{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "745ebbc2",
   "metadata": {},
   "source": [
    "# Generate graphRAG for Financial Data #"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "b89d8938",
   "metadata": {},
   "source": [
    "## Imports ##"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "a5fd823d-c64e-4a2d-a01f-67e52191045e",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "import os\n",
    "import glob\n",
    "import time\n",
    "import pandas as pd\n",
    "from dotenv import load_dotenv\n",
    "from pathlib import Path\n",
    "from typing import List\n",
    "\n",
    "from langchain_community.document_loaders import TextLoader\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "from langchain_core.prompts import ChatPromptTemplate\n",
    "from langchain_core.pydantic_v1 import BaseModel, Field\n",
    "from langchain_openai import ChatOpenAI, OpenAIEmbeddings, AzureOpenAIEmbeddings, AzureChatOpenAI\n",
    "from langchain_text_splitters import TokenTextSplitter\n",
    "from neo4j.exceptions import ClientError\n",
    "\n",
    "# import openai\n",
    "# from openai import OpenAI\n",
    "# from openai import AzureOpenAI\n",
    "\n",
    "from time import sleep\n",
    "import hashlib\n",
    "\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "94281a6d-9bd8-46bc-896b-a96961f004f7",
   "metadata": {
    "tags": []
   },
   "source": [
    "## Initializations ##"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "f9a98868-d5ea-45e7-b66c-7f6e91ae0f46",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "# Load from environment\n",
    "load_dotenv('.env', override=True)\n",
    "\n",
    "AZURE_OPENAI_ENDPOINT=os.getenv(\"AZURE_OPENAI_ENDPOINT\")\n",
    "AZURE_OPENAI_API_KEY=os.getenv(\"AZURE_OPENAI_API_KEY\"), \n",
    "\n",
    "\n",
    "\n",
    "# Embeddings & LLM models\n",
    "embedding_dimension = 1536\n",
    "embeddings = AzureOpenAIEmbeddings(azure_deployment=\"text-embedding-3\",api_version=\"2024-02-01\",dimensions=embedding_dimension)\n",
    "\n",
    "llm = AzureChatOpenAI(azure_deployment='chat_gtp_35',api_version=\"2023-05-15\", temperature=0)\n",
    "\n",
    "# Get Neo4j credentials from environment variables\n",
    "NEO4J_URI=os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USERNAME=os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD=os.getenv(\"NEO4J_PASSWORD\")\n",
    "\n",
    "graph = Neo4jGraph(url=NEO4J_URI,username=NEO4J_USERNAME,password=NEO4J_PASSWORD)\n",
    "sleep(5)\n",
    "\n",
    "#Clear KG from previous sesions\n",
    "graph.refresh_schema()\n",
    "graph.query(\"MATCH (n) DETACH DELETE n\")\n",
    "graph.query(\"MATCH (n) DETACH DELETE n\")\n",
    "graph.query(\"DROP INDEX hypothetical_questions IF EXISTS\")\n",
    "graph.query(\"DROP INDEX parent_document IF EXISTS\")\n",
    "graph.query(\"DROP INDEX summary IF EXISTS\")\n",
    "graph.query(\"DROP INDEX typical_rag IF EXISTS\")\n",
    "# graph.query(\"\"\"\n",
    "#   SHOW VECTOR INDEXES\n",
    "#   \"\"\"\n",
    "# )\n",
    "\n",
    "class Questions(BaseModel):\n",
    "    \"\"\"Generating hypothetical questions about text.\"\"\"\n",
    "\n",
    "    questions: List[str] = Field(\n",
    "        ...,\n",
    "        description=(\n",
    "            \"Generated hypothetical questions based on \" \"the information from the text\"\n",
    "        ),\n",
    "    )\n",
    "\n",
    "\n",
    "questions_prompt = ChatPromptTemplate.from_messages(\n",
    "    [\n",
    "        (\n",
    "            \"system\",\n",
    "            (\n",
    "                \"You are generating a maximum of 5 hypothetical questions based on the information and return the output in JSON format \"\n",
    "                \"Make sure to provide full context in the generated \"\n",
    "                \"questions but again only 5 questions are required.\"\n",
    "            ),\n",
    "        ),\n",
    "        (\n",
    "            \"human\",\n",
    "            (\n",
    "                \"Use the given format to generate hypothetical questions from the\"\n",
    "                \"following input: {input}\"\n",
    "            ),\n",
    "        ),\n",
    "    ]\n",
    ")\n",
    "\n",
    "question_chain = questions_prompt | llm.with_structured_output(Questions.json)\n",
    "\n",
    "# Ingest summaries\n",
    "\n",
    "summary_prompt = ChatPromptTemplate.from_messages(\n",
    "    [\n",
    "        (\n",
    "            \"system\",\n",
    "            (\n",
    "                \"You are generating concise and accurate summaries based on the \"\n",
    "                \"information found in the text.\"\n",
    "            ),\n",
    "        ),\n",
    "        (\n",
    "            \"human\",\n",
    "            (\"Generate a summary of the following input: {question}\\n\" \"Summary:\"),\n",
    "        ),\n",
    "    ]\n",
    ")\n",
    "\n",
    "summary_chain = summary_prompt | llm\n",
    "\n",
    "def clean_questions_data(questions_data):\n",
    "    if 'questions' not in questions_data:\n",
    "        return []\n",
    "\n",
    "    cleaned_questions = []\n",
    "    for entry in questions_data['questions']:\n",
    "        if isinstance(entry, dict) and 'question' in entry:\n",
    "            cleaned_questions.append(entry)\n",
    "        elif isinstance(entry, str):\n",
    "            cleaned_questions.append({'question': entry})\n",
    "        else:\n",
    "            # Handle cases where the entry is not a string or doesn't contain the 'question' key\n",
    "            print(f\"Invalid entry found and skipped: {entry}\")\n",
    "    # Convert the cleaned_questions list into a pandas DataFrame\n",
    "    df = pd.DataFrame(cleaned_questions)\n",
    "\n",
    "    # Generate a unique file ID using the current timestamp\n",
    "    import datetime\n",
    "    timestamp = datetime.datetime.now().strftime(\"%Y%m%d%H%M%S\")\n",
    "    file_id = f\"questions_{timestamp}\"\n",
    "\n",
    "    # Define the folder path\n",
    "    folder_path = \"./LLM_questions\"\n",
    "\n",
    "    # Create the folder if it doesn't exist\n",
    "    os.makedirs(folder_path, exist_ok=True)\n",
    "    \n",
    "    # Save the DataFrame into a CSV file with the unique file ID\n",
    "    df.to_csv(f\"./LLM_questions/{file_id}.csv\", index=False)\n",
    "    return cleaned_questions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "0e0c8668-b6b5-4b37-9999-cb52f9432a87",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "# Load from environment\n",
    "load_dotenv('.env', override=True)\n",
    "\n",
    "AZURE_OPENAI_ENDPOINT=os.getenv(\"AZURE_OPENAI_ENDPOINT\")\n",
    "AZURE_OPENAI_API_KEY=os.getenv(\"AZURE_OPENAI_API_KEY\"), \n",
    "\n",
    "\n",
    "\n",
    "# Embeddings & LLM models\n",
    "embedding_dimension = 1536\n",
    "embeddings = AzureOpenAIEmbeddings(azure_deployment=\"text-embedding-3\",api_version=\"2024-02-01\",dimensions=embedding_dimension)\n",
    "\n",
    "llm = AzureChatOpenAI(azure_deployment='chat_gtp_35',api_version=\"2023-05-15\", temperature=0)\n",
    "\n",
    "# Get Neo4j credentials from environment variables\n",
    "NEO4J_URI=os.getenv(\"NEO4J_URI\")\n",
    "NEO4J_USERNAME=os.getenv(\"NEO4J_USERNAME\")\n",
    "NEO4J_PASSWORD=os.getenv(\"NEO4J_PASSWORD\")\n",
    "\n",
    "graph = Neo4jGraph(url=NEO4J_URI,username=NEO4J_USERNAME,password=NEO4J_PASSWORD)\n",
    "sleep(5)\n",
    "\n",
    "#Clear KG from previous sesions\n",
    "graph.refresh_schema()\n",
    "graph.query(\"MATCH (n) DETACH DELETE n\")\n",
    "graph.query(\"MATCH (n) DETACH DELETE n\")\n",
    "graph.query(\"DROP INDEX hypothetical_questions IF EXISTS\")\n",
    "graph.query(\"DROP INDEX parent_document IF EXISTS\")\n",
    "graph.query(\"DROP INDEX summary IF EXISTS\")\n",
    "graph.query(\"DROP INDEX typical_rag IF EXISTS\")\n",
    "# graph.query(\"\"\"\n",
    "#   SHOW VECTOR INDEXES\n",
    "#   \"\"\"\n",
    "# )\n",
    "\n",
    "class Questions(BaseModel):\n",
    "    \"\"\"Generating hypothetical questions about text.\"\"\"\n",
    "\n",
    "    questions: List[str] = Field(\n",
    "        ...,\n",
    "        description=(\n",
    "            \"Generated hypothetical questions based on \" \"the information from the text\"\n",
    "        ),\n",
    "    )\n",
    "\n",
    "\n",
    "questions_prompt = ChatPromptTemplate.from_messages(\n",
    "    [\n",
    "        (\n",
    "            \"system\",\n",
    "            (\n",
    "                \"You are generating a maximum of 5 hypothetical questions based on the information and return the output in JSON format \"\n",
    "                \"Make sure to provide full context in the generated \"\n",
    "                \"questions but again only 5 questions are required.\"\n",
    "            ),\n",
    "        ),\n",
    "        (\n",
    "            \"human\",\n",
    "            (\n",
    "                \"Use the given format to generate hypothetical questions from the\"\n",
    "                \"following input: {input}\"\n",
    "            ),\n",
    "        ),\n",
    "    ]\n",
    ")\n",
    "\n",
    "question_chain = questions_prompt | llm.with_structured_output(Questions.json)\n",
    "\n",
    "# Ingest summaries\n",
    "\n",
    "summary_prompt = ChatPromptTemplate.from_messages(\n",
    "    [\n",
    "        (\n",
    "            \"system\",\n",
    "            (\n",
    "                \"You are generating concise and accurate summaries based on the \"\n",
    "                \"information found in the text.\"\n",
    "            ),\n",
    "        ),\n",
    "        (\n",
    "            \"human\",\n",
    "            (\"Generate a summary of the following input: {question}\\n\" \"Summary:\"),\n",
    "        ),\n",
    "    ]\n",
    ")\n",
    "\n",
    "summary_chain = summary_prompt | llm\n",
    "\n",
    "def clean_questions_data(questions_data, folder_name, file_name):\n",
    "    if 'questions' not in questions_data:\n",
    "        return []\n",
    "\n",
    "    cleaned_questions = []\n",
    "    for entry in questions_data['questions']:\n",
    "        if isinstance(entry, dict) and 'question' in entry:\n",
    "            cleaned_questions.append(entry)\n",
    "        elif isinstance(entry, str):\n",
    "            cleaned_questions.append({'question': entry})\n",
    "        else:\n",
    "            # Handle cases where the entry is not a string or doesn't contain the 'question' key\n",
    "            print(f\"Invalid entry found and skipped: {entry}\")\n",
    "\n",
    "    # Convert the cleaned_questions list into a pandas DataFrame\n",
    "    df = pd.DataFrame(cleaned_questions)\n",
    "\n",
    "    # Add a new column with the folder name and file name\n",
    "    df['source'] = f\"{folder_name}/{file_name}\"\n",
    "\n",
    "    # Generate a unique file ID using the current timestamp\n",
    "    import datetime\n",
    "    timestamp = datetime.datetime.now().strftime(\"%Y%m%d%H%M%S\")\n",
    "    file_id = f\"questions_{timestamp}\"\n",
    "\n",
    "    # Define the folder path\n",
    "    folder_path = \"./LLM_questions\"\n",
    "\n",
    "    # Create the folder if it doesn't exist\n",
    "    os.makedirs(folder_path, exist_ok=True)\n",
    "    \n",
    "    # Save the DataFrame into a CSV file with the unique file ID\n",
    "    df.to_csv(f\"./LLM_questions/{file_id}.csv\", index=False)\n",
    "    return cleaned_questions"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "84b6f8d5",
   "metadata": {},
   "source": [
    "## Data ##"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "10c33424",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "# import getFinancialInfo_3\n",
    "\n",
    "# com_list = pd.read_csv('ticker_select_test.txt', sep='\\t',names=['symbol', 'cik'])\n",
    "# data = getFinancialInfo_3.get_data(com_list,True)\n",
    "# data"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "4ddb9095-057c-49d3-bcfa-c815dd2e9081",
   "metadata": {},
   "outputs": [],
   "source": [
    "# pip install sec-api\n",
    "# from sec_api import ExtractorApi\n",
    "# import multiprocessing\n",
    "\n",
    "# API_KEY = =os.getenv(\"SEC_API\")\n",
    "\n",
    "# extractorApi = ExtractorApi(API_KEY)\n",
    "\n",
    "# def extract_items_10k(filing_url):\n",
    "#   items = [\"1\", \"1A\", \"7\",\n",
    "#            \"7A\"]\n",
    "#   filing_name = os.path.basename(filing_url)\n",
    "\n",
    "#   for item in items:\n",
    "#     print(\"item:\", item, \"url\", filing_url)\n",
    "\n",
    "#     try:\n",
    "#       section_text = extractorApi.get_section(filing_url=filing_url,\n",
    "#                                               section=item,\n",
    "#                                               return_type=\"text\")\n",
    "\n",
    "#       # do something with section_text. for example, save to disk, in a database\n",
    "#       # or perform analytics\n",
    "#       # IMPORTANT: you don't want to hold a large number of sections in memory\n",
    "#       # and add sections to a list. otherwise you end up with out-of-memory issues.\n",
    "#       # instead make sure to let the garbage collection release memory frequently.\n",
    "\n",
    "#       # Create a new directory for the current filing if it doesn't exist\n",
    "#       if not os.path.exists(filing_name):\n",
    "#         os.makedirs(filing_name)\n",
    "\n",
    "#       # Save the extracted text to a file\n",
    "#       with open(f\"{filing_name}/{item}.txt\", \"w\") as f:\n",
    "#         f.write(section_text)\n",
    "#     except Exception as e:\n",
    "#       print(e)\n",
    "\n",
    "# urls_10k = [\"https://www.sec.gov/Archives/edgar/data/789019/000095017023035122/msft-20230630.htm\"]\n",
    "\n",
    "# # represents the number of processes to run in parallel.\n",
    "# # if you perform a CPU-light task such as saving a section to your local disk,\n",
    "# # you might want to set the number of processes slighly higher\n",
    "# # than number of CPU cores. if you perform CPU-heavy tasks, set number_of_processes\n",
    "# # to the actual number of CPU cores.\n",
    "# number_of_processes = 2\n",
    "\n",
    "# with multiprocessing.Pool(number_of_processes) as pool:\n",
    "#   pool.map(extract_items_10k, urls_10k)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "e0f9df2a",
   "metadata": {},
   "source": [
    "## Code ##"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "0582aea0-e3d0-495c-ba2a-03dfbf23f02a",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "def extract_entities_relationships(folder):\n",
    "    files = glob.glob(f'./sec_10K_data/{folder}/*.txt')\n",
    "    start = time.perf_counter()\n",
    "    print(f\"Running pipeline for {len(files)} files in {folder} folder\")\n",
    "\n",
    "    # Iterate over the list of file paths and print each one\n",
    "    for file_path in files:\n",
    "        file_name = os.path.basename(file_path)\n",
    "        print(f\"Extracting entities and relationships for: {str(file_path)}\")\n",
    "    \n",
    "        # Load the text file\n",
    "        loader = TextLoader(str(file_path), encoding='utf-8')\n",
    "        documents = loader.load()\n",
    "       \n",
    "        # Ingest Parent-Child node pairs\n",
    "        parent_splitter = TokenTextSplitter(chunk_size=512*5, chunk_overlap=24)\n",
    "        child_splitter = TokenTextSplitter(chunk_size=100*5, chunk_overlap=24)\n",
    "        parent_documents = parent_splitter.split_documents(documents)\n",
    "        \n",
    "        for i, parent in enumerate(parent_documents):\n",
    "            child_documents = child_splitter.split_documents([parent])\n",
    "            params = {\n",
    "                \"parent_text\": parent.page_content,\n",
    "                \"parent_id\": f\"{file_path}-{i}\",  # Use file path and index to create a unique ID\n",
    "                \"parent_embedding\": embeddings.embed_query(parent.page_content),\n",
    "                \"children\": [\n",
    "                    {\n",
    "                        \"text\": c.page_content,\n",
    "                         \"id\": f\"{file_path}-{i}-{ic}\",  # Use file path, parent index, and child index\n",
    "                        \"embedding\": embeddings.embed_query(c.page_content),\n",
    "                    }\n",
    "                    for ic, c in enumerate(child_documents)\n",
    "                ],\n",
    "            }\n",
    "            # Ingest data\n",
    "            graph.query(\n",
    "                \"\"\"\n",
    "               MERGE (p:Parent {id: $parent_id})\n",
    "                ON CREATE SET p.text = $parent_text\n",
    "                WITH p\n",
    "                CALL db.create.setVectorProperty(p, 'embedding', $parent_embedding)\n",
    "                YIELD node\n",
    "                WITH p \n",
    "                UNWIND $children AS child\n",
    "                MERGE (c:Child {id: child.id})\n",
    "                ON CREATE SET c.text = child.text\n",
    "                MERGE (c)<-[:HAS_CHILD]-(p)\n",
    "                WITH c, child\n",
    "                CALL db.create.setVectorProperty(c, 'embedding', child.embedding)\n",
    "                YIELD node\n",
    "                RETURN count(*)\n",
    "                \"\"\",\n",
    "                params,\n",
    "            )\n",
    "            # Create vector index for child\n",
    "            try:\n",
    "                graph.query(\n",
    "                    \"CALL db.index.vector.createNodeIndex('parent_document', \"\n",
    "                    \"'Child', 'embedding', $dimension, 'cosine')\",\n",
    "                    {\"dimension\": embedding_dimension},\n",
    "                )\n",
    "            except ClientError:  # already exists\n",
    "                pass\n",
    "            # Create vector index for parents\n",
    "            try:\n",
    "                graph.query(\n",
    "                    \"CALL db.index.vector.createNodeIndex('typical_rag', \"\n",
    "                    \"'Parent', 'embedding', $dimension, 'cosine')\",\n",
    "                    {\"dimension\": embedding_dimension},\n",
    "                )\n",
    "            except ClientError:  # already exists\n",
    "                pass\n",
    "\n",
    "        for i, parent in enumerate(parent_documents):\n",
    "            questions_data = question_chain.invoke(parent.page_content)\n",
    "            cleaned_questions_list = clean_questions_data(questions_data, folder, file_name)\n",
    "            if 'questions' in questions_data:\n",
    "                questions_list = questions_data['questions']\n",
    "                params = {\n",
    "                    \"parent_id\": f\"{file_path}-{i}\",\n",
    "                    \"questions\": []\n",
    "                }\n",
    "\n",
    "            for iq, q in enumerate(cleaned_questions_list):\n",
    "                if isinstance(q, dict) and 'question' in q:\n",
    "                    try:\n",
    "                        question_text = q['question']\n",
    "                        embedding = embeddings.embed_query(question_text)\n",
    "                        params[\"questions\"].append({\"text\": question_text, \"id\": f\"{file_path}-{i}-{iq}\", \"embedding\": embedding})\n",
    "                    except Exception as e:\n",
    "                        print(f\"Error embedding question {q}: {e}\")\n",
    "                else:\n",
    "                    print(f\"Skipping invalid question entry: {q}\")\n",
    "\n",
    "                sleep(5)\n",
    "                graph.query(\n",
    "                    \"\"\"\n",
    "                    MERGE (p:Parent {id: $parent_id})\n",
    "                    WITH p\n",
    "                    UNWIND $questions AS question\n",
    "                    MERGE (q:Question {id: question.id})\n",
    "                    ON CREATE SET q.text = question.text\n",
    "                    MERGE (q)<-[:HAS_QUESTION]-(p)\n",
    "                    WITH q, question\n",
    "                    CALL db.create.setVectorProperty(q, 'embedding', question.embedding)\n",
    "                    YIELD node\n",
    "                    RETURN count(*)\n",
    "                    \"\"\",\n",
    "                    params,\n",
    "                )\n",
    "                # Create vector index\n",
    "                try:\n",
    "                    graph.query(\n",
    "                        \"CALL db.index.vector.createNodeIndex('hypothetical_questions', \"\n",
    "                        \"'Question', 'embedding', $dimension, 'cosine')\",\n",
    "                        {\"dimension\": embedding_dimension},\n",
    "                    )\n",
    "                except ClientError:  # already exists\n",
    "                    pass\n",
    "                \n",
    "        for i, parent in enumerate(parent_documents):\n",
    "            summary = summary_chain.invoke({\"question\": parent.page_content}).content\n",
    "            params = {\n",
    "                \"parent_id\": f\"{file_path}-{i}\",\n",
    "                \"summary\": summary,\n",
    "                \"embedding\": embeddings.embed_query(summary),\n",
    "            }\n",
    "            graph.query(\n",
    "                \"\"\"\n",
    "                MERGE (p:Parent {id: $parent_id})\n",
    "                MERGE (p)-[:HAS_SUMMARY]->(s:Summary)\n",
    "                ON CREATE SET s.text = $summary\n",
    "                WITH s\n",
    "                CALL db.create.setVectorProperty(s, 'embedding', $embedding)\n",
    "                YIELD node\n",
    "                RETURN count(*)\n",
    "                \"\"\",\n",
    "                params,\n",
    "            )\n",
    "            # Create vector index\n",
    "            try:\n",
    "                graph.query(\n",
    "                    \"CALL db.index.vector.createNodeIndex('summary', \"\n",
    "                    \"'Summary', 'embedding', $dimension, 'cosine')\",\n",
    "                    {\"dimension\": embedding_dimension},\n",
    "                )\n",
    "            except ClientError:  # already exists\n",
    "                pass\n",
    "            \n",
    "    end = time.perf_counter()\n",
    "    print(f\"Pipeline completed in {end-start} seconds\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "f8c0e7bc",
   "metadata": {},
   "source": [
    "## Test Data Ingestion ##"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "596b0638-857a-4283-9b69-d63db10aeb6f",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#Clear KG from previous session\n",
    "graph.refresh_schema()\n",
    "graph.query(\"MATCH (n) DETACH DELETE n\")\n",
    "graph.query(\"DROP INDEX hypothetical_questions IF EXISTS\")\n",
    "graph.query(\"DROP INDEX parent_document IF EXISTS\")\n",
    "graph.query(\"DROP INDEX summary IF EXISTS\")\n",
    "graph.query(\"DROP INDEX typical_rag IF EXISTS\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "bf63ecaf",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Running pipeline for 4 files in aapl-20220924 folder\n",
      "Extracting entities and relationships for: ./sec_10K_data/aapl-20220924\\1.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/aapl-20220924\\1A.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/aapl-20220924\\7.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/aapl-20220924\\7A.txt\n",
      "Pipeline completed in 318.85228709999865 seconds\n",
      "Running pipeline for 4 files in aapl-20230930 folder\n",
      "Extracting entities and relationships for: ./sec_10K_data/aapl-20230930\\1.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/aapl-20230930\\1A.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/aapl-20230930\\7.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/aapl-20230930\\7A.txt\n",
      "Pipeline completed in 326.5033165999994 seconds\n",
      "Running pipeline for 4 files in goog-20231231 folder\n",
      "Extracting entities and relationships for: ./sec_10K_data/goog-20231231\\1.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/goog-20231231\\1A.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/goog-20231231\\7.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/goog-20231231\\7A.txt\n",
      "Pipeline completed in 532.7110145000006 seconds\n",
      "Running pipeline for 4 files in msft-20220630 folder\n",
      "Extracting entities and relationships for: ./sec_10K_data/msft-20220630\\1.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/msft-20220630\\1A.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/msft-20220630\\7.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/msft-20220630\\7A.txt\n",
      "Pipeline completed in 688.2102669999986 seconds\n",
      "Running pipeline for 4 files in msft-20230630 folder\n",
      "Extracting entities and relationships for: ./sec_10K_data/msft-20230630\\1.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/msft-20230630\\1A.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/msft-20230630\\7.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/msft-20230630\\7A.txt\n",
      "Pipeline completed in 533.4265629000001 seconds\n",
      "Running pipeline for 4 files in nvda-20220130 folder\n",
      "Extracting entities and relationships for: ./sec_10K_data/nvda-20220130\\1.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/nvda-20220130\\1A.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/nvda-20220130\\7.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/nvda-20220130\\7A.txt\n",
      "Pipeline completed in 375.7028604999996 seconds\n",
      "Running pipeline for 4 files in nvda-20230129 folder\n",
      "Extracting entities and relationships for: ./sec_10K_data/nvda-20230129\\1.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/nvda-20230129\\1A.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/nvda-20230129\\7.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/nvda-20230129\\7A.txt\n",
      "Pipeline completed in 607.3278258000009 seconds\n",
      "Running pipeline for 4 files in nvda-20240128 folder\n",
      "Extracting entities and relationships for: ./sec_10K_data/nvda-20240128\\1.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/nvda-20240128\\1A.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/nvda-20240128\\7.txt\n",
      "Extracting entities and relationships for: ./sec_10K_data/nvda-20240128\\7A.txt\n",
      "Pipeline completed in 588.132799500001 seconds\n"
     ]
    }
   ],
   "source": [
    "folders = [\"aapl-20220924\",\"aapl-20230930\",\"goog-20231231\",\"msft-20220630\",\"msft-20230630\",\"nvda-20220130\",\"nvda-20230129\",\"nvda-20240128\"]\n",
    "ingestion_pipeline(folders)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "93374647-a1dd-463b-b933-8219c153ea65",
   "metadata": {},
   "source": [
    "## Test RAG ##"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "7a42ed9b-b438-4478-b3f3-f091f9525eb5",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "from langchain_community.vectorstores import Neo4jVector\n",
    "\n",
    "\n",
    "# Typical RAG retriever\n",
    "\n",
    "typical_rag = Neo4jVector.from_existing_index(\n",
    "    embeddings, index_name=\"typical_rag\"\n",
    ")\n",
    "\n",
    "# Parent retriever\n",
    "\n",
    "parent_query = \"\"\"\n",
    "MATCH (node)<-[:HAS_CHILD]-(parent)\n",
    "WITH parent, max(score) AS score // deduplicate parents\n",
    "RETURN parent.text AS text, score, {} AS metadata LIMIT 1\n",
    "\"\"\"\n",
    "\n",
    "parent_vectorstore = Neo4jVector.from_existing_index(\n",
    "    embeddings,\n",
    "    index_name=\"parent_document\",\n",
    "    retrieval_query=parent_query,\n",
    ")\n",
    "\n",
    "# Hypothetic questions retriever\n",
    "\n",
    "hypothetic_question_query = \"\"\"\n",
    "MATCH (node)<-[:HAS_QUESTION]-(parent)\n",
    "WITH parent, max(score) AS score // deduplicate parents\n",
    "RETURN parent.text AS text, score, {} AS metadata\n",
    "\"\"\"\n",
    "\n",
    "hypothetic_question_vectorstore = Neo4jVector.from_existing_index(\n",
    "    embeddings,\n",
    "    index_name=\"hypothetical_questions\",\n",
    "    retrieval_query=hypothetic_question_query,\n",
    ")\n",
    "# Summary retriever\n",
    "\n",
    "summary_query = \"\"\"\n",
    "MATCH (node)<-[:HAS_SUMMARY]-(parent)\n",
    "WITH parent, max(score) AS score // deduplicate parents\n",
    "RETURN parent.text AS text, score, {} AS metadata\n",
    "\"\"\"\n",
    "\n",
    "summary_vectorstore = Neo4jVector.from_existing_index(\n",
    "    embeddings,\n",
    "    index_name=\"summary\",\n",
    "    retrieval_query=summary_query,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "9dc5bdd3-be56-4927-a075-4a3d62a5423e",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " Item 1A. Risk Factors \n",
      "\n",
      "The Company&#8217;s business, reputation, results of operations, financial condition and stock price can be affected by a number of factors, whether currently known or unknown, including those described below. When any one or more of these risks materialize from time to time, the Company&#8217;s business, reputation, results of operations, financial condition and stock price can be materially and adversely affected. \n",
      "\n",
      "Because of the following factors, as well as other factors affecting the Company&#8217;s results of operations and financial condition, past financial performance should not be considered to be a reliable indicator of future performance, and investors should not use historical trends to anticipate results or trends in future periods. This discussion of risk factors contains forward-looking statements. \n",
      "\n",
      "This section should be read in conjunction with Part II, Item 7, &#8220;Management&#8217;s Discussion and Analysis of Financial Condition and Results of Operations&#8221; and the consolidated financial statements and accompanying notes in Part II, Item 8, &#8220;Financial Statements and Supplementary Data&#8221; of this Form 10-K. \n",
      "\n",
      "Macroeconomic and Industry Risks \n",
      "\n",
      "The Company&#8217;s operations and performance depend significantly on global and regional economic conditions and adverse economic conditions can materially adversely affect the Company&#8217;s business, results of operations and financial condition. \n",
      "\n",
      "The Company has international operations with sales outside the U.S. representing a majority of the Company&#8217;s total net sales. In addition, the Company&#8217;s global supply chain is large and complex and a majority of the Company&#8217;s supplier facilities, including manufacturing and assembly sites, are located outside the U.S. As a result, the Company&#8217;s operations and performance depend significantly on global and regional economic conditions. \n",
      "\n",
      "Adverse macroeconomic conditions, including slow growth or recession, high unemployment, inflation, tighter credit, higher interest rates, and currency fluctuations, can adversely impact consumer confidence and spending and materially adversely affect demand for the Company&#8217;s products and services. In addition, consumer confidence and spending can be materially adversely affected in response to changes in fiscal and monetary policy, financial market volatility, declines in income or asset values, and other economic factors. \n",
      "\n",
      "In addition to an adverse impact on demand for the Company&#8217;s products and services, uncertainty about, or a decline in, global or regional economic conditions can have a significant impact on the Company&#8217;s suppliers, contract manufacturers, logistics providers, distributors, cellular network carriers and other channel partners, and developers. Potential outcomes include financial instability; inability to obtain credit to finance business operations; and insolvency. \n",
      "\n",
      "Adverse economic conditions can also lead to increased credit and collectibility risk on the Company&#8217;s trade receivables; the failure of derivative counterparties and other financial institutions; limitations on the Company&#8217;s ability to issue new debt; reduced liquidity; and declines in the fair values of the Company&#8217;s financial instruments. These and other impacts can materially adversely affect the Company&#8217;s business, results of operations, financial condition and stock price. \n",
      "\n",
      "The Company&#8217;s business can be impacted by political events, trade and other international disputes, war, terrorism, natural disasters, public health issues, industrial accidents and other business interruptions. \n",
      "\n",
      "Political events, trade and other international disputes, war, terrorism, natural disasters, public health issues, industrial accidents and other business interruptions can harm or disrupt international commerce and the global economy, and could have a material adverse effect on the Company and its customers, suppliers, contract manufacturers, logistics providers, distributors, cellular network carriers and other channel partners. \n",
      "\n",
      "Apple Inc. | 2023 Form 10-K | 5 \n",
      "\n",
      "The Company has a large, global business with sales outside the U.S. representing a majority of the Company&#8217;s total net sales, and the Company believes that it generally benefits from growth in international trade. Substantially all of the Company&#8217;s manufacturing is performed in whole or in part by outsourcing partners located primarily in China mainland, India, Japan, South Korea, Taiwan and Vietnam. Restrictions on international trade, such as tariffs and other controls on imports or exports of goods, technology or data, can materially adversely affect the Company&#8217;s operations and supply chain and limit the Company&#8217;s ability to offer and distribute its products and services to customers. The impact can be particularly significant if these restrictive measures apply to countries and regions where the Company derives a significant portion of its revenues and/or has significant supply chain operations. Restrictive measures can require the Company to take various actions, including changing suppliers, restructuring business relationships, and ceasing to offer third-party applications on its platforms. Changing the Company&#8217;s operations in accordance with new or changed restrictions on international trade can be expensive, time-consuming and disruptive to the Company&#8217;s operations. Such restrictions can be announced with little or no advance notice and the Company may not be able to effectively mitigate all adverse impacts from such measures. For example, tensions between governments, including the U.S. and China, have in the past led to tariffs and other restrictions being imposed on the Company&#8217;s business. If disputes and conflicts further escalate in the future, actions by governments in response could be significantly more severe and restrictive and could materially adversely affect the Company&#8217;s business. Political uncertainty surrounding trade and other international disputes could also have a negative effect on consumer confidence and spending, which could adversely affect the Company&#8217;s business. \n",
      "\n",
      "Many of the Company&#8217;s operations and facilities, as well as critical business operations of the Company&#8217;s suppliers and contract manufacturers, are in locations that are prone to earthquakes and other natural disasters. In addition, such operations and facilities are subject to the risk of interruption by fire, power shortages, nuclear power plant accidents and other industrial accidents, terrorist attacks and other hostile acts, ransomware and other cybersecurity attacks, labor disputes, public health issues, including pandemics such as the COVID-19 pandemic, and other events beyond the Company&#8217;s control. Global climate change is resulting in certain types of natural disasters, such as droughts, floods, hurricanes and wildfires, occurring more frequently or with more intense effects. Such events can make it difficult or impossible for the Company to manufacture and deliver products to its customers, create delays and inefficiencies in the Company&#8217;s supply and manufacturing chain, and result in slowdowns and outages to the Company&#8217;s service offerings, and negatively impact consumer spending and demand in affected areas. Following an interruption to its business, the Company can require substantial recovery time, experience significant expenditures to resume operations, and lose significant sales. Because the Company relies on single or limited sources for the supply and manufacture of many critical components, a business interruption affecting such sources would exacerbate any negative consequences to the Company. \n",
      "\n",
      "The Company&#8217;s operations are also subject to the risks of industrial accidents at its suppliers and contract manufacturers. While the Company&#8217;s suppliers are required to maintain safe working environments and operations, an industrial accident could occur and could result in serious injuries or loss of life, disruption to the Company&#8217;s business, and harm to the Company&#8217;s reputation. Major public health issues, including pandemics such as the COVID-19 pandemic, have adversely affected, and could in the future materially adversely affect, the Company due to their impact on the global economy and demand for consumer products; the imposition of protective public safety measures, such as stringent employee travel restrictions and limitations on freight services and the movement of products between regions; and disruptions in the Company&#8217;s operations, supply chain and sales and distribution channels, resulting in interruptions to the supply of current products and offering of existing services, and delays in production ramps of new products and development of new services. \n",
      "\n",
      "While the Company maintains insurance coverage for certain types of losses, such insurance coverage may be insufficient to cover all losses that may arise. \n",
      "\n",
      "Global markets for the Company&#8217;s products and services are highly competitive and subject to rapid technological change, and the Company may be unable to compete effectively in these markets. \n",
      "\n",
      "The Company&#8217;s products and services are offered in highly competitive global markets characterized by aggressive price competition and resulting downward pressure on gross margins, frequent introduction of new products and services, short product life cycles, evolving industry standards, continual improvement in product price and performance characteristics, rapid adoption of technological advancements by competitors, and price sensitivity on the part of consumers and businesses. \n",
      "\n",
      "The Company&#8217;s ability to compete successfully depends heavily on ensuring the continuing and timely introduction of innovative new products, services and technologies to the marketplace. The Company designs and develops nearly the entire solution for its products, including the hardware, operating system, numerous software applications and related services. As a result, the Company must make significant investments in R&#38;D. There can be no assurance these investments will achieve expected returns, and the Company may not be able to develop and market new products and services successfully. \n",
      "\n",
      "Apple Inc. | 2023 Form 10-K | 6 \n",
      "\n",
      "The Company currently holds a significant number of patents, trademarks and copyrights and has registered, and applied to register, additional patents, trademarks and copyrights. In contrast, many of the Company&#8217;s competitors seek to compete primarily through aggressive pricing and very low cost structures, and by imitating the Company&#8217;s products and infringing on its intellectual property. Effective intellectual property protection is not consistently available in every country in which the Company operates. If the Company is unable to continue to develop and sell innovative new products with attractive margins or if competitors infringe on the Company&#8217;s intellectual property, the Company&#8217;s ability to maintain a competitive advantage could be materially adversely affected. \n",
      "\n",
      "The Company has a minority market share in the global smartphone, personal computer and tablet markets. The Company faces substantial competition in these markets from companies that have significant technical, marketing, distribution and other resources, as well as established hardware, software and digital content supplier relationships. In addition, some of the Company&#8217;s competitors have broader product lines, lower-priced products and a larger installed base of active devices. Competition has been particularly intense as competitors have aggressively cut prices and lowered product margins. Certain competitors have the resources, experience or cost structures to provide products at little or no profit or even at a loss. Some of the markets in which the Company competes have from time to time experienced little to no growth or contracted overall. \n",
      "\n",
      "Additionally, the Company faces significant competition as competitors imitate the Company&#8217;s product features and applications within their products or collaborate to offer solutions that are more competitive than those they currently offer. The Company also expects competition to intensify as competitors imitate the Company&#8217;s approach to providing components seamlessly within their offerings or work collaboratively to offer integrated solutions. \n",
      "\n",
      "The Company&#8217;s services also face substantial competition, including from companies that have significant resources and experience and have established service offerings with large customer bases. The Company competes with business models that provide content to users for free. The Company also competes with illegitimate means to obtain third-party digital content and applications. \n",
      "\n",
      "The Company&#8217;s business, results of operations and financial condition depend substantially on the Company&#8217;s ability to continually improve its products and services to maintain their functional and design advantages. There can be no assurance the Company will be able to continue to provide products and services that compete effectively. \n",
      "\n",
      "Business Risks \n",
      "\n",
      "To remain competitive and stimulate customer demand, the Company must successfully manage frequent introductions and transitions of products and services. \n",
      "\n"
     ]
    }
   ],
   "source": [
    "response = typical_rag.similarity_search(\n",
    "    \"What are some risk factors that can affect Apple's stock price?\"\n",
    ")\n",
    "print(response[0].page_content)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "d8e83525-d45e-428b-8a8e-d2dc2e6a6c90",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'query': \"What are some risk factors that can affect Apple's stock price?\",\n",
       " 'result': \"There are several risk factors that can affect Apple's stock price, including:\\n\\n1. Macroeconomic and industry risks, such as adverse economic conditions, slow growth or recession, high unemployment, inflation, tighter credit, higher interest rates, and currency fluctuations.\\n\\n2. Political events, trade and other international disputes, war, terrorism, natural disasters, public health issues, industrial accidents, and other business interruptions.\\n\\n3. Global markets for the Company's products and services are highly competitive and subject to rapid technological change, and the Company may be unable to compete effectively in these markets.\\n\\n4. The Company's new products often utilize custom components available from only one source, and the continued availability of these components at acceptable prices, or at all, can be affected for any number of reasons.\\n\\n5. Losses or unauthorized access to or releases of confidential information, including personal information, could subject the Company to significant reputational, financial, legal, and operational consequences.\\n\\n6. The Company's success depends largely on the talents and efforts of its team members, the continued service and availability of highly skilled employees, including key personnel, and the Company's ability to nurture its distinctive and inclusive culture.\\n\\nThese are just a few examples of the risk factors that can affect Apple's stock price.\"}"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from langchain.chains import RetrievalQA\n",
    "from langchain.chat_models import AzureChatOpenAI\n",
    "\n",
    "vector_typrag = RetrievalQA.from_chain_type(\n",
    "    llm=llm,\n",
    "    chain_type=\"stuff\",\n",
    "    retriever=typical_rag.as_retriever()\n",
    ")\n",
    "\n",
    "vector_parent = RetrievalQA.from_chain_type(\n",
    "    llm=llm,\n",
    "    chain_type=\"stuff\",\n",
    "    retriever=parent_vectorstore.as_retriever()\n",
    ")\n",
    "\n",
    "vector_hypquestion = RetrievalQA.from_chain_type(\n",
    "    llm=llm,\n",
    "    chain_type=\"stuff\",\n",
    "    retriever=hypothetic_question_vectorstore.as_retriever()\n",
    ")\n",
    "\n",
    "vector_summary = RetrievalQA.from_chain_type(\n",
    "    llm=llm,\n",
    "    chain_type=\"stuff\",\n",
    "    retriever=summary_vectorstore.as_retriever()\n",
    ")\n",
    "\n",
    "vector_typrag.invoke(\n",
    "     \"What are some risk factors that can affect Apple's stock price?\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "13952441-ceba-4b8e-917b-c206937abc8d",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'query': \"What are some risk factors that can affect Apple's stock price?\",\n",
       " 'result': \"There are several risk factors that can affect Apple's stock price, as outlined in the company's 2023 Form 10-K. These include macroeconomic and industry risks, political events, trade and other international disputes, war, terrorism, natural disasters, public health issues, industrial accidents, and other business interruptions. Additionally, the company faces significant competition in global markets for its products and services, and its ability to compete successfully depends heavily on ensuring the continuing and timely introduction of innovative new products, services, and technologies to the marketplace. Other risk factors include the need to manage frequent introductions and transitions of products and services, the dependence on carriers, wholesalers, retailers, and other resellers, and the exposure to credit risk and fluctuations in the values of its investment portfolio. Finally, the company is subject to changes in tax rates, the adoption of new U.S. or international tax legislation, and exposure to additional tax liabilities.\"}"
      ]
     },
     "execution_count": 32,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "vector_hypquestion.invoke(\n",
    "     \"What are some risk factors that can affect Apple's stock price?\"\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "1b0c3708-52ad-4504-b06f-97deabe7c9d0",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "{'query': \"What are some risk factors that can affect Apple's stock price?\",\n",
       " 'result': \"There are several risk factors that can affect Apple's stock price, including adverse macroeconomic conditions, political events, trade and other international disputes, war, terrorism, natural disasters, public health issues, industrial accidents, and other business interruptions. Additionally, global markets for Apple's products and services are highly competitive and subject to rapid technological change, and the company may be unable to compete effectively in these markets. The company's ability to continually improve its products and services to maintain their functional and design advantages is also a risk factor. Finally, to remain competitive and stimulate customer demand, the company must successfully manage frequent introductions and transitions of products and services.\"}"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "vector_parent.invoke(\n",
    "     \"What are some risk factors that can affect Apple's stock price?\"\n",
    ")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "3b09c268-b085-441b-842d-11dbf3f36db9",
   "metadata": {},
   "source": [
    "##RAG Agent Tool (combination of retrievers)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "a150e3e2-9ecd-43e8-867e-19bcb1eeeda5",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "C:\\Users\\lriospie\\AppData\\Local\\anaconda3\\Lib\\site-packages\\langchain_core\\_api\\deprecation.py:119: LangChainDeprecationWarning: The class `AzureChatOpenAI` was deprecated in LangChain 0.0.10 and will be removed in 0.3.0. An updated version of the class exists in the langchain-openai package and should be used instead. To use it run `pip install -U langchain-openai` and import as `from langchain_openai import AzureChatOpenAI`.\n",
      "  warn_deprecated(\n",
      "C:\\Users\\lriospie\\AppData\\Local\\anaconda3\\Lib\\site-packages\\langchain_core\\_api\\deprecation.py:119: LangChainDeprecationWarning: The function `initialize_agent` was deprecated in LangChain 0.1.0 and will be removed in 0.3.0. Use Use new agent constructor methods like create_react_agent, create_json_agent, create_structured_chat_agent, etc. instead.\n",
      "  warn_deprecated(\n"
     ]
    }
   ],
   "source": [
    "from langchain.chains import GraphCypherQAChain\n",
    "from langchain.agents import initialize_agent, Tool\n",
    "from langchain.agents import AgentType\n",
    "\n",
    "\n",
    "cypher_chain = GraphCypherQAChain.from_llm(\n",
    "    cypher_llm = AzureChatOpenAI(azure_deployment='Chat_gpt_4',api_version=\"2023-05-15\", temperature=0),\n",
    "    qa_llm = AzureChatOpenAI(azure_deployment='chat_gtp_35',api_version=\"2023-05-15\", temperature=0), graph=graph, verbose=True,\n",
    ")\n",
    "\n",
    "tools = [\n",
    "    Tool(\n",
    "        name=\"Tasks\",\n",
    "        func=vector_typrag.run,\n",
    "        description=\"\"\"Useful to answer most of the questions.\n",
    "        Not useful for questions that involve aggregation.\n",
    "        Use full question as input.\n",
    "        \"\"\",\n",
    "        \n",
    "    ),\n",
    "    Tool(\n",
    "        name=\"Tasks\",\n",
    "        func=vector_hypquestion.run,\n",
    "        description=\"\"\"Useful to answer questions on dates and relationship between different companies.\n",
    "        Not useful for questions that involve aggregation.\n",
    "        Use full question as input.\n",
    "        \"\"\",        \n",
    "        \n",
    "    ),\n",
    "    # Tool(\n",
    "    #     name=\"Graph\",\n",
    "    #     func=cypher_chain.run,\n",
    "    #     description=\"\"\" Only useful for AGGREGATION questions.\n",
    "    #     Use full question as input.\n",
    "    #     \"\"\",\n",
    "    # ),\n",
    "]\n",
    "\n",
    "mrkl = initialize_agent(\n",
    "    tools, \n",
    "    AzureChatOpenAI(azure_deployment='Chat_gpt_4',api_version=\"2023-05-15\", temperature=0),\n",
    "    agent=AgentType.OPENAI_FUNCTIONS, verbose=True\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "id": "a92dbc1a-36f5-4926-9ba5-157b5b5fc78e",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3mSeveral risk factors can affect Apple Inc.'s stock price, including but not limited to:\n",
      "\n",
      "1. **Market Competition**: Apple operates in highly competitive markets, including smartphones, personal computers, tablets, wearables, and digital services. Intense competition from other tech giants and emerging players can impact Apple's market share and profitability.\n",
      "\n",
      "2. **Supply Chain Disruptions**: Apple relies on a global supply chain for the manufacturing of its products. Disruptions due to geopolitical tensions, natural disasters, pandemics, or labor disputes can affect product availability and increase costs.\n",
      "\n",
      "3. **Regulatory Risks**: Changes in regulations, especially in key markets like the United States, Europe, and China, can impact Apple's operations. This includes antitrust investigations, privacy regulations, and taxes on digital services.\n",
      "\n",
      "4. **Economic Conditions**: Economic downturns or recessions can lead to reduced consumer spending, affecting sales of Apple's products and services.\n",
      "\n",
      "5. **Technological Changes**: The technology industry is rapidly evolving. Failure to innovate or adapt to new technologies can make Apple's products less desirable to consumers.\n",
      "\n",
      "6. **Intellectual Property Disputes**: Litigation related to patents and intellectual property rights can result in significant financial liabilities and affect Apple's ability to sell certain products.\n",
      "\n",
      "7. **Currency Fluctuations**: Since Apple operates globally, fluctuations in currency exchange rates can impact its financial results when converting foreign earnings back to U.S. dollars.\n",
      "\n",
      "8. **Consumer Preferences**: Changes in consumer preferences and behaviors can affect the demand for Apple's products and services. For example, a shift towards more affordable devices could impact Apple's premium product sales.\n",
      "\n",
      "9. **Cybersecurity Threats**: Data breaches or cybersecurity incidents can harm Apple's reputation and lead to financial losses.\n",
      "\n",
      "10. **Environmental and Social Governance (ESG) Factors**: Increasing focus on sustainability and social responsibility can influence investor sentiment. Failure to meet ESG expectations can affect Apple's stock price.\n",
      "\n",
      "These risk factors highlight the complexity of the environment in which Apple operates and the variety of challenges it faces. Investors closely monitor these risks as they can significantly impact Apple's financial performance and stock price.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "{'input': \"What are some risk factors that can affect Apple's stock price?\", 'output': \"Several risk factors can affect Apple Inc.'s stock price, including but not limited to:\\n\\n1. **Market Competition**: Apple operates in highly competitive markets, including smartphones, personal computers, tablets, wearables, and digital services. Intense competition from other tech giants and emerging players can impact Apple's market share and profitability.\\n\\n2. **Supply Chain Disruptions**: Apple relies on a global supply chain for the manufacturing of its products. Disruptions due to geopolitical tensions, natural disasters, pandemics, or labor disputes can affect product availability and increase costs.\\n\\n3. **Regulatory Risks**: Changes in regulations, especially in key markets like the United States, Europe, and China, can impact Apple's operations. This includes antitrust investigations, privacy regulations, and taxes on digital services.\\n\\n4. **Economic Conditions**: Economic downturns or recessions can lead to reduced consumer spending, affecting sales of Apple's products and services.\\n\\n5. **Technological Changes**: The technology industry is rapidly evolving. Failure to innovate or adapt to new technologies can make Apple's products less desirable to consumers.\\n\\n6. **Intellectual Property Disputes**: Litigation related to patents and intellectual property rights can result in significant financial liabilities and affect Apple's ability to sell certain products.\\n\\n7. **Currency Fluctuations**: Since Apple operates globally, fluctuations in currency exchange rates can impact its financial results when converting foreign earnings back to U.S. dollars.\\n\\n8. **Consumer Preferences**: Changes in consumer preferences and behaviors can affect the demand for Apple's products and services. For example, a shift towards more affordable devices could impact Apple's premium product sales.\\n\\n9. **Cybersecurity Threats**: Data breaches or cybersecurity incidents can harm Apple's reputation and lead to financial losses.\\n\\n10. **Environmental and Social Governance (ESG) Factors**: Increasing focus on sustainability and social responsibility can influence investor sentiment. Failure to meet ESG expectations can affect Apple's stock price.\\n\\nThese risk factors highlight the complexity of the environment in which Apple operates and the variety of challenges it faces. Investors closely monitor these risks as they can significantly impact Apple's financial performance and stock price.\"}\n"
     ]
    }
   ],
   "source": [
    "graph.refresh_schema()\n",
    "response = mrkl.invoke(\"What are some risk factors that can affect Apple's stock price?\")\n",
    "print(response)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 38,
   "id": "778448e5-0e1e-4c19-9135-a98b6b1e852b",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "\n",
      "\u001b[1m> Entering new AgentExecutor chain...\u001b[0m\n",
      "\u001b[32;1m\u001b[1;3m\n",
      "Invoking: `Tasks` with `What kind of business Apple handles?`\n",
      "\n",
      "\n",
      "\u001b[0m\u001b[33;1m\u001b[1;3mApple designs, manufactures, and markets smartphones, personal computers, tablets, wearables and accessories, and sells a variety of related services. The company also offers digital content through subscription-based services, payment services, and advertising services. Apple manages its business primarily on a geographic basis and sells its products and resells third-party products in most of its major markets directly to customers through its retail and online stores and its direct sales force.\u001b[0m\u001b[32;1m\u001b[1;3mApple is involved in designing, manufacturing, and marketing a wide range of products and services. These include:\n",
      "\n",
      "- **Smartphones**: Apple's iPhone is one of the most popular smartphone brands globally.\n",
      "- **Personal Computers**: The company produces the Mac line of computers.\n",
      "- **Tablets**: Apple's iPad is a leading product in the tablet market.\n",
      "- **Wearables and Accessories**: This includes products like the Apple Watch, AirPods, and other accessories.\n",
      "- **Digital Content and Services**: Apple offers subscription-based services such as Apple Music, Apple TV+, Apple Arcade, and iCloud, among others.\n",
      "- **Payment Services**: Apple Pay is a mobile payment and digital wallet service.\n",
      "- **Advertising Services**: The company provides advertising opportunities across its platforms.\n",
      "\n",
      "Apple sells its products worldwide through a combination of direct sales, online and retail stores, and also resells third-party products. The company operates primarily on a geographic basis.\u001b[0m\n",
      "\n",
      "\u001b[1m> Finished chain.\u001b[0m\n",
      "{'input': 'What kind of business Apple handles?', 'output': \"Apple is involved in designing, manufacturing, and marketing a wide range of products and services. These include:\\n\\n- **Smartphones**: Apple's iPhone is one of the most popular smartphone brands globally.\\n- **Personal Computers**: The company produces the Mac line of computers.\\n- **Tablets**: Apple's iPad is a leading product in the tablet market.\\n- **Wearables and Accessories**: This includes products like the Apple Watch, AirPods, and other accessories.\\n- **Digital Content and Services**: Apple offers subscription-based services such as Apple Music, Apple TV+, Apple Arcade, and iCloud, among others.\\n- **Payment Services**: Apple Pay is a mobile payment and digital wallet service.\\n- **Advertising Services**: The company provides advertising opportunities across its platforms.\\n\\nApple sells its products worldwide through a combination of direct sales, online and retail stores, and also resells third-party products. The company operates primarily on a geographic basis.\"}\n"
     ]
    }
   ],
   "source": [
    "graph.refresh_schema()\n",
    "response = mrkl.invoke(\"What kind of business Apple handles?\")\n",
    "print(response)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "32c05238-237a-4fbd-9bbe-bc4e4ff1cf03",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "# pip freeze >requirements.txt"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "07e3f95a-31fb-4975-a88b-72e335eb0b41",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Python version: 3.11.5 | packaged by Anaconda, Inc. | (main, Sep 11 2023, 13:26:23) [MSC v.1916 64 bit (AMD64)]\n"
     ]
    }
   ],
   "source": [
    "# import sys\n",
    "# print(\"Python version: \" + sys.version)"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
