{"news": [{"date": "20240412020100", "headline": "Biogen Is Suffering From Doubts About the Future", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412031000", "headline": "Smart Money Is Betting Big In ABBV Options", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412032500", "headline": "AbbVie hails positive results for chronic migraine prevention", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412043800", "headline": "AbbVie Enters Oversold Territory", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412050300", "headline": "GLP-1s benefit Parkinson’s: Barclays sees implications across biopharma", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412053000", "headline": "AbbVie Announces Late-Breaking Data at AAN Supporting Long-Term Safety and Efficacy of Atogepant (QULIPTA®) for Preventive Treatment of Migraine", "summary": "AbbVie (NYSE: ABBV) today announced an interim analysis of an ongoing Phase 3, open-label 156-week extension study evaluating the long-term safety and tolerability of oral atogepant for the prevention of migraine in participants with chronic or episodic migraine. The overall long-term safety results were consistent with the known safety profile of atogepant in chronic and episodic migraine, and no new safety signals were identified. These results also support improvements in key efficacy outcome"}, {"date": "20240412053555", "headline": "AbbVie: Despite The Run, Shares Still Look Attractive, Yielding 3.67%", "summary": "After losing Humira patent protection, (accounting for 37% of 2022 revenue), AbbVie remains undervalued and continues to grow its dividend. Learn more on ABBV stock here."}, {"date": "20240412075406", "headline": "Law Offices of Howard G. Smith Announces Investigation of AbbVie Inc. (ABBV) on Behalf of Investors", "summary": "Law Offices of Howard G. Smith announces an investigation on behalf of AbbVie Inc. investors concerning the Company’s possible violations of federal securities laws.On April 4, 2024, AbbVie..."}, {"date": "20240412081054", "headline": "AbbVie: Bulletproof Fundamentals", "summary": "AbbVie is a profitability superstar with a strong track record, offering an attractive valuation and a solid dividend yield. See why ABBV stock is a strong buy."}, {"date": "20240412100206", "headline": "Glancy Prongay & Murray LLP, a Leading Securities Fraud Law Firm, Announces Investigation of AbbVie Inc. (ABBV) on Behalf of Investors", "summary": "Glancy Prongay & Murray LLP , a leading national shareholder rights law firm, today announced that it has commenced an investigation on behalf of AbbVie Inc. investors concerning the Company’s..."}, {"date": "20240412141954", "headline": "What's Going On AbbVie Stock On Friday?", "summary": "Friday, AbbVie Inc (NYSE:ABBV) released an interim analysis of an ongoing Phase 3, open-label 156-week extension study evaluating the long-term safety and tolerability of oral atogepant for the prevention of migraine in participants with chronic or episodic migraine. The shares are trading lower with a session volume of 3.9 million versus the average volume of 5.6 million, as per the data from Benzinga Pro. Also Read: AbbVie Lifts Long-Term Outlook For New Immunology Drugs, Even As Q4 Revenue an"}, {"date": "20240413035600", "headline": "AbbVie keeps Humira market share near 100% despite biosimilars: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240413232300", "headline": "Is AbbVie a Millionaire Maker?", "summary": "Everything is going according to plan, and more growth is on the way."}, {"date": "20240414031224", "headline": "BME: Discount Widens Substantially Creating An Opportunity", "summary": "BME is a healthcare-focused fund with a stable underlying portfolio that employs a covered call writing strategy. See why I continue to rate the fund a buy."}, {"date": "20240414040000", "headline": "AbbVie: Great To Be Proven Wrong - Still Not A Buy", "summary": "AbbVie outperformed expectations, with Humira remaining the market leader with 98% share despite LOE and biosimilar headwinds. Read more on ABBV stock here."}, {"date": "20240414193100", "headline": "AbbVie Stock (NYSE:ABBV): Humira Leads Market with 96% Share", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415020600", "headline": "See Which Of The Latest 13F Filers Holds AbbVie", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415041345", "headline": "AbbVie Announces Late-Breaking Data at AAN Supporting Long-Term Safety and Efficacy of Atogepant for Preventive Treatment of Migraine", "summary": "NORTH CHICAGO - AbbVie today announced an interim analysis of an ongoing Phase 3, open-label 156-week extension study evaluating the long-term safety and tolerability of oral atogepant for the..."}, {"date": "20240415055700", "headline": "Roche reports survival data for new dual-acting lymphoma drug", "summary": "The results could give Roche’s Columvi an edge over a rival medicine from AbbVie and Genmab, while Regeneron awaits an approval of its own therapy."}, {"date": "20240415190200", "headline": "Fake Botox Fight Sends AbbVie (NASDAQ:ABBV) Up Fractionally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416000100", "headline": "Invest with Confidence: Intrinsic Value Unveiled of AbbVie Inc", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416005500", "headline": "Powell And The Great Indecision", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416010216", "headline": "12 Best Dividend Stocks with High Upside Potential", "summary": "In this article, we discuss 12 best dividend stocks with high upside potential. You can skip our detailed analysis of dividend stocks and their past performance, and go directly to read 5 Best Dividend Stocks with High Upside Potential. The current state of the US economy is uncertain with many analysts gravitating toward the idea […]"}, {"date": "20240416035000", "headline": "AbbVie working with FDA after reports of fake Botox versions", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416052038", "headline": "Genmab Acquires A Missing Piece For Its Pipeline", "summary": "Genmab's acquisition of ProfoundBio for $1.8 billion in cashÂ adds an important ADC platform, a missing piece for Genmab. Learn more about GMAB stock here."}, {"date": "20240416053002", "headline": "Johnson & Johnson (JNJ) Q1 Earnings Top Estimates", "summary": "Johnson & Johnson (JNJ) delivered earnings and revenue surprises of 2.65% and 0.09%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240416055700", "headline": "AbbVie to develop long acting injectables in a deal worth up to $1.9B", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416060700", "headline": "AbbVie to develop long-acting injectables in a deal worth up to $1.9B", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416070017", "headline": "AbbVie Inc. (ABBV) is Attracting Investor Attention: Here is What You Should Know", "summary": "Zacks.com users have recently been watching AbbVie (ABBV) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects."}, {"date": "20240416082133", "headline": "UPDATE 1-US FDA warns of harmful reactions to fake Botox injections", "summary": "The U.S. Food and Drug Administration on Tuesday alerted health care professionals and consumers that unsafe counterfeit versions of AbbVie's Botox were given to consumers for cosmetic purposes in multiple states.  The U.S. Centers for Disease Control and Prevention (CDC) and the FDA are investigating reports of harmful reactions among people who received injections of counterfeit Botox.  As of April 12, a total of 19 people from nine states had reported harmful reactions after receiving Botox injections from unlicensed or untrained individuals, or in non-healthcare settings, such as homes and spas, according to the CDC."}, {"date": "20240416100554", "headline": "AbbVie: Through Humira's Crisis Towards Solid Growth", "summary": "AbbVie strategically manages patent expiration, fosters innovation, expands pipeline, and enters new markets. Learn more about ABBV stock here."}, {"date": "20240416102442", "headline": "FHLC: Healthcare Dashboard For April", "summary": "Fidelity MSCIÂ Health CareÂ Index ETF is an alternative to XLV for long-term investors. Read this article to learn more about FHLC ETF."}, {"date": "20240416125616", "headline": "Steady Income, Steady Growth: 7 Blue-Chip Dividend Stocks to Buy Now", "summary": "Blue-chip dividend stocks have always been relevant. While they’re not the most exciting investments, they provide a steady hand during market uncertainty. This attribute has just become even more critical. With an already tense situation in the geopolitical realm boiling over, investors will likely seek reassurances. It doesn’t get much better than established stalwarts that pay consistent and/or reliable passive income. On this note, below are top blue-chip dividend stocks to consider. RTX (RT"}, {"date": "20240416190300", "headline": "$1000 Invested In This Stock 5 Years Ago Would Be Worth $2,100 Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416193900", "headline": "14 companies with a near-term catalyst around 1Q earnings - MS", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416194700", "headline": "Is Your Botox Real Or Fake? Counterfeit Boxes Circulate For Widely Used Antiwrinkle Treatment, CDC And FDA Investigate Harmful Reactions", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416202600", "headline": "AbbVie (ABBV) Gets a Buy from Barclays", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417020000", "headline": "ClearBridge Multi Cap Growth Strategy Q1 2024 Portfolio Manager Commentary", "summary": "ClearBridge is a leading global asset manager committed to active management."}, {"date": "20240417023200", "headline": "CVS favors Humira copycats hurting AbbVie’s market share: Evercore", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417154517", "headline": "AbbVie (ABBV) Increases Despite Market Slip: Here's What You Need to Know", "summary": "AbbVie (ABBV) closed at $164.25 in the latest trading session, marking a +1.05% move from the prior day."}, {"date": "20240418000600", "headline": "AbbVie buyout Cerevel posts late-stage win for Parkinson’s disease drug", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418012839", "headline": "Johnson & Johnson: Buy This Bargain Before It's Gone", "summary": "Johnson & Johnson exceeds expectations with strong financial results and impressive sales growth. Read more to see why I am bullish on JNJ stock."}, {"date": "20240418013400", "headline": "AbbVie reports 'positive' results from Phase 3 SELECT-GCA study of upadacitinib", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418023400", "headline": "AbbVie succeeds in late-stage trial for Rinvoq in inflammatory condition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418032729", "headline": "AbbVie Study on Treatment for Giant Cell Arteritis Meets Primary Endpoint", "summary": "By Denny Jacob AbbVie disclosed positive top-line results from a study on upadacitinib to treat adults with giant cell arteritis, an autoimmune disease. The drugmaker said its Phase 3..."}, {"date": "20240418043000", "headline": "Cerevel, in ‘major surprise,’ finds success in late-stage Parkinson’s study", "summary": "Analysts had low expectations for Cerevel’s drug tavapadon, which was something of an afterthought in AbbVie’s proposed buyout of the biotech."}, {"date": "20240418063100", "headline": "Phase 3 SELECT-GCA Study of Upadacitinib (RINVOQ®) Showed Positive Results in Patients With Giant Cell Arteritis", "summary": "AbbVie (NYSE: ABBV) today announced positive top-line results from SELECT-GCA, a Phase 3, multicenter, randomized, double-blind, placebo-controlled study, showing upadacitinib (RINVOQ®; 15 mg, once daily) in combination with a 26-week steroid taper regimen achieved its primary endpoint of sustained remissiona from week 12 through week 52 in adults with giant cell arteritis (GCA). In this study, 46 percent of patients receiving upadacitinib 15 mg in combination with a 26-week steroid taper regime"}, {"date": "20240418074638", "headline": "AbbVie Q1 Earnings Preview: No Repeat Of Last Year's Q1 Disappointment", "summary": "AbbVie soon releases Q1 2024 earnings and faces losing patent protection for its best-selling drug, Humira. Read why I expect a positive Q1 2024 from ABBV."}, {"date": "20240418101800", "headline": "Heard on the Street: AbbVie’s Bet on a Neuroscience Drug Maker Just Got Better", "summary": "AbbVie’s acquisition of neuroscience biotech Cerevel Therapeutics hasn’t closed yet.  Notably, when AbbVie announced the $8.7 billion acquisition of Cerevel back in December, the main focus of the deal was the experimental schizophrenia drug Emraclidine, part of a new class of medications that target the muscarinic receptor.  Late last year, Bristol Myers Squibb also announced its entry into the field, buying Karuna Therapeutics for $14 billion. The Food and Drug Administration is reviewing Karuna’s drug for the treatment of schizophrenia."}, {"date": "20240418134409", "headline": "Soon To Be Acquired Cerevel Therapeutics Reveals High Level Data From Late-Stage Parkinson's Disease Study", "summary": "On Thursday, Cerevel Therapeutics Holdings Inc. (NASDAQ:CERE) released topline results from its pivotal Phase 3 TEMPO-3 trial for tavapadon in Parkinson’s disease. The TEMPO-3 trial evaluated the efficacy, safety, and tolerability of tavapadon as an adjunctive therapy to levodopa (LD) in adults. The trial met its primary endpoint – patients treated with tavapadon adjunctive to LD experienced a clinically meaningful and statistically significant increase of 1.1 hours in total “on” time without tr"}, {"date": "20240418200200", "headline": "Catalyst Watch: Tesla, Boeing and General Motors brace for earnings fireworks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418202500", "headline": "At least 70% of the S&P 500 names that reported results this week topped estimates - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418224600", "headline": "Wells Fargo Reaffirms Their Buy Rating on AbbVie (ABBV)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418234041", "headline": "Market Correction Expected: 20 Stocks To Buy If It Worsens", "summary": "A market correction of 10% or more occurs every 1.2 years, re-adjusting valuations and setting the stage for the next leg up. Click here for a detailed review."}, {"date": "20240419000000", "headline": "Alvotech, Teva signs deal to expand access for Humira biosimilar in U.S.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419002500", "headline": "Alvotech/Teva bring new partner to expand access for Humira biosimilar in U.S.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419010348", "headline": "Unveiling Pfizer's Potent Cocktail: Key Drivers Of Free Cash Flow Growth", "summary": "Pfizer announced positive results from a pivotal clinical trial evaluating Abrysvo's efficacy against respiratory syncytial virus. See why PFE stock is a Buy."}, {"date": "20240419032204", "headline": "AbbVie - Phase 3 SELECT-GCA Study of Upadacitinib showed Positive Results in Patients with Giant Cell Arteritis", "summary": "NORTH CHICAGO - AbbVie today announced positive top-line results from SELECT-GCA, a Phase 3, multicenter, randomized, double-blind, placebo-controlled study, showing upadacitinib in combination..."}, {"date": "20240419071500", "headline": "Pharma Stock Roundup: JNJ's Q1 Results, LLY, ABBV, RHHBY's Successful Study Data", "summary": "J&J (JNJ) posts mixed first-quarter 2024 results. Lilly's (LLY) tirzepatide meets key goals in late-stage studies for obstructive sleep apnea."}, {"date": "20240419080023", "headline": "Earnings Preview: AbbVie (ABBV) Q1 Earnings Expected to Decline", "summary": "AbbVie (ABBV) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240419104317", "headline": "The Bad News Heading Into AbbVie's First-Quarter Earnings Report", "summary": "AbbVie stock has slumped 10% off its record high in March and is facing increasingly steep competition for its biggest moneymaker, Humira."}, {"date": "20240419123020", "headline": "These 3 Small-Cap Stocks Are Up 304% in 2024. Can They Run Higher?", "summary": "Small-cap stocks tend to outperform their larger brethren over time. After several years of underperformance, it looked like the little guys were going to start winning again. Inflation was moderating and the Federal Reserve was hinting it would cut interest rates at least three times this year. Beginning last October, the performance of the Russell 2000 index of small-cap stocks started pulling away from that of the S&P 500. But it wouldn’t last. Runaway government spending drove inflation high"}, {"date": "20240420010000", "headline": "20 Years To $300k? Building A $10,000 Dividend Portfolio From Scratch", "summary": "Focusing on consistent dividend growth can lead to higher returns in lower-risk areas. Read an analysis of the portfolio here."}, {"date": "20240420060300", "headline": "THQ: Collecting A High Yield From Increased Medical Spending", "summary": "abrdn Healthcare Opportunities Fund (THQ) offers a high dividend yield and exposure to diverse healthcare subsectors, outperforming peers. Explore more here."}, {"date": "20240420224900", "headline": "Can Magnificent 7 Help Script Market Turnaround? Earnings Pick Up Pace With Microsoft, Meta, Alphabet And Tesla Expected This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421004642", "headline": "Wall Street Breakfast: The Week Ahead", "summary": "Stay updated with the latest financial news and market trends by listening to the Wall Street Breakfast podcast available on Seeking Alpha, iTunes, and..."}, {"date": "20240421010500", "headline": "Earnings week ahead: Tesla, Meta Platforms, Google, Microsoft, Intel, Exxon Mobil, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422000200", "headline": "Options Volatility and Implied Earnings Moves This Week, April 22 – April 26, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422010400", "headline": "3 Dividend Kings Down 11% You’ll Regret Not Buying on the Dip", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422012800", "headline": "AbbVie (ABBV) Gets a Buy from Piper Sandler", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422031800", "headline": "EU regulators approve Pfizer antibiotic Emblaveo", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422041000", "headline": "Dividend yield and growth stock list by Goldman", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422074700", "headline": "Buying the Dip in These 3 Undervalued Dividend Stocks", "summary": "All three of these stocks look intriguing."}, {"date": "20240422105600", "headline": "AbbVie (ABBV) to Report Q1 Earnings: What's in the Cards?", "summary": "Investor focus is likely to be on the sales of AbbVie's (ABBV) blockbuster immunology drugs Rinvoq and Skyrizi when it reports first-quarter results."}, {"date": "20240422194800", "headline": "AbbVie's Options Frenzy: What You Need to Know", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422214400", "headline": "Dividend Growth Stars: 7 Stocks With 10-Year Double-Digit Rate Hikes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423010020", "headline": "Not A Millionaire? No Problem! Here's A 10-Stock Portfolio To Retire Comfortably", "summary": "Most retirees are managing to thrive in retirement with less savings than expected. Check here to learn more about a 10-stock portfolio to retire comfortably."}, {"date": "20240423020100", "headline": "Takeda Pharmaceutical: A Long-Term Cash Cow", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423060000", "headline": "Allergan Aesthetics Invites Consumers to Be the Face of BOTOX® Cosmetic (onabotulinumtoxinA) and Their Other Biggest Brands", "summary": "Allergan Aesthetics, an AbbVie company (NYSE: ABBV), is offering consumers an opportunity to be featured in upcoming campaigns for their biggest brands, including BOTOX® Cosmetic, the JUVÉDERM® Collection of Fillers, and Allē, the Allergan Aesthetics loyalty rewards program. Beginning today, consumers—including existing patients and those who are considering aesthetic treatment—can apply for a chance to be included in future brand campaigns. The first Allergan Aesthetics open casting call for BO"}, {"date": "20240423061438", "headline": "US CDC warns of harmful reactions to fake Botox injections", "summary": "The U.S. Centers for DiseaseControl and Prevention on Tuesday alerted clinicians aboutrisks of counterfeit versions of AbbVie's Botox thatwere given to consumers for cosmetic purposes in..."}, {"date": "20240423071523", "headline": "Gear Up for AbbVie (ABBV) Q1 Earnings: Wall Street Estimates for Key Metrics", "summary": "Get a deeper insight into the potential performance of AbbVie (ABBV) for the quarter ended March 2024 by going beyond Wall Street's top -and-bottom-line estimates and examining the estimates for some of its key metrics."}, {"date": "20240423080101", "headline": "Eli Lilly (LLY) Reports Next Week: Wall Street Expects Earnings Growth", "summary": "Lilly (LLY) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240423130927", "headline": "Nvidia will soar 21% to $1,000 as its new AI chip slams would-be rivals, Morgan Stanley says. It’s among 10 stocks set to surge", "summary": "“We believe earnings growth is set for a healthier runway through 2024,” Morgan Stanley’s analysts wrote."}, {"date": "20240423212100", "headline": "Wall Street Analysts Are Neutral on Top Healthcare Picks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423212500", "headline": "Abbvie breaks six day winning cycle, trades in the red", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424025248", "headline": "Allergan Aesthetics Invites Consumers to Be the Face of BOTOX Cosmetic and Their Other Biggest Brands", "summary": "IRVINE - Allergan Aesthetics, an AbbVie company , is offering consumers an opportunity to be featured in upcoming campaigns for their biggest brands, including BOTOX Cosmetic, the JUVEDERM Collection..."}, {"date": "20240424040200", "headline": "Eaton Vance Worldwide Health Sciences Fund Bolsters Position in IDEXX Laboratories", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424042006", "headline": "Is Invesco Pharmaceuticals ETF (PJP) a Strong ETF Right Now?", "summary": "Smart Beta ETF report for PJP"}, {"date": "20240424071900", "headline": "What's in Store for These 5 Pharma Bigwigs in Q1 Earnings?", "summary": "Let's look at five biotech/drug companies, MRK, SNY, BMY, GILD and ABBV, slated to release their first quarter 2024 earnings results this week."}, {"date": "20240424080900", "headline": "4 Large Drug Stocks to Hold on to Amid Industry Challenges", "summary": "Drug and biotech companies are likely to see significant innovation. In the Large-Cap Pharmaceuticals industry, Eli Lilly (LLY), Novo Nordisk (NVO), Merck (MRK) and AbbVie (ABBV) are worth retaining in one's portfolio."}, {"date": "20240424100500", "headline": "Will Healthcare ETFs Lose Momentum as Q1 Earnings Unfold?", "summary": "While the healthcare sector is expected to benefit from cutting-edge medicines, new drug approvals, technological advancements, and deal activities, it is expected to witness a modest earnings decline of 5.6% in the first quarter."}, {"date": "20240424190200", "headline": "AbbVie's Dermatitis Drug Shown 'Superior' To Sanofi/Regeneron's Dupixent In Head-To-Head Study", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424214000", "headline": "AbbVie Inc. stock outperforms competitors despite losses on the day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424230600", "headline": "3 Biotech Stocks That Could Be Multibaggers in the Making: April Edition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425010500", "headline": "AbbVie reports 'positive' results from LEVEL UP study", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425020000", "headline": "Polaris Global Equity Composite Q1 2024 Commentary", "summary": "Global equity markets enjoyed consecutive months of gains, with the MSCI World Index returning 9.01% for the quarter."}, {"date": "20240425021000", "headline": "March's Dividend Portfolio Update Sets New All-Time Record - 100 Holdings, 21 Buys", "summary": "Portfolio changes in March focus on BDCs, aiming to increase dividend income by at least $100 each month. Click here for a detailed analysis."}, {"date": "20240425032500", "headline": "AbbVie Q1 Preview: Skyrizi and Rinvoq’s launches could help Q1", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425040700", "headline": "Notable earnings before Friday's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425043000", "headline": "AbbVie reports positive results from Rinvoq versus Dupixent study", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425060000", "headline": "New Data Show RINVOQ® (upadacitinib) Demonstrated Superiority Versus DUPIXENT® (dupilumab) Across Primary and All Secondary Endpoints in an Open-Label Head-to-Head Atopic Dermatitis Study", "summary": "AbbVie (NYSE: ABBV) today announced positive topline results from LEVEL UP, an open-label, efficacy assessor-blinded head-to-head Phase 3b/4 study that evaluated the efficacy and safety of upadacitinib (RINVOQ®, 15 mg once daily starting dose and dose-adjusted based on clinical response) versus dupilumab (DUPIXENT®, per its labeled dose) in adults and adolescents (≥12 years of age) with moderate-to-severe atopic dermatitis (AD) who had an inadequate response to systemic therapy or when use of th"}, {"date": "20240425061100", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425063300", "headline": "Zacks Industry Outlook Highlights Eli Lilly, Novo Nordisk, Merck and AbbVie", "summary": "Eli Lilly, Novo Nordisk, Merck and AbbVie are part of the Zacks Industry Outlook article."}, {"date": "20240425064404", "headline": "UPDATE 1-AbbVie's skin disease drug found to be more effective than Regeneron's Dupixent in study", "summary": "AbbVie said on Thursday its drug, Rinvoq, for treating a type of inflammatory skin condition was found to be more effective than Regeneron Pharmaceuticals and Sanofi's Dupixent in a late-stage head-to-head study.  Rinvoq helped 19.9% of patients simultaneously achieve near-complete skin clearance with a no-to-little itch after 16 weeks of treatment, compared with 8.9% of patients treated with Dupixent, the study showed.  The study is the first head-to-head trial in adults and adolescents with moderate-to-severe atopic dermatitis and had shown an inadequate response to systemic therapy, AbbVie said."}, {"date": "20240425101300", "headline": "NEW YORK MARKET CLOSE: Stocks ebb on stagflation fears as growth slows", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425114916", "headline": "These Are The Biotechs Showing Up At The Biggest Cancer Meeting Of The Year (Oral Presentations)", "summary": "The Annual Meeting of ASCO is a major event for clinicians and researchers in the field of oncology. Explore more details here."}, {"date": "20240425144839", "headline": "Cigna to offer Humira rivals with $0 copay at specialty pharmacy", "summary": "Cigna plans to make close copies of AbbVie's blockbuster arthritis drug Humira available with no out-of-pocket payment to eligible patients in the U.S. using its specialty pharmacy beginning in June, the health insurer said on Thursday.  Cigna said it will stock high- and low-concentration biosimilar versions of Humira from drugmakers including Boehringer Ingelheim, Teva and Alvotech at its Accredo pharmacy."}, {"date": "20240425183500", "headline": "GLOBAL BRIEFING: Yen slumps to new multi-decade low as BoJ stands pat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425190800", "headline": "More than half of the S&P 500 names that reported results this week beat top and bottom line - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425191400", "headline": "AbbVie stock slides 6% amid concerns about falling Humira sales", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425194300", "headline": "Arthritis Patients - Cigna's Evernorth To Offer Humira Biosimilar At No Out-of-Pocket Cost", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425210900", "headline": "What You Missed On Wall Street On Friday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425220700", "headline": "Hold Rating on AbbVie Amid Revenue Decline and Profitability Concerns", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425224000", "headline": "AbbVie (NYSE:ABBV) Sinks as Humira Drug Sees Increased Competition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425235300", "headline": "Wall Street Futures Ride High On Microsoft, Alphabet Cheer, But Will Inflation Data Burst The Bubble? Why This Analyst Thinks Bull Run Isn't Over Yet", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426000600", "headline": "Options Volatility and Implied Earnings Moves Today, April 26, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426003600", "headline": "AbbVie reports Q1 adjusted EPS $2.31, consensus $2.23", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426003700", "headline": "AbbVie raises FY24 adjusted EPS view to $11.13-$11.33 from $10.97-$11.17", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426004000", "headline": "AbbVie Non-GAAP EPS of $2.31 beats by $0.05, revenue of $12.31B beats by $370M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426004300", "headline": "AbbVie reports Q1 global revenue from immunology portfolio $5.371B, down 3.9%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426004900", "headline": "AbbVie’s first-quarter results top expectations as arthritis drugs fuel growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426014410", "headline": "AbbVie: Q1 Earnings Snapshot", "summary": "NORTH CHICAGO, Ill. — NORTH CHICAGO, Ill. — AbbVie Inc. on Friday reported first-quarter earnings of $1.37 billion. On a per-share basis, the North Chicago, Illinois-based company said it..."}, {"date": "20240426015400", "headline": "Fly Intel: Pre-market Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426021000", "headline": "5 stocks to watch on Friday: XOM, CVX, ABBV and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426021200", "headline": "AbbVie says Q1 results exceeded expectations", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426021500", "headline": "AbbVie in charts: Q1 Skyrizi, Rinvoq sales jump, while revenue from Humira continues to fall", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426022600", "headline": "AbbVie reports quarterly revenue rise and net earnings boost", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426022630", "headline": "AbbVie Lifts Outlook After 1Q Revenue Unexpectedly Rises", "summary": "By Dean Seal AbbVie raised its annual adjusted earnings guidance after revenue unexpectedly rose in the first quarter as lower sales of Humira were offset with gains elsewhere. The..."}, {"date": "20240426023246", "headline": "AbbVie raises annual targets", "summary": "On the occasion of its quarterly publication, healthcare group AbbVie announces that it has raised its adjusted EPS guidance range for the full year 2024 from $10.97-11.17 to $11.13-11.33.It reports..."}, {"date": "20240426023600", "headline": "AbbVie sees Q2 adjusted EPS $3.05-$3.09, consensus $2.81", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426024000", "headline": "AbbVie sees FY24 revenue approximately $55B, consensus $54.6B", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426025900", "headline": "Ex-Humira Growth Platform Drives AbbVie's Q1 Performance, Drugmaker Lifts Annual Profit Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426030000", "headline": "AbbVie says Humira downdraft 'within what was assumed'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426030000", "headline": "EOI: 9% Plus Income, Paid Monthly, And Solid Past Record", "summary": "Eaton Vance Enhanced Equity Income Fund is an appealing CEF for income investors, offering a nearly 9% yield on a monthly basis. Click here for more on EOI CEF."}, {"date": "20240426033700", "headline": "AbbVie off 3% despite quarterly beats, 2024 guidance raise", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426042200", "headline": "AbbVie Q1 report beats Street despite plunging Humira sales", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426045500", "headline": "ABBV Stock Earnings: AbbVie Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426050400", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426051300", "headline": "Interesting ABBV Put And Call Options For July 19th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426053500", "headline": "AbbVie Reports First-Quarter 2024 Financial Results", "summary": "AbbVie (NYSE:ABBV) announced financial results for the first quarter ended March 31, 2024."}, {"date": "20240426053634", "headline": "AbbVie raises annual profit forecast on strong Skyrizi sales", "summary": "AbbVie raised its annual profit forecast on Friday after strong sales of its immunology drug Skyrizi and cancer drug Imbruvica helped the company beat Wall Street estimates for the first quarter.  The company now expects adjusted profit of between $11.13 and $11.33 per share for this year, compared with $10.97 to $11.17 estimated earlier.  Analysts on average expect annual profit of $11.10 per share, according to LSEG data."}, {"date": "20240426054431", "headline": "Drugmaker AbbVie expects Humira volume erosion to worsen", "summary": "(Reuters) -AbbVie expects a drop in sales volumes of its blockbuster arthritis drug Humira to deepen after recent changes by U.S. pharmacy benefit managers and as patients shift to other drugs.  Its shares were down nearly 5% in afternoon trade on Friday, after the company forecast U.S. Humira sales would fall 32% in the second quarter.  AbbVie's investors have been closely watching the sales trajectory of Humira - the world's top-selling drug till it lost exclusivity last year and saw the launch of nine close copies, or biosimilars, in the United States."}, {"date": "20240426060100", "headline": "AbbVie tries to reassure investors on Humira biosimilar threat", "summary": "Prescription volume erosion is tracking with company forecasts, executives claimed, even as more insurers could exclude the branded drug."}, {"date": "20240426060150", "headline": "AbbVie's Q1: Positive Surprise", "summary": "AbbVie's earnings beat estimates, with a smaller decline in Humira sales. Read how the biotech's next-generation drugs Rinvoq and Skyrizi are offsetting a decline in Humira sales."}, {"date": "20240426064502", "headline": "AbbVie (ABBV) Beats Q1 Earnings and Revenue Estimates", "summary": "AbbVie (ABBV) delivered earnings and revenue surprises of 2.21% and 2.65%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240426065000", "headline": "Tech Stocks Rebound As Magnificent 7 Roar On Strong Earnings, Energy Giants Tumble: What's Driving Markets Friday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426071146", "headline": "AbbVie Inc (ABBV) Q1 2024 Earnings: Adjusted EPS Tops Estimates Despite Revenue Challenges", "summary": "Comprehensive Analysis of AbbVie's Latest Financial Performance"}, {"date": "20240426072532", "headline": "AbbVie Inc. (ABBV) Q1 2024 Earnings Call Transcript", "summary": "AbbVie Inc. (NYSE:NYSE:ABBV) Q1 2024 Earnings Conference Call April 26, 2024 9:00 AM ETCompany ParticipantsLiz Shea - Vice President of Investor..."}, {"date": "20240426075800", "headline": "AbbVie Raises Earnings Guidance Even as Humira Sales Continue to Drop", "summary": "AbbVie  raised its full-year earnings outlook despite continuing sales declines for autoimmune drug Humira.  AbbVie  said it expects adjusted earnings in 2024 of between $11.13 and $11.33 a share, up from previous guidance of $10.97 to $11.17 a share.  Analysts surveyed by FactSet were expecting the biopharmaceutical company to post full-year earnings of $11.12 a share."}, {"date": "20240426083002", "headline": "AbbVie (ABBV) Reports Q1 Earnings: What Key Metrics Have to Say", "summary": "While the top- and bottom-line numbers for AbbVie (ABBV) give a sense of how the business performed in the quarter ended March 2024, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values."}, {"date": "20240426083300", "headline": "PCE In-Line to Warmer, Pre-Market Calms; ABBV Beats, XOM Misses", "summary": "Pre-market futures are up across the board: +106 points on the Dow, +45 points on the S&P 500 and +195 on the Nasdaq immediately following this important data's release."}, {"date": "20240426085300", "headline": "PCE/Core PCE Numbers Came In Line With Expectations", "summary": "PCE/Core PCE Numbers Came In Line With Expectations"}, {"date": "20240426090219", "headline": "Top 20 biopharma kick off 9.6% market cap surge in Q1 2024 amid Medicare price talks", "summary": "Some companies, however, reported a market capitalisation decline, including Gilead Sciences and Roche."}, {"date": "20240426101000", "headline": "AbbVie (ABBV) Beats on Q1 Earnings & Sales, Ups '24 EPS View", "summary": "AbbVie's (ABBV) first-quarter earnings and sales beat estimates. Management hikes the EPS guidance on the back of encouraging Skyrizi product sales."}, {"date": "20240426105418", "headline": "AbbVie Shares Close Down 4.6%, Sees Additional Humira Volume Erosion in 2Q", "summary": "By Sabela Ojea Shares of AbbVie lost 4.6% to close at $159.62 on Friday after the company warned about the effects of losing the exclusivity of its patent for the arthritis medication Humira,..."}, {"date": "20240426131513", "headline": "AbbVie (ABBV) Q1 2024 Earnings Call Transcript", "summary": "ABBV earnings call for the period ending March 31, 2024."}, {"date": "20240426140711", "headline": "Why AbbVie Stock Stumbled Today Despite the Earnings Beat", "summary": "Investors are struggling to see past the end of Humira's dominance."}, {"date": "20240426140832", "headline": "AbbVie Is 'Firing On All Cylinders,' But Its Stock Doesn't Show That", "summary": "AbbVie is \"firing on all cylinders,\" an analyst said Friday after the firm beat first-quarter estimates. But AbbVie stock fell."}, {"date": "20240426153137", "headline": "Abbvie stock falls amid growing biosimilar competition", "summary": "Pharmaceutical giant AbbVie Inc. (ABBV) shares came under pressure as the market closed on Friday, following the disappointing first quarter sales performance of the company's arthritis drug, Humira. The company forecast that Humira's sales could slow further in the face of heightened competition. Yahoo Finance's health reporter Anjalee Khemlani breaks down the details, providing insight into the rise of biosimilars in the market. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance. This post was written by Angel Smith"}, {"date": "20240426232453", "headline": "Q1 2024 AbbVie Inc Earnings Call", "summary": "Q1 2024 AbbVie Inc Earnings Call"}, {"date": "20240427010715", "headline": "AbbVie Inc (ABBV) Q1 2024 Earnings Call Transcript Highlights: Surpassing Expectations with ...", "summary": "Discover how AbbVie Inc (ABBV) exceeded forecasts with robust revenue growth and strategic expansions in its latest quarterly earnings."}, {"date": "20240427051500", "headline": "3 Dividend Stocks to Buy and Hold for the Next Decade", "summary": "You'll get dividends and more with these great stocks."}, {"date": "20240428022000", "headline": "Better Dividend Stock: AbbVie or Johnson & Johnson?", "summary": "One thing is for sure: Dividend seekers can't go wrong with either."}, {"date": "20240428060400", "headline": "J&J, Roche, AstraZeneca poised to have highest orphan drug sales by end of decade", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428064245", "headline": "AbbVie First Quarter 2024 Earnings: Beats Expectations", "summary": "AbbVie ( NYSE:ABBV ) First Quarter 2024 Results Key Financial Results Revenue: US$12.3b (flat on 1Q 2023). Net income..."}, {"date": "20240428165443", "headline": "Dividend Stock Portfolio For Income: Top 15 Stocks", "summary": "In this article, we will discuss dividend stocks for regular income. You can skip our detailed analysis of dividend stocks and their historical performance, and go directly to read Dividend Stock Portfolio For Income: Top 5 Stocks. It is generally believed that dividend stocks are primarily suitable for people approaching retirement. However, this is far from […]"}, {"date": "20240428224800", "headline": "AbbVie price target lowered by $8 at Barclays, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428225100", "headline": "Analysts Offer Insights on Healthcare Companies: Dexcom (DXCM), OptimizeRx (OPRX) and AbbVie (ABBV)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428234700", "headline": "Buy Rating Reaffirmed for AbbVie: Future Growth Beyond Humira’s Competition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429000856", "headline": "Unveiling AbbVie's Winning Strategy In Pharmaceutical Innovation (Rating Upgrade)", "summary": "AbbVie's management raised its 2024 adjusted earnings guidance from $10.97 - $11.17 to $11.13 - $11.33. See why I upgrade ABBV stock from hold to buy."}, {"date": "20240429002800", "headline": "Buy Rating Affirmed: AbbVie’s Strong Performance and Positive Growth Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429005000", "headline": "Truist Financial Sticks to Its Buy Rating for AbbVie (ABBV)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429005300", "headline": "Analysts’ Top Healthcare Picks: AbbVie (ABBV), Wave Life Sciences (WVE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429015700", "headline": "AbbVie price target lowered by $5 at Morgan Stanley, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429020100", "headline": "Novo Nordisk: Growth Is Still A Better Choice", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429024900", "headline": "AbbVie price target lowered by $15 at BMO Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429040300", "headline": "Peeling Back The Layers: Exploring AbbVie Through Analyst Insights", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429090853", "headline": "AbbVie: The Inevitable Is Happening", "summary": "AbbVie's shares dropped last week due to concerns about Humira erosion and despite ABBV beating revenue and EPS expectations. Find out why ABBV stock is a Buy."}, {"date": "20240429102715", "headline": "AbbVie Outlook: Why Humira Biosimilars Won't Undo A Projected $73 Billion In Sales", "summary": "Fears that Humira biosimilars will erode AbbVie's topline are overblown, an analyst said Monday. He has an outperform rating on AbbVie stock."}, {"date": "20240429190600", "headline": "Hold Rating on AbbVie Amidst Humira Concerns and Biosimilar Competition Despite Strong Pipeline Prospects", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429201200", "headline": "Analysts Offer Insights on Healthcare Companies: AbbVie (ABBV), Molina Healthcare (MOH) and Cytokinetics (CYTK)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429234000", "headline": "Inflation-Proof Fortunes: 7 Dividend Aristocrats to Keep Your Wealth Growing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000100", "headline": "AbbVie Inc: An Exploration into Its Intrinsic Value", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430042144", "headline": "Earnings Beat: AbbVie Inc. Just Beat Analyst Forecasts, And Analysts Have Been Updating Their Models", "summary": "AbbVie Inc. ( NYSE:ABBV ) investors will be delighted, with the company turning in some strong numbers with its latest..."}, {"date": "20240430050000", "headline": "Alvotech to produce Humira biosimilar for Cigna's Quallent", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430052400", "headline": "Novo, Teva, AstraZeneca issued FTC warnings over ‘bogus’ patents", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430063825", "headline": "AbbVie Inc. (NYSE:ABBV) Q1 2024 Earnings Call Transcript", "summary": "AbbVie Inc. (NYSE:ABBV) Q1 2024 Earnings Call Transcript April 26, 2024 AbbVie Inc. beats earnings expectations. Reported EPS is $2.31, expectations were $2.26. AbbVie Inc. isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning and thank you for standing […]"}, {"date": "20240430065115", "headline": "AbbVie : Reinforces Commitment to Science and Innovation with a €150 million Euro Investment in New Cutting-Edge Research and Development Facility in Germany", "summary": "April 30, 2024 AbbVie Reinforces Commitment to Science and Innovation with a €150 million Euro Investment in New Cutting-Edge Research and Development Facility..."}, {"date": "20240430065200", "headline": "7 Safe Haven Stocks That Can Withstand the Market’s Worst Meltdowns", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430070300", "headline": "US challenges 'bogus' patents on Ozempic and other drugs in effort to spur competition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430071002", "headline": "3 Top Dividend Stocks to Maximize Your Retirement Income", "summary": "The traditional retirement planning approaches no longer cover all expenses in nest egg years. So what can retirees do? Thankfully, there are alternative investments that provide steady, higher-rate income streams to replace dwindling bond yields."}, {"date": "20240430075920", "headline": "2 Dividend Stocks To Watch In May 2024", "summary": "Dividend stocks for your May 2024 watch list."}, {"date": "20240430094504", "headline": "AbbVie (ABBV) Could Be a Great Choice", "summary": "Dividends are one of the best benefits to being a shareholder, but finding a great dividend stock is no easy task. Does AbbVie (ABBV) have what it takes? Let's find out."}, {"date": "20240430100250", "headline": "Trials to watch: Four ALS drugs to keep an eye on", "summary": "There are a total of 12 candidates in mid to late-stage trials for ALS poised to enter the market in the next five years."}, {"date": "20240430211500", "headline": "BeiGene, AbbVie patent spat to get trial from USPTO appeals board", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501020100", "headline": "Novartis Is Tracking Well Above the Industry", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501070012", "headline": "How to Boost Your Portfolio with Top Medical Stocks Set to Beat Earnings", "summary": "The Zacks Earnings ESP is a great way to find potential earnings surprises. Why investors should take advantage now."}, {"date": "20240501070016", "headline": "Here is What to Know Beyond Why AbbVie Inc. (ABBV) is a Trending Stock", "summary": "AbbVie (ABBV) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock."}, {"date": "20240501114627", "headline": "CVS stock plunges after earnings numbers one analyst 'did not even believe'", "summary": "CVS warns it could cede Medicare Advantage market share as reimbursement rates pressure the company."}, {"date": "20240501193600", "headline": "$1000 Invested In This Stock 10 Years Ago Would Be Worth $3,100 Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502010106", "headline": "The top pharmaceutical companies by R&D expenditure", "summary": "From Merck & Co to Sanofi, Pharmaceutical Technology lists the leading pharmaceutical companies spending the most on R&D in 2023."}, {"date": "20240502040600", "headline": "Genmab reports Q1 revenue increased 46% vs. last year", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502101144", "headline": "Top 25 Stocks in the S&P 500 by Index Weight Right Now", "summary": "In this piece, we will take a look at the top 25 stocks in the S&P 500 by index weight right now. If you want to skip our coverage of the flagship stock index and some recent news for its biggest constituents then you can skip ahead to Top 10 Stocks in the S&P 500 […]"}, {"date": "20240503044900", "headline": "ABBV June 14th Options Begin Trading", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503074011", "headline": "Are You a Value Investor? This 1 Stock Could Be the Perfect Pick", "summary": "Whether you're a value, growth, or momentum investor, finding strong stocks becomes easier with the Zacks Style Scores, a top feature of the Zacks Premium research service."}, {"date": "20240503092900", "headline": "Pharma Stock Roundup: LLY, NVO, PFE Q1 Results, JNJ's New Plan to Resolve Talc Claims", "summary": "Eli Lilly (LLY), Novo Nordisk (NVO), Pfizer (PFE) and AbbVie (ABBV) announce their first-quarter results."}, {"date": "20240503230115", "headline": "Decoding AbbVie Inc (ABBV): A Strategic SWOT Insight", "summary": "Insightful Analysis of AbbVie's Strengths, Weaknesses, Opportunities, and Threats"}]}