{"news": [{"date": "20240425115900", "headline": "Airbus Earnings Improved, But Less Than Expected.", "summary": "Airbus reported higher first-quarter profit and revenue, but results came in below what Wall Street was expecting.  Airbus  reported results just before noon ET Thursday in the U.S., after the European markets had closed for the day.  France-based Airbus is still trouncing its U.S. rival on pure metrics so far this year."}, {"date": "20240425122400", "headline": "Amid poor first-quarter financial results, Southwest ends service in 4 cities", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425170300", "headline": "Analysts reboot stock price target for GE Aerospace after earnings", "summary": "This is what could happen next to GE Aerospace shares."}, {"date": "20240425175226", "headline": "American Airlines CEO fumes at Boeing’s failures—’Get your act together’", "summary": "Boeing’s production problems have taken a toll on airline earnings and some are luckier than others."}, {"date": "20240425190300", "headline": "30 out of 34 industrial stocks post EPS wins, while half of them beat revenue estimates - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425190800", "headline": "More than half of the S&P 500 names that reported results this week beat top and bottom line - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425191541", "headline": "News Highlights : Top Company News of the Day - Friday at 1 AM ET", "summary": "Microsoft CEO to Visit Southeast Asia With AI on Agenda Satya Nadella will meet officials in Indonesia, Thailand and Malaysia next week, as the tech titan is betting on generative AI for..."}, {"date": "20240425193900", "headline": "More Plane Trouble for Boeing (NYSE:BA), But Defense Unit Helps?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425201700", "headline": "More Plane Trouble for Boeing (NYSE:BA)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425221914", "headline": "Q1 2024 American Airlines Group Inc Earnings Call", "summary": "Q1 2024 American Airlines Group Inc Earnings Call"}, {"date": "20240425222205", "headline": "Q1 2024 Kaiser Aluminum Corp Earnings Call", "summary": "Q1 2024 Kaiser Aluminum Corp Earnings Call"}, {"date": "20240425230406", "headline": "Safran posts higher Q1 revenue, keeps financial targets", "summary": "PARIS (Reuters) -French jet engine maker Safran posted an 18.1% jump in first-quarter revenue and reaffirmed financial targets for the year while joining U.S. partner GE Aerospace in lowering a target for engine deliveries.  Safran co-produces engines for Boeing and Airbus narrow-body jets with GE Aerospace through their CFM joint venture, which is the sole supplier to Boeing's 737 MAX family of jets and competes with Pratt & Whitney on the Airbus A320neo series."}, {"date": "20240425230700", "headline": "Senior expects \"good growth\" in 2024 led by Aerospace business", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426004029", "headline": "UPDATE 1-Safran posts higher Q1 revenue, keeps financial targets", "summary": "French jet engine maker Safran posted an 18.1% jump in first-quarter revenue and reaffirmed financial targets for the year while joining U.S. partner GE Aerospace in lowering a target for engine deliveries.  The Paris-based company posted quarterly revenues of 6.22 billion euros  ($6.67 billion), up 19.1% on an underlying basis.  Safran co-produces engines for Boeing and Airbus narrow-body jets with GE Aerospace through their CFM joint venture, which is the sole supplier to Boeing's 737 MAX family of jets and competes with Pratt & Whitney on the Airbus A320neo series."}, {"date": "20240426004200", "headline": "Boeing price target lowered by $40 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426004900", "headline": "Airbus posts drop in earnings raising fears it may struggle to profit on Boeing’s woes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426013210", "headline": "Southwest Airlines Co (LUV) (Q1 2024) Earnings Call Transcript Highlights: Record Revenues and ...", "summary": "Southwest achieves unprecedented first-quarter revenues and passenger numbers, while navigating operational changes and planning for future expansions."}, {"date": "20240426013300", "headline": "GLOBAL BROKER RATINGS: Stifel cuts Caterpillar; HSBC likes Ashtead", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426014200", "headline": "Boeing outlook cut to negative at Fitch on production, cash flow struggles", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426024800", "headline": "Smart Money Is Betting Big In Boeing Options", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426040103", "headline": "Q1 2024 Southwest Airlines Co Earnings Call", "summary": "Q1 2024 Southwest Airlines Co Earnings Call"}, {"date": "20240426041204", "headline": "Aviation results: European carriers EasyJet and Jet2 fly to new heights, while Airbus prepares to overtake Boeing as headwinds continue", "summary": "It's been an eventful few days for aviation players—from Airbus to Heathrow. Here's how they fared."}, {"date": "20240426041500", "headline": "Interesting BA Put And Call Options For September 2025", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426044000", "headline": "Microsoft, Alphabet Earnings Show Markets Need AI After Fed Cut Delay, Here’s Why. And 5 Other Things to Know Before the Market Opens.", "summary": "Southwest Airlines sees deeper Boeing impact, huge mining merger rejected with copper’s rise in the spotlight, and other news to start your day."}, {"date": "20240426050000", "headline": "Cargo airline Amerijet warns of pilot furloughs amid downsizing", "summary": "Amerijet, trying to pull out of a downward spiral, is floating possible furloughs to address a pilot surplus. The post Cargo airline Amerijet warns of pilot furloughs amid downsizing appeared first on FreightWaves."}, {"date": "20240426053900", "headline": "L3Harris Stock Rises. Its Earnings Cap a Strong Week For Defense Contractors.", "summary": "The company's stock is rising in early trading after it beat Wall Street expectations and raised guidance."}, {"date": "20240426055300", "headline": "7 Must-Buy Stocks to Lock In a Luxurious Lifestyle", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426065800", "headline": "Optimistic Outlook on Boeing: Balancing Short-term Setbacks with Strategic Long-term Growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426082500", "headline": "Tighter Spreads Drive Outperformance", "summary": "Fallen angels returned 1.61 % versus 1.51 % for the broad high yield market due to tighter spreads, which drove high price returns. Click to read."}, {"date": "20240426082514", "headline": "Boeing : GKN Aerospace Close Deal for St. Louis Site", "summary": "ST. LOUIS, April 26, 2024 - Boeing [NYSE: BA] has closed a deal with GKN Aerospace St. Louis and its parent company, Melrose Industries, to continue the manufacturing of critical components..."}, {"date": "20240426083131", "headline": "Boeing, GKN Aerospace close deal for St. Louis site", "summary": "Boeing said on Friday thatit has closed a deal with aero supplier GKN Aerospace and itsparent company Melrose Industries for a plant in St.Louis. The deal immediately transitions..."}, {"date": "20240426091553", "headline": "Boeing, Lockheed Passed Up for Air Force Drone Program", "summary": "The program could be worth billions."}, {"date": "20240426101300", "headline": "Southwest Airlines is considering changes to its quirky boarding and seating practices", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426112211", "headline": "Authorities searching for emergency slide that fell off Delta plane during flight", "summary": "An emergency slide fell off a Delta Airlines Boeing 767 shortly after takeoff Friday, forcing the plane to return to John F. Kennedy International Airport.Delta Air Lines Flight 520 turned around..."}, {"date": "20240426125800", "headline": "An emergency slide falls off a Delta Air Lines plane, forcing pilots to return to JFK in New York", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426130848", "headline": "Fitch downgrades Boeing's outlook to 'negative' on production, cashflow challenges", "summary": "Fitch Ratings downgraded outlook on Boeing to \"negative\" from \"stable\" on Friday, amid a fallout from safety crisis impacting the U.S. planemaker's production and cashflow.  The ratings agency, which reaffirmed its \"BBB-\" long-term issuer default rating, said it could stabilize the outlook if Boeing liquidates over 100 of its pre-2023 built 737 MAX and half of its 787 inventories by early 2025, along with increasing production of its MAX jets towards 38 per month.  Fitch's downgrade follows similar moves by S&P and Moody's earlier in the week on its bumpy cashflow."}, {"date": "20240426144048", "headline": "American Airlines to adjust routes amid Boeing 787 delivery delays", "summary": "\"We're making these adjustments now to ensure we're able to re-accommodate customers on affected flights,\" the company said.  The move comes a day after peer Southwest Airlines said that it will shut operations at some airports as a result of the 787 delivery issues.  Reuters reported earlier this month that the output of Boeing's 737 MAX had fallen sharply on increased production checks by U.S. regulators."}, {"date": "20240426144856", "headline": "Emergency slide falls off Delta plane after takeoff", "summary": "The emergency exit slide fell off a Delta Airlines jet after taking off from New York en route to Los Angeles on Friday, Delta said.  Delta said that crew on the flight, which had 183 people on board, declared an emergency and returned to John F. Kennedy International Airport, that it \"supporting retrieval efforts.\"  “As nothing is more important than the safety of our customers and people, Delta flight crews enacted their extensive training and followed procedures to return to JFK,\" the airline said."}, {"date": "20240426153919", "headline": "US Air Force awards Doomsday plane contract to Sierra Nevada", "summary": "The U.S. Air Force said on Friday that it has awarded a contract to Sierra Nevada Corp to develop a successor to the E-4B, known as the Doomsday plane, due to its ability to survive a nuclear war.  The Survivable Airborne Operations Center (SAOC) project is intended to replace the aging 1970s-era aircraft, which is approaching end-of-service life, a Air Force spokesperson said in a statement.  To satisfy operational requirements, the weapon system will comprise of a commercial derivative jet hardened and modified to meet military requirements."}, {"date": "20240426154423", "headline": "US Air Force awards $13 billion Doomsday plane contract to Sierra Nevada", "summary": "The Survivable Airborne Operations Center (SAOC) project is intended to replace the aging 1970s-era aircraft, which is approaching end-of-service life, an Air Force spokesperson said in a statement.  Work on the SAOC will be carried out in Colorado, Nevada and Ohio and is expected to be completed in 2036, the Air Force added.  Reuters in December reported that the U.S. Air Force eliminated Boeing from its competition to develop a successor to the E-4B Nightwatch."}, {"date": "20240426162417", "headline": "UPDATE 1-US Air Force awards $13 bln Doomsday plane contract to Sierra Nevada", "summary": "The U.S. Air Force said on Friday that it has awarded a $13 billion contract to Sierra Nevada Corp to develop a successor to the E-4B, known as the Doomsday plane due to its ability to survive a nuclear war.  The Survivable Airborne Operations Center (SAOC) project is intended to replace the aging 1970s-era aircraft, which is approaching end-of-service life, an Air Force spokesperson said in a statement.  Work on the SAOC will be carried out in Colorado, Nevada and Ohio and is expected to be completed in 2036, the Air Force added."}, {"date": "20240426230630", "headline": "Decoding Southwest Airlines Co (LUV): A Strategic SWOT Insight", "summary": "Unveiling the Strengths and Challenges: A Deep Dive into Southwest Airlines Co (LUV) SWOT Analysis"}, {"date": "20240427060000", "headline": "Michael O’Leary interview: ‘I’m not putting up with any mewling nonsense about my €100m pay’", "summary": "Ryanair boss Michael O’Leary has defended his proposed €100m (£86m) bonus by comparing himself to football managers Pep Guardiola and Jurgen Klopp."}, {"date": "20240427063000", "headline": "How to play aerospace and defense stocks now", "summary": "Defense stocks have come under pressure as US lawmakers put spending under the microscope.  The Gabelli Commercial Aerospace and Defense ETF Portfolio Manager Tony Bancroft and Baird Senior Analyst Peter Arment join Market Domination to discuss how to play the aerospace and defense sectors now.  Bancroft says that \"US defense spending is below historic averages,\" but President Biden's latest budget request has a notable increase in defense spending.  Arment notes the US is trying to \"recapitalize our entire military... that takes well over a decade to do.\" He says that part of that focus is new technology, meaning there are \"a lot of opportunities for new companies to be brought into the industry,\" including Silicon Valley companies and those that are funded through private equity and venture capitalists.  Both men note L3Harris Technologies (LHX), a company Arment says has a \"multiyear growth story.\" They both like Boeing (BA), saying the company \"makes safe planes.\" For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Stephanie Mikulich."}, {"date": "20240427095657", "headline": "Boeing’s CEO search hits a roadblock—now an ‘insider/outsider’ who runs the planemaker’s biggest supplier is on the short list and near the top", "summary": "Frontrunner David Gitlin said he didn't want to lead Boeing, and board members are said to have doubts about the leading inside candidate."}, {"date": "20240427110311", "headline": "30 Cities with the Highest Number of Veterans in the US", "summary": "In this article, we will take a look at the 30 cities with the highest number of veterans in the US. If you want to skip our discussion on trends in the veteran population, you can go directly to the 5 Cities with the Highest Number of Veterans in the US. Veterans are individuals who […]"}, {"date": "20240428010200", "headline": "Fitch downgrades Boeing's outlook to 'negative,' Reuters reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428220000", "headline": "What You Missed On Wall Street On Monday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428232300", "headline": "Boeing plane flown by Delta loses emergency slide after takeoff, NY Times says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428234429", "headline": "UPDATE 1-US lawmakers strike deal to boost aviation safety, will not raise pilot retirement age", "summary": "U.S. House and Senate negotiators said early Monday they had reached a deal to boost air traffic controller staffing and boost funding to avert runway close-call incidents, but will not increase the airline pilot retirement age to 67 from 65.  The U.S. House of Representatives in July voted 351-69 on a sweeping bill to reauthorize the Federal Aviation Administration (FAA) that would also raise the mandatory pilot retirement age to 67 but the Senate Commerce Committee had voted in February to reject the retirement age increase.  Congress has temporarily extended authorization for the FAA through May 10 as it works on a new $105 billion, five-year deal."}, {"date": "20240429005700", "headline": "Optimistic Future Cash Flow Projections Justify Buy Rating for Boeing Despite Production Slowdown", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429010000", "headline": "Southwest Airlines Is Set To Soar Again", "summary": "Southwest Airlines joined a number of U.S. airlines in reporting a first quarter 2024 loss. Read more to see why I'm bullish on LUV stock."}, {"date": "20240429011800", "headline": "Insider Q&A: Avelo Airlines CEO Andrew Levy describes the challenges of starting a new carrier", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429015600", "headline": "American Airlines is the latest carrier to cut back on routes due to Boeing delays", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429025507", "headline": "Turkish Airlines: negotiating with Airbus, Boeing on buying 235 aircraft", "summary": "Turkish Airlines Chairman Ahmet Bolat said on Monday that the company is negotiating with both Airbus and Boeing regarding the 235 aircraft that it plans to purchase under its expansion plans.  Speaking at an event with Airbus, Bolat said his company was waiting for problems faced by Boeing to end, so was not in a hurry to reach a decision on its fleet plan, adding that Turkish Airlines had always followed a balanced policy regarding Airbus and Boeing."}, {"date": "20240429030300", "headline": "Boeing awarded $178M contract for seven addtional MH-139A helicopters", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429031700", "headline": "Turkish Airlines seeks to buy 235 planes from Boeing, Airbus", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429035548", "headline": "An inside look at one company driving the new space economy", "summary": "NASA has been a leader of space exploration for decades, being the only organization to put humans on the moon. As part of their Artemis missions, for the first time in over 50 years, NASA hopes to repeat that feat and put a human on the moon in 2026. One of the biggest differences this time: the private sector is helping them do it. In addition to major companies, like Boeing (BA) and Lockheed Martin (LMT), one of the businesses assisting in NASA’s mission is SpaceX. The private company, co-founded by Elon Musk, introduced a new commercial era of space exploration. In 2023 SpaceX executed 96 successful missions, launching a rocket on average every four days. There are many companies following SpaceX’s lead. Yahoo Finance got an inside look at one of those businesses: Firefly Aerospace. Firefly is also playing a role in NASA’s mission as part of the $2.6 billion Commercial Lunar Payload Services initiative, aimed at developing reliable transportation options to the moon for supplies and research. Later this year, Firefly will be the third American company to attempt an unmanned lunar landing with their Blue Ghost spacecraft. That mission is backed by a $112 million contract from NASA. While Firefly plans to continue its work with NASA, the company is expecting the commercial side of space to become a larger part of its business, with the industry expected to grow to $1.8 trillion by 2035, according to the World Economic Forum. In an effort to capitalize on this, and maximize speed and cost efficiency, Firefly’s mission is to become an end-to-end space transportation company. The company is manufacturing rockets, including an upcoming medium launch vehicle in partnership with Northrop Grumman (NOC), orbital vehicles to service spacecraft on their missions, and landers, like Blue Ghost. If you’re going to future-proof your portfolio, you need to know what’s NEXT. In this series, Yahoo Finance will feature stories that give a glimpse at the future, and show how companies are making big moves today that will matter tomorrow. For more on our NEXT series, click here, and tune in to Yahoo Finance Live for more expert insight and the latest market action, Monday through Friday. Editor's note: This article was written by Luke Brooks."}, {"date": "20240429042041", "headline": "UPDATE 1-Turkish Airlines in talks with Airbus, Boeing to buy 235 planes", "summary": "Turkish Airlines is negotiating with both Airbus and Boeing about buying 235 aircraft as part of its expansion plans, Chairman Ahmet Bolat said on Monday.  In December it announced a deal with Airbus for 355 firm and optional orders for A321 narrow body and A350 wide body aircraft.  \"We are negotiating with both Airbus and Boeing for the remaining 235 planes,\" Bolat said at an event held with Airbus and Rolls-Royce in Istanbul."}, {"date": "20240429042348", "headline": "Turkish Airlines in talks with Airbus, Boeing to buy 235 planes", "summary": "Turkish Airlines is negotiating with both Airbus and Boeing about buying 235 aircraft as part of its expansion plans, Chairman Ahmet Bolat said on Monday.  In December it announced a deal with Airbus for 355 firm and optional orders for A321 narrow body and A350 wide body aircraft.  \"We are negotiating with both Airbus and Boeing for the remaining 235 planes,\" Bolat said at an event held with Airbus and Rolls-Royce in Istanbul."}, {"date": "20240429043300", "headline": "Boeing Unusual Options Activity For April 29", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429044300", "headline": "Flying Cars are Coming! 3 Stocks to Buy Before They Hit the Skies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429044800", "headline": "Video: Dow Analyst Moves: BA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429044900", "headline": "Broker Darlings of the Dow: Boeing Ranks As a Top 15 Analyst Pick", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429045827", "headline": "Boeing signs $178 million contract with US Air Force", "summary": "Boeing wins contract for seven additional MH-139A helicopters The US Air Force has signed a $178 million contract with Boeing to produce seven MH-139A helicopters. The order brings the total number of..."}, {"date": "20240429050300", "headline": "Cargojet (TSE:CJT) Posts Earnings, Shares Gain", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429053300", "headline": "Turkish Airlines 'not rushing' to acquire more Boeing planes, FT reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429054301", "headline": "Safran Stock: An Aerospace Powerhouse To Buy", "summary": "Safran stock has outperformed the market, gaining nearly 38% compared to a 13% market return. Click here to read why SAFRY stock is a Buy."}, {"date": "20240429060500", "headline": "Bond Sale, New Possible Orders Send Boeing (NYSE:BA) Shares Surging", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429061422", "headline": "Boeing : T-7A Red Hawk Triples Progress", "summary": "ST. LOUIS, April 29, 2024 - The Boeing [NYSE: BA] T-7A Red Hawk achieved three recent milestones, propelling the advanced pilot trainer for the U.S. Air Force forward. Climate..."}, {"date": "20240429062200", "headline": "House and Senate negotiate bill to help FAA add more air traffic controllers and safety inspectors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429063000", "headline": "Bond Sale and Potential Order Send Boeing (NYSE:BA) Shares Surging", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429063109", "headline": "Boeing taps debt market to raise $10 billion: sources", "summary": "Boeing on Monday tapped debt markets to raise $10 billion, after the U.S. planemaker burned $3.93 billion in free cash during the first quarter following slowing production of its best-selling..."}, {"date": "20240429063900", "headline": "Boeing aims to raise $10B in debt sale amid cash burn", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429070014", "headline": "The Boeing Company (BA) Is a Trending Stock: Facts to Know Before Betting on It", "summary": "Boeing (BA) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock."}, {"date": "20240429073010", "headline": "Brokers Suggest Investing in Boeing (BA): Read This Before Placing a Bet", "summary": "The average brokerage recommendation (ABR) for Boeing (BA) is equivalent to a Buy. The overly optimistic recommendations of Wall Street analysts make the effectiveness of this highly sought-after metric questionable. So, is it worth buying the stock?"}, {"date": "20240429082850", "headline": "Boeing Looks to Sell Bonds After Reporting Cash Burn", "summary": "(Bloomberg) -- Boeing Co. is looking to issue around $8 billion of debt in as many as six parts, its first bond sale since the planemaker reported a quarterly loss and $3.9 billion of cash burn, and Moody’s Ratings cut the company’s credit rating to a step above junk. Most Read from BloombergTesla Soars on Tentative Approval for Driving System in ChinaMusk Makes Surprise China Visit in Search of Tesla Revenue BoostElliott Built ‘Large’ Stake in Buffett-Favored Sumitomo, Source SaysYen Sparks Int"}, {"date": "20240429084200", "headline": "Southwest Airlines Stock Gets Downgraded to Sell. This Bumpy Flight Could Just Be Getting Started.", "summary": "A Jefferies analyst says it’s time to sell the shares, and slashed her price target to $20 from $28."}, {"date": "20240429090527", "headline": "Update: Market Chatter: Turkish Airlines in Discussions with Boeing, Airbus to Buy 235 Planes", "summary": "Update: Market Chatter: Turkish Airlines in Discussions with Boeing, Airbus to Buy 235 Planes"}, {"date": "20240429101806", "headline": "UPDATE 3-Boeing taps debt market to raise $10 billion, sources say", "summary": "Boeing on Monday tapped debt markets to raise $10 billion, after the U.S. planemaker burned $3.93 billion in free cash during the first quarter as production of its best-selling jet declined, sources familiar with the matter said.  Boeing shares rose 3.4% after the successful sale.  Ratings agencies last week slashed the outlook on Boeing's credit to just above \"junk\" status."}, {"date": "20240429103109", "headline": "Boeing taps debt market to raise $10 billion, sources say", "summary": "(Reuters) -Boeing on Monday tapped debt markets to raise $10 billion, after the U.S. planemaker burned $3.93 billion in free cash during the first quarter as production of its best-selling jet declined, sources familiar with the matter said.  Boeing shares rose 3.4% after the successful sale.  Ratings agencies last week slashed the outlook on Boeing's credit to just above \"junk\" status."}, {"date": "20240429112900", "headline": "Boeing’s Latest Safety Incident Teaches an Important Lesson", "summary": "Any incident involving a Boeing jet will create a buzz after the emergency-door-plug blowout from a 737 MAX 9 jet operated by  Alaska Air Group  on Jan. 5.  Understanding safety incidents is important, too.  The plane has had no incidents before this, according to the safety database maintained by the National Transportation Safety Board, or NTSB."}, {"date": "20240429131600", "headline": "Boeing scores $10 billion bond financing in ‘much-needed’ liquidity boost", "summary": "Fresh off reporting a more than $300 million quarterly loss, Boeing Co. saw robust demand on Monday for its $10 billion corporate-bond deal."}, {"date": "20240429135552", "headline": "TREASURIES-US yields drift lower before Fed policy meeting, economic data", "summary": "U.S. Treasury yields fell on Monday, pulling back a little from highs hit last week ahead of a Federal Reserve meeting that is expected to strike a hawkish tone, while keeping interest rates unchanged.  A slew of important U.S. economic data, including the nonfarm payrolls report on Friday, also awaits bond investors this week."}, {"date": "20240429202400", "headline": "Spirit AeroSystems, Airbus are said to prepare talks on supplier’s future", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429210800", "headline": "Caterpillar, Boeing share losses lead Dow's 475-point fall", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429212200", "headline": "What You Missed On Wall Street On Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429223200", "headline": "Barclays Sticks to Their Hold Rating for Boeing (BA)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429223300", "headline": "Analysts Offer Insights on Industrial Goods Companies: Boeing (BA) and Knight Transportation (KNX)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429231600", "headline": "Boeing: Hold Rating Maintained Amidst Production and Delivery Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429235800", "headline": "Argus gets more bearish on Boeing, downgrades shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430002200", "headline": "Argus downgrades Boeing to Hold, says 'business is suffering'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430032600", "headline": "DZ BANK AG Sticks to Its Buy Rating for Boeing (BA)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430045639", "headline": "Glass Lewis recommends investors vote against three Boeing directors", "summary": "Proxy advisory firm Glass Lewis onTuesday recommended shareholders vote against the election ofthree directors - Dave Calhoun, Akhil Johri and David Joyce - toplanemaker Boeing's board.(Reporting..."}, {"date": "20240430053318", "headline": "Argus Research Downgrades Boeing (BA)", "summary": ""}, {"date": "20240430054900", "headline": "Boeing (NYSE:BA) Slips as Even Donation Targets Turn Their Back", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430070531", "headline": "Glass Lewis Recommends Against Three Boeing Directors, Reuters Reports", "summary": "--Proxy adviser Glass Lewis is recommending shareholders vote against three director nominees to Boeing's board, Reuters reports. --Glass Lewis's cited dissatisfaction around efforts to change..."}, {"date": "20240430072755", "headline": "US junk debt market sees mixed performance in April, JPMorgan says", "summary": "The U.S. high-yieldbond and leveraged loan markets saw mixed performances in April,according to a JPMorgan report, as companies continued tostruggle through high interest rates and inflation. ..."}, {"date": "20240430073200", "headline": "Boeing Stock Is Slipping. A Bull Bails Because the Turnaround Will Take Time.", "summary": "Argus analyst John Eade downgraded Boeing shares to Hold from Buy. Issues will last “multiple quarters into the future.”"}, {"date": "20240430074542", "headline": "Boeing, Paramount downgraded: Wall Street's top analyst calls", "summary": "Boeing, Paramount downgraded: Wall Street's top analyst calls"}, {"date": "20240430075026", "headline": "Southwest Airlines Co. (NYSE:LUV) Q1 2024 Earnings Call Transcript", "summary": "Southwest Airlines Co. (NYSE:LUV) Q1 2024 Earnings Call Transcript April 25, 2024 Southwest Airlines Co. misses on earnings expectations. Reported EPS is $-0.36 EPS, expectations were $-0.34. Southwest Airlines Co. isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Hello, everyone, […]"}, {"date": "20240430082900", "headline": "3 Airline Stocks to Watch From a Promising Industry", "summary": "Buoyant air travel demand bodes well for the Zacks Transportation - Airline industry. Stocks like UAL, ALK and CPA appear well-poised to capitalize on this rosy scenario."}, {"date": "20240430083820", "headline": "Boeing Wins $414 Million Space Development Agency Contract", "summary": "By Sabela Ojea Boeing has been awarded a $414 million contract from the Space Development Agency. The office said Tuesday that Millennium Space Systems, a provider of flight-proven..."}, {"date": "20240430085948", "headline": "Glass Lewis recommends investors vote against three Boeing directors, including CEO Calhoun", "summary": "(Reuters) -Proxy advisor Glass Lewis has recommended shareholders vote against the reelection of three directors to Boeing's board, including outgoing CEO Dave Calhoun, citing dissatisfaction over the efforts to transform the safety culture at the planemaker.  While Boeing declined to comment, it responded by referencing comments on the need to improve safety and quality in its recent proxy statement.  Calhoun, who has been a Boeing director since 2009, has said he will step down as CEO of the embattled planemaker at the end of the year."}, {"date": "20240430090631", "headline": "UPDATE 3-Glass Lewis recommends investors vote against three Boeing directors, including CEO Calhoun", "summary": "Proxy advisor Glass Lewis has recommended shareholders vote against the reelection of three directors to Boeing's board, including outgoing CEO Dave Calhoun, citing dissatisfaction over the efforts to transform the safety culture at the planemaker.  While Boeing declined to comment, it responded by referencing comments on the need to improve safety and quality in its recent proxy statement.  Calhoun, who has been a Boeing director since 2009, has said he will step down as CEO of the embattled planemaker at the end of the year."}, {"date": "20240430094550", "headline": "Boeing Company Expands to Make Parts for Stingrays, Red Hawks, Military Helicopters", "summary": "The site is already home to some advanced manufacturing technology."}, {"date": "20240430115000", "headline": "Millennium Space Systems Awarded $414M Space Development Agency Contract", "summary": "The Space Development Agency awarded Millennium Space Systems, a Boeing [NYSE: BA] company an award with a total potential value of $414 million to deliver the Fire-control On Orbit-support-to-the-war Fighter, also known as FOO Fighter, or F2. As the end-to-end operational prime, Millennium Space Systems will deliver a constellation of eight satellites with a ground system and perform mission operations."}, {"date": "20240430123400", "headline": "Why ATI Stock Is Flying High Today", "summary": "A solid quarter is alleviating some of the concern surrounding this aerospace stock."}, {"date": "20240430151800", "headline": "Aerospace & Defense ETFs to Watch Amid Q1 Earnings", "summary": "With escalating geopolitical tensions and an estimated surge in global military spending, look into Aerospace and Defence ETFs as they report Q1 earnings."}, {"date": "20240430200200", "headline": "Boeing (NYSE:BA) Jumps on New Spirit AeroSystems (NYSE:SPR) Plans", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430200400", "headline": "Ticking Time Bombs: 3 Dow Stocks to Dump While You Still Can", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430211500", "headline": "Boeing (NYSE:BA) Jumps on New Spirit AeroSystems Plans", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430212000", "headline": "Lockheed-Boeing venture is told to launch more satellites for U.S. Air Force", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430212800", "headline": "Embraer studies plans for rival to Airbus, Boeing jets, FT says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430221400", "headline": "Boeing awarded $457.69M Navy contract modification", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501002700", "headline": "Embraer is said to explore making plane to rival Boeing, Airbus", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501004600", "headline": "ATI price target raised by $12 at TD Cowen, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501011057", "headline": "Albany International Corp (AIN) Q1 2024 Earnings Call Transcript Highlights: Strong Sales ...", "summary": "Explore key financial outcomes and strategic insights from Albany International's first quarter of 2024, emphasizing robust sales increases and the impact of the Heimbach acquisition."}, {"date": "20240501011200", "headline": "GLOBAL BROKER RATINGS: Bernstein raises Deutsche Lufthansa", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501030000", "headline": "Non-Farm Payrolls Preview For April 2024: 3 Major Considerations", "summary": "April 2024 jobs report expected to show an increase of 250,000 jobs, indicating continued tightness in the labor market. Check out 3 major things to consider."}, {"date": "20240501032100", "headline": "Is Boeing Stock A Buy Or A Sell After Earnings?", "summary": "Boeing's debt was reduced, but its net debt position increased. Click here to read what provides a more compelling investment case for BA stock."}, {"date": "20240501033000", "headline": "Brazil’s Embraer Plots a New 737-Sized Jet to Rival Boeing", "summary": "The Brazilian aircraft maker has been sounding out potential partners and financial backers on plans for a new narrow-body aircraft."}, {"date": "20240501045043", "headline": "Embraer mulls options for new narrowbody jet model, WSJ reports", "summary": "Brazilian planemaker Embraer is exploring options for a new narrowbody jet model to challenge the market dominance of Boeing and Airbus , the Wall Street Journal reported on Wednesday.  Internal studies conducted by Embraer have determined that the company has the technological know-how and manufacturing capability to develop a next-generation narrowbody aircraft, which would be its first in that segment, the report said, citing people familiar with the matter.  Embraer, currently the world's third-largest jetmaker and specializing in regional and business jets, was not immediately available for a comment."}, {"date": "20240501045604", "headline": "Embraer counters report of new jet, says no major capex plan", "summary": "(Reuters) -Brazilian planemaker Embraer on Wednesday played down a report that it is studying a new jet to compete directly with Boeing and Airbus, saying it has no plans for a major cycle of spending.  The Wall Street Journal reported that the world's third-largest planemaker is exploring options for a narrowbody jet to break out of its regional niche and \"compete head-on\" with the best-selling Boeing 737 MAX and Airbus A320neo families.  Studies determined Embraer has the know-how and manufacturing capability to develop a next-generation jet, the report said, citing people familiar with the matter."}, {"date": "20240501051500", "headline": "Is Boeing Stock Going to $224? 1 Wall Street Analyst Thinks So", "summary": "A strong start to the year leads one analyst to believe that Boeing stock can soon take off."}, {"date": "20240501052500", "headline": "As Boeing Struggles, Embraer Considers Entry Into Narrow-Body Aircraft Market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501053420", "headline": "Embraer focused on selling current products, no plans for sizeable capex cycle", "summary": "Brazilian planemaker Embraer is focused on selling its current portfolio of recently developed products, a company spokesperson told Reuters, adding there was no big capital expenditures (capex) cycle in the works.  He was reacting to an earlier Wall Street Journal article saying Embraer was exploring options for a new narrowbody jet model to challenge the market dominance of Boeing and Airbus."}, {"date": "20240501053507", "headline": "Ethiopian Airlines sees 30% surge in passengers this year, CEO says", "summary": "Ethiopian Airlines expects to carry 30% more passengers in the year ended June from the year before, its chief executive told Reuters on Wednesday, buoyed by new routes and a rebound in global travel.  Africa's biggest airline, however, faces risks from delayed aircraft deliveries and the grounding of some planes due to engine shortages caused by supply chain disruptions, Mesfin Tasew Bekele said in an interview.  The delivery problems mainly affect narrow-body passenger jets from Boeing, he said, while the grounding is affecting wide-body aircraft used for long-haul travel."}, {"date": "20240501054800", "headline": "Auto & Transport Roundup: Market Talk", "summary": "Mercedes-Benz Group, Stellantis and more in the latest Market Talks covering the Auto and Transport sector."}, {"date": "20240501063300", "headline": "U.S., Saudi Arabia are said to be close to signing defense treaty", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501063642", "headline": "UPDATE 1-Embraer counters report of new jet, says no major capex plan", "summary": "Brazilian planemaker Embraer on Wednesday played down a report that it is planning to develop a new jet to compete directly with best-selling Boeing and Airbus models, saying it has no plans for a major cycle of spending.  The Wall Street Journal reported that the world's third-largest planemaker is exploring options for a new narrowbody jet  to break out of its regional niche and \"compete head-on\" with the 737 MAX and A320neo in the busiest part of the market."}, {"date": "20240501064300", "headline": "Noteworthy Wednesday Option Activity: BA, CDW, MTCH", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501065600", "headline": "Spirit Aero tells Reuters it has developed plan to meet 737 MAX parts demand", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501071800", "headline": "ASML Shows Us a Different Part of the Chip Boom Story", "summary": "The boom is on for chip buyers and sellers, but demand is lighter further up the supply chain. And United Airlines results show the skies look friendly for airline stocks."}, {"date": "20240501084243", "headline": "Boeing Takes Over GKN Plant to Support F/A-18, F-15 Programs", "summary": "The aerospace giant also brought along some 550 workers."}, {"date": "20240501091538", "headline": "US corporate borrowers benefit from hot demand in April, BMO says", "summary": "WASHINGTON, May 1 - Relentless demand for highly rated debt is helping bringdown the premiums U.S. investment-grade rated companies arepaying, according..."}, {"date": "20240501094607", "headline": "Update: Market Chatter: Embraer Exploring New Jet to Compete With Boeing's 737 Max", "summary": "Update: Market Chatter: Embraer Exploring New Jet to Compete With Boeing's 737 Max"}, {"date": "20240501112300", "headline": "Embraer Might Launch a Boeing-Sized Jet. That’s a Very Bad Idea.", "summary": "If Embraer is working on such a project, Boeing would have a new competitor while it struggles with its latest safety crisis and production issues."}, {"date": "20240501112910", "headline": "Spirit Aero says it has a new plan to address Boeing 737 MAX parts demand", "summary": "(Reuters) -Spirit AeroSystems said it has developed a plan that gives it “a high degree of confidence” to meet U.S. planemaker Boeing's rate and quality demands for parts for the 737 MAX jet, the company told Reuters on Wednesday.  Boeing is under pressure to restore slumping production of its strong-selling narrowbody jet to 38 per month in the second half of the year as it grapples with a sprawling safety crisis following a January mid-air panel blowout on a new 737 MAX plane.  Boeing is pressing Spirit Aero, its key supplier, to improve the quality of the fuselages it produces for the MAX at a higher rate for the second half of 2024."}, {"date": "20240501131500", "headline": "The Boeing Company Announces Closing of Senior Notes Offering", "summary": "The Boeing Company announced that it closed an offering of $10.0 billion aggregate principal amount of fixed-rate senior unsecured notes, consisting of $1.0 billion aggregate principal amount of its..."}, {"date": "20240501141531", "headline": "Market Chatter: Spirit AeroSystems Confident to Keep Up with Boeing Demand for Jetliner Components", "summary": "Market Chatter: Spirit AeroSystems Confident to Keep Up with Boeing Demand for Jetliner Components"}, {"date": "20240501151742", "headline": "UPDATE 1-Spirit Aero says it has a new plan to address Boeing 737 MAX parts demand", "summary": "Spirit AeroSystems said it has developed a plan that gives it “a high degree of confidence” to meet U.S. planemaker Boeing's rate and quality demands for parts for the 737 MAX jet, the company told Reuters on Wednesday.  Boeing is under pressure to restore slumping production of its strong-selling narrowbody jet to 38 per month in the second half of the year as it grapples with a sprawling safety crisis following a January mid-air panel blowout on a new 737 MAX plane.  Boeing is pressing Spirit Aero, its key supplier, to improve the quality of the fuselages it produces for the MAX at a higher rate for the second half of 2024."}, {"date": "20240501171500", "headline": "Boeing Announces Closing of Senior Notes Offering", "summary": "The Boeing Company [NYSE: BA] announced today it closed an offering of $10.0 billion aggregate principal amount of fixed-rate senior unsecured notes (the \"notes\"), consisting of $1.0 billion aggregate principal amount of its 6.259% senior notes due 2027, $1.5 billion aggregate principal amount of its 6.298% senior notes due 2029, $1.0 billion aggregate principal amount of its 6.388% senior notes due 2031, $2.5 billion aggregate principal amount of its 6.528% senior notes due 2034, $2.5 billion a"}, {"date": "20240501190200", "headline": "Howmet Aerospace jumps 17%to record high on improved outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501202200", "headline": "Boeing, Amazon.com Inc. share gains lead Dow's nearly 325-point climb", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501204200", "headline": "Another Boeing Whistleblower Dies, This Time Due To Sudden Infection", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501221011", "headline": "DDTC Goes Back-To-Basics In Boeing Settlement", "summary": "On February 28, 2024, the U.S. Department of State and The Boeing Company agreed to an administrative settlement regarding 199 violations by Boeing of the Arms Export Control Act and the..."}, {"date": "20240501224700", "headline": "Second Boeing whistleblower dies, Seattle Times reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501232400", "headline": "Embraer Plotting a Rival to Boeing’s 737 Jets…Not Likely", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502000300", "headline": "Stock Market Crash Warning: Don’t Get Caught Holding These 3 Airline Stocks.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502000400", "headline": "Analysts Offer Insights on Industrial Goods Companies: Boeing (BA) and Nordex (OtherNRDXF)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502002800", "headline": "3 Contrarian Stocks That Could Make You a Fortune (If You Dare)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502004400", "headline": "Second Boeing-linked whistleblower dies after two weeks in critical condition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502012511", "headline": "Universal Stainless & Alloy Products Inc (USAP) (Q1 2024) Earnings Call Transcript ...", "summary": "USAP reports significant growth in Q1 2024, with record gross margins and a robust increase in net income, signaling a positive trajectory for the year."}, {"date": "20240502012858", "headline": "Q1 2024 Universal Stainless & Alloy Products Inc Earnings Call", "summary": "Q1 2024 Universal Stainless & Alloy Products Inc Earnings Call"}, {"date": "20240502014026", "headline": "Growth, Almost No Dividends, 2 Years Later", "summary": "Discover the benefits of growth investing, as we explore the long-term strategy of buying quality companies at a good price."}, {"date": "20240502024800", "headline": "UK shareholder meetings calendar - next 7 days", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502030000", "headline": "U.S. Navy awards BAE Systems $87 million contract to upgrade USS Carter Hall", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502045200", "headline": "Why Megacorporations Shouldn’t Overestimate Their Monopoly Power", "summary": "Embraer’s potential venture into 737-sized commercial planes highlights how even companies in a global duopoly must innovate to survive. It is a useful lesson for investors in most industries."}, {"date": "20240502051700", "headline": "Spirit AeroSystems asks judge to block Texas safety investigation, Reuters says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502053000", "headline": "Boeing (NYSE:BA) Shoots Up as Second Whistleblower Dies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502053700", "headline": "Dow's 200-point rally highlighted by gains for Boeing, Amazon.com Inc. stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502053700", "headline": "Dow's 110-point rally highlighted by gains for shares of Boeing, Apple", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502061300", "headline": "Spirit AeroSystems sues to halt safety probe by Texas", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502061600", "headline": "Boeing (NYSE:BA) Shoots Up despite Second Whistleblower Death", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502064100", "headline": "Dow's 225-point rally highlighted by gains in shares of Boeing, Amazon.com Inc.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502083500", "headline": "Wall Street Lunch: Peloton CEO Steps Down", "summary": "Barry McCarthy steps down as CEO, president, and board director of Peloton. Q1 nonfarm productivity crept up 0.3% Q/Q; Initial jobless claims steady 208k for the week."}, {"date": "20240502085755", "headline": "Boeing supplier Spirit AeroSystems sues to block Texas safety probe", "summary": "Airline parts manufacturer Spirit AeroSystems has asked a U.S. judge to block a probe by Texas Attorney General Ken Paxton, calling the state's demand for internal documents and other information unreasonable and unlawful.  Spirit Aero filed the lawsuit Wednesday night in an Austin, Texas, federal court.  It said Spirit Aero had significant legal concerns with the investigation that Paxton's office announced in March focused on the safety of airplane parts provided to Boeing."}, {"date": "20240502091600", "headline": "This Boeing Supplier’s Stock Is Soaring Despite Slashing Its 737 MAX Guidance", "summary": "Aerospace supplier Howmet expects to ship parts for 20 Boeing 737 MAX jets a month. Prior guidance assumed 34 a month."}, {"date": "20240502103233", "headline": "Why Howmet Aerospace Stock Is Soaring Higher Today", "summary": "This under-the-radar aerospace manufacturer is finally getting its due."}, {"date": "20240502110400", "headline": "Airline Stocks Fly High: Buy These 3", "summary": "The airline industry is flourishing despite a plethora of industry challenges. Three airline-related stocks offer great reward-to-risk zones."}, {"date": "20240502123709", "headline": "Another Boeing whistleblower is dead—this time a healthy 45-year-old who battled a sudden, severe infection", "summary": "“It is known at Spirit that if you make too much noise and cause too much trouble, you will be moved,” Joshua Dean once told the Wall Street Journal."}, {"date": "20240502130000", "headline": "Boeing Stock Is Soaring. Its Debt Sale Is Helping.", "summary": "Boeing  stock continued to fly higher Thursday as markets digested the aerospace company’s $10 billion debt sale.  Thursday’s jump follows the company’s update Wednesday, when Boeing said it finalized its $10 billion debt offering.  Before Wednesday, investors couldn’t be sure what Boeing would pay for debt capital."}, {"date": "20240502142342", "headline": "Air Canada abandons plans for two Boeing 767 converted freighters", "summary": "Air Canada said Thursday it changed its mind about investing in two widebody freighters and will rely on its growing passenger fleet to increase cargo capacity. The post Air Canada abandons plans for two Boeing 767 converted freighters appeared first on FreightWaves."}, {"date": "20240502165957", "headline": "Airbus called for compensation to take on money-losing Spirit operations, sources say", "summary": "Airbus has called for financial compensation to take on money-losing operations from Spirit AeroSystems, a demand that has emerged as one obstacle to a tie-up deal between the supplier and its main customer Boeing, people familiar with the matter said.  Spirit and Airbus executives are holding talks in New York, first reported by Bloomberg, to try and work through issues such as the European planemaker's demands for financial compensation to take on the supplier's loss-making operations."}, {"date": "20240502183100", "headline": "Boeing Supplier Whistle-Blower Dies. This Is the Issue He Raised.", "summary": "Joshua Dean, a whistle-blower at  Boeing  supplier  Spirit AeroSystems died of a bacterial infection on Tuesday.  In 2022, Dean, a quality auditor at Spirit Aero, noted incorrectly drilled holes on 737 MAX aft pressure bulkhead, part of the fuselage supplied by Spirit AeroSystems to Boeing."}, {"date": "20240502191800", "headline": "Boeing delays mean Southwest pilots face reduced hours, Reuters reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502194300", "headline": "Southwest Airlines cuts pilots' hours on shortage of Boeing aircraft - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502200000", "headline": "Catalyst Watch: Disney earnings, Apple iPad event and Fed speakers back on the circuit", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502212100", "headline": "DoJ to decide by May 28 if Boeing breached prosecution deal - Bloomberg", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502214900", "headline": "Tesla, Boeing, Visa: Big Names Worth Talking About", "summary": "Tesla and its robotaxi ambitions lead the show."}, {"date": "20240502231500", "headline": "Boeing faces parts related issue due to Russia sanctions, WSJ reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502235700", "headline": "Stock Market Crash Warning: Don’t Get Caught Holding These 3 Dow Stocks.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503000000", "headline": "Boeing sending first astronaut crew to space after years of delay", "summary": "Boeing is poised tosend the first Starliner space capsule with a crew of humansinto orbit next week, giving it a long-delayed chance to score abadly needed win as it struggles to compete with Elon..."}, {"date": "20240503000700", "headline": "7 Growth Stocks to Sweep From Your Portfolio This Spring", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503002700", "headline": "Airbus Demands Compensation To Acquire Spirit Operations: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503012600", "headline": "Boeing’s Strategic Capital Raise and Deleveraging Path to Justify Buy Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503013252", "headline": "Q1 2024 Howmet Aerospace Inc Earnings Call", "summary": "Q1 2024 Howmet Aerospace Inc Earnings Call"}, {"date": "20240503014228", "headline": "Howmet Aerospace Inc (HWM) Q1 2024 Earnings Call Transcript Highlights: Soaring Performance ...", "summary": "Discover Howmet Aerospace's robust Q1 growth, featuring unprecedented revenue, EBITDA, and EPS increases, alongside strategic insights from the CEO."}, {"date": "20240503020622", "headline": "Astronics Corp (ATRO) Q1 2024 Earnings Call Transcript Highlights: Robust Growth and Record ...", "summary": "Discover how Astronics Corp achieved significant sales growth and a record backlog, while navigating operational and financial hurdles."}, {"date": "20240503021500", "headline": "Zacks Investment Ideas feature highlights: Boeing, Airbus, United Airlines, Airline Azul and Delta Airlines", "summary": "Boeing, Airbus, United Airlines, Airline Azul and Delta Airlines have been highlighted in this Investment Ideas article."}, {"date": "20240503021900", "headline": "Howmet Aerospace price target raised by $15 at BofA, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503030400", "headline": "Jefferies aerospace/defense analyst to hold analyst/industry conference call", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503033000", "headline": "Boeing’s Latest Trouble Is a Jet Part Caught Up in Russia Sanctions", "summary": "The plane maker can’t deliver enough 787 Dreamliners after sanctions disrupted production of heat exchangers."}, {"date": "20240503033900", "headline": "Cameron says UK will appoint envoy to ramp up defence production", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503040200", "headline": "Boeing’s Starliner set for historic launch that will take two NASA astronauts into space", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503043000", "headline": "BA June 14th Options Begin Trading", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503045501", "headline": "Social Buzz: Wallstreetbets Stocks Mixed Pre-Bell Friday; ImmunityBio to Advance, Boeing to Decline", "summary": "Social Buzz: Wallstreetbets Stocks Mixed Pre-Bell Friday; ImmunityBio to Advance, Boeing to Decline"}, {"date": "20240503045900", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503054300", "headline": "Here’s what is so amazing about Apple’s stock buybacks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503054643", "headline": "Alaska Air says Boeing issued $61 million in credit memos to address grounding hit", "summary": "An Alaska Airlines-operated MAX 9 jet experienced a mid-air cabin panel blowout in January, which led to the U.S. Federal Aviation Administration grounding 171 of the aircraft for about three weeks.  The credit memos can be used to make future purchases at Boeing, Alaska said in its quarterly report on Friday.  Boeing is also compensating United Airlines — a prominent customer — to address the financial damages related to the grounding."}, {"date": "20240503060800", "headline": "The Bill for Boeing’s (NYSE:BA) Alaska Airlines (NYSE:ALK) Misadventure Rises", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503061243", "headline": "Boeing has lost $32 billion since 2019, with no end in sight. How long can it keep losing money?", "summary": "Few companies have lost more than the $32 billion that Boeing has lost in the last five years. And fewer companies could lose that kind of money and not be facing bankruptcy — or worse."}, {"date": "20240503064600", "headline": "The Bill for Boeing’s (NYSE:BA) Alaska Airlines Misadventure Rises", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503070045", "headline": "Universal Stainless & Alloy Products, Inc. (NASDAQ:USAP) Q1 2024 Earnings Call Transcript", "summary": "Universal Stainless & Alloy Products, Inc. (NASDAQ:USAP) Q1 2024 Earnings Call Transcript May 1, 2024 Universal Stainless & Alloy Products, Inc. beats earnings expectations. Reported EPS is $0.43, expectations were $0.32. USAP isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: […]"}, {"date": "20240503075702", "headline": "Southwest pilots face reduced hours, pay due to Boeing delivery delays", "summary": "Southwest Airlinesplans to offer its pilots reduced hours and, in effect, monthlypay, two people familiar with the matter said, as it grappleswith higher costs and overstaffing due to delays in..."}, {"date": "20240503120351", "headline": "Exclusive-Southwest pilots face reduced hours, pay due to Boeing delivery delays", "summary": "Southwest Airlines plans to offer its pilots reduced hours and, in effect, monthly pay, two people familiar with the matter said, as it grapples with higher costs and overstaffing due to delays in aircraft deliveries from Boeing.  The Dallas-based airline, which operates an all-Boeing fleet, has been reeling from the U.S. planemaker's ongoing safety crisis.  Last week it warned of a hit to earnings as it expected to receive just 20 Boeing aircraft this year, less than one-fourth of its original plans."}, {"date": "20240503121200", "headline": "A SpaceX Competitor Launches Monday. Boeing’s Getting a Lift.", "summary": "Boeing’s long-delayed Starliner spaceship is set for its first crewed mission leaving Earth on Monday."}, {"date": "20240503130259", "headline": "Update: Market Chatter: Southwest Pilots Face Reduced Hours, Pay Due to Boeing Delivery Delays", "summary": "Update: Market Chatter: Southwest Pilots Face Reduced Hours, Pay Due to Boeing Delivery Delays"}, {"date": "20240503151112", "headline": "Boeing threatens to lock out its private firefighters around Seattle in a dispute over pay", "summary": "Boeing is threatening to lock out its private force of firefighters who protect its aircraft-manufacturing plants in the Seattle area and bring in replacements beginning Friday night unless the workers accept the company's last offer on wages.  The labor showdown comes as Boeing deals with mounting losses — more than $24 billion since the start of 2019 — and increased scrutiny over quality and safety in its manufacturing since a door plug blew out of an Alaska Airlines Boeing 737 Max flying over Oregon in January.  On Friday, Boeing dismissed any safety concerns about the dispute with its industrial firefighters."}, {"date": "20240503153300", "headline": "Amazon Stock Is on a Roll. Here’s Why It’s on This Firm’s ‘Best Ideas List.’", "summary": "Amazon reported strong first-quarter results, with revenue and operating income ahead of expectations.  The company delivered operating income of $15.3 billion, above consensus of $11.3 billion, while reporting better-than-expected growth in both Amazon Web Services (+17.2% year over year versus Street +15%) and advertising (+24.3% Y/Y versus Street +23.5%).  Amazon has now reported operating income above the high end of its guidance range for five consecutive quarters, and the company has a number of drivers for further margin expansion in place, including continued cost efficiencies within its fulfillment network as well as the ongoing mix shift toward higher-margin AWS and advertising revenue."}, {"date": "20240503155555", "headline": "Buy Northrop Grumman instead of Boeing: Portfolio manager", "summary": "When investing, it can be hard to choose which stocks to avoid and which to consider, especially when you are trying to gain exposure to a specific sector. In the latest edition of Good Buy or Goodbye, F/m Investments Senior Portfolio Manager Don Nesbitt shares his stock that could fly and which could face turbulence in the aerospace industry.  Nesbitt likes Northrop Grumman (NOC) for its \"consistent earnings and sales growth.\" He also says the company has a strong order backlog and uses free cash flow to return cash to shareholders. He also thinks it has an attractive valuation. Nesbitt cautions, however, that the company risks facing an over-reliance on US government contracts.  Nesbitt is less of a fan of Boeing (BA). His first concern, which is a short-term one, is the uncertainty surrounding who will be leading the company after CEO Dave Calhoun steps down at the end of the year. Nesbitt also points to the debt downgrade from Moody's and the lack of a dividend. What could reverse his thesis? Investors shrugging off some of the more near-term concerns or that the leadership shake-up serves as a positive catalyst. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Stephanie Mikulich."}, {"date": "20240504025807", "headline": "Boeing is on the verge of launching astronauts aboard new capsule, the newest entry to space travel", "summary": "CAPE CANAVERAL, Fla. — After years of delays and stumbles, Boeing is finally poised to launch astronauts to the International Space Station for NASA. It’s the first flight of Boeing’s..."}, {"date": "20240504033148", "headline": "Boeing is on the verge of launching astronauts aboard new capsule, the latest entry to space travel", "summary": "CAPE CANAVERAL, Fla. — After years of delays and stumbles, Boeing is finally poised to launch astronauts to the International Space Station for NASA. It’s the first flight of Boeing’s..."}, {"date": "20240504040029", "headline": "Boeing faces critical launch Monday ferrying astronauts to the International Space Station", "summary": "After years of delay that have put it behind SpaceX, Boeing is set to launch its new Starliner capsule with two crew members to the International Space Station."}, {"date": "20240504042912", "headline": "Why Howmet Aerospace Stock Is Soaring", "summary": "Howmet Aerospace surpasses analyst expectations with strong Q1 earnings, driven by revenue growth and solid performance in aerospace segments."}, {"date": "20240504060800", "headline": "Boeing Locks Out Firefighters at 737 Factory Amid Contract Dispute", "summary": "The airplane maker and the firefighters’ union have been wrestling for months over wages and staffing levels."}, {"date": "20240504065732", "headline": "Boeing on the verge of launching astronauts aboard new capsule, the latest entry to space travel", "summary": "After years of delays and stumbles, Boeing is finally poised to launch astronauts to the International Space Station for NASA.  It’s the first flight of Boeing’s Starliner capsule with a crew on board, a pair of NASA pilots who will check out the spacecraft during the test drive and a weeklong stay at the space station.  NASA turned to U.S. companies for astronaut rides after the space shuttles were retired."}, {"date": "20240504093244", "headline": "Boeing’s weakness has a lesser known plane maker from Brazil gearing up to compete, and American Airlines’ CEO is a fan", "summary": "“Therefore, we have no doubt Embraer could develop an excellent jet to compete in the same class as the 737 Max and the A320neo, on budget, on time and at a fraction of the cost of the other OEMs.\""}, {"date": "20240504111734", "headline": "ISS recommends Boeing investors vote against CEO pay package", "summary": "(Bloomberg) -- Institutional Shareholder Services urged Boeing Co. investors to vote against a $32.8 million pay package for its chief executive officer, citing concerns over a special equity award and a “sizable increase” in his long-term incentive grant.Most Read from BloombergEverything Apple Plans to Show at May 7 ‘Let Loose’ iPad EventThe World’s Hunger for Salmon Is Linked to an Ecological DisasterSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineTrump Aide Hicks Cries on Witne"}, {"date": "20240504113629", "headline": "Top Boeing executive weighs in on qualities the next CEO should have as the search for a new boss takes more twists and turns", "summary": "In a note distributed to investors on Thursday, JPMorgan analysts recounted a recent meeting they had with Boeing CFO Brian West."}, {"date": "20240504114143", "headline": "Boeing locks out its private firefighters around Seattle over pay dispute", "summary": "Boeing has locked out its private force of firefighters who protect its aircraft-manufacturing plants in the Seattle area and brought in replacements after the latest round of negotiations with the firefighters' union failed to deliver an agreement on wages.  The company said Saturday that it locked out about 125 firefighters and a facility about 170 miles (275 kilometers) away in central Washington.  The firefighters serve as first responders to fires and medical emergencies and can call in help from local fire departments."}]}