{"news": [{"date": "20240416055931", "headline": "Bank of America Earnings Drop, Under Pressure From Higher Rates", "summary": "Bank of America reported a 18% drop in first-quarter profit, the latest big lender to feel the squeeze of higher interest rates.  Here’s a rundown of BofA's results, out this morning:  + Net income fell to $6.67 billion, or $0.76 a share, in line with analysts' expectations.  + BofA took a special charge of $700 million to pay the Federal Deposit Insurance Corp. over last year’s bank failures, on top of the $2.1 billion charge it booked last quarter."}, {"date": "20240416060543", "headline": "Stocks to Watch Tuesday: UnitedHealth, Tesla, J&J, Live Nation", "summary": "**↘️** **Live Nation Entertainment (LYV)**: Shares of the Ticketmaster parent company slid more than 9% in premarket trading after the Journal reported that the Justice Department is preparing to sue it as soon as next month."}, {"date": "20240416063519", "headline": "Bank Of America Rebound Hinges On Today's Action; Morgan Stanley Surges On Earnings", "summary": "Bank of America could be a buy or a sell on post-earnings action. Morgan Stanley reports first EPS gain in eight quarters."}, {"date": "20240416073009", "headline": "Bank of America (BAC) Reports Q1 Earnings: What Key Metrics Have to Say", "summary": "Although the revenue and EPS for Bank of America (BAC) give a sense of how its business performed in the quarter ended March 2024, it might be worth considering how some key metrics compare with Wall Street estimates and the year-ago numbers."}, {"date": "20240416082600", "headline": "Housing Numbers Shrink as Q1 Earnings Heat Up: BAC, JNJ, UNH", "summary": "Both Housing Starts and Building Permits missed expectations, while BofA, J&J and UnitedHealth all beat on earnings."}, {"date": "20240416083949", "headline": "BofA Shares Drop as Charge-Offs for Soured Loans Top Estimates", "summary": "(Bloomberg) -- Bank of America Corp. reported elevated expenses and charge-offs for soured loans that were higher than analysts expected, failing to satisfy investors with a gain in its trading business.Most Read from BloombergBeyond the Ivies: Surprise Winners in the List of Colleges With the Highest ROIChina Tells Iran Cooperation Will Last After Attack on IsraelUS Two-Year Yield Eyes 5% Before Powell’s Remarks: Markets WrapIMF Steps Up Its Warning to US Over Spending and Ballooning DebtIran’s"}, {"date": "20240416084600", "headline": "Bank of America Posts Strong Adjusted Profit and Net Interest Income, but the Stock Drops", "summary": "Bank of America’s adjusted earnings in the first quarter were 83 cents a share, beating analysts’ estimates of 76 cents."}, {"date": "20240416085300", "headline": "Investment Banking Bounceback Powers Big U.S. Lenders", "summary": "Top U.S. banks, including Bank of America, JPMorgan and Goldman, posted better-than-expected earnings thanks to strong consumer spending and a flurry of Wall Street activity."}, {"date": "20240416090632", "headline": "Big bank earnings show consumers may be losing spending steam", "summary": "In the wake of earnings reports from major banks like Bank of America (BAC) and Morgan Stanley (MS), a mixed picture is emerging about the state of consumer spending. While the banks have stressed that consumers are continuing to spend despite uncertainty around inflation, there are also signs of rising consumer credit stress. Bank of America, for instance, reported that its net charge-offs — debts unlikely to be recovered — rose to $1.5 billion year over year, up from $807 million in the prior-year period. At the same time, banks have noted a decline in net interest income, which is the difference between what banks earn on loans and what they pay on deposits. These figures raise concerns about whether consumers can sustain their current spending habits in an inflationary environment. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance. This post was written by Angel Smith"}, {"date": "20240416091236", "headline": "BofA’s mortgage production falls in Q1", "summary": "The top-20 U.S. mortgage lender produced a volume of $3.4 billion in first mortgages from January to March, it reported on Tuesday."}, {"date": "20240416093400", "headline": "Bank of America Losses on Bond Portfolio Hit $109 Billion in First Quarter as Rates Rose", "summary": "Bank of America  adjusted earnings topped expectations in the first quarter, but one part of the company’s financial results worsened: the big paper losses on a key portion of its enormous bond portfolio.  Bank of America shares, however, were down 2.3% to $35.03 in early trading Tuesday.  The bank said that its unrealized losses on a $587 billion portfolio of bonds that are classified as held to maturity for accounting purposes widened by $11 billion to $109 billion on March 31 from $98 billion at year-end 2023."}, {"date": "20240416095230", "headline": "Bank earnings reveal capital markets' 'resurgence': Analyst", "summary": "Morgan Stanley (MS) and Bank of America (BAC) have reported their first quarter earnings, beating expectations on the top and bottom lines. Bank of America posted revenue of $25.82 billion, surpassing estimates of $25.61 billion, alongside an adjusted EPS of $0.83, beating the $0.77 estimate. Similarly, Morgan Stanley reported revenue of $15.14 billion, outperforming the $14.46 billion estimate, with adjusted EPS of $2.02, exceeding the $1.66 estimate. To provide insights on these results, Argus Research Director of Financial Services Research Stephen Biggar joins Yahoo Finance. According to Biggar, the overarching theme is \"a resurgence in capital markets\" — a \"durable upturn in investment banking.\" Biggar notes that the banks' capital markets-related businesses, such as wealth management, investment banking, and trading, are \"doing much better.\" However, he acknowledges that the lending business and net interest income have \"faced some struggles.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance. This post was written by Angel Smith"}, {"date": "20240416101548", "headline": "News Highlights : Top Financial Services News of the Day - Tuesday at 4 PM ET", "summary": "Investment Banking Bounceback Powers Big U.S. Lenders Top U.S. banks, including Bank of America, JPMorgan and Goldman, posted better-than-expected earnings thanks to strong consumer spending..."}, {"date": "20240416102100", "headline": "NEW YORK MARKET CLOSE: Dollar up as Powell sees no rush to lower rates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416104742", "headline": "Big banks led by Citi continue to trim staff to cut costs", "summary": "(Reuters) -U.S. banking giants continued to shed employees in the first quarter, with Citigroup seeing the biggest drop.  Headcount at Citi declined by 2,000 employees after the third-largest U.S. lender completed a sweeping reorganization aimed at improving profits and reducing management layers.  Headcount at Bank of America, Wells Fargo and PNC Financial declined by about 2,000 jobs combined in the three months ended March 31 compared with the previous quarter."}, {"date": "20240416104800", "headline": "Wall Street Lunch: Bond Bulls In Hibernation", "summary": "10-year Treasury yield nearing a full point rise for 2024. UnitedHealth rallies on solid results. Fund managers are so bullish it might be time to sell."}, {"date": "20240416110305", "headline": "US luxury sales see 12% decline in March: BofA", "summary": "US luxury spending saw a 12% decline in March. However, the global luxury landscape has shown more fluctuating trends. Luxury conglomerate LVMH (MC.PA), the parent company of brands like Louis Vuitton and Dior, highlighted strong performance in other regions, notably the Middle East and Europe. Yahoo Finance's Madison Mills breaks down the details. For more expert insight and the latest market action, click here to watch this full episode of Wealth! This post was written by Angel Smith"}, {"date": "20240416112955", "headline": "Why Bank of America Stock Is Under Pressure Today", "summary": "The quarter was solid, but charge-offs caught investors off guard."}, {"date": "20240416121516", "headline": "Bank of America (BAC) Q1 2024 Earnings Call Transcript", "summary": "BAC earnings call for the period ending March 31, 2024."}, {"date": "20240416145643", "headline": "Deposits are banking industry's 'boogeyman': Money manager", "summary": "Bank of America (BAC) and Morgan Stanley (MS) were the latest Big Bank stocks to report first-quarter earnings on Tuesday. Both topped earnings and revenue estimates, a trend consistent for major financial players who have reported earnings so far. Hennessy Funds Portfolio Manager David Ellison joins Market Domination to discuss the biggest boons and challenges for the banking sector. \"I think the boogeyman or the real new issue is what's going to happen to the deposit side,\" Ellison explains. \"Since the Silicon Valley-First Republic issues of a year or so ago, the deposit side has really been exposed as a risk factor for the industry that we've never had. So you see most of these large banks losing non-interest bearing deposits to the market...\" For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Luke Carberry Mogan."}, {"date": "20240416190200", "headline": "Bank of America Corp (BAC) Q1 2024 Earnings Call Transcript Highlights: Navigating Market ...", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416191300", "headline": "Investor Optimism Decreases; Dow Ends 6-Session Losing Streak", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416200400", "headline": "Black Gold Boom: 3 Oil Stocks Primed to Pump as Prices Peak", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416220700", "headline": "Optimistic Outlook for Bank of America: Buy Rating Justified by Improved Financial Performance and Technological Advancements", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416221700", "headline": "Will GOP Retake White House? 3 Top Oil & Gas Picks to Buy for a Fossil Fuel Revival.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417004400", "headline": "Bank of America price target lowered by $1 at Oppenheimer, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417004600", "headline": "Oppenheimer Reaffirms Their Buy Rating on Bank of America (BAC)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417011900", "headline": "Morgan Stanley and HSBC Cut Asia-Pacific Jobs Amid Slowing Deals.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417020059", "headline": "Wall Street says a Wall Street revival is finally here", "summary": "Big bank bosses are not hiding their enthusiasm about Wall Street as first-quarter jumps in investment banking spur new hopes for a sustained dealmaking revival."}, {"date": "20240417020500", "headline": "IN THE KNOW: LVMH brand strength offers value with worst now behind", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417030100", "headline": "Morgan Stanley, HSBC said to cut Asia investment-banking jobs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417055100", "headline": "Bank Of America Loan Growth Is Better Than Peers, Analysts Predict 'Good Core Operating Leverage'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417061259", "headline": "Bank of America Corporation (NYSE:BAC) Q1 2024 Earnings Call Transcript", "summary": "Bank of America Corporation (NYSE:BAC) Q1 2024 Earnings Call Transcript April 16, 2024 Operator: Good day everyone and welcome to the Bank of America earnings announcement. At this time, all participants are in a listen-only mode. Later you will have the opportunity to ask questions during the question and answer session. You may register to […]"}, {"date": "20240417063100", "headline": "Analysts Conflicted on These Financial Names: Commerce Bancshares (CBSH), Mercantile Bank (MBWM) and Bank of America (BAC)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417064314", "headline": "Tax Equity Market Dynamics: Insights From The Solar + Wind Summit", "summary": "The Infocast Solar + Wind Finance & Investment Summit, held on March 12, 2024, featured a distinguished panel, moderated by Linklaters' tax partner Michael Rodgers, to discuss the current trends and..."}, {"date": "20240417124602", "headline": "High Yields Lure Buyers to US Treasuries, Including 20-Year Sale", "summary": "(Bloomberg) -- Investors flocked to Treasury yields near the highest levels of the year on Wednesday, including in an auction of 20-year bonds.Most Read from BloombergDubai Grinds to Standstill as Cloud Seeding Worsens FloodingTesla Asks Investors to Approve Musk’s $56 Billion Pay AgainRed Lobster Considers Bankruptcy to Deal With Leases and Labor CostsBankers Hit With Millions in Breakup Fees for Ditching New JobsChina Tells Iran Cooperation Will Last After Attack on IsraelThe rally trimmed yie"}, {"date": "20240417130745", "headline": "Bank of America: Keep Your Focus On The Total Picture", "summary": "There is a Bank of America Corporation automation transition underway in both bill payments and customer assistance. Click for my BAC stock Q1 earnings update."}, {"date": "20240417140706", "headline": "BofA CEO explains inflation is shifting consumer spending", "summary": "Bank of America (BAC) reported better-than-expected first quarter earnings on Tuesday, though its net interest income fell 3% from a year ago. Bank of America CEO Brian Moynihan joined Yahoo Finance Executive Editor Brian Sozzi to discuss the results, the state of the US consumer, and the Federal Reserve's inflation fight. On the consumer, Moynihan says that, from the data he is seeing, \"US consumer activity is slowing down, but that is not stopping\" and that the data is consistent with a more normalized US economy. He notes that \"if you thought the consumer was really holding back because of inflationary prices they wouldn't be spending on things that have price flexibility... but they are. They are spending on entertainment, restaurant spending is growing faster than food and store spending.\" He argues that means consumers are making discretionary purchases and necessary purchases at about the same levels as they were before the pandemic, which is a sign of normalization. Overall, Moynihan believes the Fed is \"winning\" the fight against inflation, it's just going to take time. Watch the video above to hear Moynihan explain why Bank of America's credit card business is seeing such success. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Stephanie Mikulich."}, {"date": "20240417141500", "headline": "Bank of America Announces Redemptions of Floating Rate Senior Notes Due April 2025 and 3.841% Fixed/Floating Rate Senior Notes Due April 2025", "summary": "Bank of America Corporation announced today that it will redeem on April 25, 2024 all $500,000,000 principal amount outstanding of its Floating Rate Senior Notes, due April 2025 (CUSIP No. 06051GKT5) (the \"Floating Rate Notes\"), and all $2,000,000,000 principal amount outstanding of its 3.841% Fixed/Floating Rate Senior Notes, due April 2025 (CUSIP No. 06051GKS7) (the \"Fixed/Floating Rate Notes\" and, together with the Floating Rate Notes, the \"Notes\")."}, {"date": "20240417143353", "headline": "Bank of America CEO: The Federal Reserve is winning the war on inflation", "summary": "Bank of America CEO Brian Moynihan weighs in on the fight against inflation and another solid quarter of consumer spending."}, {"date": "20240417160000", "headline": "Grants to Preserve Historic Art Awarded in 11 Countries by BofA", "summary": "Twenty-four cultural institutions have been named as grant recipients of the 2024 Bank of America Art Conservation Project. They represent a diverse range of artistic styles, media and cultural traditions across the United States, Canada, Mexico, Brazil, United Kingdom, France, Italy, The Netherlands, South Africa, India and Japan."}, {"date": "20240417161520", "headline": "Market Reaction To Bank Earnings Is Mixed, JPMorgan Analysts Project Further Decline In Net Interest Income", "summary": "As the U.S. financial sector grapples with recent earnings releases, investor reactions have been mixed. Some stocks are witnessing declines. Others are posting gains. See below. Banks Q1 Earnings Reports And Market Reactions, So Far Company Ticker Mkt Cap ($ mn) Price ($) Rating JPMorgan Price Target End Date Q1 Earnings Date EPS Revenue Stock Reaction (since earnings) as of April 18, 2:40 PM ET Citigroup Inc. C 119,590.80 62.84 N 64 Dec-24 Apr 12 Beat Beat -4.46% Wells Fargo WFC 206,396.90 57."}, {"date": "20240417190800", "headline": "Ibotta IPO jumps as investors continue to buy into AI hype (update)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417201100", "headline": "Analysts Offer Insights on Financial Companies: Nordea Bank Abp (OtherNBNKF) and Bank of America (BAC)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417201800", "headline": "Impact of Federal Reserve's Interest Rate Strategy on Global Markets Featuring Brazil's ...", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417204100", "headline": "Analysts Offer Insights on Financial Companies: Interactive Brokers (IBKR), Bank of America (BAC) and Bank of New York Mellon Corporation (BK)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418012400", "headline": "Bank of America price target raised by $1 at BMO Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418022600", "headline": "Seaport Global Keeps Their Hold Rating on Bank of America (BAC)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418023000", "headline": "Bank of America: Seize The Opportunity Before It's Gone", "summary": "Bank of America is confident of reaching a bottom in its net interest income in Q2, with a growth inflection in H2. Read why BAC stock is a Buy."}, {"date": "20240418045000", "headline": "3 Important Things We Just Learned From Bank of America", "summary": "Do the results suggest a recession is coming?"}, {"date": "20240418050017", "headline": "BofA CEO: National debt is something to be concerned about", "summary": "The International Monetary Fund warned in its latest economic outlook that when it comes the US national debt, \"Something will have to give.\" Bank of America CEO Brian Moynihan (BAC) tells Yahoo Finance Executive Editor Brian Sozzi that though the US did need to spend a lot to keep the economy churning during the pandemic, in better times \"you have to have more discipline.\" \"The financial strength of the US is one of the beacons of the world,\" Moynihan says, \"but you got to take care of that. One of the parts of taking care of that is making sure the government's budget stays in line with the economy.\" He adds that it's not something that alarms need to be raised about yet, but a it is something that needs to be managed over time. Click here to watch the full interview with Bank of America CEO Brian Moynihan. This post was written by Stephanie Mikulich."}, {"date": "20240418055400", "headline": "Ibotta IPO jumps as investors continue to buy into AI hype", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418055643", "headline": "15 AGs put BofA on notice for ‘de-banking’ conservatives", "summary": "“Your discriminatory behavior is a serious threat to free speech and religious freedom, is potentially illegal, and is causing political and regulatory backlash,” alleged Kansas Attorney General Kris Kobach."}, {"date": "20240418060011", "headline": "Bank of America Insiders Sold US$4.8m Of Shares Suggesting Hesitancy", "summary": "In the last year, many Bank of America Corporation ( NYSE:BAC ) insiders sold a substantial stake in the company which..."}, {"date": "20240418080853", "headline": "Citi Post Q1: I Like The Cost Cuts", "summary": "Citigroup is implementing strong cost-cutting measures through headcount reduction and organizational streamlining. Find out why C stock is a Buy."}, {"date": "20240418190100", "headline": "Noteworthy Friday Option Activity: BAC, ADBE, NSC", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418201900", "headline": "Regulators said to revive bid to rein in Wall Street bonus payouts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418202500", "headline": "At least 70% of the S&P 500 names that reported results this week topped estimates - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418213600", "headline": "Buy Rating Affirmed: Anticipating Bank of America’s Stock Turnaround Amid Positive Yield Trends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418214100", "headline": "Bank of America just upgraded at Wolfe Research, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418231400", "headline": "The Volatility Animal Is Waking Up", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419002600", "headline": "IN THE KNOW: Darktrace boosted by BofA double-upgrade to 'buy'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419012400", "headline": "Bank of America upgraded to Outperform at Wolfe as NII inflection nears", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419023800", "headline": "BacTech Appoints Mining Luminary to Board", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419023900", "headline": "Netflix upgraded and downgraded: Wall Street's top analyst calls", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419025600", "headline": "Early notable gainers among liquid option names on April 19th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419030000", "headline": "If You'd Invested $1,000 in Bank of America 5 Years Ago, Here's How Much You'd Have Today", "summary": "The answer might surprise you."}, {"date": "20240419030600", "headline": "Maintaining Hold: A Balanced View on Verizon’s Steady Performance and Dividend Appeal", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419030910", "headline": "India's Ola Cabs plans $500 mln IPO, to appoint banks soon, sources say", "summary": "Indian ride-hailing firmOla Cabs is planning an initial public offering to raise$500 million at a company valuation of about $5 billion, threesources with direct knowledge of the matter told..."}, {"date": "20240419032100", "headline": "15 out of 20 S&P 500 financial stocks deliver EPS wins, rebound in investment banking aids major U.S. banks - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419032600", "headline": "J.P. Morgan’s Analyst Focus List - 5 adds and 1 removal", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419050000", "headline": "Banks Believe They Are Well-Prepared for Commercial Real Estate Fallout", "summary": "For another quarter, big banks saw only a smattering of losses on office loans.  Seemingly every week brings fresh headlines about office towers selling at deeply discounted prices.  Partly that is because they have already set aside sizable reserves for future losses over the past few quarters."}, {"date": "20240419051114", "headline": "Big banks continue job cuts, Citi leads the way", "summary": "Big banks are continuing to cut back on jobs this quarter. Citi saw the biggest decrease of 2,000 employees as part of a reorganization plan for boosting profits and reducing management layers,..."}, {"date": "20240419051500", "headline": "American Express Surpasses Q1 Earnings With Robust Member Spending", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419100000", "headline": "IN THE KNOW: P&G on course to hit full-year targets despite soft sales", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419103934", "headline": "Wolfe Research Upgrades Bank of America (BAC)", "summary": ""}, {"date": "20240419115948", "headline": "Bank of America: Considerable Near-Term Potential, But Annualized Returns Likely Lower", "summary": "BofA has surged by 13.47%Â and plans expansion by opening 37 new financial centers acrossÂ nineÂ states by 2026.Â Learn why I maintain myÂ buyÂ rating on BAC stock."}, {"date": "20240419134525", "headline": "Bank of America stock rises on Wolfe Research upgrade", "summary": "Shares of Bank of America (BAC) have received an upgrade from analysts at Wolfe Research. The firm has lifted the stock's rating to Outperform from Peer Perform, citing increased clarity surrounding the bank's net interest income prospects and an attractive valuation compared to competitors. Yahoo Finance's Julie Hyman and Madison Mills break down the details. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Angel Smith"}, {"date": "20240420012300", "headline": "Warren Buffett Has $34.8 Billion Invested in This Dividend Stock. Is It a Smart Buy Now?", "summary": "This too-big-to-fail bank is the second-largest holding in Berkshire Hathaway's portfolio."}, {"date": "20240420013300", "headline": "Buy Bank of America Stock on This Dip. The Good Outweighs the Bad.", "summary": "Too many investors are distracted by a couple of recent red flags. But those red flags don't tell the whole story."}, {"date": "20240420033000", "headline": "Wall Street Has Abandoned Wall Street", "summary": "ON WALL STREET—America’s biggest bank is calling it quits on the street where American finance was born.  JPMorgan Chase  closed its branch Friday at 45 Wall St., ending more than 150 years of physical ties between the bank and the street that is a catchall term for the global money business.  The majority of the banks and brokerages that once populated Wall Street are already gone, finding new homes across Manhattan or beyond."}, {"date": "20240421033000", "headline": "Should You Buy Bank of America Hand Over Fist Right Now? There's 1 Good Reason to Think Twice.", "summary": "This leading bank just reported its latest financial results."}, {"date": "20240421044918", "headline": "Some Bubbles Are Starting To Pop", "summary": "Bubbles in the AI sector are deflating, while rising interest rates are impacting the commercial real estate sector. Read more to see my thoughts."}, {"date": "20240421122300", "headline": "Bank of America Just Told Us Something Important About Consumer Spending", "summary": "Its net charge-offs and delinquencies have risen for several quarters in a row. Here's what the bank expects for the rest of 2024."}, {"date": "20240421193800", "headline": "Visa, Mastercard earnings expected to rise in seasonally weakest volume quarter", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421220000", "headline": "Norway’s $1.6 Trillion Fund Turns Developer on Trophy UK Properties", "summary": "(Bloomberg) -- Norway’s $1.6 trillion sovereign wealth fund kicked off a glitzy property-buying spree in London more than a decade ago. Now it’s trying to figure out ways to keep the shine on some of those increasingly tired trophy buildings.Most Read from BloombergElon Musk’s Robotaxi Dreams Plunge Tesla Into ChaosTikTok to Remove Executive Tasked With Fending Off US ClaimsTrump Has Only $6.8 Million for Legal Fees With Trial UnderwayTesla Spends Weekend Cutting Prices of Cars and FSD SoftwareT"}, {"date": "20240421233200", "headline": "Forget the Noise: Buy These 3 Unfairly Punished Stocks Before Earnings Euphoria Hits", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422020000", "headline": "S&P 500 Tanks, Earnings Soar: 2 Buy-The-Dip Dividend Growth Stocks", "summary": "S&P 500 experienced a chaotic week, eroding progress made in January 2022. Check out the two top stock picks for the rest of the year."}, {"date": "20240422040700", "headline": "2 Incredibly Cheap Fintech Stocks to Buy Now", "summary": "Thanks to interest rate headwinds and economic uncertainty, there are some bargains in the financial sector."}, {"date": "20240422050000", "headline": "Want Decades of Passive Income? 3 Stocks to Buy Now and Hold Forever", "summary": "Look for leading companies in businesses that are timeless. A record of steady and rising dividend payments doesn't hurt either."}, {"date": "20240422060024", "headline": "With 59% ownership, Bank of America Corporation (NYSE:BAC) boasts of strong institutional backing", "summary": "Key Insights Given the large stake in the stock by institutions, Bank of America's stock price might be vulnerable to..."}, {"date": "20240422064100", "headline": "10 Financials Stocks Whale Activity In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422065559", "headline": "Galp seeks to sell stake in Namibia oilfield after discovery, sources say", "summary": "Portuguese oil company GalpEnergia has launched the sale of half of its stake inan exploration block offshore Namibia where it has made a majoroil discovery, three industry sources familiar with..."}, {"date": "20240422085748", "headline": "Forget Big Tech Earnings, Buy Income Instead", "summary": "Big tech earnings are approaching, but I'm not betting on them. Click here for the 2 high income stocks and one asset category that offers high yield."}, {"date": "20240422100600", "headline": "Stock market today: Wall Street climbs to kick off a big week for earnings reports", "summary": "NEW YORK — U.S. stocks clawed back some of their losses from last week. The S&P 500 rose 0.9% Monday to recover more than a quarter of last week’s rout. The Dow Jones Industrial Average added..."}, {"date": "20240422192000", "headline": "CFTC said to be probing big banks' confidential agreements in swaps, clearing businesses", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422201300", "headline": "The Top 3 Retirement Stocks to Buy in April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422205100", "headline": "Regulators probe potential use by big banks of nondisclosure agreements to discourage whistleblowers: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422224600", "headline": "Verizon Hold Rating Maintained Amid Consumer Segment Growth and Competitive Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423023607", "headline": "Trending : SAP's Cloud Momentum Accelerated Further in 1Q", "summary": "1219 GMT - SAP is among the most mentioned companies across news items over the past 12 hours, according to Factiva data, after it posted higher revenue and operating profit in the first quarter...."}, {"date": "20240423041700", "headline": "How Much Money Does Warren Buffett Have Invested in Bank of America?", "summary": "The billionaire investor has made Bank of America one of Berkshire Hathaway's top holdings."}, {"date": "20240423043711", "headline": "Goldman and BofA face renewed calls to split CEO, chairman's roles", "summary": "Goldman Sachs and Bank of America will face challenges on Wednesday as proxy advisers recommend investors vote for the banks to separate their CEO and chairman's roles, in an effort to improve the companies' governance.  With support from influential proxy advisers Institutional Shareholder Services (ISS) and Glass Lewis, some investors are leaning towards supporting shareholder resolutions to split the roles, but getting wider support will be tough.  \"I would love for a company on the echelon of Goldman Sachs to separate those two roles so there's more oversight,\" said David Wagner, a portfolio manager at Aptus Capital Advisors, which owns Goldman shares."}, {"date": "20240423062108", "headline": "MEDIA-Big banks face probe over non-disclosure agreements in swaps, clearing businesses- Bloomberg News", "summary": "-- Source link: https://tinyurl.com/25w86z6t -- Note: Reuters has not verified this story and does notvouch for its accuracy ..."}, {"date": "20240423070017", "headline": "Bank of America Corporation (BAC) is Attracting Investor Attention: Here is What You Should Know", "summary": "Zacks.com users have recently been watching Bank of America (BAC) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects."}, {"date": "20240423074500", "headline": "1 Wall Street Analyst Thinks Bank of America Stock Is Going to $42. Is It a Buy?", "summary": "Bank of America is rebounding from a post-earnings sell-off."}, {"date": "20240423105705", "headline": "Market Chatter: CFTC Asks Big Banks for Nondisclosure Agreements in Swaps, Clearing Amid Whistleblower Concerns", "summary": "Market Chatter: CFTC Asks Big Banks for Nondisclosure Agreements in Swaps, Clearing Amid Whistleblower Concerns"}, {"date": "20240423110825", "headline": "Bull Signal Flashing for Bank Stock", "summary": "A bullish combination is flashing for BAC on the charts"}, {"date": "20240423112824", "headline": "Bank of America : Earnings Release Q1 2024", "summary": "Bank of America Reports Q1-24 Net Income of $6.7 Billion, EPS of $0.76 Revenue of $25.8 Billion,1 Including Net Interest Income of $14.0 Billion ..."}, {"date": "20240423115208", "headline": "Bank of America : Merrill Lynch Bank and Trust Company (Cayman) Limited 2023 Annual Report", "summary": "Detailed Table of Contents 1...."}, {"date": "20240423115627", "headline": "Update: Market Chatter: CFTC Asks Big Banks for Nondisclosure Agreements in Swaps, Clearing Amid Whistleblower Concerns", "summary": "Update: Market Chatter: CFTC Asks Big Banks for Nondisclosure Agreements in Swaps, Clearing Amid Whistleblower Concerns"}, {"date": "20240423115908", "headline": "Bank of America : ANNUAL REPORT AND FINANCIAL STATEMENTS 2023", "summary": "Registered number: 229165 BANK OF AMERICA EUROPE DAC ANNUAL REPORT AND FINANCIAL STATEMENTS FOR THE YEAR ENDED 31..."}, {"date": "20240423193900", "headline": "Spotlight on Bank of America: Analyzing the Surge in Options Activity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423235000", "headline": "Cashing In on Earnings: 3 Financial Stocks Set to Surge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424020127", "headline": "Wall Street bosses tested by calls to strip them of power", "summary": "Some of Wall Street’s most powerful bosses are facing new shareholder proposals this spring that would strip them of power by separating CEO and chairman seats."}, {"date": "20240424020127", "headline": "Wall Street’s top bosses tested by shareholder proposals to strip them of power", "summary": "Some of Wall Street’s most powerful bosses are facing new shareholder proposals this spring that would strip them of power by separating their CEO and chairman seats."}, {"date": "20240424023500", "headline": "Forget Bank of America; Buy This Magnificent Bank Stock Instead", "summary": "This up-and-coming digital bank is ready to start generating outsized profits."}, {"date": "20240424024600", "headline": "RBC Capital Keeps Their Hold Rating on Verizon (VZ)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424030317", "headline": "Royal Bank of Canada: Risks Ahead", "summary": "Royal Bank of Canada reported solid Q1/24 results. Check out why I think RY stock is not a good investment right now."}, {"date": "20240424032100", "headline": "3 No-Brainer Stocks to Buy With $300 Right Now", "summary": "A modest amount of money can go a long way on Wall Street when it's put to work in time-tested businesses with well-defined catalysts."}, {"date": "20240424050000", "headline": "BlackRock Activates Retirement Solution Offering A Paycheck For Life", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424054051", "headline": "Bank of America shareholders reject proposal to split CEO, chair roles", "summary": "Bank of America shareholders rejected a proposal to divide the CEO and chairman roles held by Brian Moynihan on Wednesday at the company's virtual annual meeting. Proxy advisers had..."}, {"date": "20240424071607", "headline": "Warren Buffett Is Averaging Over $2.7 Million Per Day From This Dividend Stock - Should You Load Up?", "summary": "Legendary investor Warren Buffett, through his holding company Berkshire Hathaway, has built an impressive portfolio of stocks over the years. One of his most significant holdings is Bank of America Corp. (NYSE:BAC), which, according to the latest 13F ..."}, {"date": "20240424101029", "headline": "At Goldman, More Support for Splitting Chair and CEO Role but Solomon Still Wins", "summary": "A Goldman Sachs shareholder proposal that sought to separate the bank's chairman and CEO positions failed to pass on Wednesday—even as it won more support among shareholders than last year.  Of Goldman shares that were voted, 33% were in favor of splitting the positions held by David Solomon.  A similar vote on Brian Moynihan’s dual roles at Bank of America won support from 31% of votes on Wednesday."}, {"date": "20240424101838", "headline": "News Highlights : Top Financial Services News of the Day - Wednesday at 4 PM ET", "summary": "Main Street Banking Model Is Being Squeezed First-quarter results at regional banks show the uneven toll of higher interest rates. Goldman Sachs and Bank of America shareholders reject..."}, {"date": "20240424101916", "headline": "Goldman's David Solomon defeats vote on CEO-chair split even as support for it increases", "summary": "David Solomon defeated a proposal seeking to separate his roles as CEO and chairman of Goldman Sachs, but the measure received double the support it did in 2023."}, {"date": "20240424151542", "headline": "News Highlights : Top Company News of the Day - Wednesday at 9 PM ET", "summary": "Meta's Costs Rise Rapidly as Zuckerberg Vows to Keep Spending on AI Arms Race Meta Platforms reported record first-quarter sales, building on AI momentum in its ad business, although investors..."}, {"date": "20240424171539", "headline": "News Highlights : Top Company News of the Day - Wednesday at 11 PM ET", "summary": "BHP Makes Offer for Rival Anglo American in Potential Mega Mining Deal Mining giant BHP has offered to buy the longtime rival with a market capitalization of about $35 billion, in a potential..."}, {"date": "20240424181547", "headline": "News Highlights : Top Financial Services News of the Day - Thursday at 12 AM ET", "summary": "Main Street Banking Model Is Being Squeezed First-quarter results at regional banks show the uneven toll of higher interest rates. Goldman Sachs and Bank of America shareholders reject..."}, {"date": "20240424191730", "headline": "News Highlights : Top Company News of the Day - Thursday at 1 AM ET", "summary": "BHP Makes Offer for Rival Anglo American in Potential Mega Mining Deal The mining giant has offered to buy its longtime rival with a market cap of about $35 billion, in a deal that could..."}, {"date": "20240424220800", "headline": "Bank of America declares $0.24 dividend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424231700", "headline": "3 Lithium Stocks to Buy on the Dip: April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425000300", "headline": "Tesla Alternatives: 3 EV Stocks Poised to Outpace Elon’s Empire in the Long Term", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425011645", "headline": "News Highlights : Top Financial Services News of the Day - Thursday at 7 AM ET", "summary": "BlackRock-Temasek Venture Amasses $1.4 Billion for Clean-Energy Wagers The firms' Decarbonization Partners raised its first fund to support emissions-reducing technologies. Project Primus..."}, {"date": "20240425021000", "headline": "March's Dividend Portfolio Update Sets New All-Time Record - 100 Holdings, 21 Buys", "summary": "Portfolio changes in March focus on BDCs, aiming to increase dividend income by at least $100 each month. Click here for a detailed analysis."}, {"date": "20240425024500", "headline": "Bank Of America Thinks '2024 Is Starting To Look Like 2015 But In Reverse' While Jamie Dimon Warns 2024 Looks Like The 1970s", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425051649", "headline": "News Highlights : Top Financial Services News of the Day - Thursday at 11 AM ET", "summary": "BlackRock-Temasek Venture Amasses $1.4 Billion for Clean-Energy Wagers The firms' Decarbonization Partners raised its first fund to support emissions-reducing technologies. Project Primus..."}, {"date": "20240425051939", "headline": "BofA, Goldman shareholders nix proposals to split CEO, chair roles", "summary": "Roughly 33% of Goldman voters and 31% of BofA shareholders supported the measures, an uptick from last year for both banks. JPMorgan Chase shareholders will vote on a similar measure next month."}, {"date": "20240425061115", "headline": "Bank of America delivers grants for art conservation", "summary": "Bank of America has awarded 24 cultural institutions with grants from its 2024 Bank of America Art Conservation Project. First started in 2010, this project supports the preservation of sculptures,..."}, {"date": "20240425101300", "headline": "NEW YORK MARKET CLOSE: Stocks ebb on stagflation fears as growth slows", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425101531", "headline": "News Highlights : Top Financial Services News of the Day - Thursday at 4 PM ET", "summary": "BlackRock-Temasek Venture Amasses $1.4 Billion for Clean-Energy Wagers The firms' Decarbonization Partners raised its first fund to support emissions-reducing technologies. Project Primus..."}, {"date": "20240425150000", "headline": "Bank of America Declares Second-Quarter 2024 Stock Dividends", "summary": "Bank of America Corporation today announced the Board of Directors declared a regular quarterly cash dividend on Bank of America common stock of $0.24 per share, payable on June 28, 2024 to shareholders of record as of June 7, 2024."}, {"date": "20240425214300", "headline": "Bank of America Shareholders Meeting: Elections and Equity Plan Approval", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426063300", "headline": "Bank of America Corp's Non-Cumulative Preferred Stock, Series GG Ex-Dividend Reminder", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426101600", "headline": "NEW YORK MARKET CLOSE: Bullish Alphabet and Microsoft fuel tech rally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426103720", "headline": "Proposal 4: Proposal to amend and restate the Bank of America Corporation Equity Plan - Form 8-K", "summary": "Proposal 4: Proposal to amend and restate the Bank of America Corporation Equity Plan Executive summary ..."}, {"date": "20240426191900", "headline": "Warren Buffett Bolsters Holdings in Liberty SiriusXM Group", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427010000", "headline": "The Push to Split CEO and Board Chair Roles Is Gaining Traction. What Comes Next.", "summary": "On the face of it,  Bank of America  and  Goldman Sachs  annual shareholder meetings this week were uneventful—no blowout wins for long-shot proposals, no drawn-out battles with infamous activist funds.  The two resolutions called on BofA and Goldman to implement policies to prevent the chief executive from also holding the title of board chair—both banks’ CEOs currently do—in the interest of sounder corporate governance and checks on power.  While this has been a longstanding debate, what stands out is the increased support these proposals drew when shareholders’ votes were tallied on April 24."}, {"date": "20240427040000", "headline": "Bank Of America: Now Fairly Valued - H2'23 To Bring Forth Rich Interest Incomes", "summary": "We are maintaining our Buy rating for BAC, with the stock's massive returns of +52.2% well outperforming the wider market at +23% since October 2023."}, {"date": "20240427054000", "headline": "Earning A 6-6.25% Preferred Dividend Yield With Bank of America", "summary": "Bank of America offers options for various preferred shares. Find out why BAC stock's preferred dividends remain a safe investment."}, {"date": "20240427212400", "headline": "Credit card delinquency rates fall in March as consumers keep spending", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428012500", "headline": "Bank of America Stock: Buy, Sell, or Hold?", "summary": "The bank stock has gained 44% since the beginning of November. Is it time to sell?"}, {"date": "20240428030000", "headline": "How Stock Markets Will Likely React After FOMC Announcement", "summary": "Investors should pay attention to inflation rates, employment strength, & consumer spending trends. Know more about upcoming Fed meeting and its impact on stock market."}, {"date": "20240428042000", "headline": "If You Invested $10,000 in Warren Buffett's Top 3 Stocks 10 Years Ago, This Is How Much You'd Have Today", "summary": "Buffett's top stocks are not only safe, but they have also generated some impressive returns."}, {"date": "20240428194600", "headline": "Bank of America Files New SEC Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428213500", "headline": "Bank of America Corp. stock underperforms Monday when compared to competitors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429020000", "headline": "American Express Can Sustain Its Rally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429035000", "headline": "Prediction: This Will Be Warren Buffett's Second Biggest Holding After Apple by 2027", "summary": "The ingredients could be in place for one stock to replace Bank of America as Buffett's second largest holding."}, {"date": "20240429050800", "headline": "Decoding Bank of America's Options Activity: What's the Big Picture?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429070100", "headline": "Japan's currency falls to its weakest since 1990 against the dollar as the yen keeps yelping", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429101200", "headline": "NEW YORK MARKET CLOSE: Stocks push higher while Tesla hits top gear", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429190800", "headline": "Bank of America's Preferred Stock, Series GG Crosses Above 6% Yield Territory", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429195100", "headline": "Maintaining Buy on Bank of America: Growth and Capital Returns Justify Valuation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429200200", "headline": "Critical Insights From Bank of America Analyst Ratings: What You Need To Know", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429202900", "headline": "7 Multibagger Growth Stocks to Buy to Defy the Downtrend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000100", "headline": "Bank of America Corp: An Exploration into Its Intrinsic Value", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430003800", "headline": "Verizon (VZ) Gets a Buy from Oppenheimer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430021500", "headline": "Jim Cramer Rejects Illumina As 'It's Not Well-Run,' Recommends Buying This Tech Stock 'Right Here, Right Now'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430040600", "headline": "Seven bank-stock picks as industry nears ‘positive inflections’", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430041215", "headline": "Bank of America : USGBC Announces 2024 LEED for Cities Leadership Program Cohort", "summary": "WASHINGTON, D.C. - The U.S. Green Building Council , the leading authority on green building and the global developer of the LEED green building program, has announced the 2024 cohort..."}, {"date": "20240430072818", "headline": "4 Buyable Berkshire DiviDogs From April, Plus 5 To Watch", "summary": "25 of 41 current BKH owned stocks pay dividends.Â Read more to see a detailed analysis of the stocks listedÂ in this article."}, {"date": "20240430081032", "headline": "How To Earn $500 A Month From Bank of America Stock Following Upbeat Q1 Earnings", "summary": "Bank of America Corp (NYSE:BAC) reported better-than-expected earnings for its first quarter on April 16. The Charlotte, North Carolina-based bank posted quarterly adjusted net income of $7.2 billion and adjusted EPS of 83 cents, beating the consensus of 77 cents. Revenue, net of interest expense, decreased 2% year over year to $25.8 billion. Adjusted revenue declined 1.6% year over year to $25.98 billion, beating the consensus of $25.46 billion, according to data from Benzinga Pro. On April 25,"}, {"date": "20240430115039", "headline": "Bank of America : 1Q24 Form 10-Q", "summary": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549 FORM 10-Q ..."}, {"date": "20240430193200", "headline": "Bank Of America, Fifth Third Bancorp To Gain From 'Higher For Longer' Interest Rates: JPMorgan's Top Picks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430194300", "headline": "Analyst Upgrades: 3 Stocks That the Pros Can’t Stop Raving About", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430194800", "headline": "Bank of America Files Quarterly Financials", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430235700", "headline": "Bank of America price target raised by $1 at JPMorgan, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501005911", "headline": "Bank of America -USGBC Announces 2024 LEED for Cities Leadership Program Cohort", "summary": "Partnership with Bank of America Supports Achievement of Local Government Sustainability Goals with LEED for Cities.U.S. Green Building Council USGBC logoWASHINGTON, D.C. - The U.S. Green Building..."}, {"date": "20240501020123", "headline": "Whether Wall Street garden leaves survive non-compete ban is an 'open question'", "summary": "Some 'garden leave' agreements that Wall Street uses to protect secrets are expected to survive the FTC's new non-compete ban, but some probably won't."}, {"date": "20240501042800", "headline": "More Than 10% of Warren Buffett-Led Berkshire Hathaway's $374 Billion Portfolio Is Invested in This Stock. Should You Buy It?", "summary": "The Oracle of Omaha knows a thing or two about analyzing these types of companies."}, {"date": "20240501052700", "headline": "Federal Reserve moving forward with bank capital rules, Bloomberg says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501063900", "headline": "10 Financials Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501064500", "headline": "Profit from the Panic: 3 Stocks to Pounce on When They Become Steals", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501064500", "headline": "U.S. banking regulators push to rework Basel III endgame rule - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501065500", "headline": "BofA Survey: Majority of Small and Mid-Sized Business Owners Anticipate Revenue Growth This Year", "summary": "A majority of small and mid-sized business owners expect their revenues to increase this year, and their worries over a recession have declined substantially, according to the 2024 Bank of America Business Owner Report, conducted in partnership with Bank of America Institute. While business owners remain mindful of the impacts of inflation and interest rates on their bottom lines, both concerns have lessened since Spring 2023. And despite some lingering uncertainties over the broader economy, bu"}, {"date": "20240501075200", "headline": "IN BRIEF: Public Policy inks USD13 million credit facility", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501075428", "headline": "Public Policy inks USD13 million credit facility", "summary": "Public Policy Holding Co Inc - Washington DC-based group of advisory firms specialising in government affairs and public relations - Enters into a supplemental USD13 million credit facility with Bank..."}, {"date": "20240501205300", "headline": "Analysts Are Bullish on Top Financial Stocks: Mastercard (MA), Interactive Brokers (IBKR)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501212000", "headline": "Bank of America closes 7th straight session of loss", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501215705", "headline": "Without transparency, banks will continue to find themselves as political prey", "summary": "Bank of America should take the opportunity to be upfront about its de-banking policies and lead a path for other banks in the US to do the same argues Phoebe Hodgson"}, {"date": "20240501230606", "headline": "Decoding Bank of America Corp (BAC): A Strategic SWOT Insight", "summary": "Insightful Analysis of Bank of America's Financial Health and Strategic Position"}, {"date": "20240501230615", "headline": "Bank of America to Participate in the Barclays Americas Select Franchise Conference", "summary": "Bank of America President of International Bernard Mensah will participate in the Barclays Americas Select Franchise Conference on Wednesday, May 8, at 1:30 p.m. British Summer Time in London .A..."}, {"date": "20240502020016", "headline": "Whether Wall Street garden leaves survive noncompete ban is an 'open question'", "summary": "Some 'garden leave' agreements that Wall Street uses to protect secrets are expected to survive the FTC's new noncompete ban, but some probably won't."}, {"date": "20240502023000", "headline": "Peloton Layoffs 2024: What to Know About the Latest PTON Job Cuts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502031300", "headline": "What's Driving ING Groep NV's Surprising 25% Stock Rally?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502035803", "headline": "Bank of America : Soles4Souls Receives $150,000 Grant From Bank of America to Expand Entrepreneurship Program to Dominican Republic", "summary": "For more than a decade, we have seen how our 4Opportunity program can change lives around the world, said Soles4Souls President and CEO Buddy Teaster. Building on our deep partnerships..."}, {"date": "20240502065100", "headline": "Warren Buffett Increases Stake in Liberty SiriusXM Group", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502080431", "headline": "Bank of America : 2023 (English)", "summary": "BANC OF AMERICA SECURITIES ASIA LIMITED Audited Annual Financial Statements for the year ended 31..."}, {"date": "20240502084910", "headline": "Bank of America : United Kingdom 2023 Report", "summary": "UK Pillar 3 Remuneration Disclosure Performance Year Ended 31 December 2023 ..."}, {"date": "20240502084912", "headline": "Bank of America : Europe D.A.C. (formerly Bank of America Merrill Lynch International D.A.C.) 2023 Report", "summary": "Bank of America Europe Designated Activity Company Pillar 3 Remuneration Disclosure Performance Year Ended 31 December 2023 ..."}, {"date": "20240502101700", "headline": "NEW YORK MARKET CLOSE: Dovish Fed boosts stocks as jobs report looms", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502113550", "headline": "FNDB: Outperforming Most Passively Managed Value ETFs", "summary": ""}, {"date": "20240502222500", "headline": "Top BofA Analyst Thinks S&P500 Will Rally Another 8%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502223700", "headline": "Top BofA Analyst Thinks S&P50 Will Rally Another 8%?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502223900", "headline": "Top BofA Analyst Thinks S&P 500 Will Rally Another 8%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503001800", "headline": "Camsing Healthcare Gains SGX-ST Listing Approval", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503021252", "headline": "Bank of America: Wait For A Better Price", "summary": "Bank of America's Q1 2024 results showed negative revenue growth and a decline in net income. Find out why BAC stock is a Hold."}, {"date": "20240503030600", "headline": "52% of Warren Buffett's $372 Billion Portfolio Is Invested in These 2 Magnificent Stocks", "summary": "Two sensational, time-tested businesses account for more than half of the invested assets the Oracle of Omaha oversees at Berkshire Hathaway."}, {"date": "20240503032700", "headline": "Warren Buffett's Berkshire To Rake In $226M Passively In A Jiffy, Thanks To Its Core Holding Apple", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503062354", "headline": "BofA Hires Goldman Sachs, Deutsche Bank Traders in Europe Push", "summary": "(Bloomberg) -- Bank of America Corp. hired Goldman Sachs Group Inc.’s head of European loan trading and Deutsche Bank AG’s head of sterling investment grade corporates as part of a push to grow in Europe. Most Read from BloombergSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineApple Rallies on Upbeat Forecast, Record-Setting BuybackTurkey Confirms All Trade Halt With Israel Over War in GazaHuawei Secretly Backs US Research, Awarding Millions in PrizesTrump Auditions VP Picks Before"}, {"date": "20240503070616", "headline": "The Bank of America Corporation (NYSE:BAC) First-Quarter Results Are Out And Analysts Have Published New Forecasts", "summary": "Bank of America Corporation ( NYSE:BAC ) shareholders are probably feeling a little disappointed, since its shares fell..."}, {"date": "20240503092935", "headline": "Bond Market Parties On as Jobs Data Revive Fed Rate-Cut Bets", "summary": "(Bloomberg) -- The world’s biggest bond market is back in celebration mode after its worst month in more than a year.Most Read from BloombergSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineApple Rallies Most in 18 Months on Upbeat Forecast, BuybackTrump Auditions VP Picks Before Wealthy Donors in Palm BeachTurkey Confirms All Trade Halt With Israel Over War in GazaHuawei Secretly Backs US Research, Awarding Millions in PrizesEvidence that the US labor market is finally softening in"}, {"date": "20240503134645", "headline": "TD Bank's Fentanyl Probe: Assessing The Damage", "summary": "What are the risks and potential costs TD Bank may face due to its involvement in an alleged Fentanyl money-laundering scandal? Read my analysis of TD stock here."}, {"date": "20240504012000", "headline": "Berkshire says 75% of fair value concentrated in five companies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504023600", "headline": "Berkshire Hathaway's Q1 Operating Earnings Surged 39% — Here's Why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504031100", "headline": "Buffett's Berkshire Hathaway slashes Apple stake in Q1", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504050800", "headline": "Warren Buffett's Confidence In Apple Wanes? Berkshire Cuts Stake By 18% Amid Tech Giant's Troubles.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504050900", "headline": "Buffett says Apple likely to be largest investment at 2024-end, despite Q1 stake cut (update)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}]}