{"news": [{"date": "20240318170035", "headline": "Booking Holdings Inc CEO Glenn Fogel Sells 5,827 Shares", "summary": "Glenn Fogel, the CEO and President of Booking Holdings Inc (NASDAQ:BKNG), has sold 5,827 shares of the company on March 15, 2024, according to a recent SEC filing."}, {"date": "20240318170042", "headline": "Booking Holdings Inc CEO Glenn Fogel Sells 4,302 Shares", "summary": "Glenn Fogel, CEO and President of Booking Holdings Inc (NASDAQ:BKNG), has sold 4,302 shares of the company on March 15, 2024, according to a recent SEC filing."}, {"date": "20240318233400", "headline": "3 High-Risk, High-Reward Stocks Worth Betting On for Under $20", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240319053000", "headline": "Affordable Stocks on the Horizon? 3 Companies to Watch for Stock Splits", "summary": "In January 2024, Walmart (NYSE:WMT) announced it was conducting a 3-for-1 stock split which was executed in February. This was the tenth stock split in the company’s history. That is leading some investors to wonder if there are other stocks to watch for stock splits in 2024. When a company splits its stock, it divides its number of existing shares into multiple shares. A stock split immediately impacts existing shareholders because the number of shares they own will increase by the multiple of"}, {"date": "20240320153204", "headline": "Goodbye, Magnificent Seven. Who are tech's 'Electric Eleven'?", "summary": "First came the Magnificent Seven. And then Wall Street analysts began doubting the strength of the tech sector, quickly coining the term \"Fantastic Four\" to exclude several of the biggest laggards in 2024. Now, Evercore ISI is pairing together a new group of tech stocks as big as the previous two — \"the Electric Eleven,\" comprised of Airbnb (ABNB), Alphabet (GOOG, GOOGL), Amazon (AMZN), Booking Holdings (BKNG), DoorDash (DASH), Meta Platforms (META), Netflix (NFLX), Shopify (SHOP), Spotify (SPOT), The Trade Desk (TTD), and Uber (UBER). Evercore ISI Senior Managing Director and Head of Internet Research Mark Mahaney explains where the similarities between these companies lie and their core drivers. \"I think most of these digital-first companies are beneficiaries of gen AI. They're going to be able to figure it out, they're going to deploy, or they already have in ways that improve products and processes and they're and I think shareholders will benefit from that,\" Mahaney explains. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan."}, {"date": "20240321001700", "headline": "Agoda, GSTC, and USAID Partner to Champion Sustainability Education for Hotels in Asia", "summary": "Digital travel platform Agoda, the Global Sustainable Tourism Council (GSTC), and the United States Agency for International Development (USAID) have partnered to provide sustainability trainings for hoteliers across Asia, which will strengthen the sustainability transformation and foster green growth within the region's hotel industry, with models that have the potential for global application."}, {"date": "20240321010000", "headline": "11 High-Quality Blue Chips Potentially Poised To Pop", "summary": "In today's overvalued market, investors might assume nothing is on sale. Read more on 11 stocks that may have flown under most investor radars."}, {"date": "20240321161521", "headline": "Booking Holdings (BKNG) Rises Higher Than Market: Key Facts", "summary": "In the latest trading session, Booking Holdings (BKNG) closed at $3,647.81, marking a +1.94% move from the previous day."}, {"date": "20240321203643", "headline": "Expedia's Next Phase Of Its Post-Pandemic Transition Holds Promise", "summary": "Expedia is focusing on the merchant model format to generate more margin and expand its B2B business proposition. Learn why EXPE stock is a Hold."}, {"date": "20240321214200", "headline": "Booking Holdings Inc. stock falls Friday, underperforms market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240321233033", "headline": "Italy regulator launches probe into Booking.com for potential abuse of dominant position", "summary": "Italy's antitrust has opened a probe into Booking.com to establish whether the travel website is in a potential abuse of dominant position, the regulator said on Friday. ..."}, {"date": "20240321235648", "headline": "Booking.com Probed in Italy Over Alleged Market Abuse", "summary": "By Mauro Orru Italy's competition watchdog launched an investigation into Booking.com, saying the online travel company might be stifling competition by adjusting accommodation prices on its..."}, {"date": "20240322002352", "headline": "Booking.com Probed in Italy Over Alleged Market Abuse -- Update", "summary": "By Mauro Orru Italy's competition watchdog launched an investigation into Booking.com, saying the online travel company might be stifling competition by adjusting accommodation prices on its..."}, {"date": "20240322002525", "headline": "Italy regulator probes Booking.com for alleged abuse of dominant position", "summary": "Italy's competition watchdogsaid on Friday it has opened a probe into Booking.comto establish whether the travel website is abusing its dominantmarket position. The watchdog, AGCM,..."}, {"date": "20240322031500", "headline": "Peering Into Booking Holdings's Recent Short Interest", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322040200", "headline": "Why Investors Are Eyeing Booking Holdings Inc (BKNG): The Key Drivers of Market Outperformance ...", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322045200", "headline": "Italy opens anti-trust investigation into Booking Holdings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322050300", "headline": "Italian Competition Authority opens investigation into Booking", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322071339", "headline": "Michael Burry’s Top 15 Stock Picks For 2024", "summary": "In this article, we discuss Michael Burry’s top 15 stock picks for 2024. If you want to see the investor’s top 5 stock picks, head directly to Michael Burry’s Top 5 Stock Picks For 2024. Michael Burry, the founder and manager of Scion Asset Management, increased his investments in Chinese tech giants Alibaba Group Holding […]"}, {"date": "20240322132544", "headline": "Corporate Insiders are Dumping These 11 Tech Stocks", "summary": "In this article, we will take a detailed look at Corporate Insiders are Dumping These 11 Tech Stocks. For a quick overview of such stocks, read our article Corporate Insiders are Dumping These 5 Tech Stocks. The US stock market is on track to conclude a solid week on Friday, as the Federal Reserve’s latest statement saying it’s still […]"}, {"date": "20240322133300", "headline": "Top Analyst Reports for Booking Holdings, Mitsubishi UFJ & Micron Technology", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Booking Holdings Inc. (BKNG), Mitsubishi UFJ Financial Group, Inc. (MUFG) and Micron Technology, Inc. (MU)."}, {"date": "20240323025100", "headline": "Airbnb Stock (NASDAQ:ABNB): Cash-Printing Machine for the Long Term", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240324071922", "headline": "Top 12 Stocks in George Soros’ Stock Portfolio", "summary": "In this article, we discuss the top 12 stocks in George Soros’ stock portfolio. To skip the details on Soros’ life, investment philosophy, and his fund’s latest bets, go directly to the Top 5 Stocks in George Soros’ Stock Portfolio. Billionaire George Soros is one of the most famous hedge fund managers in the world, […]"}, {"date": "20240324075418", "headline": "16 Most Undervalued Growth Stocks To Buy According To Hedge Funds", "summary": "In this article, we will be taking a look at the 16 most undervalued growth stocks to buy according to hedge funds. To skip our detailed analysis of current stock market dynamics, you can go directly to see the 5 Most Undervalued Growth Stocks To Buy According To Hedge Funds. Growth Stocks in 2023 and […]"}, {"date": "20240324151857", "headline": "Booking Holdings: Consistent Market-Share Gainer At A Discount", "summary": "Booking Holdings is a prominent name in the online travel market. Read why I encourage investors to start accumulating BKNG shares at these levels."}, {"date": "20240325040100", "headline": "Priceline Takes Flight as Breeze Airways' First-Ever OTA Partner", "summary": "Today Priceline, the iconic innovator of online travel, and Breeze Airways, the U.S.' Seriously Nice™ NLCC, or 'Nice Low Cost Carrier,' announced a first-to-market partnership. Priceline is the first online travel agency (OTA) to establish a direct API connection to Breeze, which provides its customers direct access to Breeze Airways' inventory."}, {"date": "20240325051248", "headline": "Despegar: The Booking Holdings Of Latin America With More Catalysts And Growth", "summary": "Despegar, a thriving online travel company, offers excellent investment potential with its profitable growth, expanding market share, and numerous catalysts to move the needle."}, {"date": "20240325060300", "headline": "Booking Holdings Options Trading: A Deep Dive into Market Sentiment", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240325083900", "headline": "The Zacks Analyst Blog Highlights Booking Holdings, Mitsubishi UFJ Financial, Micron Technology, American Electric Power and Alcon", "summary": "Booking Holdings, Mitsubishi UFJ Financial, Micron Technology, American Electric Power and Alcon are part of the Zacks Analyst Blog."}, {"date": "20240325095640", "headline": "Priceline CEO Says Summer Travel Demand Is Still Strong", "summary": "Priceline Chief Executive Officer Brett Keller says the summer travel demand is still strong, especially in Florida. He also says demand for trips to Europe and Asia are strong as well. He talks about how customers are using the Priceline chatbot online too. He speaks on \"Bloomberg Markets.\""}, {"date": "20240325104849", "headline": "3 Growth Stocks to Buy on the Dip: March 2024", "summary": "In the current market environment, the stars are aligning for growth stocks to buy. The macro outlook is positive and the Federal Reserve is dovish. On the macro front, the data continues to be impressive. Economic growth is robust, coming in at 3.2% in the fourth quarter of 2023 and unemployment is low. Particularly encouraging is that leading economic indicators have bottomed and no longer suggest recession. Another catalyst for growth stocks is the Fed’s dovish stance. We just heard from the"}, {"date": "20240325115940", "headline": "You Don't Have To Take Excess Risk To Beat The Market", "summary": ""}, {"date": "20240325121642", "headline": "20 Best Countries for Migration by Investment", "summary": "In this article, we will take a look at 20 Best Countries for Migration by Investment. You can skip our detailed analysis and go directly to the 5 Best Countries for Migration by Investment. With an increased emphasis on the global village concept and greater connectivity between countries through international movement, migration by investment programs […]"}, {"date": "20240325141550", "headline": "Booking.com Ends ‘Possibly Misleading’ Sustainability Program", "summary": "Booking.com's Travel Sustainable program ran into a regulatory buzzsaw."}, {"date": "20240325184659", "headline": "15 Cheapest Latin American Countries To Visit In 2024", "summary": "In this article, we will be covering the 15 cheapest Latin American countries to visit in 2024. If you wish to skip our detailed analysis, you can move directly to the 5 Cheapest Latin American Countries To Visit In 2024. Tourism in Latin America The global tourism industry took a major hit during COVID-19. Travel […]"}, {"date": "20240326064100", "headline": "10 Consumer Discretionary Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240326144844", "headline": "Tracking Lone Pine Capital Portfolio - Q4 2023 Update", "summary": "Lone Pine Capital's 13F portfolio grew to $11.56B, with Meta Platforms, Taiwan Semi, and Microsoft as top holdings. Read the article for more details."}, {"date": "20240326202500", "headline": "3 Companies That Should Follow in Chipotle’s Stock Split Footsteps", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240327025000", "headline": "Behind the Scenes of Booking Holdings's Latest Options Trends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240327115935", "headline": "Booking: Despite New Dividend, Upside Remains Limited", "summary": "Booking's stock performance has been flat this year, and its future potential from 2024 summer travel season is already priced in. Read more on BKNG stock here."}, {"date": "20240327161518", "headline": "Booking Holdings (BKNG) Advances But Underperforms Market: Key Facts", "summary": "In the closing of the recent trading day, Booking Holdings (BKNG) stood at $3,673.50, denoting a +0.34% change from the preceding trading day."}, {"date": "20240327214600", "headline": "Booking Holdings Inc. stock falls Thursday, underperforms market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328044921", "headline": "Booking.com moves towards prioritizing third-party certifications in its commitment to make more sustainable travel choices easier for everyone", "summary": "Reaffirming Booking.com's commitment to showcase more sustainable travel options to all of its customers, and to help support accommodation partners on actions they can take to operate more..."}, {"date": "20240328065000", "headline": "CCL, SPB, RARE, and VRSK are new additions to GS’ Long Duration Basket", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328123621", "headline": "20 Best Stocks to Buy Right Now According to Financial Media", "summary": "In this article, we discuss the 20 best stocks to buy right now according to financial media. If you want to skip our detailed analysis of these stocks, go directly to 5 Best Stocks to Buy Right Now According to Financial Media. The United States economy has been hit hard by inflation concerns in the […]"}, {"date": "20240330040000", "headline": "3 Overlooked Travel Stocks Set to Rebound in 2024", "summary": "The travel industry is roaring back to life in 2024, making it a great time to consider the top overlooked travel stocks to buy. Pent-up demand, relaxed travel restrictions and a new sense of wanderlust are driving a surge in bookings. While airlines are often the first stocks that come to mind for travel investors, this resurgence extends far beyond traditional carriers. These companies represent the different facets of the travel experience, offering investors a diversified approach to capital"}, {"date": "20240331024503", "headline": "The MaM Portfolio: 2024 Q1 Update", "summary": "Moats and Monopolies portfolio beat the QQQ, SPY and the MSCI World index in the quarter. Click here for the MaM portfolio 2024 Q1 update."}, {"date": "20240331222700", "headline": "Booking Holdings Maintains Hold Rating Amid Consistent Performance and Market Alignment", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401060400", "headline": "Here's How Much $100 Invested In Booking Holdings 5 Years Ago Would Be Worth Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401190000", "headline": "Agoda Announces Official Accommodation Partnership for the World Masters Games", "summary": "Global digital travel platform Agoda has been named the Official Accommodation Partner for the World Masters Games (WMG) by its hosts the Taipei City Government Department of Information and Tourism. WMG, organized by the International Masters Games Association (IMGA), will be held in Taiwan in May 2025, and is a global multi-disciplinary sporting event that welcomes anyone aged 30 and above, and no qualification is needed to participate. Unlike other sports games, the registration for WMG is by"}, {"date": "20240401231900", "headline": "Booking Holdings initiated with bullish view at B. Riley", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402101014", "headline": "Why Booking Holdings (BKNG) is Poised to Beat Earnings Estimates Again", "summary": "Booking Holdings (BKNG) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report."}, {"date": "20240402114708", "headline": "Are Investors Warming Up To Dividends? What Meta, Microsoft Tell Investors", "summary": "In the first quarter, three large caps in the S&P 500 initiated dividend payments: Meta Platforms, Salesforce and Booking Holdings. That contributed to a $16 billion increase in U.S. dividends in the first quarter."}, {"date": "20240402120000", "headline": "The Spring Break Stock Surge: 3 Companies Ready to Cash In", "summary": "April is here, and spring break stocks are ready for takeoff. With robust consumer spending and pent-up travel demand, vacation bookings are skyrocketing. Projections indicate a significant uptick in travel volumes for the upcoming months. And, recent data shows 64% of Americans are planning trips in the early weeks of spring alone. The expected spend per person is likely to exceed $1,750. So far in 2024, the US Global Jets ETF (NYSEARCA:JETS) which invests in major airlines, online travel agenc"}, {"date": "20240403015400", "headline": "B. Riley starts 'best-of-breed' Booking Holdings with Buy rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403025500", "headline": "UPS upgraded, PepsiCo downgraded: Wall Street's top analyst calls", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403042600", "headline": "Booking Holdings lands a higher rating initiation than Airbnb from B. Riley", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403091700", "headline": "Booking Holdings (BKNG) to Boost Clientele With Taipei Deal", "summary": "Booking Holdings' (BKNG) Agoda partners with Taipei City Government to serve as the Official Accommodation Partner for WMG in a bid to boost its customer base in Asia."}, {"date": "20240404043400", "headline": "Billionaire Steve Cohen Predicts AI Will Lead To 4-Day Work Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404135410", "headline": "Expedia Group: Travelling Toward Recovery And Breakout From The U.S.", "summary": "Expedia Group dominates the US OTA market, investing in AI to enhance personalization. Click here to read an analysis of EXPE stock now."}, {"date": "20240404212500", "headline": "Booking Holdings Announces New CFO and Transition Plan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404214500", "headline": "Booking Holdings Inc. stock rises Friday, outperforms market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405000500", "headline": "Solar eclipse: Airbnb, United Airlines and other brands set to divvy up $1.5 billion ‘path of totality’ windfall", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405015000", "headline": "Meta, Charles Schwab, Booking Holdings And More On CNBC's 'Final Trades'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405021900", "headline": "US Labor Market Heats Up In March: Payrolls Grow By 303,000, Highest In 10 Months, Dampen June Rate Cut Hopes (UPDATED)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405061100", "headline": "Buy/Sell: Wall Street's top 10 stock calls this week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405063914", "headline": "Booking Holdings to Webcast First Quarter 2024 Financial Results on May 2", "summary": "NORWALK, Conn- Booking Holdings announced today that it intends to hold a conference call to discuss its first quarter 2024 financial results on Thursday, May 2 at 4:30 p.m. ET. The event will be..."}, {"date": "20240406224750", "headline": "Top 2 Growth Stock Bargains To Buy In April", "summary": ""}, {"date": "20240407030300", "headline": "Stock Split Candidates: 3 Companies That Should Take a Page from Chipotle’s Playbook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407153523", "headline": "Top 25 Biggest Internet Companies in the US", "summary": "In this article, we will be taking a look at the top 25 biggest internet companies in the US. If you want to skip our detailed analysis, you can go directly to see the Top 5 Biggest Internet Companies in the US. The Power of the Internet The internet has become an indispensable tool in […]"}, {"date": "20240408212100", "headline": "Booking Holdings's Options: A Look at What the Big Money is Thinking", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411045500", "headline": "Airbnb Faces Growth Hurdles Despite Strong Consumer Preference, Analysts Warn", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412000354", "headline": "Travel Titan Booking Holdings Set For Record Breaking Year", "summary": "Booking Holdings is the largest player in the OTA market, with dominance in the European market. Check out why I'm bullish on BKNG stock."}, {"date": "20240412105800", "headline": "Spring Fever: 3 Travel Stocks Set to Surge as Bookings Bloom", "summary": "With pandemic-era travel restrictions behind us and an improving economic landscape ahead, travel stocks are adjusting to a new era of global travel. Consumer travel rates for air travel, hotel bookings and more are rising rapidly. While inflation certainly exerts some downward pressure on global and domestic travel, indicators of decreasing inflation suggest a potential travel surge as we march through 2024. This presents several top travel stocks to buy this year. These travel stocks represent"}, {"date": "20240413031000", "headline": "Wedgewood Partners Q1 2024 Client Letter", "summary": "Wedgewood Partners recently released their 1st Quarter 2024 Client Letter carrying their commentary and outlook. Click here to read the full letter."}, {"date": "20240415060300", "headline": "Time To Go Shopping, The Tax Pay Sell-Off Is Over", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415161517", "headline": "Booking Holdings (BKNG) Dips More Than Broader Market: What You Should Know", "summary": "The latest trading day saw Booking Holdings (BKNG) settling at $3,485.63, representing a -1.31% change from its previous close."}, {"date": "20240415213300", "headline": "Here's How Much You Would Have Made Owning Booking Holdings Stock In The Last 20 Years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415213800", "headline": "Booking Holdings CEO sells $2.65M in common stock", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416012700", "headline": "Buyback Bonanza: The Top 7 ETFs to Profit From Corporate Cash Splurges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416021700", "headline": "Don't Sleep On These Other Tremendous Stocks Amid AI Mania", "summary": "Here are two companies that are excellent portfolio additions (and not because of artificial intelligence)."}, {"date": "20240416062000", "headline": "Noteworthy Tuesday Option Activity: BKNG, MSFT, JBHT", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416095655", "headline": "Q4 Earnings Highs And Lows: Booking (NASDAQ:BKNG) Vs The Rest Of The Consumer Internet Stocks", "summary": "Let's dig into the relative performance of Booking (NASDAQ:BKNG) and its peers as we unravel the now-completed Q4 consumer internet earnings season."}, {"date": "20240416103658", "headline": "Plan For A Secure Retirement With A $100,000 Aggressive, 15-Stock Dividend Growth Portfolio", "summary": ""}, {"date": "20240416170044", "headline": "Booking Holdings Inc CEO Glenn Fogel Sells Company Shares", "summary": "Booking Holdings Inc (NASDAQ:BKNG), a leader in the online travel industry, provides services through its Booking.com, priceline.com, agoda.com, KAYAK, Rentalcars.com, and OpenTable brands."}, {"date": "20240416224700", "headline": "Bernstein Reaffirms Their Hold Rating on Booking Holdings (BKNG)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416235117", "headline": "Should You Hold Booking Holdings (BKNG)?", "summary": "Wedgewood Partners, an investment management company, released its first quarter 2024 investor letter. A copy of the letter can be downloaded here. In the first quarter, Wedgewood Composite’s net return was 11.5% compared to the Standard & Poor’s 10.6%, Russell 1000 Growth Index’s 11.4%, and Russell 1000 Value Index’s 9.0% return for the same period. […]"}, {"date": "20240417041900", "headline": "This Is What Whales Are Betting On Booking Holdings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417110000", "headline": "Chris DeSaye, CTO of José Andrés Group, and Erick Williams, James Beard Award-Winning Chef, Join OpenTable's Advisory Board", "summary": "OpenTable, a leader in restaurant technology, today announces the appointment of Chris DeSaye, chief technology officer of José Andrés Group, and Chef Erick Williams, chef & owner of Chicago-based Virtue Hospitality Group, to its Advisory Board. As members, DeSaye and Williams will work closely with OpenTable's leadership team to provide strategic guidance in support of OpenTable's mission – helping restaurants thrive."}, {"date": "20240418030600", "headline": "Stay expands property offering with Booking.com partnership", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418080400", "headline": "Stay Expands Property Offering via Booking.com", "summary": "TORONTO, April 18, 2024 (GLOBE NEWSWIRE) -- Stay Inc. (\"Stay\" or the \"Company\"), a vacation rental platform with operations in both Canada and the United States of America, has announced a partnership with Booking.com, one of the world's leading online travel platforms with a mission to make it easier for everyone to experience the world. This strategic partnership allows Stay to expand their global property portfolio to guests worldwide through the properties listed on the Booking.com platform."}, {"date": "20240418234041", "headline": "Market Correction Expected: 20 Stocks To Buy If It Worsens", "summary": "A market correction of 10% or more occurs every 1.2 years, re-adjusting valuations and setting the stage for the next leg up. Click here for a detailed review."}, {"date": "20240419064100", "headline": "10 Consumer Discretionary Stocks Whale Activity In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422025117", "headline": "PKW: Buyback ETF Combining Value And Growth", "summary": "Invesco BuyBack Achievers ETF invests in companies that have reduced shares outstanding by at least 5% in last 12 months. Read more on PKW ETF here."}, {"date": "20240422041000", "headline": "Dividend yield and growth stock list by Goldman", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422050700", "headline": "Latest Booking.com Sustainable Travel Data Reveals Ongoing Challenges for Americans & Highlights a Heightened Opportunity for Cross-Industry Collaboration", "summary": "Today, Booking.com releases new research, with insights gathered from more than 31,000 travelers across 34 countries and territories, exploring the latest consumer attitudes, priorities and influences related to sustainable travel, revealing:"}, {"date": "20240422062900", "headline": "Goldman’s buybacks basket: Buyback growth will be 13% in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422080000", "headline": "Latest Booking.com Sustainable Travel Data Reveals Ongoing Challenges for Canadian Consumers & Highlights the Opportunity for Cross-Industry Collaboration", "summary": "Today, Booking.com releases new research, with insights gathered from more than 31,000 travellers across 34 countries and territories, exploring the latest consumer attitudes, priorities and influences related to sustainable travel, revealing:"}, {"date": "20240422095804", "headline": "40 Best Places to Visit in India Before You Die", "summary": "In this article, we shall discuss the 40 best places to visit in India before you die. To skip our detailed analysis of the tourism industry in India in 2024, go directly and see 10 Best Places to Visit in India Before You Die. According to figures by the World Travel & Tourism Council, India […]"}, {"date": "20240422161520", "headline": "Booking Holdings (BKNG) Rises Yet Lags Behind Market: Some Facts Worth Knowing", "summary": "The latest trading day saw Booking Holdings (BKNG) settling at $3,440.94, representing a +0.76% change from its previous close."}, {"date": "20240423115609", "headline": "Booking : 2024 Proxy Statement and Annual Report", "summary": "TABLE OF CONTENTS NOTICE OF ANNUAL MEETING OF ..."}, {"date": "20240424004700", "headline": "Booking Holdings price target raised by $90 at Jefferies, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424024800", "headline": "Looking At Booking Holdings's Recent Unusual Options Activity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424032500", "headline": "Airbnb could see meaningful upside if company adopts sponsored listings - analyst", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424074511", "headline": "Are You a Growth Investor? This 1 Stock Could Be the Perfect Pick", "summary": "The Zacks Style Scores offers investors a way to easily find top-rated stocks based on their investing style. Here's why you should take advantage."}, {"date": "20240424232700", "headline": "Wex signs new long-term agreement with Booking.com", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425002500", "headline": "WEX Signs Agreement with Leading Online Travel Platform Booking.com", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425080204", "headline": "Booking Holdings (BKNG) Earnings Expected to Grow: Should You Buy?", "summary": "Booking Holdings (BKNG) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240425145506", "headline": "InterContinental Hotels Group's Share Price Leaves No Room For Error", "summary": "InterContinental Hotels is a UK-based hotel company with well-known brands and a robust loyalty program. Read an investment analysis of IHG stock here."}, {"date": "20240425200100", "headline": "Here's How Much $1000 Invested In Booking Holdings 20 Years Ago Would Be Worth Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425200600", "headline": "Catalyst Watch: Apple earnings, Viking IPO, Chinese EV deliveries and Russell indices' Rank Day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425231900", "headline": "Vacation-Bound: 3 Travel Stocks Set to Surge This Summer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426054615", "headline": "20 Countries That Have The Potential To Be Major Tourist Destinations", "summary": "In this article, we shall discuss the 20 countries that have the potential to be major tourist destinations. To skip our detailed analysis of the global tourism industry in 2024, go directly and see 10 Countries That Have The Potential To Be Major Tourist Destinations. Global Tourism Industry Outlook: Key Trends According to World Tourism […]"}, {"date": "20240426161416", "headline": "15 Cheapest European Countries to Visit in 2024", "summary": "This article looks at the 15 cheapest European countries to visit in 2024. If you wish to skip our detailed analysis of Tourism in Europe and ways to budget your vacation, you may skip ahead to 5 Cheapest European Countries to Visit in 2024. Tourism in Europe Europe is by far the most popular tourist […]"}, {"date": "20240426213500", "headline": "Three New Dividend Growth Companies For A Retirement Nest Egg", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428010300", "headline": "Earnings week ahead: Amazon, Apple, Pfizer, AMD, Coca-Cola, Starbucks and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428012226", "headline": "Wall Street Breakfast: The Week Ahead", "summary": "This article discusses the upcoming events in the financial world, including the Federal Reserve meeting, corporate earnings, IPOs, and investor events."}, {"date": "20240428162558", "headline": "10 Leisure and Recreation Services Stocks to Buy", "summary": "In this article, we discuss the 10 leisure and recreation services stocks to buy. To skip our detailed analysis, go directly to the 5 Leisure and Recreation Services Stocks to Buy. During the market downturns of the last five years, the leisure and recreation industry bore the brunt of the damage. Nevertheless, the industry showed […]"}, {"date": "20240429055800", "headline": "Top 3 Internet-Commerce Stocks Poised to Beat on Q1 Earnings", "summary": "We have narrowed our search to three e-commerce stocks that are poised to beat on first-quarter earnings results this week. These are: AMZN, BKNG, W."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429071602", "headline": "Curious about Booking Holdings (BKNG) Q1 Performance? Explore Wall Street Estimates for Key Metrics", "summary": "Get a deeper insight into the potential performance of Booking Holdings (BKNG) for the quarter ended March 2024 by going beyond Wall Street's top -and-bottom-line estimates and examining the estimates for some of its key metrics."}, {"date": "20240429090815", "headline": "trivago: Fair Company, Wonderful Price", "summary": "trivago, still reeling from COVID-19 fallout and facing increasing competitive pressures, is by no means a wonderful company. Find out why TRVG stock is a Buy."}, {"date": "20240429095600", "headline": "Should You Buy Booking Holdings (BKNG) Ahead of Q1 Earnings?", "summary": "Booking Holdings' (BKNG) first-quarter 2024 results are likely to reflect strength in gross bookings, hotel room nights sold, and airline ticket units sold."}, {"date": "20240430080113", "headline": "Coupang, Inc. (CPNG) Reports Next Week: Wall Street Expects Earnings Growth", "summary": "Coupang (CPNG) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240430091400", "headline": "More is More this Mother's Day: OpenTable Reveals Moms May Dine Out Multiple Times (With and Without the Kids) and 62% of Diners Plan to Spend More vs. Last Year", "summary": "The mother of all dining days is upon us: Mother's Day was the biggest dining day of 2023 and the Saturday before (May 13) took the #2 spot,1 according to OpenTable data, pointing to festivities happening all weekend long. Research suggests the trend will continue this year as nearly a third (31%) of American moms being celebrated will consider dining out multiple times for the occasion. This includes without the kids: 31% of moms will consider dining out with friends, 21% will consider a date n"}, {"date": "20240501011050", "headline": "Booking (BKNG) Q1 Earnings Report Preview: What To Look For", "summary": "Online travel agency Booking Holdings (NASDAQ:BKNG) will be reporting results tomorrow after market close. Here's what to expect."}, {"date": "20240501024900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501044400", "headline": "Moody’s, Booking, DraftKings, Amgen Stocks In Focus Ahead Of Earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501070012", "headline": "How to Boost Your Portfolio with Top Retail-Wholesale Stocks Set to Beat Earnings", "summary": "Why investors should use the Zacks Earnings ESP tool to help find stocks that are poised to top quarterly earnings estimates."}, {"date": "20240501080000", "headline": "Booking Holdings to Make First Quarter 2024 Earnings Press Release Available on Company's Investor Relations Website on Thursday, May 2", "summary": "First quarter 2024 financial results for Booking Holdings (NASDAQ: BKNG) will be made available at approximately 4:00 p.m. ET on Thursday, May 2 through a press release posted to the company's Investor Relations website: http://ir.bookingholdings.com."}, {"date": "20240501145748", "headline": "Apple, Novo Nordisk earnings, jobless claims: What to watch", "summary": "A number of companies release their quarterly earning reports on Thursday, including Apple (AAPL), Novo Nordisk (NVO), Shell (SHEL), ConocoPhillips (COP), Cigna (CI), Coinbase (COIN), Moderna (MRNA), DraftKings (DKNG), Kellanova (K), United States Steel (X), and more. On the economic front, jobless claims for the week ending on April 27 will be released. Economists expect claims to rise to 212,000 from 207,000 the prior week. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Nicholas Jacobino"}, {"date": "20240501183500", "headline": "GLOBAL BRIEFING: Federal Reserve notes \"lack of progress\" on inflation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501215600", "headline": "Booking Holdings says not updating FY24 guidance at this time", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501215800", "headline": "Booking Holdings erases post-earnings gains after outlook, now flat afterhours", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501220000", "headline": "Booking Holdings sees Q2 gross bookings growth up 3%-5%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501220600", "headline": "Booking Holdings outperforms rival Expedia as VRBO drag leads to lowered guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501223300", "headline": "Market Today: Coinbase and Block Lead Earnings Surprises, Boosting Tech Stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501234900", "headline": "Fly Intel: After-Hours Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501235500", "headline": "Nasdaq, S&P 500 Futures Rise Ahead Of Apple Earnings: Why This Analyst Thinks 'No Cut' Scenario May Not Be Negative For Market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502020000", "headline": "BKNG Stock Earnings: Booking Holdings Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502040249", "headline": "Booking Holdings Historically Adds to Post-Market Earnings Moves in Following Regular Session", "summary": "Booking Holdings Historically Adds to Post-Market Earnings Moves in Following Regular Session"}, {"date": "20240502045000", "headline": "Big Quarterly Beats After the Bell: AAPL, SQ, COIN & More", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502064100", "headline": "Wall Street Inches Up Post Fed; Chipmakers Rebound; Gold, Crude Falter: What's Driving Market Thursday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502064500", "headline": "Wall Street Inches Up After Powell's Inflation Remarks; Chipmakers Rebound; Gold, Crude Falter: What's Driving Markets Thursday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502065000", "headline": "Notable companies reporting after market close", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502101820", "headline": "Booking Holdings: Q1 Earnings Snapshot", "summary": "NORWALK, Conn. — NORWALK, Conn. — Booking Holdings Inc. on Thursday reported first-quarter profit of $776 million. The Norwalk, Connecticut-based company said it had net income of $22.37..."}, {"date": "20240502102546", "headline": "Booking reports higher quarterly profit on international travel demand", "summary": "May 2 - Booking Holdings reported higherfirst-quarter profit on Thursday, as strong demand forinternational travel offset moderating leisure travel demand inthe U.S. ..."}, {"date": "20240502102919", "headline": "Booking Holdings 1Q Profit Rises As Users Up Frequency", "summary": "By Ben Glickman Booking Holdings said its profit jumped in the first quarter as the company's traveler bookings grew ahead of expectations, buoyed by users traveling more reliably to the..."}, {"date": "20240502104300", "headline": "Booking Holdings shares jump as quarterly revenue climbs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502141855", "headline": "Booking (NASDAQ:BKNG) Beats Q1 Sales Targets, Stock Soars", "summary": "Online travel agency Booking Holdings (NASDAQ:BKNG) reported Q1 CY2024 results beating Wall Street analysts' expectations, with revenue up 16.9% year on year to $4.42 billion. It made a non-GAAP profit of $20.39 per share, improving from its profit of $11.58 per share in the same quarter last year."}, {"date": "20240502141902", "headline": "Booking Holdings Inc. (BKNG) Q1 2024 Earnings Call Transcript", "summary": "Booking Holdings Inc. (NASDAQ:NASDAQ:BKNG) Q1 2024 Earnings Conference Call May 2, 2024 4:30 PM ETCompany ParticipantsGlenn Fogel - Chief Executive..."}, {"date": "20240502142932", "headline": "Booking tops Q1 profit estimates on robust international travel demand", "summary": "Shares of the online travel agency were up 5.25% after the bell.  Travelers are flocking to international destinations in Asia and the Middle East as global air connectivity improves and drives up international travel demand, which is expected to remain strong this year even as demand for domestic travel in North America plateaus.  Gross travel bookings were at $43.5 billion, an increase of 10% from last year, while room nights booked increased 9%."}, {"date": "20240502152343", "headline": "Booking Holdings Stock Jumps As Travel Demand Powers Strong Q1", "summary": "Booking stock jumped in after-hours trading on a strong first quarter report from travel company Booking Holdings."}, {"date": "20240502154257", "headline": "Booking Holdings Inc Surpasses Analyst Revenue and Earnings Estimates in Q1 2024", "summary": "Significant Growth in Revenue and Net Income Highlighted by Strong Operational Performance"}, {"date": "20240502154831", "headline": "Booking Says Room Reservations to Slow Amid Middle-East Conflict", "summary": "(Bloomberg) -- Booking Holdings Inc., owner of travel brands Kayak and Priceline, said it expects room-night reservations to slow in the current quarter as tensions in the Middle East curb regional tourism.Most Read from BloombergSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineTurkey Confirms All Trade Halt With Israel Over War in GazaHuawei Secretly Backs US Research, Awarding Millions in PrizesBiden Calls Ally Japan ‘Xenophobic’ Along With China, RussiaUS and Saudis Near Defense"}, {"date": "20240502164723", "headline": "Booking Holdings Q1 Results: Sustained Travel Demand And Improved Bookings Mix", "summary": "Booking Holdings' direct bookings mix on its online properties continues to drive higher bookings and revenue growth than anticipated. Read more on BKNG here."}, {"date": "20240502165217", "headline": "Booking.Com's Q1 Earnings Show Growth In Travel Demand - Here's Why", "summary": "Booking Holdings Inc. (NASDAQ:BKNG) reported its first-quarter financial results after the bell on Thursday. Here are the key figures from the report. Booking reported quarterly earnings of $20.39 per share, which beat the analyst consensus estimate of $14.06 by 45.02%. The company reported quarterly sales of $4.415 billion, which beat the analyst consensus estimate of $4.254 billion. This represents a 16.86 percent increase over sales of $3.778 billion from the same period last year. Booking sa"}, {"date": "20240502173713", "headline": "20 Beautiful Places in the World Ruined by Overtourism", "summary": "This article looks at the 20 beautiful places in the world ruined by overtourism. If you wish to skip our analysis of over tourism and sustainable travel, please proceed to 5 Beautiful Places in the World Ruined by Overtourism. UNWTO predicts that destinations around the world will host approximately 1.5 billion international tourists in 2024, […]"}, {"date": "20240502180007", "headline": "Booking Holdings (BKNG) Q1 Earnings: Taking a Look at Key Metrics Versus Estimates", "summary": "The headline numbers for Booking Holdings (BKNG) give insight into how the company performed in the quarter ended March 2024, but it may be worthwhile to compare some of its key metrics to Wall Street estimates and the year-ago actuals."}, {"date": "20240502183200", "headline": "GLOBAL BRIEFING: Apple shares climb as firm announces buyback", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502184519", "headline": "Booking Holdings (BKNG) Q1 2024 Earnings Call Transcript", "summary": "BKNG earnings call for the period ending March 31, 2024."}, {"date": "20240502193000", "headline": "Expedia Faces Challenges: Analysts Concerned About Vrbo's Slow Start and B2C Growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502200600", "headline": "Maintaining Hold on Booking Holdings Amid Short-Term Uncertainties and Long-Term Growth Initiatives", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502205600", "headline": "Stock market today: Wall Street rallies after hiring shows welcome signs of cooling", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502213400", "headline": "What You Missed On Wall Street On Friday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502230440", "headline": "Decoding Booking Holdings Inc (BKNG): A Strategic SWOT Insight", "summary": "Uncovering the Financial Fortitude and Market Challenges of Booking Holdings Inc"}, {"date": "20240502231800", "headline": "Booking Holdings: Strong Q1 Performance Balanced by Cautious Q2 Outlook; Maintaining Hold Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502234000", "headline": "Booking Holdings: Hold Rating Maintained Amid Strong Q1 Performance and Cautious Q2 Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502234500", "headline": "RBC Capital Sticks to Its Buy Rating for Booking Holdings (BKNG)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502234500", "headline": "Booking Holdings price target raised by $50 at BofA, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503000400", "headline": "Booking Holdings: A Cautious Outlook Amid Solid Performance and Market Optimism", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503001200", "headline": "Analysts Offer Insights on Consumer Cyclical Companies: Booking Holdings (BKNG), DraftKings (DKNG) and Wayfair (W)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503002000", "headline": "Booking Holdings price target raised by $75 at JPMorgan, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503010000", "headline": "Booking Holdings price target raised by $700 at Evercore ISI, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503010900", "headline": "Oppenheimer Sticks to Their Buy Rating for Booking Holdings (BKNG)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503011900", "headline": "Booking Holdings (BKNG) Gets a Hold from Piper Sandler", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503012200", "headline": "Booking Holdings price target raised by $59 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503012300", "headline": "Wedbush Keeps Their Buy Rating on Booking Holdings (BKNG)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503015700", "headline": "Analysts Offer Insights on Consumer Cyclical Companies: WestRock (WRK), Floor & Decor Holdings (FND) and Booking Holdings (BKNG)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503020300", "headline": "Coinbase Global To Rally Around 22%? Here Are 10 Top Analyst Forecasts For Friday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503021800", "headline": "4 stocks to watch on Friday: BKNG, HSY and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503021900", "headline": "Booking Holdings price target raised by $50 at DA Davidson, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503022800", "headline": "Job Market Cools In April: Payrolls Miss Forecasts, Wages Rise Less Than Expected (UPDATED)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503023000", "headline": "Booking Holdings: Decent First Quarter, Worries About Near-Term Growth Continue", "summary": "Booking Holdings exceeded Q1 expectations, reaffirming its industry leadership. Find out why I reiterate a buy rating for BKNG stock."}, {"date": "20240503023500", "headline": "Expedia's guidance cut triggers downgrade, price target cuts, while Booking advances", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503025500", "headline": "Early notable gainers among liquid option names on May 3rd", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503032100", "headline": "Amgen Posts Upbeat Results, Joins OneSpan, Paylocity Holding, MercadoLibre And Other Big Stocks Moving Higher On Friday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503040200", "headline": "Booking Holdings Inc (BKNG)'s Winning Formula: Financial Metrics and Competitive Strengths", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503041500", "headline": "Booking Holdings (BKNG) Surpasses Q1 Expectations, Outshines Expedia (EXPE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503043000", "headline": "Cyclical stocks earnings recap: 8 out of 16 beat market consensus", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503045900", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503053900", "headline": "Booking Holdings Issues Soft Guidance Despite Strong Q1 Upside; These Analysts Delve Deeper", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503054217", "headline": "Booking Holdings Reports Financial Results for 1st Quarter 2024", "summary": "NORWALK, CT - Booking Holdings Inc. today reported its first quarter 2024 financial results:Gross travel bookings, which refers to the total dollar value, generally inclusive of taxes and fees, of..."}, {"date": "20240503063100", "headline": "Apple, Amgen rise; Expedia, Fortinet fall, Friday, 5/3/2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503065700", "headline": "Stocks Rally As Jobs Report Rekindles Rate Cut Hopes, Apple Rockets, Bitcoin Soars Above $61,000: What's Driving Markets Friday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503093945", "headline": "Why Is Booking (BKNG) Stock Soaring Today", "summary": "Shares of online travel agency Booking Holdings (NASDAQ:BKNG) jumped 7.5% in the pre-market session after the company reported first-quarter results that beat analysts' revenue expectations. The company also smashed adjusted EBITDA estimates. Gross travel booking grew 10% year on year and came in ahead of consensus, highlighting the expanding demand in the tourism space post-pandemic. Other key demand indicators, including Hotel room nights, airline tickets, and rental car days sold, all beat an"}, {"date": "20240503101547", "headline": "Dow Jones Jumps 400 Points As Apple Stock Surges; Nvidia Jumps Again, Tempts New Buyers", "summary": "A weak April jobs report fueled a wave of buying in the stock market today. Apple and Amgen were strong gainers in the Dow Jones."}, {"date": "20240503110000", "headline": "Booking Holdings (BKNG) Q1 Earnings Beat, Revenues Rise Y/Y", "summary": "Booking Holdings' (BKNG) first-quarter 2024 results reflect a rising bookings trend. However, geopolitical tensions in the Middle East region have been concerning."}, {"date": "20240503113708", "headline": "Booking Holdings CEO: Healthy Business on the Books", "summary": "Glenn Fogel, chief executive officer at Booking Holdings Inc., discusses growth expectations after beating first-quarter estimates, travel destinations and alternative accommodations. He speaks on \"Bloomberg Markets.\""}, {"date": "20240503135728", "headline": "Expedia stock sinks on full-year guidance cut, Q1 bookings", "summary": "Earnings season is taking a rain-check on travel site Expedia Group (EXPE) after the company slashed its full-year guidance after first-quarter bookings missed estimates. Expedia's stock is tumbling on this news despite an earnings beat on the top and bottom lines, while Booking Holdings (BKNG) shares, on the other hand, are popping. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Luke Carberry Mogan."}, {"date": "20240503141343", "headline": "Booking Stock Jumps While Expedia Tumbles Following Q1 Reports", "summary": "Booking stock jumped in after-hours trading on a strong first quarter report from travel company Booking Holdings."}]}