{"news": [{"date": "20240412000013", "headline": "BlackRock : Q1 2024 Earnings Supplement", "summary": "April 12, 2024 Q1 2024 Earnings Earnings Release Supplement A broadly diversified business ..."}, {"date": "20240412000105", "headline": "BlackRock Reports First Quarter 2024 Earnings", "summary": "BlackRock, Inc. today released its financial results for the first quarter of 2024. The company’s earnings release and supplemental materials are available via..."}, {"date": "20240412000500", "headline": "Options Volatility and Implied Earnings Moves Today, April 12, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412000613", "headline": "BlackRock: Q1 Earnings Snapshot", "summary": "NEW YORK — NEW YORK — BlackRock Inc. on Friday reported first-quarter net income of $1.57 billion. The New York-based company said it had profit of $10.48 per share. Earnings, adjusted..."}, {"date": "20240412001300", "headline": "BlackRock Surpasses Expectations With Strong Q1 Earnings And Record AUM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412002100", "headline": "Earnings Scheduled For April 12, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412002700", "headline": "BLK Earnings: BlackRock Rises on Q1 Beat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412003300", "headline": "Wall Street Wobbles: Stock Futures Point To Slide As JPMorgan Tumbles 3% While Gold Surges Past $2,400 — Analyst Sees This As 'Worst-Case' Scenario For S&P 500 Pullback", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412004600", "headline": "Buy Rating Affirmed for BlackRock Amid Strong Performance and Positive Future Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412004700", "headline": "Buy Rating on BlackRock: Solid Q1 Earnings and Strong Growth Prospects Despite Revenue Softness", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412004700", "headline": "BlackRock’s Robust Outlook: Siegenthaler Affirms Buy Rating Amid Strong ETF and Fixed-Income Performance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412005600", "headline": "TOP NEWS: BlackRock celebrates boost in quarterly revenue and profit", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412014625", "headline": "BlackRock: EPS up 24% in Q1", "summary": "BlackRock, the world's leading asset manager, reports adjusted net income up 23% year-on-year to $1.47 billion for the first quarter of 2024, or $9.81 per share .The New York-based group saw its..."}, {"date": "20240412020700", "headline": "5 stocks to watch on Friday: JPM, BLK, STT and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412025700", "headline": "Energy, tech, comms among top-rated S&P 500 sectors as Q1 earnings kicks off", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412031400", "headline": "Banking giants amongst least shorted financial stocks in March", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412032000", "headline": "Banking giants amongst least shorted financial stocks ahead of Q1 earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412034519", "headline": "Blackrock CEO Fink Says I Don't Think Inflation Will Get Back To 2% Anytime Soon -CNBC Interview", "summary": "April 12 - * BLACKROCK CEO FINK SAYS I DON’T THINK INFLATION WILL GETBACKTO 2% ANYTIME SOON -CNBC INTERVIEW * BLACKROCK CEO SAYS STILL PROJECTING 2..."}, {"date": "20240412034800", "headline": "Stocks with the least price swings, most attractive option-sale candidates - JPM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412035400", "headline": "BLK Stock Earnings: BlackRock Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412040240", "headline": "BlackRock assets hit record $10.5 trillion as markets surge", "summary": "(Reuters) -Assets at BlackRock hit a record $10.5 trillion in the first quarter and the firm posted a 36% jump in profit as rising global equity markets boosted its investment advisory and administration fees, the world's largest asset manager said on Friday.  Global stock markets rallied in the first quarter on expectations that the world's major central banks were done with monetary policy tightening and would pivot to cutting interest rates, helping boost BlackRock’s assets under management (AUM).  BlackRock's AUM surged 15% in the first quarter from a year earlier, while investment advisory and administration fees, typically a percentage of AUM and the company's chief source of revenue, climbed nearly 8.8% to $3.63 billion."}, {"date": "20240412040404", "headline": "BlackRock Beats Earnings Expectations", "summary": "BlackRock reported first-quarter earnings Friday that surpassed analysts' expectations. Adjusted earnings of $9.81 a share beat analysts' estimates of $9.39. Shares rose 1.7% in premarket trading. Revenue in the period was $4."}, {"date": "20240412040425", "headline": "UPDATE 2-BlackRock hits record $10.5 trillion in assets under management, profit jumps", "summary": "BlackRock reported record assets under management (AUM) of about $10.5 trillion in the first quarter and posted a 36% jump in profit on Friday as a rebound in global equity markets boosted its investment advisory and administration fees.  Global equity markets rallied in the first quarter as expectations grew that the world's major central banks were done with monetary policy tightening and would pivot to rate cuts, resulting in a jump in AUM.  The company's AUM jumped 15% in the first quarter from a year earlier, while investment advisory and administration fees, typically a percentage of AUM and BlackRock's chief source of revenue, climbed nearly 8.8% to $3.63 billion."}, {"date": "20240412041431", "headline": "BlackRock Now Manages a Record $10.5 Trillion", "summary": "BlackRock, the world's largest money manager, reported record assets under management of $10.5 trillion in its first quarter as buoyant markets boosted the firm. Assets rose 15%, or some $1.4 trillion, from a year earlier."}, {"date": "20240412044942", "headline": "BlackRock's Closely Watched Performance Fees Top Expectations", "summary": "BlackRock reported first-quarter performance fees—those it earns through its typically more lucrative, actively managed products—of $204 million, topping Wall Street's expectations.  Increased revenue from alternative products drove higher performance fees from a year ago, the firm said, though those results reflected a drop from last quarter.  BlackRock shares rose nearly 3% in premarket trading on Friday."}, {"date": "20240412045400", "headline": "Bitcoin ETFs Shake Up Investment Landscape", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412050100", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412051003", "headline": "BlackRock (BLK) Q1 Earnings and Revenues Surpass Estimates", "summary": "BlackRock (BLK) delivered earnings and revenue surprises of 4.14% and 0.87%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240412051604", "headline": "BlackRock, Inc. (BLK) Q1 2024 Earnings Call Transcript", "summary": "BlackRock, Inc. (NYSE:NYSE:BLK) Q1 2024 Earnings Conference Call April 12, 2024 7:30 AM ETCompany ParticipantsChris Meade - General CounselLaurence Fink -..."}, {"date": "20240412060300", "headline": "Major banks deliver EPS beat this week to kick off Q1 earnings; JPMorgan FY interest margin guidance unchanged - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412060400", "headline": "The Institutions Are Already In Crypto: Why Web3 Natives Are In The Driver's Seat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412061700", "headline": "Noteworthy Friday Option Activity: BLK, ANET, PNC", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412063000", "headline": "BlackRock's Q1 Equity Fee Rates Were Light Across All Product Types, Analyst Cautions On Fee Rate Dynamics", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412063000", "headline": "How BlackRock (BLK) Stock Stands Out in a Strong Industry", "summary": "BlackRock (BLK) has seen solid earnings estimate revision activity over the past month, and belongs to a strong industry as well."}, {"date": "20240412063100", "headline": "BlackRock (BLK) Beats Q1 Earnings Estimates, Stock Gains", "summary": "Higher revenues, solid increase in AUM balance and a rise in non-operating income support BlackRock's (BLK) Q1 earnings."}, {"date": "20240412070000", "headline": "3 Stocks From the Prospering Investment Management Industry", "summary": "Higher rates and overall asset inflows will likely aid Zacks Investment Management stocks like BlackRock (BLK), SEI Investments (SEIC) and Affiliated Managers (AMG)."}, {"date": "20240412073005", "headline": "Compared to Estimates, BlackRock (BLK) Q1 Earnings: A Look at Key Metrics", "summary": "The headline numbers for BlackRock (BLK) give insight into how the company performed in the quarter ended March 2024, but it may be worthwhile to compare some of its key metrics to Wall Street estimates and the year-ago actuals."}, {"date": "20240412073009", "headline": "Wall Street Analysts Think BlackRock (BLK) Is a Good Investment: Is It?", "summary": "According to the average brokerage recommendation (ABR), one should invest in BlackRock (BLK). It is debatable whether this highly sought-after metric is effective because Wall Street analysts' recommendations tend to be overly optimistic. Would it be worth investing in the stock?"}, {"date": "20240412074216", "headline": "Stocks to Watch Friday:  JPMorgan, Intel, Globe Life", "summary": "↘️ **JPMorgan Chase (JPM)**, **Wells Fargo (WFC)**: The banking giants posted earnings and revenue that trumped Wall Street's expectations. However, JPMorgan projected muted growth for the rest of the year."}, {"date": "20240412075748", "headline": "BlackRock Now Manages Nearly $10.5 Trillion in Assets", "summary": "BlackRock, the world’s largest asset management-firm, reported first-quarter earnings that beat analyst expectations.  Assets under management at BlackRock climbed to a record $10.47 trillion in the first quarter, up 15% on the year, boosted by $57 billion of total net inflows to its investment products.  BlackRock stock was down 1.3% in recenttrading."}, {"date": "20240412082355", "headline": "BlackRock assets under management hit record $10.5T in Q1", "summary": "BlackRock (BLK) shares are rising in pre-market trading after beating first-quarter expectations, with adjusted earnings per share at $9.81 against Wall Street estimates of $9.34. The company's assets under management also climbed to a record $10.47 trillion, a 15% boost from a year ago. BlackRock explained its growth potential in infrastructure, retirement, technology, and whole portfolio solutions will drive the momentum forward. Morning Brief Co-hosts Seana Smith and Brad Smith break down the catalysts for the company's strong performance. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This article was written by Gabriel Roy."}, {"date": "20240412082814", "headline": "Dow Jones Falls On Iran, JPMorgan; Tesla Bull Fears Robotaxi 'Debacle'", "summary": "Futures fell early Friday on Mideast fears and JPMorgan earnings. Tesla bull Dan Ives fears a robotaxi \"debacle.\""}, {"date": "20240412085757", "headline": "BlackRock’s Larry Fink Expects Fed to Cut Rates Once or Twice in 2024", "summary": "(Bloomberg) -- BlackRock Inc. Chief Executive Officer Larry Fink said he expects the Federal Reserve to cut rates twice at the most this year, and that it will be difficult for the central bank to curb inflation.Most Read from BloombergIsrael Bracing for Unprecedented Direct Iran Attack in DaysApple Plans to Overhaul Entire Mac Line With AI-Focused M4 ChipsRussian Attacks on Ukraine Stoke Fears Army Near Breaking PointUS Sees Imminent Missile Strike on Israel by Iran, ProxiesVietnam Tycoon Lan S"}, {"date": "20240412090729", "headline": "Larry Fink lashes out at BlackRock's political critics: They 'continuously lie'", "summary": "BlackRock CEO Larry Fink said political critics 'continuously lie' as the giant money manager faces heat in Washington and states like Texas."}, {"date": "20240412091511", "headline": "BlackRock (BLK) Q1 2024 Earnings Call Transcript", "summary": "BLK earnings call for the period ending March 31, 2024."}, {"date": "20240412100546", "headline": "BlackRock: 15% Annual Returns Since 2004 - And It's Far From Done", "summary": "BlackRockÂ reported strong Q1 2024 earnings, with net inflows of $76 billion and revenue surging by 11% year-over-year. Read my analysis of BLK stock here."}, {"date": "20240412100849", "headline": "Bank Stocks Unravel As JPMorgan Drags Down The Dow", "summary": "JPMorgan dives below critical support on its outlook as bank earnings roll in. BlackRock, Citi post ugly reversals."}, {"date": "20240412101332", "headline": "Bank Earnings Roll In: A Roundup of Journal Coverage", "summary": "Bank earnings season began today, with results from JPMorgan Chase, Wells Fargo and Citigroup.  Next week will bring numbers from Goldman Sachs, among others.  **Here is a roundup of our latest coverage:**  + JPMorgan Chase's first-quarter earnings rose 6%, but the bank projected muted growth for the rest of the year."}, {"date": "20240412135000", "headline": "BlackRock Loses Appeal Over UK Tax Dispute in Barclays Global Investors' Acquisition", "summary": "BlackRock Inc (NYSE:BLK), the world’s largest asset manager, faced a setback in its appeal concerning the U.K. tax it sought to reclaim from HM Revenue & Customs on its $13.5 billion acquisition of Barclays Global Investors (BGI) in 2009. The appeal revolves around a structure BlackRock established during the Barclays acquisition. Specifically, it concerns the U.S. part of the BGI business, acquired through a corporate structure involving a U.K. tax resident entity, LLC5, funded by $4 billion in"}, {"date": "20240412142457", "headline": "BlackRock CEO Larry Fink Says AI Will Boost Productivity, Worker Pay", "summary": "(Bloomberg) -- BlackRock Inc.’s Chief Executive Officer Larry Fink said that his firm’s investment in artificial intelligence will ultimately raise his employees’ pay.Most Read from BloombergIsrael Bracing for Unprecedented Direct Iran Attack in DaysStocks Get Hit as War Jitters Fuel Rush to Bonds: Markets WrapRussian Attacks on Ukraine Stoke Fears Army Near Breaking PointApple Plans to Overhaul Entire Mac Line With AI-Focused M4 ChipsTexas Warns of Possible Power Emergency Next Week“If we conti"}, {"date": "20240412200541", "headline": "Q1 2024 BlackRock Inc Earnings Call", "summary": "Q1 2024 BlackRock Inc Earnings Call"}, {"date": "20240413010144", "headline": "BlackRock Inc (BLK) Q1 2024 Earnings Call Transcript Highlights: Record AUM and Robust ...", "summary": "Unveiling a strong start to 2024, BlackRock reports significant growth in revenue, operating income, and assets under management."}, {"date": "20240413164124", "headline": "15 Best Places to Retire in Oklahoma", "summary": "This article looks at the best places to retire in Oklahoma. If you wish to skip our detailed analysis of retirement savings in America and retirement in Oklahoma, head over to the 5 Best Places to Retire in Oklahoma. Retirement Savings in America The oldest members of the Gen X cohort turn 59 this year, […]"}, {"date": "20240414010600", "headline": "Earnings week ahead: BAC, JNJ, TSM, UNH, ABT, SLB, UAL, PG, NFLX and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414052000", "headline": "East 72 Dynasty Trust - D'Ieteren Group: Belron's Performance Is A Gigantic Windfall", "summary": "For D'Ieteren, the performance of Belron has been a gigantic windfall, which keeps on giving. Click here to read East 72's comprehensive investment thesis."}, {"date": "20240414195500", "headline": "Bitcoin, Stablecoins, Tokenization: BlackRock's Crypto Strategy Explained", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414201100", "headline": "3 Stocks to Buy Low Today With High Hopes for Tomorrow", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414203400", "headline": "The Trillion-Dollar Space Race: 3 of the Best Space Stocks to Buy Leading the Charge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414233500", "headline": "Bull Of The Day: Coinbase Global", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415000200", "headline": "Yes, You Can Play it Safe and Still Buy Crypto: 3 Strong Tokens", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415002000", "headline": "BlackRock price target lowered by $7 at TD Cowen, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415010000", "headline": "BlackRock: This Great Dividend Growth Stock Is A Buy Again (Rating Upgrade)", "summary": "BlackRock's assets under management reached an all-time high to close out the first quarter. Find out why I upgrade BLK stock from hold to buy."}, {"date": "20240415013356", "headline": "Bank Earnings: A Roundup of Journal Coverage", "summary": "Bank earnings season continues today, with results due from Goldman Sachs. That follows results from JPMorgan Chase, Wells Fargo and Citigroup last week. Investors watch bank earnings for news about the individual banks and the financial sector broadly, but also for insights about the state of the economy."}, {"date": "20240415020600", "headline": "Optimistic Outlook for BlackRock: Accelerating Growth and Expanding Opportunities Justify Buy Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415023500", "headline": "BlackRock price target lowered by $15 at Keefe Bruyette, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415025300", "headline": "'Bitcoin Is Just An Extractive Bubble,' Says Portfolio Manager, As Blackrock's Acceptance Fails To Quell Finance Sector Critics", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415040407", "headline": "Jio Financial and Blackrock forms JV to set up wealth management and broking business", "summary": "India's Jio Financial Services has entered into a joint venture with U.S.-based BlackRock Inc to set up a wealth management and broking business, the companies said on Monday...."}, {"date": "20240415062000", "headline": "Smart Money Is Betting Big In BLK Options", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415073300", "headline": "Zacks Industry Outlook Highlights BlackRock, SEI Investments Company and Affiliated Managers", "summary": "BlackRock, SEI Investments Company and Affiliated Managers have been highlighted in this Industry Outlook article."}, {"date": "20240415080407", "headline": "BlackRock doubles down on India bet, signs new JV with Ambani's Jio Financial", "summary": "Jio Financial Services said on Monday that it had entered into a new joint venture (JV) with U.S.-based BlackRock Inc to set up a wealth management and broking business in India less than a year after launching an asset management venture.  Jio Financial Service, part of billionaire Mukesh Ambani-led Reliance Group, said the JV aims to tap into India's increasingly lucrative wealth business and will include the incorporation of a wealth management firm and, subsequently, a brokerage company."}, {"date": "20240415083441", "headline": "UPDATE 2-BlackRock doubles down on India bet, signs new JV with Ambani's Jio Financial", "summary": "Jio Financial Services said on Monday that it had entered into a new joint venture (JV) with U.S.-based BlackRock Inc to set up a wealth management and broking business in India less than a year after launching an asset management venture.  Jio Financial Service, part of billionaire Mukesh Ambani-led Reliance Group, said the JV aims to tap into India's increasingly lucrative wealth business and will include the incorporation of a wealth management firm and, subsequently, a brokerage company."}, {"date": "20240415085700", "headline": "BankUnited (BKU) Loans & Deposit Balances Aid, High Costs Ail", "summary": "BankUnited's (BKU) decent loan and deposit balances and strong fee income sources are likely to bolster revenue growth. However, an elevated expense base and weak asset quality remain concerns."}, {"date": "20240415134303", "headline": "BlackRock First Quarter 2024 Earnings: EPS Beats Expectations", "summary": "BlackRock ( NYSE:BLK ) First Quarter 2024 Results Key Financial Results Revenue: US$4.73b (up 11% from 1Q 2023). Net..."}, {"date": "20240415153100", "headline": "Fixed Income ETFs: Where Should You Invest Now?", "summary": "We discuss bond market opportunities amid 'higher for longer' interest rates."}, {"date": "20240415185300", "headline": "Hunt to insist UK economy 'is on the up' on trip to IMF meetings in US", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415191700", "headline": "Bitcoin Halving May See Rise In King Crypto Sales, Forecasts Crypto.Com CEO, But 'Decent Action' Anticipated Within Next Six Months", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415192000", "headline": "Citigroup's Exit from Municipal Bond Market: Analyzing the Impact", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415205800", "headline": "Silent Surge: The 3 Stocks Quietly Making Millionaires", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415212024", "headline": "BlackRock’s President Sees Markets Primed for a Comeback", "summary": "(Bloomberg) -- BlackRock Inc.’s co-founder sees markets primed for a comeback. Most Read from BloombergBeyond the Ivies: Surprise Winners in the List of Colleges With the Highest ROIIran’s Attack on Israel Sparks Race to Avert a Full-Blown WarS&P 500 Breaks Below 5,100 as Big Tech Sells Off: Markets WrapTrump Media’s $5.3 Billion Selloff Deepens as 270% Rally FizzlesApple Faces Worst iPhone Slump Since Covid as Rivals RiseThere’s almost $9 trillion right now sitting in money market funds, and th"}, {"date": "20240415214800", "headline": "Ken Shih Reaffirms Buy Rating for BlackRock, Citing Market Leadership and Growth Resilience", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415215642", "headline": "India's Jio Financial Services rises 5% after BlackRock wealth management JV", "summary": "Shares of Jio Financial Services rose 5% on Tuesday, a day after it entered into a new joint venture with BlackRock to set up a wealth management and broking business in the country.  The stock has jumped 40% since it was spun out of billionaire Mukesh Ambani-led Reliance Group last year.  Jio Financial and BlackRock's their second joint venture aims to tap into India's increasingly lucrative wealth business and on the growing tribe of retail investors as the country's benchmark stock indices hovering near record highs."}, {"date": "20240416001500", "headline": "Crypto Analyst Warns Bitcoin's Impending Correction As Rally Falters: 'We Are Bearish Risk Assets'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416001818", "headline": "Baloise investor gaining support in campaign to lift voting cap", "summary": "Baloise investor zCapital has won broad support for its campaign to change the voting regulations at the Swiss insurer, the asset manager said on Tuesday. ..."}, {"date": "20240416011600", "headline": "J.P. Morgan Keeps Their Hold Rating on BlackRock (BLK)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416055400", "headline": "3 BlackRock Mutual Funds for Solid Returns", "summary": "Invest in BlackRock mutual funds like MDBAX, MDLRX and PCBAX for consistent returns."}, {"date": "20240416061600", "headline": "Bank of America Securities Sticks to Its Buy Rating for BlackRock (BLK)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416073323", "headline": "BlackRock, Inc. (NYSE:BLK) Q1 2024 Earnings Call Transcript", "summary": "BlackRock, Inc. (NYSE:BLK) Q1 2024 Earnings Call Transcript April 12, 2024 BlackRock, Inc. beats earnings expectations. Reported EPS is $9.81, expectations were $9.35. BLK isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning. My name is Katie, and I […]"}, {"date": "20240416092600", "headline": "Zions Bancorp (ZION) Rides on Loans & Deposits Amid High Costs", "summary": "Zions' (ZION) top line is likely to grow given the solid loans and deposit balances, fee-income strength, high rates and asset-yield repricing. However, mounting expenses and weak asset quality are woes."}, {"date": "20240416103658", "headline": "Plan For A Secure Retirement With A $100,000 Aggressive, 15-Stock Dividend Growth Portfolio", "summary": ""}, {"date": "20240416110929", "headline": "Citi’s Muni Exit Creates Liquidity Test If Downturn Hits Market", "summary": "(Bloomberg) -- The recent departure of Citigroup Inc., a perennial top-10 underwriter of municipal debt, from that industry may eventually pose a challenge in the next muni downturn, said officials at two of the largest market participants.Most Read from BloombergChina Tells Iran Cooperation Will Last After Attack on IsraelUS Two-Year Yield Hits 5% After Powell’s Remarks: Markets WrapBeyond the Ivies: Surprise Winners in the List of Colleges With the Highest ROIIMF Steps Up Its Warning to US Ove"}, {"date": "20240416135003", "headline": "BlackRock, Inc. Just Recorded A 13% EPS Beat: Here's What Analysts Are Forecasting Next", "summary": "Shareholders might have noticed that BlackRock, Inc. ( NYSE:BLK ) filed its quarterly result this time last week. The..."}, {"date": "20240416150003", "headline": "BlackRock’s Aggressive Hunt for Growth in Saudi Arabia", "summary": "(Bloomberg Markets) -- What’s worth your time when you’ve already built the world’s largest asset management company?Most Read from BloombergUS Yields Spike as Hawkish Powell Puts 5% in Play: Markets WrapDubai Grinds to Standstill as Cloud Seeding Worsens FloodingChina Tells Iran Cooperation Will Last After Attack on IsraelBeyond the Ivies: Surprise Winners in the List of Colleges With the Highest ROIPowell Signals Rate-Cut Delay After Run of Inflation SurprisesFor Larry Fink, chief executive of"}, {"date": "20240416191800", "headline": "Market Alert: High Interest Rates May Persist, Impacting Global Stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416205400", "headline": "3 Blue-Chip Stocks to Buy Now: Q2 Edition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416214800", "headline": "BlackRock Inc. stock outperforms competitors on strong trading day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416223300", "headline": "$100 Invested In BlackRock 20 Years Ago Would Be Worth This Much Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417070000", "headline": "Darbonne: The ESG Sword: BlackRock's Life, Death by ESG", "summary": "BlackRock, the $10 trillion investment manager, is getting heat for too much ESG investing, while shareholders are complaining it’s doing too little."}, {"date": "20240417090912", "headline": "Larry Fink Rebukes Political Critics, Calling Them Out For 'Continuously Lying' About The World's Largest Money Manager", "summary": "BlackRock Inc. CEO Larry Fink called out political critics for their continuous lies about anti-woke investment and BlackRock, the world's largest money manager. Fink's troubles began in 2023 when the Select Committee on the Chinese Communist Party of the U.S. House of Representatives launched an investigation into BlackRock's investments with certain Chinese companies. The committee was concerned that BlackRock was among the 40 companies flagged for investing in blacklisted Chinese businesses."}, {"date": "20240417094014", "headline": "BEN vs. BLK: Which Stock Is the Better Value Option?", "summary": "BEN vs. BLK: Which Stock Is the Better Value Option?"}, {"date": "20240417094505", "headline": "Are You Looking for a High-Growth Dividend Stock?", "summary": "Dividends are one of the best benefits to being a shareholder, but finding a great dividend stock is no easy task. Does BlackRock (BLK) have what it takes? Let's find out."}, {"date": "20240417191800", "headline": "Wall Street Invests in Blacklisted Chinese Firms Through Index Funds", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417201800", "headline": "Impact of Federal Reserve's Interest Rate Strategy on Global Markets Featuring Brazil's ...", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418041511", "headline": "Bitcoin price falls ahead of halving as ETF inflows slow", "summary": "Bitcoin has fallen to its lowest level in over a month as inflows from spot BTC exchange-traded funds waver."}, {"date": "20240418050000", "headline": "BlackRock® Canada Announces April Cash Distributions for the iShares® ETFs", "summary": "Listing:TSX (Toronto Stock Exchange) Symbol:CBH, CBO, CDZ, CEW, CLF, CLG, CMR, CPD, CUD, CVD, CYH, FIE, XAGG, XAGG.U, XAGH, XBB, XCB, XCBG, XCBU, XCBU.U, XDG, XDG.U, XDGH, XDIV, XDU, XDU.U, XDUH, XDV, XEB, XEI, XFLB, XFN, XFR, XGB, XHB, XHD, XHU, XHY, XIG, XIGS, XLB, XPF, XQB, XRE, XSAB, XSB, XSC, XSE, XSH, XSHG, XSHU, XSHU.U, XSI, XSTB, XSTH, XSTP, XSTP.U, XTLH, XTLT, XTLT.U, XTR, XUT Listing:Cboe Canada (NEO Exchange Inc.) Symbol:XGGB TORONTO, April 18, 2024 (GLOBE NEWSWIRE) -- BlackRock Asset"}, {"date": "20240418064953", "headline": "15 Best Low Cost ETFs", "summary": "In this article, we discuss 15 best low cost ETFs. If you want to see the top 5 low cost ETFs, head directly to 5 Best Low Cost ETFs. Beginner investors usually go for passive investing, with a focus on consistently increasing wealth over the long term with lower fees and reduced risk. In contrast, […]"}, {"date": "20240418070013", "headline": "Is Trending Stock BlackRock, Inc. (BLK) a Buy Now?", "summary": "Zacks.com users have recently been watching BlackRock (BLK) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects."}, {"date": "20240418093202", "headline": "Blackrock's Rick Rieder Says Still Think The Fed Would Like To Get One Or Two Cuts Done This Year - CNBC Interview", "summary": "April 18 - * BLACKROCK'S RICK RIEDER SAYS STILL THINK THE FED WOULDLIKE TOGET ONE OR TWO CUTS DONE THIS YEAR - CNBC INTERVIEW * BLACKROCK'S RICK RIEDER..."}, {"date": "20240418102400", "headline": "Wall Street Steered Billions to Blacklisted Chinese Companies, House Probe Finds", "summary": "The investigation focused on BlackRock, the world’s largest asset manager, and MSCI, a major compiler of stock indexes. Both firms say they violated no laws."}, {"date": "20240418102954", "headline": "US firms channeled funds to blacklisted Chinese companies, says House panel", "summary": "American financial institutionsfacilitated investments worth billions of dollars in index fundsthat included several blacklisted Chinese companies, accordingto a bipartisan House Committee..."}, {"date": "20240418114554", "headline": "Wall Street steered billions to blacklisted Chinese companies: probe, WSJ reports", "summary": "A congressional investigation found that Wall Street used billions of dollars of American retirement savings and other investments to buy shares in index funds that included several blacklisted Chinese companies, the Wall Street Journal reported on Thursday.  The probe, conducted by a bipartisan House committee empowered to devise strategies for the U.S. to counter China, focused on world's largest asset manager BlackRock and index provider MSCI, the report said.  BlackRock and MSCI did not immediately respond to Reuters requests for comment."}, {"date": "20240418115008", "headline": "US firms facilitated investments into blacklisted Chinese companies, says House probe", "summary": "(Reuters) -U.S. financial firms facilitated investments worth billions of dollars in index funds that included blacklisted Chinese companies, according to a bipartisan House Committee investigation that called for legislation aimed at restricting investment in those Chinese entities.  U.S. index providers and asset managers channeled $6.5 billion last year to 63 Chinese companies flagged by the U.S. government for advancing China's military capabilities or supporting human rights abuses, the probe report unveiled on Thursday said.  The panel said the activity was not illegal, but it called for Congress to pass legislation that would restrict investment in blacklisted entities, as well as require U.S. public companies to disclose risks related to China."}, {"date": "20240418122351", "headline": "Private Credit Funds Get Moody’s Warning on Problem Loans", "summary": "(Bloomberg) -- Moody’s Ratings this week gave private credit investors greater reason for concern about credit quality in the flourishing $1.7 trillion industry.Most Read from BloombergDubai Grinds to Standstill as Flooding Hits CityElon Wants His Money BackRecord Rainfall in Dubai? Blame Climate Change, Not Cloud SeedingSingapore Loses ‘World’s Best Airport’ Crown to QatarRed Lobster Considers Bankruptcy to Deal With Leases and Labor CostsThe ratings company on Monday reduced its outlook for di"}, {"date": "20240418142954", "headline": "UPDATE 1-US firms channeled funds to blacklisted Chinese companies, says House panel", "summary": "American financial institutions facilitated investments worth billions of dollars in index funds that included several blacklisted Chinese companies, according to a bipartisan House Committee investigation.  The Select Committee said it focused on two companies — the world's foremost index provider, MSCI, and the world's largest asset manager, BlackRock,— and also canvassed the broader financial industry.  The committee, in its report, concluded that MSCI indexes alone channeled $3.7 billion and BlackRock invested at least $1.9 billion in these red-flagged entities."}, {"date": "20240418204800", "headline": "BlackRock Unusual Options Activity For April 19", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418211700", "headline": "Powell, Middle East Fears Weigh On Tech Stocks, Treasury Yields Hit 5%, Gold Notches Fifth Week Of Gains: This Week In The Markets", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418234041", "headline": "Market Correction Expected: 20 Stocks To Buy If It Worsens", "summary": "A market correction of 10% or more occurs every 1.2 years, re-adjusting valuations and setting the stage for the next leg up. Click here for a detailed review."}, {"date": "20240419025328", "headline": "Trending tickers: Bitcoin, oil, gold, Netflix", "summary": "The latest investor updates on stocks that are trending on Friday."}, {"date": "20240419060000", "headline": "‘Flash Boys’ Ditch Happy Hour to Compete With Chess Grandmaster", "summary": "(Bloomberg) -- The up-and-comers of Wall Street gathered not around an open bar, but tables with chess boards.Most Read from BloombergElon Wants His Money BackNew York’s Rich Get Creative to Flee State Taxes. Auditors Are On to ThemDubai Grinds to Standstill as Flooding Hits CityIsrael Reported to Have Launched Retaliatory Strike on IranRecord Rainfall in Dubai? Blame Climate Change, Not Cloud SeedingTraders and quants from Goldman Sachs Group Inc., Jane Street and Bank of Montreal were among th"}, {"date": "20240419103625", "headline": "BlackRock And Coinbase Explain Importance Of Bitcoin Halving In New Ad Campaigns", "summary": "The crypto space is fraught with opinions, with celebrities, micro-influencers and community members constantly chiming in to give their take on markets. This can make it difficult for investors to determine what information is important and relevant. However, when topics are discussed by everyone, all the way up to the largest players in the space, it is likely significant. The upcoming Bitcoin halving is a great example. Don't Miss: If you invested $100 in DOGE when Elon Musk first tweeted abo"}, {"date": "20240420020937", "headline": "Blackrock: An Attractive Setup To Buy A Globally Leading Franchise", "summary": "BlackRock outperformed estimates in Q1 2024, as the world's leading investment franchise saw its revenues, operating earnings, and AUM grow by 11%, 18%, and..."}, {"date": "20240420071609", "headline": "10 Best Healthcare Stocks to Buy Under $20", "summary": "In this article, we will be taking a look at the 10 best healthcare stocks to buy under $20. To skip our detailed analysis of the healthcare sector, you can go directly to see the 5 Best Healthcare Stocks to Buy Under $20. Global Healthcare Outlook for 2024 As 2024 progresses, the optimism surrounding the healthcare […]"}, {"date": "20240420213300", "headline": "Weekly Commentary: World-Wide De-Risking/Deleveraging", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421083053", "headline": "BlackRock boss steps up security after anti-woke backlash", "summary": "BlackRock spent nearly $800,000 (£647,000) last year on security for its chief executive Larry Fink following a backlash by activists over the company’s “woke” stance on investing."}, {"date": "20240421220000", "headline": "Move Aside, Big Banks: Giant Funds Now Rule Wall Street", "summary": "Asset managers are growing into huge and complex financial supermarkets that mint billionaires by the dozen."}, {"date": "20240421220024", "headline": "FDIC ponders tighter checks on big ‘passive’ investors in US banks", "summary": "The US Federal Deposit Insurance Corporation is working on proposals aimed at ensuring asset managers do not seek too much influence over the..."}, {"date": "20240422050006", "headline": "Is BlackRock Small Cap Growth Equity A (CSGEX) a Strong Mutual Fund Pick Right Now?", "summary": "Mutual Fund Report for CSGEX"}, {"date": "20240422060044", "headline": "Active Could Be Ideal for Muni Bond Exposure in 2024", "summary": "The start to 2024 by municipal bonds hasn’t been anything to boast about. Neither has it been alarmingly bad. Therefore, It could be inferred active management might be the way to pursue muni bond exposure this year. The ALPS Intermediate Municipal Bond ETF (MNBD) is among the exchange traded funds that bring active management to [...]"}, {"date": "20240422090335", "headline": "Equities gain, gold drops as fears of wider Middle East conflict ease", "summary": "Investors scaledback safe-haven bets on Monday as worries over a wider MiddleEast conflict eased, boosting world equities and pressuringgold, oil and bond prices. MSCI's gauge of..."}, {"date": "20240422092800", "headline": "UBS Group (UBS) to Cut Jobs for $10 Billion Cost Reduction", "summary": "UBS Group (UBS) plans to cut jobs in five separate waves, starting June 2024, to save costs. The other waves are set to take place in the months of August, September, October and November."}, {"date": "20240422114331", "headline": "BlackRock’s Rieder Sees Scope for Two Fed Rate Cuts This Year", "summary": "(Bloomberg) -- Bond investors confronting a painful run-up in yields in the past month may soon find relief from ebbing inflation and the Federal Reserve, according to BlackRock Inc.’s Rick Rieder.Most Read from BloombergTrump Has Only $6.8 Million for Legal Fees With Trial UnderwayRay Dalio’s Famous Trade Is Sputtering, Investors BailingStocks Climb as US Earnings Kick Into High Gear: Markets WrapRussians Transform Dubai as They Flee Putin’s War: Photo EssaySea Billionaire’s Wife to Buy Singapo"}, {"date": "20240422202400", "headline": "5 Investors Betting Big on Spotify (SPOT) Stock", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423052000", "headline": "Globe Life (GL) Q1 Earnings Miss Estimates, Revenues Rise Y/Y", "summary": "Globe Life's (GL) first-quarter results reflect a rise in premiums, improved net investment income and increased insurance underwriting income, offset by higher expenses."}, {"date": "20240423072000", "headline": "Invesco (IVZ) Dips on Q1 Earnings Miss, Y/Y Revenue Decline", "summary": "Invesco (IVZ) records a y/y increase in the AUM balance in the first quarter of 2024."}, {"date": "20240423100600", "headline": "Ameriprise (AMP) Q1 Earnings Beat as Revenues & AUM Rise Y/Y", "summary": "Ameriprise (AMP) records a y/y improvement in the AUM balance in the first quarter of 2024."}, {"date": "20240423113427", "headline": "BlackRock doubled spending on security for CEO Larry Fink amid growing backlash to ESG investing", "summary": "The world’s largest asset manager paid $780,00 last year for security guards and an upgraded security system at Fink’s home, filings show."}, {"date": "20240423162037", "headline": "12 Best Places to Retire in Puerto Rico", "summary": "This article takes a look at the best places to retire in Puerto Rico. If you wish to skip our detailed analysis, you may go to the 5 Best Places to Retire in Puerto Rico. Exploring Alternatives to the American Dream The Sunshine State is no longer the number one retirement destination in the US- […]"}, {"date": "20240423190000", "headline": "Notable Wednesday Option Activity: BLK, NOC, STX", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423230503", "headline": "Decoding MSCI Inc (MSCI): A Strategic SWOT Insight", "summary": "Unveiling the Strengths and Challenges: A Deep Dive into MSCI Inc (MSCI) SWOT Analysis"}, {"date": "20240423233300", "headline": "Ethereum ETF Countdown: Grayscale and BlackRock’s Race Against the SEC Clock", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424004253", "headline": "SEC postpones Ethereum ETF decisions", "summary": "The SEC extends review of Ethereum ETFs and requests public comments on BlackRock's proposal, casting uncertainty on May approvals."}, {"date": "20240424014500", "headline": "Doubling Down On Telus In Smith Maneuver - March 2024 Dividend Income Report", "summary": "Since I started this portfolio in September 2017, I have received a total of $25,263.93 CAD in dividends. Read what investors need to know."}, {"date": "20240424020127", "headline": "Wall Street bosses tested by calls to strip them of power", "summary": "Some of Wall Street’s most powerful bosses are facing new shareholder proposals this spring that would strip them of power by separating CEO and chairman seats."}, {"date": "20240424045700", "headline": "HBAR Crypto Drama: How a BlackRock Report Sent Hedera Token on a Wild Ride", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424080000", "headline": "TotalEnergies partners with Vanguard in US renewable gas venture", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424085053", "headline": "BlackRock Says $12,000 Copper Is Needed to Incentivize New Mines", "summary": "(Bloomberg) -- Copper needs to reach $12,000 a ton — a 20% jump from this week’s high — to incentivize large-scale investments in new mines, said Olivia Markham, who co-manages the BlackRock World Mining Fund.Most Read from BloombergBiden’s Gains Against Trump Vanish on Deep Economic Pessimism, Poll ShowsTaylor Swift Is Proof That How We Critique Music Is BrokenBiden’s New Chopper Is Demoted After Scorching White House LawnTesla Soars as Musk’s Cheaper EVs Calm Fears Over StrategyStock Rally Sta"}, {"date": "20240424090000", "headline": "BlackRock Activates Retirement Solution Offering A Paycheck For Life", "summary": "NEW YORK, April 24, 2024--BlackRock (NYSE: BLK) announced today that its retirement income solution, LifePath Paycheck™, is now available in defined contribution plans."}, {"date": "20240424101916", "headline": "Goldman's David Solomon defeats vote on CEO-chair split even as support for it increases", "summary": "David Solomon defeated a proposal seeking to separate his roles as CEO and chairman of Goldman Sachs, but the measure received double the support it did in 2023."}, {"date": "20240424135236", "headline": "15 Best Places to Retire in Rhode Island", "summary": "This article looks at the best places to retire in Rhode Island. If you wish to skip our analysis of retirement concerns for Gen Zs & Millennials and pros and cons of retirement in Rhode Island, you may go directly to the 5 Best Places to Retire in Rhode Island. Retirement Savings: A Concern for […]"}, {"date": "20240424200000", "headline": "BlackRock® Canada Announces Final April Cash Distributions for the iShares® Premium Money Market ETF", "summary": "Listing: TSX (Toronto Stock Exchange) Symbol: CMR TORONTO, April 24, 2024 (GLOBE NEWSWIRE) -- BlackRock Asset Management Canada Limited (“BlackRock Canada”), an indirect, wholly-owned subsidiary of BlackRock, Inc. (NYSE: BLK), today announced the final April 2024 cash distributions for the iShares Premium Money Market ETF. Unitholders of record on April 25, 2024 will receive cash distributions payable on April 30, 2024. Details regarding the final “per unit” distribution amounts are as follows:"}, {"date": "20240425004224", "headline": "BlackRock Denies Tokenization Partnership with Hedera Hashgraph, HBAR Drops by 35%", "summary": "Asset management giant BlackRock has clarified that it has no commercial relationship with Hedera and did not choose Hedera Hashgraph to tokenize any of its funds."}, {"date": "20240425022800", "headline": "Morgan Stanley Considers Broader Bitcoin ETF Sales Through Broker Network", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425032450", "headline": "Bitcoin price slides amid Grayscale ETF sell-off", "summary": "Bitcoin fell 4% in 24 hours, dipping below $65,000 after outflows from Grayscale's exchange-traded fund hit $130m."}, {"date": "20240425040000", "headline": "BlackRock-backed Decarbonization Partners raises $1.4 bln for first fund", "summary": "Climate-focused investor Decarbonization Partners, a tie-up between BlackRock and Singaporean state investment firm Temasek, said on Thursday it had raised a higher-than-targeted $1.4 billion for its first fund.  Others to back the venture and late-stage growth equity fund, which will focus on companies that can help accelerate the transition to a low-carbon economy, include U.S. insurer Allstate, Spanish lender BBVA and energy firm TotalEnergies.  In total, more than 30 institutional investors from 18 countries invested in the fund, the firm said in a statement, including public and private pension funds, sovereign wealth funds and family offices, helping it pass a $1 billion target."}, {"date": "20240425040000", "headline": "Decarbonization Partners Exceeds Fundraising Target With US$1.40 Billion Final Close for Inaugural Fund", "summary": "NEW YORK & SINGAPORE, April 25, 2024--Decarbonization Partners, a partnership between BlackRock and Temasek focused on investing in next-generation private companies that support the acceleration of decarbonization and the transition to a net-zero economy, today announced the final close of US$1.40 billion for its inaugural late-stage venture capital and growth private equity investment fund, The Decarbonization Partners Fund I (the \"Fund\"), surpassing its fundraising target of US$1 billion."}, {"date": "20240425041622", "headline": "BlackRock-backed Decarbonization Partners raises $1.4 billion for first fund", "summary": "Climate-focused investor Decarbonization Partners, a tie-up between BlackRock and Singaporean state investment firm Temasek, said on Thursday it had raised a higher-than-targeted $1.4 billion for its first fund.  Others to back the venture and late-stage growth equity fund, which will focus on companies that can help accelerate the transition to a low-carbon economy, include U.S. insurer Allstate, Spanish lender BBVA and energy firm TotalEnergies.  In total, more than 30 institutional investors from 18 countries invested in the fund, the firm said in a statement, including public and private pension funds, sovereign wealth funds and family offices, helping it pass a $1 billion target."}, {"date": "20240425050358", "headline": "US bank regulator tables plans to scrutinize asset manager stakes in banks", "summary": "A top US bank regulatoropted not to consider new rules that would have imposed stricteroversight on asset managers with sizeable investments in banks,even as agency officials agreed the matter..."}, {"date": "20240425074900", "headline": "4 Blackrock Mutual Funds to Build a Solid Portfolio", "summary": "Invest in Blackrock mutual funds like BMCAX, BIRAX, MDBAX and BREAX that have given impressive returns in the past and are expected to do the same in 2024 and beyond."}, {"date": "20240425090802", "headline": "The 71-Day Inflow Boom Ends for BlackRock’s Bitcoin ETF Giant", "summary": "(Bloomberg) -- For 71 days in a row, BlackRock Inc.’s Bitcoin fund enjoyed a remarkable run, amassing almost $18 billion in one of the biggest exchange-traded fund launches ever. Now, investors have stopped piling in as the crypto fever eases.Most Read from BloombergUS Economy Slows and Inflation Jumps, Damping Soft-Landing HopesMalaysia in Talks With Tycoons on Casino to Revive $100 Billion Forest CityBiden’s Gains Against Trump Vanish on Deep Economic Pessimism, Poll ShowsBig Tech Surges in La"}, {"date": "20240425112423", "headline": "Record $8.8 bln pulled from US sustainable funds in Q1", "summary": "European and American investors showed converse interest in sustainable funds during the first quarter, research firm Morningstar said on Thursday, with a record $8.8 billion in net withdrawals from the products in the U.S.  A combination of factors likely contributed to the U.S. sustainable fund outflows during the first three months of 2024, said Morningstar.  European consumers, and politicians, have supported greener products and climate-minded regulations."}, {"date": "20240425113824", "headline": "Record $8.8 billion pulled from US sustainable funds in Q1", "summary": "European and American investors showed converse interest in sustainable funds during the first quarter, research firm Morningstar said on Thursday, with a record $8.8 billion in net withdrawals from the products in the U.S.  A combination of factors likely contributed to the U.S. sustainable fund outflows during the first three months of 2024, said Morningstar.  European consumers, and politicians, have supported greener products and climate-minded regulations."}, {"date": "20240425135000", "headline": "BlackRock Memo Reveals Wealth-Management Shuffle Amid ESG Backlash in Texas", "summary": "The asset manager is seeking to expand ties with rich investors and calm a backlash over energy investment strategy, among other areas."}, {"date": "20240426094511", "headline": "Bitcoin ETFs stall: BlackRock ends 71-day streak, Fidelity sees first outflows", "summary": "The Bitcoin ETF frenzy has cooled a bit with the original cryptocurrency hovering near $63,500."}, {"date": "20240428171406", "headline": "Top 12 Alternatives to Edward Jones", "summary": "In this article, we will take a look at the top 12 alternatives to Edward Jones. If you want to skip our detailed analysis, you can go directly to Top 5 Alternatives to Edward Jones. Why are People Choosing Edward Jones Edward Jones is a broker-dealer and investment advisor. Edward Jones focuses on serving individual […]"}, {"date": "20240429033600", "headline": "How Is The Market Feeling About BlackRock?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429040425", "headline": "BlackRock’s Fink Set to Corral Investors at Saudi Summit", "summary": "(Bloomberg) -- BlackRock Inc. is set to host a gathering of top corporate executives and government officials in Riyadh, marking the US firm’s first event on this scale in the Saudi capital and bolstering the kingdom’s efforts to lure foreign investment.Most Read from BloombergTesla Soars on Tentative Approval for Driving System in ChinaStocks Trade for 390 Minutes a Day. Increasingly, Only 10 MatterYen Sparks Intervention Suspicion After U-Turn From 1990 LowsMusk Makes Surprise China Visit in S"}, {"date": "20240429042000", "headline": "3 Winners of the Bitcoin Halving", "summary": "After the halving, several stocks have the potential to follow Bitcoin higher."}, {"date": "20240429043545", "headline": "ISS recommends shareholders vote against BlackRock CEO's pay proposal", "summary": "Proxy advisory firm ISS on Monday recommended that shareholders vote against proposal to ratify BlackRock CEO Larry Fink's 2023 compensation. The proxy advisor said Fink's pay..."}, {"date": "20240429082154", "headline": "UPDATE 2-ISS, Glass Lewis recommend shareholders vote against BlackRock CEO's pay proposal", "summary": "BlackRock shareholders should vote against the proposal to ratify CEO Larry Fink's 2023 compensation at its annual meeting, proxy advisory firms ISS and Glass Lewis said in separate recommendations.  ISS said Fink's pay package totaling roughly $27 million for the year is higher than the industry's median pay for CEOs.  \"While the majority of equity awards are based on clearly disclosed multi-year goals that appear reasonably rigorous, there are significant concerns regarding the process used to determine annual cash incentive awards,\" ISS said."}, {"date": "20240429083545", "headline": "ISS, Glass Lewis recommend shareholders vote against BlackRock CEO's pay proposal", "summary": "ISS said Fink's pay package totaling roughly $27 million for the year is higher than the industry's median pay for CEOs.  \"While the majority of equity awards are based on clearly disclosed multi-year goals that appear reasonably rigorous, there are significant concerns regarding the process used to determine annual cash incentive awards,\" ISS said.  Glass Lewis said it maintains reservations surrounding the structure of the sizable retention awards granted to a handful of executive officers during the year in review."}, {"date": "20240429093725", "headline": "Crypto company Tether invests $200 mln in brain-chip maker Blackrock Neurotech", "summary": "Crypto company Tether has invested $200 million in Blackrock Neurotech, taking a majority stake in the U.S. brain implant company, Tether said in a statement on Monday.  Blackrock Neurotech makes brain-to-computer interfaces, including neural implants which can allow people to control computers and prosthetic arms without moving, its website says.  The deal, which closed on Friday after several months of due diligence, values Blackrock Neurotech at around $350 million, making Tether its largest shareholder, Tether CEO Paolo Ardoino told Reuters."}, {"date": "20240429094137", "headline": "Crypto company Tether invests $200 million in brain-chip maker Blackrock Neurotech", "summary": "Crypto company Tether has invested $200 million in Blackrock Neurotech, taking a majority stake in the U.S. brain implant company, Tether said in a statement on Monday.  Blackrock Neurotech makes brain-to-computer interfaces, including neural implants which can allow people to control computers and prosthetic arms without moving, its website says.  The deal, which closed on Friday after several months of due diligence, values Blackrock Neurotech at around $350 million, making Tether its largest shareholder, Tether CEO Paolo Ardoino told Reuters."}, {"date": "20240429102400", "headline": "Franklin (BEN) Q2 Earnings Miss, Revenues Beat on High AUM", "summary": "Franklin's (BEN) second-quarter fiscal 2024 results display top-line strength and an improvement in the AUM balance, whereas higher expenses were concerning."}, {"date": "20240429120939", "headline": "Proxy Advisers Recommend Voting Against BlackRock CEO Larry Fink's Pay Package", "summary": "Both major proxy advisory firms are recommending shareholders vote against BlackRock Chief Executive Larry Fink's roughly $27 million pay package at the asset manager's annual meeting.  ISS and Glass Lewis separately recommended that shareholders vote against the proposal to ratify the compensation for BlackRock's named executive officers.  Glass Lewis wrote that there was a \"disconnect between pay and performance\" and that total compensation for BlackRock's top executives outpaces the median for peers."}, {"date": "20240429201200", "headline": "BlackRock to boost Saudi Arabia presence with $5B investment from PIF", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429213309", "headline": "Traveloka Repays $300 Million Private Credit to BlackRock, Orion", "summary": "(Bloomberg) -- Traveloka Indonesia PT, one of Southeast Asia’s biggest online travel startups, has repaid a $300 million private credit loan to a group of lenders that include BlackRock Inc. and Orion Capital Asia, according to people familiar with the matter.Most Read from BloombergTesla Soars on Tentative China Approval for Driving SystemStocks Trade for 390 Minutes a Day. Increasingly, Only 10 MatterUS Warns ICC Action on Israel Would Hurt Cease-Fire ChancesYen Sparks Intervention Suspicion A"}, {"date": "20240429214100", "headline": "April Showers On Wall Street:  Miners, Utilities Emerge As Bright Spots In Gloomy Market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429221317", "headline": "Tether Makes Strategic Investment of $200 Million in Blackrock Neurotech to Advance Human Potential", "summary": "In an announcement on April 29, Tether, the issuer of popular stablecoin USDT, revealed its strategic investment of $200 million into Blackrock Neurotech, a leading neural implant company."}, {"date": "20240430103000", "headline": "Certain BlackRock Closed-End Funds Announce Estimated Sources of Distributions", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430110000", "headline": "BlackRock to Get $5 Billion From PIF to Boost Presence in Saudi Arabia", "summary": "(Bloomberg) -- BlackRock Inc. is set to get as much as $5 billion from Saudi Arabia’s sovereign wealth fund to invest in the Middle East and build a Riyadh-based investments team, one more sign that the world’s largest asset manager is intensifying efforts to grow in the kingdom.Most Read from BloombergHSBC CEO Quinn Unexpectedly Steps Down After Almost 5 YearsBinance and CZ’s Fortunes Are Set to Grow, Even in JailWall Street Hit by Fed Jitters to Close Wild April: Markets WrapTesla Soars on Ten"}, {"date": "20240430110053", "headline": "BlackRock to launch Saudi investment firm after $5bn deal with Riyadh", "summary": "BlackRock has struck a deal with the Saudi Arabian government to open a multi-class investment firm in Riyadh, anchored by a $5bn mandate from..."}, {"date": "20240430110317", "headline": "BlackRock to launch PIF-backed Saudi investment platform", "summary": "The world's largest asset manager BlackRock said on Tuesday it plans to launch a new investment platform in Saudi Arabia, backed by up to $5 billion from Saudi sovereign wealth fund the Public Investment Fund (PIF).  BlackRock and PIF said they had signed a memorandum of understanding under which BlackRock would establish a Riyadh-based multi-asset investment platform, anchored by PIF's initial cash injection, subject to certain agreed milestones being hit.  The two parties said the platform would accelerate growth of Saudi Arabia's capital markets, with a Riyadh-based investment team looking to raise additional funds locally and overseas."}, {"date": "20240430110500", "headline": "BlackRock, Saudi Sovereign Wealth Fund to Launch Riyadh-Based Investment Firm", "summary": "BlackRock and Saudi Arabia's sovereign wealth fund have agreed to establish a new multi-asset investment firm based in the Saudi capital.  The new entity, BlackRock Riyadh Investment Management, will invest across a range of asset classes, starting with an anchor investment of up to $5 billion from Saudi Arabia's Public Investment Fund, BlackRock said Tuesday.  BlackRock and the PIF are seeking to accelerate the growth of capital markets in Saudi Arabia by supporting foreign institutional investment in the country."}, {"date": "20240430135203", "headline": "Sector Update: Financial Stocks Decline Late Afternoon", "summary": "Sector Update: Financial Stocks Decline Late Afternoon"}, {"date": "20240430232502", "headline": "BlackRock's Tokenized Asset Fund Surpasses Competitor Franklin Templeton", "summary": "BlackRock's tokenized asset fund, BUIDL, has overtaken the rival offering from Franklin Templeton just six weeks after its launch."}, {"date": "20240501014500", "headline": "Largest borrow rate increases among liquid names", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501033000", "headline": "BlackRock’s Plan for Your Retirement: A 401(k) With a Monthly Check", "summary": "A small-but-growing number of companies are offering plans that promise employees a degree of predictability. The new target-date funds turn a portion of savings into payments for life."}, {"date": "20240501060000", "headline": "BlackRock leads $47 million round for Securitize: ‘Another step in the evolution of our digital assets strategy’", "summary": "Other investors include Hamilton Lane and Tradeweb Markets, with traditional financial firms diving headfirst into tokenization."}, {"date": "20240501062600", "headline": "BlackRock (BLK) Receives a Buy from KBW", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501062900", "headline": "BlackRock Completes Acquisition of SpiderRock Advisors", "summary": "NEW YORK & CHICAGO, May 01, 2024--BlackRock (NYSE: BLK) today announced the completion of its acquisition of SpiderRock Advisors, LLC, a leading provider of option overlay-based strategies for separately managed accounts (SMAs). The acquisition strengthens BlackRock’s ability to deliver a robust platform of SMA solutions and customization capabilities to financial advisors and clients."}, {"date": "20240501063100", "headline": "Securitize announces $47 Million Strategic Funding Round led by BlackRock", "summary": "Securitize, the leader in tokenizing real-world assets, today announced the successful completion of a $47 million funding round led by BlackRock (Nasdaq: BLK). The strategic investment also includes funding from Hamilton Lane (Nasdaq: HLNE), ParaFi Capital, and Tradeweb Markets (Nasdaq: TW)."}, {"date": "20240501064400", "headline": "BlackRock (BLK) Launches Investment Platform in Saudi Arabia", "summary": "BlackRock (BLK) partners with PIF to set up an investment management platform in Saudi Arabia. The strategic move intends to boost the investment management industry in the region."}, {"date": "20240501071504", "headline": "BlackRock TCP (TCPC) Q1 Earnings Match Estimates", "summary": "BlackRock TCP (TCPC) delivered earnings and revenue surprises of 0% and 9.31%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240501073335", "headline": "BlackRock TCP Capital Corp. (TCPC) Q1 2024 Earnings: Surpasses Analyst EPS Forecasts", "summary": "Comprehensive Analysis of Financial Performance and Strategic Developments"}, {"date": "20240501083753", "headline": "US Holds Quarterly Debt Sale Steady, Details Buybacks Start", "summary": "(Bloomberg) -- The US Treasury left its quarterly issuance of longer-term debt unchanged on Wednesday, with the government set to benefit from an expected slowdown in the Federal Reserve’s shrinking holdings of Treasuries.Most Read from BloombergTesla Axes Supercharger Team in Blow to Broader EV MarketNYPD Arrests Over 300 Protesters in Crackdown on College CampusesThe Ozempic Effect: How a Weight Loss Wonder Drug Gobbled Up an Entire EconomyFed to Signal Delay of Interest-Rate CutsLilly Soars a"}, {"date": "20240501103000", "headline": "Distribution Dates and Amounts Announced for Certain BlackRock Closed-End Funds", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501114043", "headline": "New York City pension leader opposes election of Aramco's chief as BlackRock director", "summary": "NEW YORK/BOSTON (Reuters) -A pension fund for New York City employees urged BlackRock's shareholders to vote against the election of Saudi Aramco's chief executive as director, citing potential conflicts of interest around the asset manager's decarbonizing strategy as well as human rights concerns.  The world's top asset manager BlackRock named Amin Nasser, the chief of the world's largest oil company Saudi Aramco as an independent director last year."}, {"date": "20240501122835", "headline": "NYC Pushes BlackRock Investors to Vote Against Aramco CEO", "summary": "(Bloomberg) -- New York City Comptroller Brad Lander is pressing BlackRock Inc. shareholders to vote against the election of Saudi Aramco Chief Executive Officer Amin Nasser as an independent member of the company’s board.Most Read from BloombergUS and Saudis Near Defense Pact Meant to Reshape Middle EastTesla Axes Supercharger Team in Blow to Broader EV MarketNYPD Arrests Over 300 Protesters in Crackdown on College CampusesThe Ozempic Effect: How a Weight Loss Wonder Drug Gobbled Up an Entire E"}, {"date": "20240501125444", "headline": "UPDATE 1-New York City pension leader opposes election of Aramco's chief as BlackRock director", "summary": "A pension fund for New York City employees urged BlackRock's shareholders to vote against the election of Saudi Aramco's chief executive as director, citing potential conflicts of interest around the asset manager's decarbonizing strategy as well as human rights concerns.  The world's top asset manager BlackRock named Amin Nasser, the chief of the world's largest oil company Saudi Aramco as an independent director last year."}, {"date": "20240501133437", "headline": "Update: NYC Comptroller Urges BlackRock Shareholders to Vote Against Saudi Aramco CEO Board Nomination", "summary": "Update: NYC Comptroller Urges BlackRock Shareholders to Vote Against Saudi Aramco CEO Board Nomination"}, {"date": "20240501194149", "headline": "BlackRock, Citadel Reap Billion-Dollar Deals From Australia Fund", "summary": "(Bloomberg) -- Man Group Plc, BlackRock Inc. and Citadel are among big winners from the giant alternatives portfolio held by Australia’s sovereign wealth fund, which has revealed the size of its mandates for the first time.Most Read from BloombergUS and Saudis Near Defense Pact Meant to Reshape Middle EastTesla Axes Supercharger Team in Blow to Broader EV MarketNYPD Arrests Over 300 Protesters in Crackdown on College CampusesThe Ozempic Effect: How a Weight Loss Wonder Drug Gobbled Up an Entire"}, {"date": "20240501214208", "headline": "Q1 2024 Equitable Holdings Inc Earnings Call", "summary": "Q1 2024 Equitable Holdings Inc Earnings Call"}, {"date": "20240502001236", "headline": "SOXX: Wonderful Market Sector Now Trading At An Excessive Price", "summary": "The semiconductor industry has strong differentiation, financial metrics, and competitive advantages. See why I rate iShares Semiconductor ETF (SOXX) as a sell."}, {"date": "20240502010705", "headline": "Q1 2024 BlackRock TCP Capital Corp Earnings Call", "summary": "Q1 2024 BlackRock TCP Capital Corp Earnings Call"}, {"date": "20240502033000", "headline": "BlackRock Anticipates Renewed Institutional Interest In Bitcoin Spot ETFs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502060000", "headline": "BlackRock Invests in Willow to Support Growth of NextGen Investors", "summary": "NEW YORK & BOSTON, May 02, 2024--BlackRock, Inc. (NYSE: BLK) has made a minority investment in Willow Network, Inc. (\"Willow\"), a startup providing services to help financial advisors better serve a growing population of new investors."}, {"date": "20240502070742", "headline": "Record Bitcoin-ETF Outflow Buffets BlackRock, Fidelity Funds", "summary": "(Bloomberg) -- US spot-Bitcoin exchange-traded funds suffered their largest daily outflow as the digital token heads for its worst week since August 2023.Most Read from BloombergUS and Saudis Near Defense Pact Meant to Reshape Middle EastBiden Calls Ally Japan ‘Xenophobic’ Along With China, RussiaSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineTesla Axes Supercharger Team in Blow to Broader EV MarketHuawei Secretly Backs US Research, Awarding Millions in PrizesInvestors pulled a ne"}, {"date": "20240502094600", "headline": "BlackRock (BLK) Acquires SpiderRock, Boosts SMA Offerings", "summary": "BlackRock (BLK) acquires the remaining 75% stake in SpiderRock to further boost its SMA offerings. The impact of the acquisition will be immaterial to 2024 earnings."}, {"date": "20240502111420", "headline": "BlackRock reports first outflows as Bitcoin ETFs shrink 20% since March", "summary": "On Wednesday, outflows were recorded from every spot Bitcoin ETF for the first time, amassing the greatest losses since trading began in January."}, {"date": "20240503005342", "headline": "Tokenization Firm Securitize Secures $47M Funding Round Led by BlackRock", "summary": "Securitize, a tokenization firm based in Miami, has successfully closed a strategic funding round, raising $47 million."}, {"date": "20240503025300", "headline": "JPMorgan Just Raised Its Price Target on Coinbase (COIN) Stock", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503030000", "headline": "Kraken Unit Quietly Claims Pivotal Position in Bitcoin ETF Boom", "summary": "(Bloomberg) -- A unit of crypto exchange Kraken is emerging as a key beneficiary of this year’s boom in spot-Bitcoin exchange-traded funds, which debuted in the US in January and rolled out in Hong Kong this week.Most Read from BloombergSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineApple Rallies on Upbeat Forecast, Record-Setting BuybackTurkey Confirms All Trade Halt With Israel Over War in GazaHuawei Secretly Backs US Research, Awarding Millions in PrizesTrump Auditions VP Picks"}, {"date": "20240503043000", "headline": "‘Your Fund Is Under Attack’: BlackRock Fights to Repel Saba Raid", "summary": "(Bloomberg) -- A few days ago, BlackRock Inc. sent an unusual message to thousands of clients. It contained none of the formulaic language or inscrutable fine print typically packed into these sorts of statements. No, this was a call to arms.Most Read from BloombergSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineApple Rallies on Upbeat Forecast, Record-Setting BuybackTurkey Confirms All Trade Halt With Israel Over War in GazaHuawei Secretly Backs US Research, Awarding Millions in P"}, {"date": "20240503060300", "headline": "3 Stocks to Watch as Bitcoin Spot ETFs Witness Large Outflows", "summary": "BlackRock (BLK), Invesco (IVZ) and WisdomTree (WT) are three asset managers that must be watched closely as the Fed rate decision sparks large outflows from Bitcoin spot ETFs."}, {"date": "20240503094011", "headline": "JHG vs. BLK: Which Stock Should Value Investors Buy Now?", "summary": "JHG vs. BLK: Which Stock Is the Better Value Option?"}, {"date": "20240503094503", "headline": "BlackRock (BLK) Could Be a Great Choice", "summary": "Dividends are one of the best benefits to being a shareholder, but finding a great dividend stock is no easy task. Does BlackRock (BLK) have what it takes? Let's find out."}, {"date": "20240503120500", "headline": "Certain BlackRock Closed-End Funds Announce Adoption of Discount Management Program", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503130702", "headline": "BlackRock-Boaz Weinstein Dispute Turns Even More Bitter", "summary": "Boaz Weinstein's dispute with BlackRock Inc. is growing even sharper as the hedge-fund titan's Saba Capital Management seeks to dump BlackRock from overseeing six closed-end funds and the company fights back with a call-to-arms message to thousands of clients, Bloomberg's Justina Lee tells Sonali Basak on \"Bloomberg Markets.\" (Company name has been updated in headline)"}, {"date": "20240503151200", "headline": "Warren Buffett Might Reveal Berkshire’s Mystery Stock at Annual Meeting", "summary": "The company began accumulating the shares in the second half of 2023. Barron’s has speculated it could be one of these three companies."}, {"date": "20240504081154", "headline": "14 Best Financial Sector Dividend Stocks To Invest In", "summary": "In this article, we discuss 14 best financial sector dividend stocks to invest in. You can skip our detailed analysis of the financial sector and its outlook for this year, and go directly to read 5 Best Financial Sector Dividend Stocks To Invest In. 2023 didn’t start out very rosy for the financial sector, marked […]"}]}