{"news": [{"date": "20240308044820", "headline": "BP's carbon emissions rise for the first time since 2019", "summary": "LONDON (Reuters) -BP said on Friday its overall carbon emissions climbed in 2023 for the first time since 2019 as the company started up new oil and gas projects and increased its production levels.  Direct and indirect emissions from BP's operations, respectively known as Scope 1 and Scope 2 emissions, also rose last year to 32.1 million metric tons of carbon dioxide equivalent, up 0.6% from 31.9 million tons in 2022, its annual report showed."}, {"date": "20240308050744", "headline": "BP hands new CEO Murray Auchincloss £8 million after predecessor Looney's shock exit", "summary": "BP said it was “in our shareholders’ interest” to make him one of the top-paid bosses on the FTSE 100"}, {"date": "20240308070300", "headline": "Here are 3 Integrated Majors Leading the Energy Transition Race", "summary": "There are abundant opportunities for energy companies with a footprint in oil and gas resources and the renewable energy space. Three such companies are BP, Shell (SHEL) and Eni (E)."}, {"date": "20240308084118", "headline": "BP makes Amanda Blanc senior independent director in wake of Looney misconduct scandal", "summary": "BP has elevated Dame Amanda Blanc to the position of senior independent director as it looks to rebuild its reputation following Bernard Looney’s sexual misconduct scandal."}, {"date": "20240308100000", "headline": "BP Awards New Chief £8 Million After Stellar 2023 Performance", "summary": "BP rewarded its new chief executive, Murray Auchincloss, with an £8 million pay package following a better-than-expected profit in 2023."}, {"date": "20240308122233", "headline": "Bitcoin hits $70,000 in new record high", "summary": "Bitcoin reached an all-time high this afternoon, breaching $70,000, as investors become more confident of interest rate cuts by the US Federal Reserve."}, {"date": "20240311060000", "headline": "BP p.l.c. Announces Early Tender Results of Cash Tender Offer for Up to $1.3 Billion Aggregate Principal Amount of One Series of USD Notes", "summary": "BP p.l.c. (\"BP\") (NYSE: BP) (LSE: BP) today announced the early tender results for the previously announced cash tender offer by its wholly-owned subsidiary BP Capital Markets p.l.c. (the \"Offeror\") to purchase for cash any validly tendered (and not validly withdrawn) and accepted Notes up to an aggregate principal amount of $1,300,000,000 (the \"Offer Cap\") of Notes issued by the Offeror (the \"Tender Offer\"). The Tender Offer is being made upon the terms and subject to the conditions set forth i"}, {"date": "20240312024000", "headline": "Unusually active option classes on open March 12th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240312063000", "headline": "Shell Ponders Slowing Carbon-Cut Targets Amid Energy Strategy Revamp: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240312100000", "headline": "AI, Bitcoin And Clean Energy Boom Are Straining U.S. Power Supply", "summary": "Industry insiders have started acknowledging that these technologies powering the fourth industrial revolution are indeed power hungry."}, {"date": "20240312170000", "headline": "Forgotten Gas Reserves Could Be A Gamechanger For European Energy", "summary": "The geologist who helped develop one of Europe's biggest heavy oilfields is back, and he's set his sights on forgotten gas reserves in a bid to bolster the continent's push towards energy independence."}, {"date": "20240313020900", "headline": "Geopolitical Unrest Halts BP, Adnoc's $2B Bid For Israeli Gas Firm", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313021058", "headline": "February's Dividend Portfolio Update Sets New Record - 100 Holdings, 19 Strategic Buys", "summary": "US stocks climbed higher in February, with the DJIA adding 0.4% and the S&P closing in on the 5,000-point mark. Read more here."}, {"date": "20240313024000", "headline": "Unusually active option classes on open March 13th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313041600", "headline": "BP, Adnoc suspend deal to buy $2B stake in Israeli gas field as Gaza war rages", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313044748", "headline": "Trending tickers: Metro Bank, Adidas, BP and ASML", "summary": "The latest investor updates on stocks that are trending on Wednesday."}, {"date": "20240313055655", "headline": "BP and UAE’s $2 Billion Israel Gas Deal Suspended as War Rages", "summary": "(Bloomberg) -- BP Plc and the United Arab Emirates’ state oil firm suspended a $2 billion bid to buy a major stake in Israel’s NewMed Energy as the war in Gaza upends politics across the region.Most Read from BloombergEx-Wall Street Banker Takes On AOC in New York Democratic PrimaryUnited Tells Boeing to Stop Making Its Long Delayed Max 10sPutin Says Ukraine Deal Requires Security Pledges for RussiaPhysical Intelligence Is Building a Brain for RobotsStock Traders Bracing for Worst Shrug Off Hot"}, {"date": "20240313055700", "headline": "BP's Ex-CEO Looney Faces Major Compensation Cut Post Resignation", "summary": "BP's former CEO, Bernard Looney, grapples with a GBP1.8M compensation cut after undisclosed relationships lead to his abrupt resignation in September 2023."}, {"date": "20240313060900", "headline": "Shell (SHEL) Considers Adjusting Its Emission Reduction Strategy", "summary": "Shell (SHEL) considers slowing carbon emission cuts amid an energy strategy update and follows BP's similar move to prioritize shareholder returns."}, {"date": "20240313064100", "headline": "9 Energy Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313075718", "headline": "20 Biggest Natural Gas Companies in the World", "summary": "In this article, we will be covering the 20 biggest natural gas companies in the world. If you want to skip our detailed analysis of the global natural gas market, you can go directly to 5 Biggest Natural Gas Companies in the World. The Global Natural Gas Industry at a Glance Natural gas is an […]"}, {"date": "20240313081840", "headline": "BP and UAE suspend $2 billion gas deal in Israel as Gaza war drags on", "summary": "BP and an oil company owned by the United Arab Emirates have shelved talks to buy a 50% stake in Israel’s leading natural gas producer, judging the $2 billion deal too risky as the war in Gaza rages."}, {"date": "20240313100027", "headline": "Microsoft to Release Security AI Product to Help Clients Track Hackers", "summary": "(Bloomberg) -- Microsoft Corp. plans to release artificial intelligence tools on April 1 that will help cybersecurity workers produce summaries of suspicious incidents and ferret out the devious methods hackers use to obscure their intentions.Most Read from BloombergEx-Wall Street Banker Takes On AOC in New York Democratic PrimaryUnited Tells Boeing to Stop Making Its Long Delayed Max 10sPutin Says Ukraine Deal Requires Security Pledges for RussiaPhysical Intelligence Is Building a Brain for Rob"}, {"date": "20240313115506", "headline": "BP puts $2bn Israel deal on hold amid Gaza war", "summary": "BP has halted talks on a $2bn (£1.56bn) deal to invest in an Israeli gas field as the war with Hamas rages on in Gaza."}, {"date": "20240313130354", "headline": "Elon Musk’s Tesla is ‘growth company with no growth’", "summary": "More than $14.3bn (£11.2bn) has been wiped off the value of Tesla after it was labelled a “growth company with no growth” by a Wall Street bank."}, {"date": "20240314000700", "headline": "Piper Sandler Sticks to Their Hold Rating for BP (BP)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314001700", "headline": "BP price target raised by $2 at Piper Sandler, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314001900", "headline": "BP picks up Ashford site to boost electric charging scope for trucks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314014900", "headline": "Baker Hughes announces 'breakthrough' in flare emissions monitoring", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314015400", "headline": "BP details green credentials in similar push towards net zero as Shell", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314020200", "headline": "Shell to Slow Pace of Carbon-Emission Cuts", "summary": "Anglo-Dutch energy heavyweight said it now targets a 15%-20% reduction by 2030 in the net carbon intensity of the energy products it sells."}, {"date": "20240314062500", "headline": "BP-UAE $2B Israel Gas Deal on Hold Amid Regional Conflict", "summary": "BP and ADNOC suspend a $2B bid for Israel's NewMed Energy amid the Israeli-Gaza conflict."}, {"date": "20240314105536", "headline": "Petrobras: Losing Its Appeal On Lower Distributions, Higher Capex", "summary": "Petrobrasâ\u0080\u0099 new strategic plan bumps Capex significantly and lowers return potential to now be in line with Western peers. Find out why PBR stock is a Sell."}, {"date": "20240314201400", "headline": "BP confirms talks with governments of Venezuela, Trinidad to develop gas field", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314223000", "headline": "BP PLC ADR remains steady Friday, still outperforms market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314232000", "headline": "Crude Oil (CM:CL) Closes Lower despite Bullish Fundamentals", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240315021100", "headline": "LONDON MARKET MIDDAY: FTSE 100 underperforms despite mining, oil boost", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240315030700", "headline": "IN BRIEF: Costain wins place on GBP4 billion carbon capture project", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240315052828", "headline": "15 Countries that Speak English the Best", "summary": "In this article, we will talk about the 15 countries that speak English the best. If you want to skip our detailed analysis, you can go directly to the 5 Countries that Speak English the Best. English is one of the most spoken languages in the world, and the number of English speakers is growing […]"}, {"date": "20240315065400", "headline": "Baker Hughes (BKR) and BP Collaborate on Flare Emissions", "summary": "Baker Hughes (BKR) and BP unite, leveraging the former's Flare.IQ tech to curb emissions from flaring operations, marking a significant advancement in the energy sector's sustainability efforts."}, {"date": "20240315120028", "headline": "BGR: A 6.14%-Yielding Energy CEF With A History Of Underperformance", "summary": "BlackRock Energy & Resources Trust's performance has been underwhelming compared to energy partnerships and index funds. Check out my update on BGR CEF here."}, {"date": "20240316090000", "headline": "Almost all top BP shareholders unhappy with green strategy, claims activist investor", "summary": "Almost all of BP’s biggest shareholders are unhappy with its shift to green energy, an activist investor has claimed, amid a growing backlash over the oil giant’s focus on net zero targets."}, {"date": "20240316100047", "headline": "Shell just showed why Big Oil is reluctant to give up on fossil fuels", "summary": "Shell cut its carbon emissions goals this week, underscoring Big Oil's commitment to fossil fuels."}, {"date": "20240317192700", "headline": "BP resumes normal operations at Midwest's biggest oil refinery", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240318014900", "headline": "LONDON MARKET MIDDAY: FTSE 100 as shakes off pre-interest rate nerves", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240318052022", "headline": "Is BP p.l.c.'s (LON:BP.) Latest Stock Performance Being Led By Its Strong Fundamentals?", "summary": "Most readers would already know that BP's (LON:BP.) stock increased by 5.9% over the past three months. Since the..."}, {"date": "20240318055700", "headline": "BP Explores Trinidad-Venezuela Gas Field Project Partnership", "summary": "BP is in talks for a cross-border collaboration to explore gas field development from Trinidad to Venezuela, highlighting potential economic and geopolitical implications."}, {"date": "20240318062700", "headline": "March’s Energy Stock Sizzlers: 3 Picks Ready to Ignite", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240318170000", "headline": "The Gas Find That Could Transform Europe’s Energy Future", "summary": "De-risking the Welchau play in Austria may not just be a big step toward Austrian energy independence, it may also ease Europe's $800 billion energy crisis."}, {"date": "20240319015200", "headline": "LONDON MARKET MIDDAY: European markets flat ahead of Fed and BoE", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240319043000", "headline": "Hot Stocks: The 3 Best Opportunities for Investing in Hydrogen", "summary": "On March 13, the U.S. Department of Energy announced $750 million in funding for 52 projects across 24 states to support clean hydrogen in America. That’s excellent news for hydrogen stocks. “The Biden-Harris Administration is propelling an American-led clean hydrogen economy that is delivering good-paying, high-quality jobs and accelerating a manufacturing renaissance in communities across America,” said U.S. Secretary of Energy Jennifer M. Granholm. “The projects announced today—funded by the"}, {"date": "20240319051500", "headline": "BP's Whiting Refinery Resumes Full Operations Post-Outage", "summary": "BP's Whiting Refinery bounces back after the February outage, bringing stability to Midwest fuel markets."}, {"date": "20240319065700", "headline": "LONDON MARKET CLOSE: European large-caps rise on eve of Fed decision", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240319105911", "headline": "BP oil refinery in Indiana resumes normal operations weeks after power outage, temporary shutdown", "summary": "BP’s sprawling oil refinery in northwest Indiana has resumed normal operations more than six weeks after a power outage prompted the energy giant to temporarily shut down the complex and evacuate workers.  BP spokesperson Christina Audisho said Tuesday that “the Whiting Refinery is back to normal operations\" at the site along Lake Michigan some 15 miles (24 kilometers) southeast of Chicago.  The refinery is the largest in the U.S. Midwest and sixth-largest nationally, processing about 440,000 barrels of crude oil daily, making a variety of liquid fuels and asphalt."}, {"date": "20240319233100", "headline": "Microsoft’s AI Security Bombshell: Is Copilot a $20B Game-Changer for MSFT Stock?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240320023000", "headline": "Moda Midstream II Announces Equity Commitment from EnCap Flatrock Midstream", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240320070000", "headline": "bp unveils first US bp pulse EV charging Gigahub™ at Houston headquarters", "summary": "bp (NYSE: BP) will celebrate the opening of its new electric-vehicle charging site at its bp America headquarters in Houston, Texas, expanding its network of EV chargers in the US. The new bp pulse station is the first bp pulse branded Gigahub™ in the US and will be open to the public on April 2."}, {"date": "20240320070010", "headline": "Here is What to Know Beyond Why BP p.l.c. (BP) is a Trending Stock", "summary": "Zacks.com users have recently been watching BP (BP) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects."}, {"date": "20240320092400", "headline": "No oil and gas majors aligned with climate targets - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240321034200", "headline": "BP May 3rd Options Begin Trading", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240321050000", "headline": "TETRA TECHNOLOGIES, INC. ANNOUNCES APPOINTMENT OF ANGELA D. JOHN TO ITS BOARD OF DIRECTORS", "summary": "TETRA Technologies, Inc. (\"TETRA\" or the \"Company\") (NYSE: TTI) announced today that its Board of Directors has appointed Angela D. John as a member of the Board of Directors, effective March 20, 2024. With nearly 30 years of experience with BP and Williams, including senior executive business and strategy leadership roles, Ms. John brings great industry and energy transition experience to TETRA. Ms. John will serve as an independent director and a member of the Audit Committee and the Nominatin"}, {"date": "20240321053900", "headline": "BP Electrifies Houston With Launch of Its First US Gigahub", "summary": "BP sets the stage for the future of mobility with the launch of its pioneering EV charging station in Houston, featuring 24 fast-charging points."}, {"date": "20240321063400", "headline": "Global upstream oil and gas spending poised to hit $555B in 2024 - JPM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322092200", "headline": "BP to Reduce Gelsenkirchen Refinery Capacity Amid Demand Shift", "summary": "BP announces plans to reduce Gelsenkirchen refinery capacity by around one-third from 2025, adapting to changing demand and environmental pressures."}, {"date": "20240325065100", "headline": "LONDON MARKET CLOSE: Renewed global tensions put pressure on stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240326003208", "headline": "BP: High Yield, Buybacks, And A Low Valuation Offset Mixed Growth Prospects", "summary": "BP reported better-than-expected earnings in Q4, but revenue was below expectations. Check out why I have a buy rating on BP stock."}, {"date": "20240326014513", "headline": "Chevron: Solid As A Cap Rock But Fairly Valued For Now", "summary": "Chevron maintains surface exploration and production operations in Canada and Kazakhstan's Tengiz Oil field. See why CVX stock is a Hold."}, {"date": "20240326063800", "headline": "Pennsylvania county joins other local governments in suing oil industry over climate change", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328034100", "headline": "Interesting BP Put And Call Options For May 10th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328065945", "headline": "Maritime Disasters Shed Light on Legal Future of Bridge Collapse", "summary": "(Bloomberg) -- Years of legal battles are in store for the owner of the ship that crashed into the Francis Scott Key Bridge in Baltimore this week, to judge by past disasters.Most Read from BloombergLondon Insurers Face Baltimore Bridge Payouts Worth BillionsDubai Is Losing Its Allure for Wealthy RussiansUBS Banker’s Frustration Exposes Cracks in World of Climate FinanceTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly LineBiden Gains Ground Against Trump in Six Key States, Poll Sh"}, {"date": "20240328073151", "headline": "Senegal’s New Leader Plans to Revisit Oil Deals with BP, Kosmos", "summary": "(Bloomberg) -- Newly elected Senegalese President Bassirou Diomaye Faye plans to revisit the contracts of oil and gas projects developed by BP Plc, Kosmos Energy Ltd. and Woodside Energy Group Ltd. in order to boost revenue for the state.Most Read from BloombergLondon Insurers Face Baltimore Bridge Payouts Worth BillionsDubai Is Losing Its Allure for Wealthy RussiansUBS Banker’s Frustration Exposes Cracks in World of Climate FinanceTesla’s $25,000 Car Means Tossing Out the 100-Year-Old Assembly"}, {"date": "20240328083105", "headline": "Shell: LNG Leadership Makes For An Attractive Risk/Reward", "summary": "Shell has lowered the pace of its energy transition and now aims at stable production through 2030. Read why I am highly bullish on SHEL stock here."}, {"date": "20240328093434", "headline": "NewMed Energy: Israel-Based Energy Firm With Strategic Partnerships Is Worth A Look", "summary": "NewMed Energy's stock price is stable as it distributes $50M profit to investors. Click here to read an analysis on DKDRF stock now."}, {"date": "20240331212600", "headline": "Mexico said to cut some oil exports as global supplies tighten", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401060700", "headline": "Oil prices supported by stronger demand in Europe: Goldman Sachs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401190000", "headline": "BP Announces Share Buybacks and Director Changes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401195800", "headline": "BP plc Announces Updated Share Capital and Voting Rights", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401220900", "headline": "LONDON MARKET OPEN: FTSE 100 up as oil majors and gold miners shine", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402055700", "headline": "LONDON MARKET CLOSE: Europe down after Easter holiday weekend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402112022", "headline": "The 3 Best Hydrogen Stocks to Buy in April 2024", "summary": "Hydrogen is vital to advancing cleaner energy sources and lowering carbon emissions. As a much cleaner alternative energy source, the major players interested in zero-carbon transformations and green makeovers are counting on hydrogen power coming into full force. However, hydrogen is difficult and expensive to extract at the scale required for widespread use. That is where these three stocks come in. All three are developing technology and making considerable investments to stay on track for th"}, {"date": "20240403005800", "headline": "Erste Group gets more bullish on BP, upgrades shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403021600", "headline": "Oil Is Exploding Higher and 5 Blue Chip Dividend Integrated Giants Are Cheap", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403042600", "headline": "BP's handling of CEO Looney's sacking wins support from Glass Lewis, ISS", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403070010", "headline": "Investors Heavily Search BP p.l.c. (BP): Here is What You Need to Know", "summary": "BP (BP) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock."}, {"date": "20240403193600", "headline": "BP put volume heavy and directionally bearish", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403233400", "headline": "Gas Price Predictions: What Can You Expect at the Pump in April 2024?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404005800", "headline": "LONDON MARKET MIDDAY: Stocks up as Fed chair calms some rate nerves", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404055500", "headline": "LONDON MARKET CLOSE: US initial jobless claims hotter than expected", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404064500", "headline": "Here's Why Retain Strategy is Apt for BP Stock Right Now", "summary": "BP has a strong presence in refining and marketing spaces, providing support during periods of business turmoil and low oil prices."}, {"date": "20240404214700", "headline": "LONDON MARKET OPEN: Europe slumps on US rate worry and rising tensions", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405010000", "headline": "LONDON MARKET MIDDAY: Stocks drop on Israel-Iran tensions and Fed talk", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407201000", "headline": "BP (NYSE:BP) Looks to Sell Assets, Gains Ground with Shareholders", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407230005", "headline": "BP p.l.c. (LON:BP.) is largely controlled by institutional shareholders who own 76% of the company", "summary": "Key Insights Significantly high institutional ownership implies BP's stock price is sensitive to their trading actions..."}, {"date": "20240408063700", "headline": "BP poised to sell some Trinidad upstream gas assets to Perenco - Reuters", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408195800", "headline": "The top 10 names with relative cheap earnings volume for the season - Barclays", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408203900", "headline": "LONDON BRIEFING: HSBC sells Argentinian arm for USD550 million", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408214400", "headline": "LONDON MARKET OPEN: Stocks shaky ahead of US CPI data, ECB decision", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408215300", "headline": "TOP NEWS: BP predicts upstream production will rise in first quarter", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408232100", "headline": "PRESS: Shell could make London exit if value gap to US does not close", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408234400", "headline": "What's Going On With BP Shares Premarket Today?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409002544", "headline": "BP: Refueling The Cash Engine (Rating Upgrade)", "summary": "BP has shifted its energy transition strategy to a more \"pragmatic\" approach, with a renewed focus on Oil & Gas. See why I upgrade BP stock to a buy."}, {"date": "20240409005018", "headline": "BP sees oil and gas production move higher in first quarter", "summary": "The oil major warned that it would face a hit from lower prices for oil and gas."}, {"date": "20240409005300", "headline": "BP poised for solid Q1 as strong trading, production offset lower oil and gas prices", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409010000", "headline": "LONDON MARKET MIDDAY: FTSE 100 treads water despite boost from miners", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409012754", "headline": "European shares dip ahead of ECB policy decision; BP shines", "summary": "European shares opened lower on Tuesday, with investors stepping to the sidelines ahead of this week's U.S. inflation data and a European Central Bank monetary policy decision, while gains in British energy giant BP and miners kept losses in check.  The pan-European STOXX 600 index was down 0.2%, as of 0716 GMT, after notching its strongest session in more than two weeks on Monday.  Traders kept away from big bets ahead of the key U.S. print on Wednesday and the ECB's decision on Thursday that could determine the outlook for interest rate cuts."}, {"date": "20240409021702", "headline": "Trending tickers: BP, TSMC, HSBC and Auddia", "summary": "The latest investor updates on stocks that are trending on Tuesday."}, {"date": "20240409022700", "headline": "BP Expects Higher Oil, Gas Production to Boost Profit", "summary": "BP expects a boost to first-quarter profits from higher oil, gas and low-carbon energy production, despite weaker gas prices."}, {"date": "20240409022800", "headline": "BP Anticipates Varied Q1 2024 Financial Performance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409030447", "headline": "Stocks to Watch Tuesday: Tesla, BP, Newmont", "summary": "? **Tesla (TSLA)**: The electric-vehicle company reached a settlement with the family of a driver who died in a 2018 crash involving its Autopilot system, days before attorneys were poised to deliver opening statements."}, {"date": "20240409032200", "headline": "IN THE KNOW: BP poised for \"strong quarterly scorecard\" to start 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409034323", "headline": "Diamond Offshore Drilling: Investors Should Look Beyond Recent Rig Incident Impact - Buy", "summary": "Diamond Offshore Drilling reported better-than-expected Q4/2023 results and guided Q1 and FY2024 largely in line with muted expectations. Read more here."}, {"date": "20240409053100", "headline": "BP in Talks to Offload Aging Trinidad Gas Assets to Perenco", "summary": "BP eyes the divestment of aging Trinidad gas field assets to Perenco, with the aim of realigning its energy portfolio. This move signals a significant shift in the global oil and gas market."}, {"date": "20240409055300", "headline": "LONDON MARKET CLOSE: Stocks struggle in nervy trade before US data", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409103000", "headline": "Energy & Utilities Roundup: Market Talk", "summary": "Read about BP, natural-gas futures, Russia’s refining capacity and more in the latest Market Talks covering Energy and Utilities."}, {"date": "20240409190000", "headline": "The Best Performing Energy Stocks Of Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409204700", "headline": "LONDON BRIEFING: Stocks called up ahead of US inflation data", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409214100", "headline": "Johnson Matthey and BP win deal for US sustainable aviation fuel plant", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410001100", "headline": "Analysts Offer Insights on Energy Companies: BP (BP) and Enterprise Products Partners (EPD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410001600", "headline": "BP (BP) Receives a Hold from Piper Sandler", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410020700", "headline": "BP price target raised by $4 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410020800", "headline": "BP Stock Rating Maintained at Hold with Increased Price Target Amidst Q1 Earnings Adjustment", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410020900", "headline": "BP sees Q1 upstream production 'higher compared to prior quarters'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410070500", "headline": "BP Anticipates Robust Q1 Performance Amid Trading Surge", "summary": "BP expects solid Q1 performance, driven by robust trading and production operations, offsetting lower oil prices."}, {"date": "20240410204000", "headline": "Chevron, Occidental raised at Scotiabank; PBF Energy a potential positive Q1 surprise", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411002100", "headline": "Exxon CEO's 2024 total pay bumped up 3% to $36.9M; Chevron CEO pay rose 12%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411015300", "headline": "BP price target raised by $2 at Scotiabank, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411065000", "headline": "ADNOC eyed BP as takeover target, but decided not right fit, Reuters says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411065500", "headline": "UAE's ADNOC decided against pursuing BP after considering takeover, Reuters says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411065900", "headline": "Adnoc recently eyed BP as a takeover target - Reuters", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411071000", "headline": "Here are 3 Key Stocks Leading the Energy Transition Race", "summary": "There are opportunities for energy companies with a footprint in oil & gas resources or transporting commodities and the clean energy space. Three such firms are BP, Shell (SHEL) and Enbridge (ENB)."}, {"date": "20240411074500", "headline": "Chevron (CVX) Exits Yadana Natural Gas Field in Myanmar", "summary": "Chevron (CVX) withdraws from Myanmar's Yadana natural gas field, redistributing its stake to PTTEP and MOGE amid human rights concerns."}, {"date": "20240411115750", "headline": "Exclusive-UAE's ADNOC recently eyed BP as takeover target, sources say", "summary": "The United Arab Emirates' state-owned oil company recently considered buying Britain's BP but the deliberations did not progress beyond preliminary discussions, people familiar with the matter told Reuters.  Abu Dhabi National Oil Company (ADNOC) ultimately decided BP would not be the right fit for its strategy, three people said.  U.S. oil giants are in the midst of the industry's biggest consolidation for decades, but European oil majors have to date not been involved."}, {"date": "20240411143458", "headline": "BP draws takeover interest from UAE oil giant", "summary": "The UAE’s state oil company has explored a multibillion pound takeover of BP in a sign that depressed stock market valuations in the UK have made even the biggest companies bid targets."}, {"date": "20240411192000", "headline": "BP price target raised by 40 GBp at Morgan Stanley", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411214500", "headline": "BP Share Price Nears Key Level Amid Heightened M&A Rumours", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411215800", "headline": "LONDON MARKET OPEN: Stocks get boost thanks to growth in UK economy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412003700", "headline": "TOP NEWS: BP shares rise after reports Adnoc had pondered takeover", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412005100", "headline": "LONDON MARKET MIDDAY: February data spurs end of UK recession hopes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412054423", "headline": "Trending tickers: BP, Gold, Samsung, Apple", "summary": "The latest investor updates on stocks that are trending on Friday."}, {"date": "20240412055600", "headline": "LONDON MARKET CLOSE: Miners lift FTSE 100 but sea of red elsewhere", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412072500", "headline": "BP Considered for Takeover by ADNOC but Deemed Unsuitable", "summary": "BP struggles to keep pace with its competitors, a factor that analysts and investors point to as a significant reason behind its vulnerability to takeovers."}, {"date": "20240412091621", "headline": "3 Hydrogen Stocks to Turn $300K Into $1 Million: April 2024", "summary": "2023 was a forgettable year for hydrogen stocks and the broader clean energy industry. Geopolitical issues, heightened interest rates, and rampant inflationary pressures were to blame for clean energy’s lackluster showing. Moreover, the Direxion Hydrogen ETF (NYSEARCA:HJEN) lost 20% of its value last year. This indicates the challenges confronted by the market. Nonetheless, hydrogen stocks could become multi-bagger investments for investors with a long-term investing horizon. Hydrogen and other"}, {"date": "20240414021944", "headline": "International High Dividend Stocks Turning The Relative Corner, DTH A Buy", "summary": "WisdomTree International High Dividend Fund ETF outperformed EFA since early March and beaten SPY since early February. Find out why DTH ETF is a Buy."}, {"date": "20240414215900", "headline": "LONDON MARKET OPEN: FTSE 100 falls as oil lower despite Iran strikes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414224445", "headline": "Petrobras: Repeating Past Mistakes, I Don't Recommend Buying Shares", "summary": "Petrobras is still reaping good results due to its old divestment strategy and focus on core business. Read why I don't recommend buying PBR stock."}, {"date": "20240415003500", "headline": "Oil slips after Iran's attack on Israel; markets expect limited Israel response", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415005600", "headline": "LONDON MARKET MIDDAY: Oil falls despite rising Iran-Israel tensions", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415040600", "headline": "BP Trims Workforce In Its EV Charging Business: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415042800", "headline": "BP’s EV charging business cuts jobs, reduces global ambitions - Reuters", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415050700", "headline": "BP (NYSE:BP) Cuts 10% of EV Charging Workforce amid Slower Growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415061000", "headline": "LONDON MARKET CLOSE: Investors show nerves after Iran launches drones", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415062700", "headline": "BP Layoffs 2024: What to Know About the Latest BP Job Cuts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415120033", "headline": "Britishvolt’s gigafactory site sold off in electric car blow", "summary": "US private equity investors have bought the site of what had been hoped would become Britain’s first electric car battery gigafactory in a blow to Britain’s net zero ambitions."}, {"date": "20240416000000", "headline": "BP Focuses on Familiar Turf as Its Rivals Push New Oil Exploration Frontiers", "summary": "(Bloomberg) -- For a company that made its name with frontier oil discoveries from Iran to Alaska, BP Plc is notably absent from today’s hottest new oil plays. The company’s head of exploration and production is just fine with that. Most Read from BloombergBeyond the Ivies: Surprise Winners in the List of Colleges With the Highest ROIIran’s Attack on Israel Sparks Race to Avert a Full-Blown WarApple Faces Worst iPhone Slump Since Covid as Rivals RiseIsrael Versus Iran — What All-Out War Could Lo"}, {"date": "20240416043600", "headline": "BP starts oil production from major new platform offshore Azerbaijan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416044200", "headline": "BP starts oil production from a major new platform offshore Azerbaijan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416233800", "headline": "Carbon Done Right advances Sierra Leone rewilding project", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417054200", "headline": "BP's New Offshore Platform in Azerbaijan Goes Operational", "summary": "BP commences oil production from the Azeri Central East platform, aiming to enhance oil production in the Caspian Sea, thereby promising economic growth."}, {"date": "20240417220400", "headline": "IN BRIEF: BP trims executive team in operational restructuring", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418001300", "headline": "BP price target raised by $3 at Piper Sandler, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418001800", "headline": "Piper Sandler Keeps Their Hold Rating on BP (BP)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418002500", "headline": "BP's gas and renewables head to depart, part of organization restructure", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418010200", "headline": "LONDON MARKET MIDDAY: FTSE 100 up despite hawkish Fed rates outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418021300", "headline": "BP to Simplify Organization, Trim Leadership Team", "summary": "BP said the changes are part of a plan to turn it into an integrated energy company and invest more in low-carbon activities."}, {"date": "20240418022800", "headline": "BP Restructures for Strategic Agility", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418043300", "headline": "BP's New Approach: Streamlines Structure For Efficiency And Clarity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418064400", "headline": "BP Restructures, Reduces Executive Team to 10", "summary": "BP said the organizational changes will reduce duplication and reporting line complexity."}, {"date": "20240418081319", "headline": "Senior women leave BP in first management shakeup since Looney misconduct claims", "summary": "Two senior female executives are leaving BP in the first management shakeup since Bernard Looney quit after he was found to have misled the board over a string of workplace affairs."}, {"date": "20240419040500", "headline": "The Energy sector is looking attractive again - SSGA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421072122", "headline": "Shell: A NYSE Listing Won't Be A Game Changer", "summary": "Shell considers a NYSE listing to bridge the valuation gap with US peers."}, {"date": "20240422034600", "headline": "UK shareholder meetings calendar - next 21 days", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422223200", "headline": "BP PLC ADR rises Tuesday, still underperforms market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423054600", "headline": "BP call volume above normal and directionally bullish", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424031600", "headline": "UK shareholder meetings calendar - next 7 days", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424050000", "headline": "Hydrogen Stock Steals: 3 Underpriced Plays to Capitalize on the Boom", "summary": "The United Nations is aiming for a Net Zero Emission by 2050, and because of that, hydrogen has become a viable alternative to fossil fuels. Hydrogen holds a huge potential in the future of clean energy, and investing in hydrogen stocks — while they’re still affordable — should be an investor’s natural response. Fortunately, many companies are now getting into the business of supporting the growing hydrogen sector — companies that are positioning themselves well to benefit from this market. This"}, {"date": "20240424060100", "headline": "Trans Mountain oil shippers worry about risk of delay to full service - Reuters", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424062800", "headline": "TotalEnergies (TTE) Expands Its Renewable Operation in the U.S.", "summary": "TotalEnergies (TTE) continues to expand its renewable energy generation business in the United States. The company aims to generate more than 100 TWh of net clean electricity by 2030."}, {"date": "20240425021000", "headline": "March's Dividend Portfolio Update Sets New All-Time Record - 100 Holdings, 21 Buys", "summary": "Portfolio changes in March focus on BDCs, aiming to increase dividend income by at least $100 each month. Click here for a detailed analysis."}, {"date": "20240425050100", "headline": "BP plc AGM 2024: Shareholders Show Strong Support", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425131602", "headline": "Chris Packham leads protests against Drax over environmental ‘destruction’", "summary": "Broadcaster Chris Packham joined protesters, including some who had flown in from Mississippi, in demonstrations against power station operator Drax at its London AGM."}, {"date": "20240426041300", "headline": "June 7th Options Now Available For BP", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428001505", "headline": "Exxon Mobil: Positioned For Strong Growth And Current Buying Opportunity", "summary": "Exxon Mobil's Q1 2024 earnings results were mixed, beating revenue expectations but missing earnings expectations. See why I rate XOM stock a strong buy."}, {"date": "20240429014852", "headline": "BP p.l.c. (LON:BP.) Shares Could Be 44% Below Their Intrinsic Value Estimate", "summary": "Key Insights Using the 2 Stage Free Cash Flow to Equity, BP fair value estimate is UK£9.33 BP's UK£5.25 share price..."}, {"date": "20240430020100", "headline": "Petrobras' Dividend Thesis Is Clouded by Policy Shifts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430090000", "headline": "bp's Archaea Energy brings online its largest modular RNG plant to date in Kansas", "summary": "Today, bp's Archaea Energy (NYSE: BP) announced the official startup of its largest original Archaea Modular Design (AMD) renewable natural gas (RNG) plant to date in Shawnee, Kansas, just outside of Kansas City. The plant, which is fully-owned by Archaea, is located next to a large, privately-owned landfill."}, {"date": "20240501024700", "headline": "BP Unveils Updated Share Capital Details", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501024900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501033000", "headline": "BP plc Advances Share Buyback Program", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501050600", "headline": "BP Goes Deeper Into Gulf of Mexico, After Triumphs and Tragedy", "summary": "While rivals bank on big new plays in Guyana and Namibia, the new BP CEO is focused on heartland waters off the coast of Louisiana and Texas."}, {"date": "20240501095307", "headline": "Exxon Mobil: ~12% Mid-Term EPS Growth Justifies Premium Valuation", "summary": "Exxon reported a soft Q1 with earnings down 29% YoY as refining income declined by 67% on significantly weaker margins. Find out why XOM stock is a Strong Buy."}, {"date": "20240501195648", "headline": "BP p.l.c.: The Dividend Growth Should Continue To Be Special", "summary": "BP p.l.c. is a strong investment choice in the thriving oil industry, boasting impressive growth, cash flow, and returns. See why BP stock is a Buy."}, {"date": "20240502010200", "headline": "LONDON MARKET MIDDAY: FTSE 100 shines but \"mixed feelings\" after Fed", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502023000", "headline": "Jamie Raskin Slams Big Oil For 'Lying' About Climate Change: 'They Acted Like Maleficent...And Cursed Everyone To Try To Go To Sleep For 100 Years'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502024400", "headline": "UK earnings, trading statements calendar - next 7 days", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502064000", "headline": "Here's Why You Should Bet on BP Stock Ahead of Q1 Earnings", "summary": "Given its substantial buyback programs, a pipeline of upstream projects, significant downstream operations, and attractive valuation, it is wise for investors to buy BP before its Q1 earnings release."}, {"date": "20240502111913", "headline": "Chevron: Solid Q1 2024 Earnings And A Good Long-Term Holding", "summary": ""}, {"date": "20240502231800", "headline": "Oil companies expand offshore drilling, bet on gas, NY Times reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503013000", "headline": "UBS in Crosshairs, Big Oil’s Buybacks: EMEA Earnings Week Ahead", "summary": "(Bloomberg) -- The recent selloff in UBS Group AG shares underscores the Swiss bank’s challenge to demonstrate its Credit Suisse Group AG acquisition is on solid ground.Most Read from BloombergSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineTurkey Confirms All Trade Halt With Israel Over War in GazaHuawei Secretly Backs US Research, Awarding Millions in PrizesBiden Calls Ally Japan ‘Xenophobic’ Along With China, RussiaIn Jamie Dimon's America, the Stock Market Has Already VotedResu"}, {"date": "20240503023700", "headline": "UK earnings, trading statements calendar - next 21 days", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503050500", "headline": "June 14th Options Now Available For BP", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503055200", "headline": "LONDON MARKET CLOSE: FTSE 100 gets boost as investors eye rate cuts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503091129", "headline": "Stocks to watch next week: BP,  Saudi Aramco, Uber, and interest rates", "summary": "Earnings preview of key companies reporting next week and what to look out for."}, {"date": "20240503153447", "headline": "Disney earnings, Fedspeak: What to Watch Next Week", "summary": "As the trading week draws to a close, it's time to look ahead at the key events that will take center stage for Yahoo Finance in the upcoming week. The earnings season continues to unfold, with notable companies such as Disney (DIS), Uber (UBER), and Toyota (TM) scheduled to report their quarterly financial results on Tuesday. Additionally, another round of Federal Reserve commentary is on the horizon. Richmond Fed President Tom Barkin and Fed Governor Lisa Cook are expected to share their perspectives on the central bank's policy outlook. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Angel Smith"}, {"date": "20240504062400", "headline": "Six out of 11 S&P 500 energy stocks post EPS wins, while five of them beat revenue estimates - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}]}