{"news": [{"date": "20240228161000", "headline": "Anheuser-Busch InBev's 4Q Net Profit Falls 33% as Revenue, Volumes Miss Consensus", "summary": "By Ronnie Harui Anheuser-Busch InBev's net profit fell 33% in the fourth quarter of 2023 as both revenue and volumes missed consensus expectations. The..."}, {"date": "20240228162600", "headline": "Anheuser-Busch, Teamsters reach labor agreement to avert strike at U.S. plants", "summary": "Budweiser brewer Anheuser-Busch has reached a contract agreement with the Teamsters union that avoids a strike at its U.S. plants."}, {"date": "20240228163833", "headline": "PCE inflation data, Fedspeak, Dell earnings: What to Watch", "summary": "Yahoo Finance anchors Julie Hyman and Josh Lipton preview the major events slated for Thursday, February 29. The Personal Consumption Expenditures (PCE) index will be closely watched for the latest inflation data and clues into the Federal Reserve's interest rate cut plans. Several Fed officials are also scheduled to speak, including Governor Christopher Waller, Atlanta's Raphael Bostic, Chicago's Austan Goolsbee, and Cleveland's Loretta Mester. Their commentary will provide further insights into potential rate cuts. On the earnings front, reports are expected out from companies like Bath & Body Works (BBWI), Dell (DELL), and Best Buy (BBY). For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Angel Smith"}, {"date": "20240228172600", "headline": "Bud Light’s Troubles Still Aren’t Over. A Strike Could Make Things Worse.", "summary": "The beer brand is still suffering a year after its involvement with transgender influencer Dylan Mulvaney triggered a boycott,"}, {"date": "20240228180300", "headline": "Anheuser-Busch, Teamsters Avert Strike With Tentative Deal", "summary": "The union, which represents about 5,000 brewery workers, had threatened to strike March 1 if a deal wasn’t reached by Thursday."}, {"date": "20240228185654", "headline": "Teamsters, Anheuser-Busch reach tentative deal to avert a strike", "summary": "Anheuser-Busch and the Teamsters union have reached a tentative contract agreement that averts a strike of 5,000 union members, who had been prepared to walk out at midnight Thursday."}, {"date": "20240228190834", "headline": "Anheuser-Busch, Teamsters reach labor agreement that avoids US strike", "summary": "Budweiser brewer Anheuser-Busch has reached a contract agreement with the Teamsters union that avoids a strike at its U.S. plants.  The union had threatened a strike at the brewer’s 12 U.S. plants if an agreement on a new five-year contract wasn’t reached by 11:59 p.m. EST Thursday.  The Teamsters union represents 5,000 Anheuser-Busch workers who brew and package beer and even take care of the company’s legendary Clydesdale horses."}, {"date": "20240228192802", "headline": "Bud Light parent Anheuser-Busch InBev to report earnings as it reaches tentative agreement with union", "summary": "The beleaguered beer giant is looking to move past its troubles as it reaches a new contract with its US brewery workers."}, {"date": "20240228193000", "headline": "AB InBev Reports Full Year and Fourth Quarter 2023 Results", "summary": "BRUSSELS, February 29, 2024--AB InBev (Brussel:ABI) (BMV:ANB) (JSE:ANH) (NYSE:BUD):"}, {"date": "20240228200549", "headline": "AB InBev, Teamsters reach tentative agreement to avert US strike", "summary": "Union members will receive wage increases of $8/hour, including an immediate $4/hour raise in the first year, along with a $2,500 ratification bonus for all members as part of the agreement, Teamsters said in a statement.  The tentative agreement also includes improved wages and better health care and retirement benefits, it said, adding that the ratification vote is expected next week.  The agreement covers 5,000 Teamsters members working at Anheuser-Busch breweries across the United States and averts a strike that was supposed to be held on Thursday, when the existing agreement was set to expire."}, {"date": "20240228205900", "headline": "Anheuser-Busch InBev declares EUR 0.82 annual dividend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240228211900", "headline": "What You Missed On Wall Street On Thursday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240228224300", "headline": "BUD Earnings: Anheuser-Busch Posts Mixed Q4; Averts Labor Strike", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240228230600", "headline": "Anheuser-Busch Inbev: Q4 Earnings Snapshot", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240228230900", "headline": "AB InBev, Teamsters strike tentative deal on labor contract, WSJ reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240228231700", "headline": "The Bud Light troubles at Anheuser Busch InBev continue as it redefines target for Argentina hyperinflation", "summary": "The boycott of Bud Light by U.S. consumers continues, its parent company Anheuser-Busch InBev reported Thursday."}, {"date": "20240228232238", "headline": "Bud Light parent company Anheuser-Busch, Teamsters reach agreement day before contract expiration", "summary": "Anheuser-Busch reached a tentative agreement with the Teamsters union a day before its single master contract for all 12 U.S. locations was set to expire on Feb. 29."}, {"date": "20240228232900", "headline": "Nasdaq, S&P 500 Futures Signal Uncertainty Before Crucial Inflation Data While Bitcoin Rallies On: Why This Analyst Models Solid Gains This Year", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240228235200", "headline": "Anheuser-Busch sees strong performance in Mexico, Brazil and Colombia offset U.S. volume drop", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240229002940", "headline": "Top brewer AB InBev hikes dividend, holds off from new share buyback", "summary": "Investors in the Bud Light brewer may be disappointed by the absence of a new share buyback and worse-than-expected US sales, analysts warned."}, {"date": "20240229004500", "headline": "Stocks and Leap Years—How Markets Usually React to February’s Extra Date. And 5 Other Things to Know Before Markets Open.", "summary": "Coinbase says activity is normalizing after crypto traffic surge swamps the site, Congress faces a vote on extending the stopgap to avert a shutdown, and..."}, {"date": "20240229004600", "headline": "Beer maker Anheuser-Busch InBev reports better-than-expected Q4 earnings despite Bud Light backlash", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240229031600", "headline": "Bud Light Sales Keep Falling. It’s Not All Bad News for the Brewer.", "summary": "The beer brand is still suffering a year after its involvement with transgender influencer Dylan Mulvaney triggered a boycott."}, {"date": "20240229051054", "headline": "Anheuser-Busch (NYSE:BUD) Misses Q4 Sales Targets", "summary": "Beer powerhouse Anheuser-Busch InBev (NYSE:BUD) fell short of analysts' expectations in Q4 FY2023, with revenue down 1.3% year on year to $14.47 billion. It made a GAAP profit of $0.82 per share, down from its profit of $1.41 per share in the same quarter last year."}, {"date": "20240229054632", "headline": "Beer maker Anheuser-Busch InBev sees operating profits rise for 2023 despite backlash over Bud Light", "summary": "The earnings news came hours after the company avoided a strike by 5,000 of its U.S. workers as negotiators reached agreement late Wednesday.  U.S. revenue declined 9.5% for the year and 17.3% in the fourth quarter, “primarily due to the volume decline of Bud Light,” the company said in an earnings news release."}, {"date": "20240229060627", "headline": "Bud Light boycott likely cost Anheuser-Busch InBev over $1 billion in lost sales", "summary": "The world’s largest brewer may have lost as much as $1.4 billion in sales because of the backlash to its brief partnership with a transgender influencer to promote Bud Light beer."}, {"date": "20240229061500", "headline": "Anheuser-Busch InBev GAAP EPS of $0.82, revenue of $14.47B", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240229062955", "headline": "Bud Light trans boycott hammers world’s biggest brewer", "summary": "A growing boycott of Bud Light over its partnership with a transgender influencer has hurt sales at parent group AB InBev."}, {"date": "20240229063814", "headline": "Bud Light parent Anheuser-Busch InBev turns profit as it reaches tentative agreement with union", "summary": "The beleaguered beer giant is looking to move past its troubles as it reaches a new contract with its US brewery workers."}, {"date": "20240229065900", "headline": "Anheuser-Busch avoids strike by reaching deal with union", "summary": "Though tentative, the agreement would include wage increases and greater benefits to the 5,000 manufacturing workers represented by the Teamsters."}, {"date": "20240229080703", "headline": "Anheuser-Busch Inbev SA (BUD) Q4 2023 Earnings Call Transcript", "summary": ""}, {"date": "20240229093257", "headline": "Anheuser-Busch InBev reveals Q4 profit as US sales decline", "summary": "Anheuser-Busch InBev (BUD) stock moves lower Thursday morning — from pre-market trading and into the trading day — after the Budweiser-parent company saw fourth-quarter profitability despite mixed earnings results. AB InBev reported a revenue miss of $14.7 billion — which rose on recent price hikes — while adjusted earnings per share eked out gains of $0.82. Yahoo Finance Retail Reporter Brooke DiPalma highlights the beer distributor's performance, breaking down its US sales and volume figures. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan."}, {"date": "20240229103300", "headline": "Anheuser-Busch InBev S.A. ADR underperforms Thursday when compared to competitors", "summary": "The Anheuser-Busch InBev S.A. ADR slid 3.33% to $60.37 Thursday, on what proved to be an all-around positive trading session for the stock market, with the..."}, {"date": "20240229114200", "headline": "AB InBev (BUD) Q4 Earnings Beat Estimates, Revenues Miss", "summary": "AB InBev's (BUD) Q4 results reflect gains from positive business trends on continued consumer demand, investment in its brands and accelerated digital transformation."}, {"date": "20240229143038", "headline": "Anheuser-Busch InBev/NV (BUD) Q4 2023 Earnings Call Transcript", "summary": "BUD earnings call for the period ending December 31, 2023."}, {"date": "20240229160100", "headline": "Bud Light remains drag on parent company as Dylan Mulvaney hit lingers", "summary": "Anheuser-Busch InBev continues to suffer from the boycott against its Bud Light brand nearly a year after its controversial partnership with transgender influencer Dylan Mulvaney."}, {"date": "20240301044600", "headline": "5 Ultra-Yield S&P 500 Stocks Are a Steal Now", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240301050600", "headline": "AB InBev price target raised by EUR 1 at Deutsche Bank", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240301062200", "headline": "AB InBev price target lowered by EUR 4 at Barclays", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240301064119", "headline": "Bud Light beer boycott may now have a price tag, as AB InBev notches a $1.4bn drop in U.S. sales following transgender influencer row", "summary": "AB InBev CEO Michel Doukeris said the group’s “growth potential was constrained\" by U.S. performance but is seeing signs of recovery."}, {"date": "20240301090316", "headline": "Anheuser-Busch InBev SA/NV (NYSE:BUD) Q4 2023 Earnings Call Transcript", "summary": "Anheuser-Busch InBev SA/NV (NYSE:BUD) Q4 2023 Earnings Call Transcript February 29, 2024 Anheuser-Busch InBev SA/NV beats earnings expectations. Reported EPS is $0.82, expectations were $0.76. Anheuser-Busch InBev SA/NV isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Welcome to Anheuser-Busch InBev’s […]"}, {"date": "20240301100000", "headline": "Diesel distancing propels alternative fuel options", "summary": "Natural gas, battery and fuel cell electric vehicles all vie to displace diesel. Which will win? Maybe all of them. The post Diesel distancing propels alternative fuel options appeared first on FreightWaves."}, {"date": "20240301100424", "headline": "Teamsters, Anheuser-Busch reach new 5-year contract", "summary": "The Teamsters and Anheuser-Busch have reached a new five-year contract covering 5,000 workers across operations in the U.S. The post Teamsters, Anheuser-Busch reach new 5-year contract appeared first on FreightWaves."}, {"date": "20240301103300", "headline": "Anheuser-Busch InBev S.A. ADR underperforms Friday when compared to competitors", "summary": "The Anheuser-Busch InBev S.A. ADR slid 0.33% to $60.17 Friday, on what proved to be an all-around favorable trading session for the stock market, with the..."}, {"date": "20240301170000", "headline": "Here's how much money Bud Light lost from recent boycott", "summary": "Bud Light's sales took a hit after facing backlash for its campaign with a transgender influencer."}, {"date": "20240302232804", "headline": "Pernod Ricard: Expensive, Emerging Markets Will Likely Drive Long-Term Growth", "summary": "Pernod Ricard is expanding internationally and investing heavily in emerging markets like India and China. Read why I rate the stock a Hold now."}, {"date": "20240303033100", "headline": "Passive Income Investors Love The 5 Highest Yielding Dividend Kings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240303190000", "headline": "Goldman Sachs Has 3 New Staple Stock Favorites", "summary": "Goldman Sachs analyst Bonnie Herzog said the companies will see their gross margins benefit from falling inflation."}, {"date": "20240304052500", "headline": "European stocks that are sensitive to lower consumer consumption - JPM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240304103300", "headline": "Anheuser-Busch InBev S.A. ADR falls Monday, still outperforms market", "summary": "The Anheuser-Busch InBev S.A. ADR sank 0.12% to $60.10 Monday, on what proved to be an all-around rough trading session for the stock market, with the S&P..."}, {"date": "20240304172553", "headline": "7 Consumer Staples Stocks to Load Up on Amid Market Uncertainty", "summary": "While the market continues to climb a wall of worries, it’s not a bad idea to consider diversifying into consumer staples stocks to buy. No, the idea here isn’t necessarily to get rich off the ideas (though that would be nice). Instead, it’s to mitigate volatility risks. Sure, a broader downdraft tends to impact all securities. However, certain companies and industries should be able to withstand the pressure better than others. In particular, consumer staples stocks to buy offer a viable platfo"}, {"date": "20240305023000", "headline": "American Airlines To Rally Around 42%? Here Are 10 Top Analyst Forecasts For Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240305044500", "headline": "Is Cannabis Replacing Beer? Canadian Study Links Weed Legalization To Drop In Alcohol Sales", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240305103300", "headline": "Anheuser-Busch InBev S.A. ADR rises Tuesday, outperforms market", "summary": "The Anheuser-Busch InBev S.A. ADR inched 0.07% higher to $60.14 Tuesday, on what proved to be an all-around dismal trading session for the stock market, with..."}, {"date": "20240305130000", "headline": "Check Call: ESG initiatives make a stand", "summary": "In this edition: Why ESG initiatives matter now and the teamsters pull home another W. The post Check Call: ESG initiatives make a stand appeared first on FreightWaves."}, {"date": "20240305134124", "headline": "Strong Buy Alert: Analysts Say to Scoop Up These 7 Stocks", "summary": "The stock market keeps hitting new record highs almost every week. With sectors like semiconductors and AI taking off, the sky is the limit. But is it too late to get a bargain in this roaring market? Fortunately, there are still some great values out there. These are seven of the top undervalued stocks to buy now. All of these are 5-star stocks according to Morningstar’s analysts, which suggests these seven strong buy stocks have dramatic upside to fair value in the weeks and months to come. Es"}, {"date": "20240305153500", "headline": "Teamsters ratify 5-year labor agreement with Anheuser-Busch, avoiding strike", "summary": "The five-year contract was ratified with 86% support, the Teamsters said."}, {"date": "20240305200900", "headline": "Strike No Longer a Threat for Anheuser-Busch Inbev (NYSE:BUD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240305202422", "headline": "Teamsters vote to ratify a 5-year labor agreement with Anheuser-Busch, avoiding strike", "summary": "Teamsters working for Budweiser brewer Anheuser-Busch on Tuesday voted to ratify a labor agreement with the company, the union said.  The five-year contract was ratified with 86% support, the Teamsters said.  The deal covers 5,000 unionized employees at Anheuser-Busch, including brewers, packagers, and warehouse workers, and provides wage increases totaling 23% over the life of the contract, plus a $2,500 ratification bonus, the union said."}, {"date": "20240305204915", "headline": "Teamsters union members ratify US agreement with AB InBev", "summary": "Anheuser-Busch Inbev and the Teamsters union had reached a tentative agreement last week that averted a strike.  Under the agreement, which covers 5,000 Teamsters working at Anheuser-Busch breweries in the United States, union members will receive wage increases of $8 an hour, including an immediate $4 an hour raise in the first year, the union said.  The contract also includes a $2,500 ratification bonus, increased pension contributions, and restoration of retirement benefits for active and retired members."}, {"date": "20240305234200", "headline": "Teamsters vote to ratify five-year labor agreement with AB InBev", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240306011700", "headline": "Anheuser-Busch roundup: Teamsters deal is approved, Nielsen data shows positive bump", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240306020600", "headline": "Investors Can Generate Huge Passive Income With 7 Dividend Kings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240306050900", "headline": "Good News for Anheuser-Busch Inbev (NYSE:BUD), Strike No Longer a Threat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240306055817", "headline": "50 of the Highest-Rated Beers in the U.S.", "summary": "In this article, we are going to discuss 50 of the highest-rated beers in the U.S. You can skip our detailed analysis of the economic impact of the American beer industry, the recent buyback in the brewing industry, and the social responsibility initiatives by breweries, and go directly to 10 of the Highest-Rated Beers in […]"}, {"date": "20240306084023", "headline": "25 Countries with the Most Beer Consumption in 2024", "summary": "In this article, we are going to discuss the 25 countries with the most beer consumption in 2024. You can skip our detailed analysis of the global beer market, the local production of imported beer brands, and sustainability in the beer industry, and go directly to the 10 Countries with the Most Beer Consumption in […]"}, {"date": "20240307035100", "headline": "April 26th Options Now Available For Anheuser-Busch InBev (BUD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240307060551", "headline": "Doritos falls into its own ‘Bud Light’ crisis as Spanish arm forced to part ways with transgender influencer", "summary": "Doritos cut ties with Samantha Hudson after finding offensive tweets from 2015, as brand deal sparked a right-wing backlash."}, {"date": "20240307195700", "headline": "Bernstein Sticks to Its Buy Rating for Anheuser-Busch Inbev Sa (BUD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240309041600", "headline": "5 High Yield Dividend Stocks To Buy and Hold Forever", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240309191600", "headline": "5 Top Dividend Stocks Passive Income Investors Should Buy in March", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240311022237", "headline": "International Wide-Moat Stocks On Sale - The March 2024 Heat Map", "summary": "We share the heat map of the most investable candidates that may be worth your time for further analysis. Check out the March 2024 Heat Map."}, {"date": "20240311152223", "headline": "3 Alcohol Stocks That Are a Way Better Buy Than Beleaguered BUD", "summary": "Alcohol stocks fall into the consumer staples sector for their defensive attributes. It’s not that people “need” their products, but they tend to buy them no matter the state of the economy. Not surprisingly, brewers delivered outsized earnings growth of 32.4 when compared to the earnings growth of the overall consumer staples sector. However, earnings growth is expected to normalize relative to the sector. That means investors will have to be more selective in choosing alcohol stocks to buy. An"}, {"date": "20240312052833", "headline": "Multibillion-dollar Bud Light maker and Coca-Cola bottler publicly shamed for waiting months to pay U.K. suppliers", "summary": "Report says hundreds of thousands of small business are at risk of insolvency because of slow paying practices by big firms."}, {"date": "20240312073010", "headline": "Is It Worth Investing in Anheuser-Busch Inbev (BUD) Based on Wall Street's Bullish Views?", "summary": "The average brokerage recommendation (ABR) for Anheuser-Busch Inbev (BUD) is equivalent to a Buy. The overly optimistic recommendations of Wall Street analysts make the effectiveness of this highly sought-after metric questionable. So, is it worth buying the stock?"}, {"date": "20240312211800", "headline": "Altria intends tot sell portion of investment in AB InBev", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240312212300", "headline": "AB InBev 35M share Spot Secondary; price range $60.75-$62.75", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240312220800", "headline": "Altria plans to reduce investment in Corona-maker AB InBev through secondary offering", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240312231000", "headline": "Altria (NYSE:MO) Plans to Sell $2.2B Worth of BUD Shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313101500", "headline": "Altria Announces Intent to Sell a Portion of its Investment in Anheuser-Busch InBev", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313160714", "headline": "Altria Plans to Sell More Than $2 Billion of AB InBev Shares", "summary": "(Bloomberg) -- Altria Group Inc. is seeking to sell a portion of its stake in Anheuser-Busch InBev SA for as much as $2.2 billion to help fund its own share repurchases. Most Read from BloombergPutin Says Ukraine Deal Requires Security Pledges for RussiaUS House Passes Bill That Would Force TikTok Sale or Ban ItEx-Wall Street Banker Takes On AOC in New York Democratic PrimaryPhysical Intelligence Is Building a Brain for RobotsUnited Tells Boeing to Stop Making Its Long Delayed Max 10sAltria, whi"}, {"date": "20240313193800", "headline": "Altria’s (NYSE:MO) Pullout Prompts Temporary Halt for Anheuser-Busch InBev (NYSE:BUD) Shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313200700", "headline": "Altria’s (NYSE:MO) Pullout Prompts Temporary Halt for BUD Shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313201000", "headline": "BUD Shares Plunge 6% as Altria (NYSE:MO) Offloads Shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313225900", "headline": "Hello Group Posts Q4 Results, Joins SentinelOne, Futu Holdings And Other Big Stocks Moving Lower In Thursday's Pre-Market Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313230900", "headline": "Marlboro maker to sell $2.3 billion worth of Bud Light maker’s stock", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313233700", "headline": "Why Did Donald Trump Change His Mind About TikTok? 'Follow The Money' Says Rep. Nancy Pelosi", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314020100", "headline": "AB InBev 35M share Spot Secondary priced at $61.50", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314021500", "headline": "Could Altria Stock Be Better Than Universal Corporation in 2024?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314022100", "headline": "Altria Group said to raise $2.15B selling AB InBev shares, Bloomberg reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314022500", "headline": "4 stocks to watch on Thursday: ADBE, UAA and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314022608", "headline": "UPDATE 1-Shares in brewer AB InBev suspended, FSMA says", "summary": "Anheuser-Busch InBev's shares were suspended from trading on Thursday pending the publication of a press release, Belgium's Financial Services and Markets Authority (FSMA) said without elaborating.  The news comes after U.S. cigarette maker Altria said on Wednesday it would cut its around 10% stake in AB InBev, the world's largest brewer, selling around 35 million shares.  AB InBev plans to buy back $200 million worth of shares."}, {"date": "20240314023116", "headline": "Trading in brewer AB InBev's shares suspended by Belgian regulator", "summary": "Anheuser-Busch InBev's shares were suspended from trading on Thursday pending the publication of a press release, Belgium's Financial Services and Markets Authority (FSMA) said without elaborating."}, {"date": "20240314024700", "headline": "Is Altria Giving Up on Anheuser-Busch (BUD) Stock?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314030200", "headline": "Altria Group says 2024 outlook excludes income from AB InBev sale", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314030200", "headline": "Altria raises buyback program by $2.4B in connection with AB InBev share sale", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314032900", "headline": "Grayscale Bitcoin ETF News: 5 Things to Know About the New ‘Mini’ BTC Fund", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314034300", "headline": "Altria to sell 35M Anheuser-Busch InBev shares, raises 2024 guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314035600", "headline": "Altria to Significantly Enhance Cash Returns to Shareholders Through Expanded Share Repurchase Program in Connection with Pricing of Offering of Anheuser-Busch InBev Stock; Raises 2024 Full-Year Earnings Guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314043000", "headline": "Morning Brew: Nvidia's AI Developments and Altria's Strategic Moves Lead Market News", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314050200", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314064100", "headline": "Why Limbach Holdings Shares Are Trading Lower By Around 15%? Here Are Other Stocks Moving In Thursday's Mid-Day Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314074000", "headline": "Wall Street Lunch: Tick Tock On TikTok", "summary": "Former Treasury Secretary Steve Mnuchin expresses support for the legislation that could ban TikTok in the US and plans to form a group to buy the social media platform. Feb. PPI rose +0.6%"}, {"date": "20240314084400", "headline": "Bud Stock Drops. A Major Shareholder Is Selling Down Its Stake.", "summary": "Anheuser-Busch InBev shares were dropping early on Thursday. It was hit by news that tobacco company Altria Group intends to sell down a significant portion of its holding in the Budweiser brewer."}, {"date": "20240314091603", "headline": "Altria adds $2.4 billion to share repurchase kitty, lifts earnings forecast on AB InBev stake sale", "summary": "Altria, like other tobacco giants, has been grappling with tougher tobacco regulations, stiff competition from disposable vapes, as well as a shift to cheaper brands from cost-conscious consumers.  Altria's shares were up about 1% in morning trade.  The sale of around 35 million AB InBev shares, along with the brewer's repurchase of shares worth $200 million from Altria, would generate around $2.4 billion, the company said."}, {"date": "20240314092137", "headline": "Marlboro cigarette owner sells $2.2bn stake in Bud Light after trans controversy", "summary": "The owner of Marlboro cigarettes is to sell $2.2bn (£1.7bn) of shares in AB InBev after the Bud Light brewer’s sales fell following a backlash over an ad campaign featuring a transgender influencer."}, {"date": "20240314095115", "headline": "Why Investors Are Downing Anheuser-Busch InBev Stock Today", "summary": "One of the stock's major holders is selling down its stake."}, {"date": "20240314095140", "headline": "Marlboro maker Altria to sell over $2B in AB InBev stock", "summary": "Altria Group (MO) — the parent company of Marlboro cigarettes — is selling over $2 billion worth of Anheuser-Busch InBev (BUD) stock from its stake in the beer company. AB InBev plans to buy back up to $200 million of these shares. Yahoo Finance Live monitors the stock performance of the Bud Light parent company following this news. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Luke Carberry Mogan."}, {"date": "20240314131400", "headline": "Altria’s Sale of Anheuser-Busch Stock Is Smart. It Should Unload the Whole Stake.", "summary": "The deal is accretive to earnings, likely will be tax-free, and lets the cigarette company to repurchase its cheaply valued shares."}, {"date": "20240314184018", "headline": "PRESS DIGEST-British Business - March 15", "summary": "The following are the top stories on the business pages of British newspapers.  - Britain's biggest pharmaceuticals company AstraZeneca has struck a deal worth more than $1 billion to acquire a French rare diseases company Amolyt Pharma as it seeks to bolster its drugs pipeline.  - Wael Sawan, chief executive of Shell said that the group would aim to cut the net \"carbon intensity\" of its products by between 15% and 20% by 2030 compared with its level in 2016 and that it had scrapped a 2035 target altogether."}, {"date": "20240315025900", "headline": "Marlboro maker Altria sells $2B stake in AB InBev", "summary": "The sale is the latest headache for the alcohol manufacturer as it attempts to shake off a drop in beer consumption and fallout from a controversial 2023 marketing campaign with a transgender influencer."}, {"date": "20240315081100", "headline": "Altria (MO) Ups Earnings View, Expands Share Buyback Plans", "summary": "Altria (MO) divests 35 million shares of Anheuser-Busch InBev. Management expands share repurchase plans while raising the bottom-line view for 2024."}, {"date": "20240315160019", "headline": "Anheuser-Busch Inbev (BUD) Stock Moves -0.34%: What You Should Know", "summary": "In the closing of the recent trading day, Anheuser-Busch Inbev (BUD) stood at $60.80, denoting a -0.34% change from the preceding trading day."}, {"date": "20240317191500", "headline": "Tyson Foods, Planet Fitness Boycott: Why The 2 Companies Are Trending On Social Media", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240318031500", "headline": "Altria Has a New Plan to Unlock Value. It Could Be a Warning Sign for the High-Yield Dividend Stock.", "summary": "The tobacco giant is selling a chunk of its stake in Anheuser-Busch."}, {"date": "20240318044600", "headline": "Altria gains as investors eye vaping upside, more Anheuser-Busch stock sales", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240318212100", "headline": "Altria Group enters into $2.4B share buyback after closing InBev stock offering", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240318220900", "headline": "3 Juicy Stocks Serving Up 5% Dividends That You Can Snag for $50", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240318222900", "headline": "Anheuser-Busch InBev Launches Major Share Sale", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240319064800", "headline": "U.S. beverage sales cooled off but energy drinks, tequila and prepared cocktails are still hot", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240319101500", "headline": "Altria Enters $2.4 Billion Accelerated Share Repurchase Transactions in Connection with Closing of Offering of Anheuser-Busch InBev Stock", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240319124442", "headline": "3 Undervalued Dividend Stocks Yielding Over 8% for Income-Hungry Investors", "summary": "There are multiple reasons dividend stocks are the first choice for many investors. First, these stocks provide regular cash flows that serve as a passive income source. Further, dividend stocks, in general, are low-beta and provide stability to the portfolio. It’s a bonus for investors if there are undervalued dividend stocks to buy. Once the valuation gap is filled, total returns can be robust. This column discusses three undervalued dividend stocks that have been sideways to lower in the last"}, {"date": "20240319133022", "headline": "Big tobacco just broke up with big beer: Marlboro maker Altria offloads AB InBev shares as both falter on decreased demand for key products", "summary": "Altria announced a sale of 35 million shares of Anheuser-Busch InBev last week, amounting to $2.2 billion."}, {"date": "20240319143200", "headline": "St. Paddy’s Day Picks: 3 Stocks to Shamrock Your Returns", "summary": "These are three St. Patrick’s Day stocks for investors to add to their portfolios. I believe these companies will see a boost in sales and consumer interest around the March 17th holiday celebrating Irish culture. However, I don’t expect them to be simply short-term performers. While the festive St. Patrick’s Day period provides an annual revenue tailwind, the companies I’ve identified have solid, long-term fundamentals and growth strategies that make them attractive holdings year-round. What’s"}, {"date": "20240319144600", "headline": "Altria Buys Back Shares for $2.4 Billion", "summary": "Altria Group reached accelerated agreements to buy back $2.4 billion in common stock after selling part of its stake in Anheuser-Busch InBev."}, {"date": "20240319224700", "headline": "Altria (NYSE:MO) Accelerates Share Buybacks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240320010000", "headline": "Altria: 9% Yield And Huge Value Creation", "summary": "Altria is inexpensive, offers a nice yield, and has shareholder-friendly management. Click here to see why MO stock is a Buy."}, {"date": "20240320022900", "headline": "AB InBev Prices $1 Billion Bond Offering", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240320030000", "headline": "Anheuser-Busch InBev: A Patient Investor's Brew Of Opportunity Amid Challenges", "summary": "Anheuser-Busch InBev's stock has maintained flat growth, albeit outperforming some rivals over the past year. Read more about BUD stock here."}, {"date": "20240320104325", "headline": "6-9% Yielding Dividend Growers: 1 To Avoid And 3 To Buy", "summary": "Three high-yielding stocks with much better prospects than Altria stock right now. Read why we recommend investing in other options discussed in the article."}, {"date": "20240320215800", "headline": "Anheuser-Busch InBev Announces New Securities Pricing Agreement", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240321021600", "headline": "6 Highest Yielding Dividend Kings With Yields Up To 9.9%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240321035900", "headline": "May 3rd Options Now Available For Anheuser-Busch InBev (BUD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322043700", "headline": "3 Beer Stocks: What This Analyst Thinks Is Brewing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322061902", "headline": "Ambev: A Dominant Beer Producer With Currency And Commodity Risk", "summary": "If Ambev's margins recover to pre-pandemic levels, there is substantial upside potential for the share price. Find out if ABEV stock is a buy."}, {"date": "20240322160022", "headline": "Why the Market Dipped But Anheuser-Busch Inbev (BUD) Gained Today", "summary": "Anheuser-Busch Inbev (BUD) concluded the recent trading session at $59.50, signifying a +0.35% move from its prior day's close."}, {"date": "20240324020300", "headline": "Trends brewing in the alcohol industry", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240324070000", "headline": "Anheuser-Busch InBev: North American Headwinds Bottoming - Long-Term Recovery Ahead", "summary": "This article discusses the positive outlook for BUD's long-term prospects, including market share stability, global growth, and expansion into healthier..."}, {"date": "20240325120405", "headline": "More Than 86% of Analysts Who Cover These 3 Stocks Rate Them a ‘Buy’", "summary": "Investors got a good case of whiplash over the past four years. The pandemic crash of 2020 brought a decade-long bull market to a screeching halt. However, the spin-up into the revenge-buying bull market of 2021 soon followed. A bear market followed again the next year, only to be gored by another bull run higher in 2023. We’re still in the midst of that today. The benchmark index seems to set new records almost daily these days, and Wall Street fully embraces it. Analysts are much more upbeat,"}, {"date": "20240327060500", "headline": "Constellation wins hard seltzer battle over AB InBev", "summary": "An appeals court affirmed a 2023 decision that ruled Constellation did not infringe on the trademarks of AB InBev’s Grupo Modelo by selling seltzer products under that brand."}, {"date": "20240327230300", "headline": "Long Live the Dividend Kings: 3 Top Picks to Build an Income Portfolio", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328022700", "headline": "Argus looking for more favorable entry point in AB InBev", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328035700", "headline": "Interesting BUD Put And Call Options For May 10th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328073011", "headline": "Is Anheuser-Busch Inbev (BUD) a Buy as Wall Street Analysts Look Optimistic?", "summary": "Based on the average brokerage recommendation (ABR), Anheuser-Busch Inbev (BUD) should be added to one's portfolio. Wall Street analysts' overly optimistic recommendations cast doubt on the effectiveness of this highly sought-after metric. So, is the stock worth buying?"}, {"date": "20240328161518", "headline": "Anheuser-Busch Inbev (BUD) Stock Falls Amid Market Uptick: What Investors Need to Know", "summary": "The latest trading day saw Anheuser-Busch Inbev (BUD) settling at $60.78, representing a -0.1% change from its previous close."}, {"date": "20240328235700", "headline": "March Recap: Conservative \"Cannabis\" Stocks Up 7%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240329014238", "headline": "15 Most Valuable Alcohol Companies in the World", "summary": "In this article, we are going to discuss the 15 most valuable alcohol companies in the world. You can skip our detailed analysis of the global alcohol industry, the impact of Covid-19 on alcohol consumption, and the recent shifts in the global alcohol market, and go directly to the 5 Most Valuable Alcohol Companies in […]"}, {"date": "20240329064600", "headline": "6 Of The Highest Yielding Dividend Kings to Buy and Hold Forever", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240330223100", "headline": "Warning: BUD is at high risk of cutting its dividend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240331213600", "headline": "Anheuser-Busch InBev S.A. ADR outperforms market on strong trading day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402225800", "headline": "AB InBev Upsizes Tender Offer to $2.5 Billion", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403161521", "headline": "Anheuser-Busch Inbev (BUD) Stock Slides as Market Rises: Facts to Know Before You Trade", "summary": "Anheuser-Busch Inbev (BUD) closed at $60.24 in the latest trading session, marking a -0.77% move from the prior day."}, {"date": "20240403222200", "headline": "Anheuser-Busch InBev shows a solid bounce in on-premise U.S. business", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404013900", "headline": "Passive Income Investors Love These 5 Dividend Kings and One Pays 9%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404023200", "headline": "Passive Income Perfection: 7 Dividend Stocks to Generate $50,000 Per Year", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404024749", "headline": "Beverages and Alcohol Stocks Q4 Highlights: Boston Beer (NYSE:SAM)", "summary": "Quarterly earnings results are a good time to check in on a company’s progress, especially compared to other peers in the same sector. Today we are looking at Boston Beer (NYSE:SAM), and the best and worst performers in the beverages and alcohol group."}, {"date": "20240406133327", "headline": "Lemann Says He’s Trying to Save Americanas After $5 Billion Fraud", "summary": "(Bloomberg) -- Jorge Paulo Lemann, the billionaire Brazilian dealmaker, said that together with his long-time partners, he’s trying to save retailer Americanas SA after a massive $5 billion fraud pushed it into bankruptcy protection. Most Read from BloombergSaudis Scale Back Ambition for $1.5 Trillion Desert Project NeomTurkey Joins NATO Allies in Suspending Europe Arms TreatyMark Zuckerberg’s Wealth Exceeds Elon Musk’s for the First Time Since 2020Iran Tells US to Step Aside as It Readies Respo"}, {"date": "20240407034722", "headline": "Tilray Could Break Down", "summary": ""}, {"date": "20240408024300", "headline": "European losers of higher financing costs - JPMorgan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408130525", "headline": "3 Sin Stocks to Add Some Spice to Your Spring Holdings", "summary": "When economic circumstances become challenging, it’s time to get an edge, which brings us to sin stocks to buy. Yes, the sector dives into controversial arenas. However, controversies can also yield significant upside. Certainly, the March jobs report may have provided a fire for sin stocks. You see, the U.S. economy added 303,000 jobs, yet another impressive print. Naturally, this result implies greater inflation, which has been the scourge of American households. To take the edge off the troub"}, {"date": "20240409012300", "headline": "Molson Coors trades higher after Goldman Sachs predicts Q1 earnings beat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409024100", "headline": "TLRY Stock Alert: Cannabis Legalization Hopes May Not Be Enough for Tilray", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409025940", "headline": "Beverages and Alcohol Stocks Q4 Recap: Benchmarking Zevia PBC (NYSE:ZVIA)", "summary": "Let's dig into the relative performance of Zevia PBC (NYSE:ZVIA) and its peers as we unravel the now-completed Q4 beverages and alcohol earnings season."}, {"date": "20240409050000", "headline": "Tilray Brands, Inc. Reports Q3 Fiscal 2024 Financial Results", "summary": "Achieved Net Revenue of $188 Million, ~ 30% Net Revenue Growth Over the Prior Year Quarter Beverage-Alcohol Net Revenue Increases 165% Over the Prior Year Quarter, 5th Largest Craft Beer Brewer in the U.S.1 with 4.5% Craft Beer Market Share Global Cannabis Net Revenue Increases 33% with International Cannabis Growth of 44% Over the Prior Year Quarter, #1 Market Share in Canada and #1 Market Share in Germany U.S. Cannabis Strategy in Place to Strike with Potential Drug Policy Reform Conference Ca"}, {"date": "20240409055900", "headline": "JPMorgan’s top European picks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409113920", "headline": "Anheuser-Busch InBev: Overvalued And Facing Multiple Headwinds", "summary": "AbInbev is rated as a sell due to negative long-term trends in beer consumption and its high valuation. Learn more about BUD stock here."}, {"date": "20240409213500", "headline": "Anheuser-Busch InBev S.A. ADR falls Wednesday, underperforms market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410032500", "headline": "Andvari Associates Q1 2024 Letter", "summary": "For the first quarter of 2024, Andvari was up 12.1% net of fees, while the SPDR S&P 500 ETF was up 10.4%."}, {"date": "20240410053300", "headline": "Anheuser-Busch InBev SA/NV Breaks Below 200-Day Moving Average - Notable for BUD", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410075200", "headline": "5 Alcohol Stocks to Watch Amid Wavering Industry Trends", "summary": "The Beverages - Alcohol industry has been in troubled waters due to adverse trends like inflation, higher input and packaging costs, and elevated marketing expenses. Persistent innovation, premiumization and innovation place players like BUD, DEO, STZ, BF.B and TAP in a favorable spot."}, {"date": "20240411041000", "headline": "May 31st Options Now Available For Anheuser-Busch InBev (BUD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411044100", "headline": "The consumer boycott of Planet Fitness is seen fading like other well-known examples", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411051500", "headline": "Constellation Brands Celebrates Strong Q4 Earnings Amid Beer Business Boom", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411061200", "headline": "Zacks Industry Outlook Highlights AnheuserBusch InBev, Diageo Plc, Constellation Brands Inc., Brown-Forman and Molson Coors", "summary": "AnheuserBusch InBev, Diageo Plc, Constellation Brands Inc., Brown-Forman and Molson Coors are part of the Zacks Industry Outlook article."}, {"date": "20240414030000", "headline": "Andvari Associates - Altria Group: Smoke Signals", "summary": "An example of a high-yielding security is the stock of Altria Group that Andvari has a stake in. Click here to read Andvari's thesis on MO stock."}, {"date": "20240415033400", "headline": "First Week of May 17th Options Trading For Anheuser-Busch InBev (BUD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415095228", "headline": "Constellation Brands' Continued Beer Strength Offsets Its Wine And Spirits Weakness", "summary": "Despite a decline in the wine and spirits business, Constellation Brands (NYSE: STZ) outperformed its expectations with beer sales with its latest quarterly report. Constellation Brands, whose operations span across the U.S., Mexico, New Zealand, and Italy, delivered a stronger than expected fourth quarter profit, with management indicating that the segment greatly contributed to its success over the fiscal year. Fourth Quarter Highlights For the quarter that ended in February, Constellation Bra"}, {"date": "20240416005100", "headline": "Anheuser-Busch InBev is called attractive due to valuation, Michelob Ultra strength", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416020000", "headline": "A Neutral View of Altria Despite High Dividends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417065500", "headline": "International Wide-Moat Stocks On Sale - The April 2024 Heat Map", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418194200", "headline": "Analysts Are Bullish on These Consumer Goods Stocks: Anheuser-Busch Inbev Sa (BUD), Diageo (DEO)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419033500", "headline": "First Week of BUD December 20th Options Trading", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419122520", "headline": "15 Largest Beer Companies in the World", "summary": "In this article, we are going to discuss the 15 largest beer companies in the world. You can skip our detailed analysis of the global beer market, the total beer output around the globe, and the impact of the Russia-Ukraine war on the international beer industry, and go directly to the 5 Largest Beer Companies […]"}, {"date": "20240420010200", "headline": "Tobacco stocks could heat up as catalysts include earnings, M&A and dividend firepower", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421224100", "headline": "Analysts Offer Insights on Consumer Goods Companies: Procter & Gamble (PG) and Anheuser-Busch Inbev Sa (BUD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422034700", "headline": "Philip Morris, Altria Q1 earnings on deck: What to expect", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422094500", "headline": "Stella Artois kicks off summer-long marketing push as official ‘Hot Ones’ beer", "summary": "A special episode of the popular YouTube show featuring brand ambassador and rapper Ludacris is already available."}, {"date": "20240422190800", "headline": "3 Defensive Stocks To Protect Your Portfolio In 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423202500", "headline": "Molson Coors’ gains from the Bud Light boycott have run their course, analysts say", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424010500", "headline": "Molson Coors falls after Citi warns sales growth will slow as it laps difficult comparisons", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424111958", "headline": "3 Sin Stocks to Buy as Consumers Crave Distraction", "summary": "There’s a proverb that states idle hands are the devil’s workshop, which makes sin stocks so compelling. Humans engage in certain practices, whether that involves imbibing or gambling as a means to let off some steam. Yes, the concept undergirding sin stocks is controversial. I don’t think there’s any way of getting around this reality. Not surprisingly, many ethical portfolios avoid enterprises that cover areas such as alcohol, tobacco and gambling, among other “vices.” Still, there’s another a"}, {"date": "20240424230600", "headline": "From Cryptocurrency to Cannabis: 7 Penny Stocks on the Rise", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425002800", "headline": "AB InBev Announces 2023 Dividend Approval", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425200100", "headline": "Sam Adams Says Hold My Beer — And You Are: Sales Numbers Dispute Cannabis Cannibalization Narrative", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426015926", "headline": "Altria Group's Market Share Woes Warrant Attention", "summary": "Altria Group's management is reducing debt and buying back stock, but caution is still warranted. Read more to see my analysis on MO stock."}, {"date": "20240426125605", "headline": "Apollo, KKR, Stonepeak Weigh Investing Billions in Intel Chip JV", "summary": "(Bloomberg) -- Apollo Global Management Inc., KKR & Co. and Stonepeak may inject billions of dollars into a joint venture that will help fund Intel Corp.’s semiconductor fabrication facility in Ireland, according to people with knowledge of the matter.Most Read from BloombergPlunging Home Prices, Fleeing Companies: Austin’s Glow Is FadingJavier Milei Fuels Wild Rally That Makes Peso No. 1 in WorldFed’s Preferred Core Inflation Gauge Rose at Brisk Pace in MarchHuawei’s New Phone Runs Latest Versi"}, {"date": "20240428043700", "headline": "The Top 3 Blue-Chip Stocks to Buy in April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428230400", "headline": "April Recap: Conservative \"Cannabis\" Stocks Portfolio Down 3%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429053128", "headline": "AB InBev building 0.0% tech in UK, sees opportunity in “adult refreshment”", "summary": "AB InBev sees \"a unique opportunity\" in building its 0.0% portfolio in the area of “adult refreshment”."}, {"date": "20240429184756", "headline": "Ambev S.A.: Diversify Out Of U.S. Assets With Beer Made In Brazil", "summary": ""}, {"date": "20240429234000", "headline": "Inflation-Proof Fortunes: 7 Dividend Aristocrats to Keep Your Wealth Growing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430211500", "headline": "BUD Makes Notable Cross Below Critical Moving Average", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501012100", "headline": "Molson Coors price target lowered by $2 at Evercore ISI, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502094500", "headline": "Here's How AB InBev (BUD) is Placed Just Before Q1 Earnings", "summary": "AB InBev's (BUD) Q1 performance is expected to have gained from strong consumer demand for its brands, pricing actions, ongoing premiumization and other revenue management initiatives."}, {"date": "20240502115600", "headline": "Top Stock Reports for Micron Technology, Anheuser-Busch & Duke Energy", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Micron Technology, Inc. (MU), Anheuser-Busch InBev SA/NV (BUD) and Duke Energy Corporation (DUK)."}, {"date": "20240502200000", "headline": "Catalyst Watch: Disney earnings, Apple iPad event and Fed speakers back on the circuit", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502214941", "headline": "Molson Coors: A Plunge After Q1 Earnings Is A Buying Opportunity", "summary": "Molson Coors shares appear undervalued after a Q1 earnings report. Find out why TAP stock is a Buy."}, {"date": "20240502230200", "headline": "Anheuser-Busch InBev SA/NV's Dividend Analysis", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503032600", "headline": "The Zacks Analyst Blog Highlights Micron Technology, Anheuser-Busch, Duke Energy, ON Semiconductor and STERIS", "summary": "Micron Technology, Anheuser-Busch, Duke Energy, ON Semiconductor and STERIS are included in this Analyst Blog."}, {"date": "20240503091129", "headline": "Stocks to watch next week: BP,  Saudi Aramco, Uber, and interest rates", "summary": "Earnings preview of key companies reporting next week and what to look out for."}, {"date": "20240504030000", "headline": "Corona parent AB InBev tackles stigma of non-alcoholic beer by pitching it as a healthy and nutritious adult version of soda", "summary": "The world's largest brewing company is placing its fast growing premium import brand Corona at the heart of its sponsorship of this year's Paris summer Olympics games."}]}