{"news": [{"date": "20240412025911", "headline": "These Stocks Are Moving the Most Today", "summary": "JPMorgan Chase, Wells Fargo, and Citigroup are scheduled to report quarterly earnings Friday, Amazon shares close at a record high, and Apple stock has its best one-day gain since last May.Read the full ..."}, {"date": "20240412041200", "headline": "These Stocks Are Moving the Most Today: JPMorgan, Wells Fargo, Citigroup, BlackRock, AMD, Amazon, Apple, and More", "summary": "JPMorgan Chase, Wells Fargo, and Citigroup are scheduled to report quarterly earnings Friday, Amazon shares close at a record high, and Apple stock has its best one-day gain since last May."}, {"date": "20240412074216", "headline": "Stocks to Watch Friday:  JPMorgan, Intel, Globe Life", "summary": "↘️ **JPMorgan Chase (JPM)**, **Wells Fargo (WFC)**: The banking giants posted earnings and revenue that trumped Wall Street's expectations. However, JPMorgan projected muted growth for the rest of the year."}, {"date": "20240412095615", "headline": "Big Meat leaves ‘a huge cow-shaped hole’ in big banks’ climate commitments, new report finds", "summary": "Between 2016 and 2023, the top 58 U.S.-based financiers poured more than $134 billion into meat, dairy, and feed corporations."}, {"date": "20240412100342", "headline": "Citi poaches back banker who had quit to join JPM, sources say", "summary": "Citigroup has rehired an investment banker who had quit to work for JPMorgan Chase even before he started work there, two sources with knowledge of the matter said on Friday.  Arvind Vashistha was on gardening leave after leaving his job at Citi in early February to join JPM as its Southeast Asia head of equity capital markets (ECM).  The sources said he is rejoining Citi in his old position of head of ECM for India."}, {"date": "20240412100849", "headline": "Bank Stocks Unravel As JPMorgan Drags Down The Dow", "summary": "JPMorgan dives below critical support on its outlook as bank earnings roll in. BlackRock, Citi post ugly reversals."}, {"date": "20240412101200", "headline": "Banks Upbeat on Consumer Spending Despite High Rates", "summary": "The biggest U.S. banks say consumer spending remains strong despite high interest rates and inflationary pressures.  Credit-card spending for the first quarter is up at issuers including JPMorgan Chase, Wells Fargo and Citigroup.  At these three banks, which reported first-quarter earnings Friday, credit-card spending totaled $471 billion, an 8% increase from the year-ago quarter."}, {"date": "20240412101332", "headline": "Bank Earnings Roll In: A Roundup of Journal Coverage", "summary": "Bank earnings season began today, with results from JPMorgan Chase, Wells Fargo and Citigroup.  Next week will bring numbers from Goldman Sachs, among others.  **Here is a roundup of our latest coverage:**  + JPMorgan Chase's first-quarter earnings rose 6%, but the bank projected muted growth for the rest of the year."}, {"date": "20240412101700", "headline": "NEW YORK MARKET CLOSE: Shares fall as banking and chip stocks slump", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412103800", "headline": "High Rates Have Been a Profit Machine For Banks. Not Anymore.", "summary": "JPMorgan Chase,  Wells Fargo  and  Citigroup  all reported better-than-expected first quarter profits and revenues and executives said consumers and businesses are healthy.  JPMorgan said its first-quarter profit rose 6% to $13.42 billion, while Wells Fargo earned $4.62 billion and Citigroup earned $3.37 billion, down 7% and 27% respectively.  The Goldilocks economy has so far been a boon for the largest banks."}, {"date": "20240412104609", "headline": "Citigroup Inc. (C) Q1 2024 Earnings Call Transcript", "summary": "Citigroup Inc. (NYSE:NYSE:C) Q1 2024 Earnings Conference Call April 12, 2024 11:00 AM ETCompany ParticipantsJennifer Landis - Head of IRJane Fraser -..."}, {"date": "20240412105238", "headline": "Citigroup Inc. 2024 Q1 - Results - Earnings Call Presentation", "summary": "The following slide deck was published by Citigroup Inc."}, {"date": "20240412115018", "headline": "WRAPUP 1-US banks' profit picture less clear with cloudy rates trajectory", "summary": "The uncertain trajectory of interest rates is making it hard for U.S. banks to forecast profits and leading some to adopt a cautious stance for the remainder of the year.  Banks have reaped high profits in recent quarters as the Federal Reserve started raising interest rates in March 2022 to tame inflation, which boosted net interest income (NII), or the difference between what lenders earn on loans and pay out for deposits.  \"It's certainly challenging these days to forecast NII, given all of the volatility that we've seen across a lot of the different data points, as well as some of the uncertainty that's out there relative to how our clients are going to behave,\" Wells Fargo's finance chief Michael Santomassimo said."}, {"date": "20240412142800", "headline": "The Q1 Earnings Season Kicks off Positively", "summary": "We see the Q1 results from the major banks as good enough; not great, but definitely not bad either. Next week, the cycle picks up notable steam, with 41 S&P 500 companies on the reporting docket. How will the market react?"}, {"date": "20240412143018", "headline": "Citigroup (C) Q1 2024 Earnings Call Transcript", "summary": "C earnings call for the period ending March 31, 2024."}, {"date": "20240412143024", "headline": "US STOCKS-Wall St ends sharply lower on mixed earnings, sticky inflation, geopolitical fears", "summary": "U.S. stocks sold off on Friday after major U.S. banks' results failed to impress, capping a week marked by market-moving inflation data, evolving expectations for U.S. Federal Reserve policy, and looming geopolitical tensions.  The S&P 500 index notched its biggest weekly percentage loss since January, while the Dow Jones Industrial Average's weekly loss was its steepest since March 2023.  \"When we look at what's happened in the macro space, inflation has taken a turn for the worse and that has put more pressure on companies to deliver this earnings season,\" said Mike Dickson, head of research at Horizon Investments in Charlotte, North Carolina."}, {"date": "20240412143700", "headline": "These Stocks Moved the Most Today: JPMorgan Chase, Citigroup, AMD, Intel, Arista Networks, Zoetis, and More", "summary": "JPMorgan stumbles as net interest income disappoints, and Citigroup’s earnings top analysts’ estimates but the stock falls. Meanwhile, a report says Chinese officials directed the nation’s largest telecom carriers to phase out foreign processors with Advanced Micro Devices and Intel being the most exposed."}, {"date": "20240413004223", "headline": "Wall Street Breakfast: What Moved Markets", "summary": "The benchmark S&P 500 fell nearly 2% last week, posting its worst weekly performance since late October 2023. Read more about last week's major events on Wall Street."}, {"date": "20240413010244", "headline": "Citigroup Inc (C) Q1 2024 Earnings Call Transcript Highlights: A Mixed Financial Performance ...", "summary": "Exploring Citigroup's financial results, strategic shifts, and future outlook as revealed in the Q1 2024 earnings call."}, {"date": "20240413011000", "headline": "Big Banks Turn Inflationary Lemons Into Lemonade", "summary": "Bank valuations have sagged under impending new bank rules known as the Basel Endgame that could raise capital requirements by one-fifth, consequently reducing returns."}, {"date": "20240413033000", "headline": "Will Banks Finally Have to Pay You More for Your Savings?", "summary": "Investors were probably hoping for more-upbeat projections from banks Friday about their net interest income, which were quite muted as of their year-end reports.  After all, investors have slashed their expectations of how many times the Federal Reserve might cut rates in 2024, from six or seven times coming into the year, to now around two times."}, {"date": "20240413060151", "headline": "Institutional owners may ignore Citigroup Inc.'s (NYSE:C) recent US$3.7b market cap decline as longer-term profits stay in the green", "summary": "Key Insights Institutions' substantial holdings in Citigroup implies that they have significant influence over the..."}, {"date": "20240414010600", "headline": "Earnings week ahead: BAC, JNJ, TSM, UNH, ABT, SLB, UAL, PG, NFLX and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414021600", "headline": "Here's what Wall St. experts are saying about these banks ahead of earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414031800", "headline": "Zomato (ZOMATO) Shares Skyrocket, Analysts Hustle to Update Forecasts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414070004", "headline": "Earnings from more banks, Netflix, and retail sales: What to know this week", "summary": "A slew of corporate earnings will face investors this week as markets continue to digest the prospect of higher interest rates throughout 2024."}, {"date": "20240414202200", "headline": "Citi credit card delinquency rate edges down in March, net charge-offs climb", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414213100", "headline": "Analysts Offer Insights on Financial Companies: Hargreaves Lansdown (OtherHRGLF) and Citigroup (C)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414225600", "headline": "Citigroup: Balancing Challenges and Resilience with a Hold Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414234500", "headline": "SPDR ETF Report For Monday, April 15", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415000700", "headline": "Citigroup (C) Receives a Buy from Piper Sandler", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415002200", "headline": "Citi price target raised by $3 at Piper Sandler, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415002800", "headline": "Citi price target lowered by $1 at Oppenheimer, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415005500", "headline": "Citi price target lowered by $2 at UBS, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415011512", "headline": "Heard on the Street Friday Recap: Everything Everywhere All at Once", "summary": "JPMorgan Chase, the nation's largest bank, gave an underwhelming forecast for net interest income this year, saying it expects it to be roughly flat as higher deposit costs bite.  Citigroup and Wells Fargo said they expect their net interest income to fall.  The University of Michigan's consumer-confidence reading edged down, while inflation expectations for the year ticked up, further feeding concerns that the Federal Reserve won't be in a position to lower rates anytime soon."}, {"date": "20240415013356", "headline": "Bank Earnings: A Roundup of Journal Coverage", "summary": "Bank earnings season continues today, with results due from Goldman Sachs. That follows results from JPMorgan Chase, Wells Fargo and Citigroup last week. Investors watch bank earnings for news about the individual banks and the financial sector broadly, but also for insights about the state of the economy."}, {"date": "20240415013500", "headline": "Seaport Global Sticks to Their Buy Rating for Citigroup (C)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415015400", "headline": "Bank Earnings Paint A Mixed Economic Picture", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415015900", "headline": "Citi price target raised by $2 at BMO Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415022200", "headline": "Citi price target raised by $10 at Argus, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415023000", "headline": "Citigroup: The Potential Breakout Is Coming (Rating Upgrade)", "summary": "Citigroup's cost-cutting measures are working and have lifted buying momentum. Find out if now is a good time to buy C stock."}, {"date": "20240415024700", "headline": "KBW Keeps Their Hold Rating on Citigroup (C)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415041500", "headline": "Goldman Sachs (GS) Surpasses Q1 Earnings and Sales Forecasts Amid Market Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415045000", "headline": "Goldman Sachs stock climbs after Q1 earnings impress with core strength", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415051100", "headline": "These Analysts Revise Their Forecasts On Citigroup Following Q1 Results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415052940", "headline": "Profits surge at Goldman Sachs on Wall Street revival", "summary": "Profits rose 28% for Goldman during the first quarter as the Wall Street giant recorded improvements in everything from investment banking to trading to wealth management."}, {"date": "20240415061800", "headline": "Market Watch: Global Shares Dip Amid Middle East Tensions", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415065700", "headline": "Fear & Greed Index In 'Neutral' Zone; Dow Tumbles 475 Points", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415070200", "headline": "JPMorgan, Citigroup and even Wells Fargo are part of Zacks Earnings Preview", "summary": "JPMorgan, Citigroup and even Wells Fargo are part of Zacks Earnings Preview."}, {"date": "20240415085443", "headline": "Nvidia stock pops as Citi opens 90-day upside catalyst watch", "summary": "Shares of Nvidia (NVDA) are trading higher on Monday after analysts at Citigroup (C) initiated a 90-day upside catalyst watch on the stock. Citi's analysts see the potential for positive supply chain commentary from chip factories and memory suppliers during the upcoming earnings season. Yahoo Finance's Brad Smith and Seana Smith discuss the recent downward pressure on the stock. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Angel Smith"}, {"date": "20240415111117", "headline": "First Quarter Bank Earnings Brought The Revival That Wall Street Needed", "summary": "The first quarter reports officially kicked off with bank earnings, as usual. On Friday, Wells Fargo & Company (NYSE: WFC), JPMorgan Chase & Co (NYSE: JPM) and Citigroup Inc (NYSE: C) opened the season, reporting strong results. On Monday, they were joined by The Goldman Sachs Group Inc (NYSE: GS) who also posted better than expected earnings due to a rebound in global M&A activity that fueled revenue for its biggest division. Wells Fargo topped estimates with first quarter profit. Wells Fargo r"}, {"date": "20240415125538", "headline": "Citi wealth division's CIO Bailin to depart", "summary": "Citigroup's David Bailin, chief investment officer (CIO) at the global wealth division, will leave next month after 15 years at the bank, he said in a LinkedIn post on Monday.  Bailin, who became the global head of investments in 2017 and took charge as the wealth division's CIO in 2019, said May 15 would be his last day at the company.  Citi did not immediately respond to a Reuters request for comment."}, {"date": "20240415130135", "headline": "Citi wealth division's CIO Bailin to depart after 15 years", "summary": "(Reuters) -Citigroup's David Bailin, chief investment officer (CIO) at the global wealth division, will leave on May 15 after 15 years at the bank, he said in a LinkedIn post on Monday.  Bailin became the global head of investments in 2017 and took his current job in 2019.  Before joining Citi, he was the head of alternative investment asset management for Bank of America's global wealth and investment management."}, {"date": "20240415132743", "headline": "UPDATE 1-Citi wealth division's CIO Bailin to depart after 15 years", "summary": "Citigroup's David Bailin, chief investment officer (CIO) at the global wealth division, will leave on May 15 after 15 years at the bank, he said in a LinkedIn post on Monday.  Bailin became the global head of investments in 2017 and took his current job in 2019.  Before joining Citi, he was the head of alternative investment asset management for Bank of America's global wealth and investment management."}, {"date": "20240415141500", "headline": "CitiGroup Announces Full Redemption of Series D Preferred Stock", "summary": "NEW YORK, April 15, 2024--Citigroup Inc. is redeeming, in whole, all $1.25 billion aggregate liquidation preference of Series D Depositary Shares representing interests in its 5.350% Fixed Rate / Floating Rate Noncumulative Preferred Stock, Series D (the \"Preferred Stock\")."}, {"date": "20240415192000", "headline": "Citigroup's Exit from Municipal Bond Market: Analyzing the Impact", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415211900", "headline": "Bank of Montreal's Chief Highlights U.S. Economic Strength and Expansion Strategy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415214900", "headline": "Carnival announces redemption of existing €500 notes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415214900", "headline": "Citigroup: A Hold Rating Amidst Restructuring and Regulatory Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416034400", "headline": "Top 10 best-performing bank stocks of 2024 as earnings results roll in", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416051500", "headline": "Bank of America Q1 Earnings: A Mixed Bag Amid Rising Interest Rates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416051800", "headline": "Wall Street Sees Uplift in Investment Banking Sector", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416051910", "headline": "Bank of America profits drop as key lending revenue weakens", "summary": "The results from the nation's second-largest lender offer the latest example of how even the biggest banks are increasingly challenged by high interest rates."}, {"date": "20240416060724", "headline": "Wall Street surge lifts Morgan Stanley and new CEO Ted Pick", "summary": "A Wall Street revival helped Morgan Stanley beat analyst expectations in the first quarter, giving a lift to new CEO Ted Pick."}, {"date": "20240416070014", "headline": "Investors Heavily Search Citigroup Inc. (C): Here is What You Need to Know", "summary": "Citigroup (C) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock."}, {"date": "20240416075316", "headline": "Citigroup Inc. (NYSE:C) Q1 2024 Earnings Call Transcript", "summary": "Citigroup Inc. (NYSE:C) Q1 2024 Earnings Call Transcript April 12, 2024 Citigroup Inc. beats earnings expectations. Reported EPS is $1.58, expectations were $1.13. C isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Hello and welcome to Citi’s First Quarter 2024 […]"}, {"date": "20240416080212", "headline": "Citigroup : Citi First Quarter 2024 Transcript", "summary": "T R A N S C R I P T Citi First Quarter 2024 Earnings Call April 12, 2024 Host Jennifer Landis,..."}, {"date": "20240416085300", "headline": "Investment Banking Bounceback Powers Big U.S. Lenders", "summary": "Top U.S. banks, including Bank of America, JPMorgan and Goldman, posted better-than-expected earnings thanks to strong consumer spending and a flurry of Wall Street activity."}, {"date": "20240416100527", "headline": "Wall Street bosses cheer investment banking gains but stay cautious", "summary": "Wall Street's bosses are finally seeing signs of a broader pickup in investment banking, but they are not cheering too loudly just yet.  Investment banking divisions showed robust growth in the first quarter for the largest U.S. banks, which reported surging revenues and fees.  Capital markets led the comeback, executives said."}, {"date": "20240416104742", "headline": "Big banks led by Citi continue to trim staff to cut costs", "summary": "(Reuters) -U.S. banking giants continued to shed employees in the first quarter, with Citigroup seeing the biggest drop.  Headcount at Citi declined by 2,000 employees after the third-largest U.S. lender completed a sweeping reorganization aimed at improving profits and reducing management layers.  Headcount at Bank of America, Wells Fargo and PNC Financial declined by about 2,000 jobs combined in the three months ended March 31 compared with the previous quarter."}, {"date": "20240416110929", "headline": "Citi’s Muni Exit Creates Liquidity Test If Downturn Hits Market", "summary": "(Bloomberg) -- The recent departure of Citigroup Inc., a perennial top-10 underwriter of municipal debt, from that industry may eventually pose a challenge in the next muni downturn, said officials at two of the largest market participants.Most Read from BloombergChina Tells Iran Cooperation Will Last After Attack on IsraelUS Two-Year Yield Hits 5% After Powell’s Remarks: Markets WrapBeyond the Ivies: Surprise Winners in the List of Colleges With the Highest ROIIMF Steps Up Its Warning to US Ove"}, {"date": "20240416142000", "headline": "JPMorgan/Citigroup Earnings Summaries: The Banking System Is In Pretty Good Shape", "summary": "JPM fell hard after their Q1 â\u0080\u009924 earnings release, which was probably more of a function of the rally the stock has seen since its $100 low in late 2022."}, {"date": "20240416145643", "headline": "Deposits are banking industry's 'boogeyman': Money manager", "summary": "Bank of America (BAC) and Morgan Stanley (MS) were the latest Big Bank stocks to report first-quarter earnings on Tuesday. Both topped earnings and revenue estimates, a trend consistent for major financial players who have reported earnings so far. Hennessy Funds Portfolio Manager David Ellison joins Market Domination to discuss the biggest boons and challenges for the banking sector. \"I think the boogeyman or the real new issue is what's going to happen to the deposit side,\" Ellison explains. \"Since the Silicon Valley-First Republic issues of a year or so ago, the deposit side has really been exposed as a risk factor for the industry that we've never had. So you see most of these large banks losing non-interest bearing deposits to the market...\" For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Luke Carberry Mogan."}, {"date": "20240416211200", "headline": "Analysts Have Conflicting Sentiments on These Financial Companies: Citigroup (C), Zurich Insurance Group (OtherZFSVF) and Banca Mediolanum SpA (OtherBNMDF)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416212400", "headline": "3 Stocks to Avoid According to Wall Street Analysts: April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416214800", "headline": "Citigroup Inc. stock outperforms competitors on strong trading day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416221100", "headline": "Analysts’ Opinions Are Mixed on These Financial Stocks: Citigroup (C), Bank of New York Mellon Corporation (BK) and Wells Fargo (WFC)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416222300", "headline": "Riding the Oil Wave: 3 Stocks to Buy Amid Middle East Tensions", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416230500", "headline": "Meta Who? 3 Under-the-Radar VR Stock Plays to Buy Instead", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417011900", "headline": "Morgan Stanley and HSBC Cut Asia-Pacific Jobs Amid Slowing Deals.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417020059", "headline": "Wall Street says a Wall Street revival is finally here", "summary": "Big bank bosses are not hiding their enthusiasm about Wall Street as first-quarter jumps in investment banking spur new hopes for a sustained dealmaking revival."}, {"date": "20240417030100", "headline": "Morgan Stanley, HSBC said to cut Asia investment-banking jobs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417031100", "headline": "Implied HCMT Analyst Target Price: $32", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417043700", "headline": "Smart Money Is Betting Big In Citigroup Options", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417051800", "headline": "Wall Street Bank Chiefs Anticipate IPO Market Revival Following Recent Successful Listings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417051900", "headline": "Wall Street Employs New Strategies Against Private Lending Competition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417091148", "headline": "Wall Street Takes New Role as Matchmaker to Private Credit", "summary": "(Bloomberg) -- Banks have found another way to fight back after private lenders have grabbed ever larger pieces of the lucrative business of financing leveraged buyouts.Most Read from BloombergDubai Grinds to Standstill as Cloud Seeding Worsens FloodingTesla Asks Investors to Approve Musk’s $56 Billion Pay AgainChina Tells Iran Cooperation Will Last After Attack on IsraelWhat If Fed Rate Hikes Are Actually Sparking US Economic Boom?Red Lobster Considers Bankruptcy to Deal With Leases and Labor C"}, {"date": "20240417143353", "headline": "Bank of America CEO: The Federal Reserve is winning the war on inflation", "summary": "Bank of America CEO Brian Moynihan weighs in on the fight against inflation and another solid quarter of consumer spending."}, {"date": "20240417161520", "headline": "Market Reaction To Bank Earnings Is Mixed, JPMorgan Analysts Project Further Decline In Net Interest Income", "summary": "As the U.S. financial sector grapples with recent earnings releases, investor reactions have been mixed. Some stocks are witnessing declines. Others are posting gains. See below. Banks Q1 Earnings Reports And Market Reactions, So Far Company Ticker Mkt Cap ($ mn) Price ($) Rating JPMorgan Price Target End Date Q1 Earnings Date EPS Revenue Stock Reaction (since earnings) as of April 18, 2:40 PM ET Citigroup Inc. C 119,590.80 62.84 N 64 Dec-24 Apr 12 Beat Beat -4.46% Wells Fargo WFC 206,396.90 57."}, {"date": "20240417190800", "headline": "Ibotta IPO jumps as investors continue to buy into AI hype (update)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417192600", "headline": "“All Done Or More To Come?” Stock Market (And Sentiment Results)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417201300", "headline": "SPDR ETF Report For Wednesday, April 17", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417201800", "headline": "Impact of Federal Reserve's Interest Rate Strategy on Global Markets Featuring Brazil's ...", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418023500", "headline": "CEO Uncertainty Spikes After Improving Last Quarter", "summary": "Banks kicked off Q1 earnings season with mixed results, proving that sizeable economic headwinds still persist. Read what investors need to know."}, {"date": "20240418041900", "headline": "Momentum Builds in Azul's Bid for Merger with Gol Airlines", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418055400", "headline": "Ibotta IPO jumps as investors continue to buy into AI hype", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418080003", "headline": "Why Citigroup Is My Favorite Buffett Stock", "summary": "The bank appears to be underearning and trades at a bargain price"}, {"date": "20240418080853", "headline": "Citi Post Q1: I Like The Cost Cuts", "summary": "Citigroup is implementing strong cost-cutting measures through headcount reduction and organizational streamlining. Find out why C stock is a Buy."}, {"date": "20240418092158", "headline": "7 Michael Burry Stocks to Buy if You’re Looking for Deep Value", "summary": "While you should never invest based on any one metric or person’s guidance, a possible exception can be made for Michael Burry stocks. Granted, you still need to conduct your own due diligence. Still, the reclusive hedge fund manager tends to win big with his contrarian trades. Of course, we all know Burry from his exploits featured in the book and film “The Big Short.” However, the investment genius – who also holds a medical degree from Vanderbilt – has made many other picks as well. Indeed, h"}, {"date": "20240418160000", "headline": "Finance firms urge ambitious action on plastic pollution", "summary": "A group of 160 financialcompanies on Friday urged governments to agree a treaty to endplastic pollution that would help spur private sector action,ahead of the next round of global talks in..."}, {"date": "20240418195500", "headline": "SPDR ETF Report For Thursday, April 18", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418200900", "headline": "ShipBob selects JPMorgan to lead its planned IPO, Bloomberg reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418201900", "headline": "Regulators said to revive bid to rein in Wall Street bonus payouts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419015600", "headline": "Notable open interest changes for April 19th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419031900", "headline": "US Banks Accelerate Preferred Stock Deals Amid Rate Cut Speculation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419134644", "headline": "ShipBob Picks JPMorgan to Lead IPO As Soon As Late 2024", "summary": "(Bloomberg) -- E-commerce fulfillment service provider ShipBob Inc. has chosen JPMorgan Chase & Co. to lead its planned initial public offering, people familiar with the situation said. Most Read from BloombergElon Wants His Money BackNew York’s Rich Get Creative to Flee State Taxes. Auditors Are On to ThemDubai Grinds to Standstill as Flooding Hits City‘Mag Seven’ Get Crushed Before Next Week’s Results: Markets WrapIsrael Reported to Have Launched Retaliatory Strike on IranChicago-based ShipBob"}, {"date": "20240419225900", "headline": "3 Finance Stocks to Consider as Earnings Approach", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420232500", "headline": "Opening Day: Ibotta soars in strong market debut", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421050023", "headline": "One Citigroup Insider Has Reduced Their Stake", "summary": "Looking at Citigroup Inc.'s ( NYSE:C ) insider transactions over the last year, we can see that insiders were net..."}, {"date": "20240421214500", "headline": "Tesco commences share buyback programme of up to GBP1 billion", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421222900", "headline": "CNH Industrial hires Iveco head Gerrit Marx as new chief executive", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422035046", "headline": "Citi managing director details 'pervasive' sexual harassment in lawsuit", "summary": "A Citigroup managing director said the bank failed to protect her from a supervisor's violent threats and abuse because of its pervasive culture of sexual harassment and gender discrimination,..."}, {"date": "20240422041547", "headline": "Copper Hones in on $10,000 a Ton as Supply Angst Continues", "summary": "(Bloomberg) -- Copper rallied towards $10,000 a ton, hitting a new two-year high on its way, as investors continue to pile in on a bet that miners will struggle to service a surge in demand for the bellwether industrial metal. Most Read from BloombergTrump Has Only $6.8 Million for Legal Fees With Trial UnderwayTikTok to Remove Executive Tasked With Fending Off US ClaimsChina Is Front and Center of Gold’s Record-Breaking RallyTesla Spends Weekend Cutting Prices of Cars and FSD SoftwareThe Fed’s"}, {"date": "20240422062900", "headline": "Goldman’s buybacks basket: Buyback growth will be 13% in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422064100", "headline": "10 Financials Stocks Whale Activity In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422094421", "headline": "Citigroup Should Benefit From Expense Inflection Point", "summary": "Citigroup trades at just 68% of tangible book value per share and offers a 3.6% dividend yield. Click here to read my analysis of C stock."}, {"date": "20240422133004", "headline": "Citigroup Sells Maple Bonds in First Sizable Deal Since 2015", "summary": "(Bloomberg) -- Citigroup Inc. sold a large debt offering in the Canadian-dollar bond market for the first time in nearly a decade as US banks seek to diversify funding after reporting earnings. Most Read from BloombergTrump Has Only $6.8 Million for Legal Fees With Trial UnderwayRay Dalio’s Famous Trade Is Sputtering and Investors Are BailingStocks Climb as US Earnings Kick Into High Gear: Markets WrapTikTok to Remove Executive Tasked With Fending Off US ClaimsRussians Transform Dubai as They Fl"}, {"date": "20240422135238", "headline": "Citigroup Knowingly Tolerated Environment 'Hostile to Women,' Managing Director Alleges in Court Filing", "summary": "Citigroup Knowingly Tolerated Environment 'Hostile to Women,' Managing Director Alleges in Court Filing"}, {"date": "20240422191647", "headline": "News Highlights : Top Company News of the Day - Tuesday at 1 AM ET", "summary": "SAP Stock Rises. Revenue Edged Estimates, but Earnings Missed. The German enterprise software giant's results were a smidgen ahead of Wall Street's expectations. FTC Blocks $8.5 Billion..."}, {"date": "20240422192000", "headline": "CFTC said to be probing big banks' confidential agreements in swaps, clearing businesses", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422193400", "headline": "Citigroup Inc Chart Analysis", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422205100", "headline": "Regulators probe potential use by big banks of nondisclosure agreements to discourage whistleblowers: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422211548", "headline": "News Highlights : Top Company News of the Day - Tuesday at 3 AM ET", "summary": "SAP Stock Rises. Revenue Edged Estimates, but Earnings Missed. The German enterprise software giant's results were a smidgen ahead of Wall Street's expectations. Primark Owner AB Foods..."}, {"date": "20240422220100", "headline": "Turning a Vault Into a Bomb Shelter: How Citigroup Has Kept Its Bank Running Inside Ukraine", "summary": "Two years into the war, Citigroup is the only U.S. bank around, navigating a sometimes treacherous landscape."}, {"date": "20240422230800", "headline": "Contact Gold Shareholders Approve Orla Acquisition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422231458", "headline": "MOVES-Citi appoints Amit Dhawan as head of Citi Commercial Bank for Singapore", "summary": "Citigroup said on Tuesday that it has appointed Amit Dhawan as the head of Citi Commercial Bank for Singapore, effective Monday, according to a statement.  The bank said Dhawan, who has over three decades of banking experience, will oversee all Citi Commercial Bank business and operations in the city-state and will be responsible for driving the business' strategy and financial performance.  \"Singapore is an important hub for Citi Commercial Bank, given its status as a top financial center as well as its proximity and connectivity to other Asian markets,\" Gunjan Kalra, head of Citi Commercial Bank for Asia North, Australia and Asia South clusters said in the statement."}, {"date": "20240422231838", "headline": "News Highlights : Top Company News of the Day - Tuesday at 5 AM ET", "summary": "SAP Stock Rises. Revenue Edged Estimates, but Earnings Missed. The German enterprise software giant's results were a smidgen ahead of Wall Street's expectations. Primark Owner AB Foods..."}, {"date": "20240423003454", "headline": "Should You Maintain Your Conviction in Citigroup (C)?", "summary": "Patient Capital Management, a value investing firm, released its “Patient Capital Opportunity Equity Strategy” first quarter 2024 investor letter. A copy of the same can be downloaded here. During the quarter the strategy returned 11.8% net of fees compared to the S&P 500’s 10.6% return. The outperformance of the portfolio can be attributed to selection and […]"}, {"date": "20240423010000", "headline": "Citigroup Preferred Offers 10% Yield—and Plenty of Risk", "summary": "An unusual Citigroup preferred issue has a tempting current yield of 10%, but the bank can redeem it for less than the current market price."}, {"date": "20240423011622", "headline": "News Highlights : Top Financial Services News of the Day - Tuesday at 7 AM ET", "summary": "Cathie Wood's Popular ARK Funds Are Sinking Fast Investors have pulled a net $2.2 billion from ARK's active funds this year, topping outflows from all of 2023. Blackstone's Beleaguered..."}, {"date": "20240423033200", "headline": "Unpacking the Latest Options Trading Trends in Citigroup", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423051614", "headline": "News Highlights : Top Financial Services News of the Day - Tuesday at 11 AM ET", "summary": "BOE Chief Economist Pill Says Key Rate Cut Is Some Way Off A first cut in the Bank of England's key interest rate remains some way off, its chief economist said. Cathie Wood's Popular ARK..."}, {"date": "20240423060007", "headline": "Citi failed to protect managing director from sexual harassment, lawsuit claims", "summary": "Ardith Lindsey filed additional details Monday in her lawsuit against the bank regarding a supervisor’s threats against her and her family."}, {"date": "20240423061500", "headline": "3 Stocks to Buy Today as Investment Banking Rebounds", "summary": "Investment banks got a huge boost from strong IPO and debt issuance markets in the first quarter."}, {"date": "20240423101521", "headline": "News Highlights : Top Financial Services News of the Day - Tuesday at 4 PM ET", "summary": "BOE Chief Economist Pill Says Key Rate Cut Is Some Way Off A first cut in the Bank of England's key interest rate remains some way off, its chief economist said. Cathie Wood's Popular ARK..."}, {"date": "20240423105705", "headline": "Market Chatter: CFTC Asks Big Banks for Nondisclosure Agreements in Swaps, Clearing Amid Whistleblower Concerns", "summary": "Market Chatter: CFTC Asks Big Banks for Nondisclosure Agreements in Swaps, Clearing Amid Whistleblower Concerns"}, {"date": "20240423181507", "headline": "News Highlights : Top Financial Services News of the Day - Wednesday at 12 AM ET", "summary": "Visa's stock gains after earnings, as one simple message resonates Visa shares were moving higher in after-hours trading Tuesday, after the payments company sported an earnings beat and showed..."}, {"date": "20240423233400", "headline": "Betting on Zuck’s Luck: Why Wall Street’s Finest Are Going All-In on Meta Stock Ahead of Earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424011616", "headline": "News Highlights : Top Financial Services News of the Day - Wednesday at 7 AM ET", "summary": "Lloyds Banking Keeps Outlook as Net Interest Margin Tops Hopes Lloyds Banking maintained its full-year guidance as it reported a slightly better-than-expected net interest margin for the first..."}, {"date": "20240424020127", "headline": "Wall Street bosses tested by calls to strip them of power", "summary": "Some of Wall Street’s most powerful bosses are facing new shareholder proposals this spring that would strip them of power by separating CEO and chairman seats."}, {"date": "20240424030317", "headline": "Royal Bank of Canada: Risks Ahead", "summary": "Royal Bank of Canada reported solid Q1/24 results. Check out why I think RY stock is not a good investment right now."}, {"date": "20240424035657", "headline": "HSBC says growing Chinese wealth fuels client investments in US", "summary": "HSBC's wealthyclients in China and Hong Kong are still eager to invest in theU.S., according to Michael Roberts, the bank's CEO for the USAand Americas. China's economic growth..."}, {"date": "20240424044200", "headline": "Cashing In on Earnings: 3 Financial Stocks Set to Surge", "summary": "The financial sector is often seen as a bellwether for the overall economy, and right now, it’s sending out healthy signals. As expectations for a soft landing of the U.S. economy increase, financial stocks are on investors’ radars. Additionally, improving consumer sentiment levels and a resilient housing market are also contributing to a favorable environment for financial stocks. In this article, we’ll take a closer look at three financial stocks that could continue to do well in the coming mo"}, {"date": "20240424044515", "headline": "Citigroup : Early redemption / Cancellation / Delisting Early redemption - ISIN CA172967EB37", "summary": "For Immediate Release Citigroup Inc. April 24, 2024 Citigroup Announces C$56.782 Million Redemption of 5.160% Fixed..."}, {"date": "20240424045800", "headline": "Dividend Investing: Only 14 S&P stocks have a 3% yield and have climbed over 10% YTD", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424070000", "headline": "Citigroup Announces C$56.782 Million Redemption of 5.160% Fixed Rate / Floating Rate Subordinated Notes due 2027", "summary": "NEW YORK, April 24, 2024--Citigroup Inc. is announcing the redemption, in whole, constituting C$56,782,000 of its 5.160% Fixed Rate / Floating Rate Subordinated Notes due 2027 (the \"notes\") (ISIN: CA172967EB37)."}, {"date": "20240424101916", "headline": "Goldman's David Solomon defeats vote on CEO-chair split even as support for it increases", "summary": "David Solomon defeated a proposal seeking to separate his roles as CEO and chairman of Goldman Sachs, but the measure received double the support it did in 2023."}, {"date": "20240424131019", "headline": "Lucid Stock Has 14% Upside, According to 1 Wall Street Analyst", "summary": "Lucid's technology could hold the key to further gains."}, {"date": "20240424140343", "headline": "Citi Eyes $2 Billion Debt Package for Berry, Glatfelter Deal", "summary": "(Bloomberg) -- Citigroup Inc. and Wells Fargo & Co. are preparing a $2 billion debt package to support Berry Global Group Inc.’s spinoff of the majority of its health, hygiene and specialties business with Glatfelter Corp., according to a person with knowledge of the matter. Most Read from BloombergBiden’s Gains Against Trump Vanish on Deep Economic Pessimism, Poll ShowsTaylor Swift Is Proof That How We Critique Music Is BrokenTech Giants Hit in Late Hours After Meta’s Outlook: Markets WrapMeta"}, {"date": "20240424232300", "headline": "SoFi Stock: The Smart Play for Investors Seeking the Next Fintech Gem?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425000500", "headline": "More Work To Do? Stock Market (and Sentiment Results)…", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425000600", "headline": "More Work To Do? Stock Market (And Sentiment Results)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425004000", "headline": "Contact Gold Corp Finalizes Merger with Orla Mining", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425050021", "headline": "Investors more bullish on Citigroup (NYSE:C) this week as stock lifts 7.4%, despite earnings trending downwards over past year", "summary": "If you want to compound wealth in the stock market, you can do so by buying an index fund. But if you pick the right..."}, {"date": "20240425050200", "headline": "RBRK Stock IPO: 7 Things to Know as Rubrik Starts Trading Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425052345", "headline": "Citigroup Offers Bearish Take on Crude, Sees Easing of Geopolitical Risks -- OPIS", "summary": "Citigroup analysts on Thursday called Brent crude's brief trip this month above $90/bbl a bullish knee-jerk price action. The price jump, which was fueled by concerns over a potential widening..."}, {"date": "20240425062100", "headline": "Notable Thursday Option Activity: C, STLD, ORLY", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425080506", "headline": "20 Most Profitable Banks in the US in 2024", "summary": "In this piece, we will take a look at the 20 most profitable banks in the US in 2024. If you want to skip our coverage of the latest news in the US banking industry, then you can take a look at the 5 Most Profitable Banks in the US in 2024. The US banking […]"}, {"date": "20240425102224", "headline": "Citigroup : Citi 2024 Annual Stockholders' Meeting", "summary": "New York - Citigroup Inc. will hold its 2024 Annual Stockholders' Meeting on Tuesday, April 30, 2024, at 9 a.m. Eastern Time . This year's Annual Meeting will be held in a virtual format. A..."}, {"date": "20240426010700", "headline": "Dividend Roundup: MetLife, General Motors, Pfizer, Citigroup, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426041400", "headline": "June 7th Options Now Available For Citigroup", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426073311", "headline": "Treasuries gain as traders find relief in key inflation readings", "summary": "US bond yields retreated from their highest levels since November as the PCE print came in less hot than feared."}, {"date": "20240426110635", "headline": "Citi Spinoff Mints $4 Billion Fortune for CVC Buyout Barons", "summary": "(Bloomberg) -- About three decades ago, a group of Citigroup Inc. dealmakers including Donald Mackenzie, Steven Koltes and Rolly van Rappard left the Wall Street giant to strike out on their own. Most Read from BloombergJavier Milei Fuels Wild Rally That Makes Peso No. 1 in WorldPlunging Home Prices, Fleeing Companies: Austin’s Glow Is FadingFed’s Preferred Core Inflation Gauge Rose at Brisk Pace in MarchHuawei’s New Phone Runs Latest Version of Made-in-China ChipBillionaire Stephen Ross Believe"}, {"date": "20240426141500", "headline": "Citigroup Announces $2.0 Billion Redemption of 0.981% Fixed Rate / Floating Rate Notes due 2025 and $500.0 Million Redemption of Floating Rate Notes due 2025", "summary": "NEW YORK, April 26, 2024--Citigroup Inc. is announcing the redemption, in whole, constituting $2,000,000,000 of its 0.981% Fixed Rate / Floating Rate Notes due 2025 (the \"fixed rate / floating rate notes\") (ISIN: US172967MX62), and the redemption, in whole, constituting $500,000,000 of its Floating Rate Notes due 2025 (the \"floating rate notes\" and, together with the fixed rate / floating rate notes, the \"notes\") (ISIN: US172967MW89)."}, {"date": "20240427212400", "headline": "Credit card delinquency rates fall in March as consumers keep spending", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427231700", "headline": "Opening Day: Rubrik jumps 20% in market debut", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428031300", "headline": "Electric Utilities: The AI Boom “Picks and Shovels” Play That’s Been Ignored", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428231908", "headline": "Citigroup: The Catalyst That Could Trigger A Melt-Up", "summary": "Citigroup's strategic restructure is progressing significantly, with a focus on high ROE business lines. Read why end of June is a critical time for C investors."}, {"date": "20240429020000", "headline": "American Express Can Sustain Its Rally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429030600", "headline": "Check Out What Whales Are Doing With Citigroup", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429041115", "headline": "Citigroup : ESG Report", "summary": "2023 Environmental, Social and Governance Report ..."}, {"date": "20240430030300", "headline": "Citigroup Stock: A Deep Dive Into Analyst Perspectives (12 Ratings)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430040600", "headline": "Seven bank-stock picks as industry nears ‘positive inflections’", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430060245", "headline": "Graphite Miners News For The Month Of April 2024", "summary": "Natural graphite under pressure from synthetics, amid oversupply, slow trade flows, andÂ mixedÂ but flatÂ China flake graphite prices. Explore more details here."}, {"date": "20240430072818", "headline": "4 Buyable Berkshire DiviDogs From April, Plus 5 To Watch", "summary": "25 of 41 current BKH owned stocks pay dividends.Â Read more to see a detailed analysis of the stocks listedÂ in this article."}, {"date": "20240430083808", "headline": "Citi CEO says US consumers are more cautious, emphasizes bank overhaul", "summary": "NEW YORK (Reuters) -Citigroup CEO Jane Fraser told shareholders on Tuesday that U.S. consumers are becoming more cautious with their spending and making smaller purchases.  U.S. borrowers earning lower incomes are increasingly struggling to keep up with loan payments, prompting banks to become more cautious about issuing credit cards and car loans.  \"Consumers remain healthy and resilient,\" Fraser said at the bank's annual meeting on Tuesday."}, {"date": "20240430102033", "headline": "UPDATE 2-Citi CEO says US consumers are more cautious, emphasizes bank overhaul", "summary": "Citigroup CEO Jane Fraser told shareholders on Tuesday that U.S. consumers are becoming more cautious with their spending and making smaller purchases.  \"Consumers remain healthy and resilient,\" Fraser said at the bank's annual meeting on Tuesday."}, {"date": "20240430111249", "headline": "Wells Fargo investors approve executive pay, CEO underscores risk controls", "summary": "Wells Fargo shareholders on Tuesday approved its plans for executive compensation with a majority vote, including hiking CEO Charlie Scharf's 2023 package to $29 million.  Scharf told investors at the bank's annual meeting that it is investing in risk and control infrastructure, which became top priorities after a 2016 scandal in which employees had opened millions of fraudulent accounts, often to meet sales goals.  \"Our control environment has become increasingly stronger to numerous internal metrics and shows that the work is clearly improving in our control environment but we will not be satisfied until all of our work is complete,\" Scharf said."}, {"date": "20240430150211", "headline": "Citigroup : Supplement - DOC00425419", "summary": "Supplement - DOC00425419 Supplement - DOC00425419 Below you will find information from the register notified prospectuses. The information has been..."}, {"date": "20240430150417", "headline": "Citigroup : Supplement - DOC00425429", "summary": "Supplement - DOC00425429 Supplement - DOC00425429 Below you will find information from the register notified prospectuses. The information has been..."}, {"date": "20240501020123", "headline": "Whether Wall Street garden leaves survive non-compete ban is an 'open question'", "summary": "Some 'garden leave' agreements that Wall Street uses to protect secrets are expected to survive the FTC's new non-compete ban, but some probably won't."}, {"date": "20240501033100", "headline": "Ex-Dividend Reminder: WestAmerica Bancorporation, First Interstate BancSystem and Citigroup", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501040302", "headline": "Exclusive-Citigroup sees loan book hit in climate action ramp-up, document shows", "summary": "Citigroup could suffer billions of dollars of losses in its loan book if the world sped up efforts to tackle climate change, according to a confidential analysis prepared by the U.S. bank that was reviewed by Reuters.  The analysis was drafted by Citigroup last summer as it prepared to make a submission to the Federal Reserve on how it plans to manage the impacts of climate change.  Five other major U.S. banks were also required to make confidential submissions using the same instructions from the Fed."}, {"date": "20240501043753", "headline": "Citigroup sees loan book hit in climate action ramp-up, document shows", "summary": "Citigroupcould suffer billions of dollars of losses in its loan book ifthe world sped up efforts to tackle climate change, according toa confidential analysis prepared by the U.S. bank that..."}, {"date": "20240501052700", "headline": "Federal Reserve moving forward with bank capital rules, Bloomberg says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501060600", "headline": "Federal Reserve Coup: What Trump Would Change at the Fed in a Second Term", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501063900", "headline": "Shhh! 3 Secret Machine Learning Stocks Flying Below Wall Street’s Radar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501063900", "headline": "10 Financials Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501064500", "headline": "U.S. banking regulators push to rework Basel III endgame rule - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501101720", "headline": "Citi Banker Exits After Firm Probed Treatment of Junior Staffer", "summary": "(Bloomberg) -- Edward Ruff has departed Citigroup Inc. after the firm put the senior dealmaker on leave while it was investigating his treatment of a junior banker, according to a person familiar with the matter. Most Read from BloombergUS and Saudis Near Defense Pact Meant to Reshape Middle EastTesla Axes Supercharger Team in Blow to Broader EV MarketNYPD Arrests Over 300 Protesters in Crackdown on College CampusesThe Ozempic Effect: How a Weight Loss Wonder Drug Gobbled Up an Entire EconomyTre"}, {"date": "20240501121124", "headline": "Citigroup's VC arm invests in API security startup Traceable", "summary": "In 2017, Jyoti Bansal co-founded San Francisco-based security company Traceable alongside Sanjay Nagaraj, a former investor. With Traceable, Bansal -- who previously co-launched app performance management startup AppDynamics, acquired by Cisco in 2017 -- sought to build a platform to protect customers' APIs from cyberattacks. Attacks on APIs -- the sets of protocols that establish how platforms, apps and services communicate -- are on the rise. API attacks affected nearly one-quarter of organiza"}, {"date": "20240501161232", "headline": "Update: Market Chatter: Citigroup Could See Big Hit to Loan Book from Heightened Climate Action", "summary": "Update: Market Chatter: Citigroup Could See Big Hit to Loan Book from Heightened Climate Action"}, {"date": "20240501194500", "headline": "Precious Profits: 3 Silver Stocks to Scoop Up on the Upswing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501201800", "headline": "Noteworthy Thursday Option Activity: C, WAL, RKT", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501202600", "headline": "Stock Market Crash Warning: Don’t Get Caught Holding These 3 Energy Stocks.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501212500", "headline": "Citigroup Enhances Stock Plan and Elects Board Directors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501220200", "headline": "First Pacific Advisors Exits American International Group in Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502013819", "headline": "Citi banker, accused of berating and intimidating employees, leaves: report", "summary": "Edward Ruff was placed on leave in January as the bank investigated allegations he intimidated one co-worker and shouted insults at members of his team because they were late to a call."}, {"date": "20240502020016", "headline": "Whether Wall Street garden leaves survive noncompete ban is an 'open question'", "summary": "Some 'garden leave' agreements that Wall Street uses to protect secrets are expected to survive the FTC's new noncompete ban, but some probably won't."}, {"date": "20240502035600", "headline": "See Which Of The Latest 13F Filers Holds Citigroup", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502050140", "headline": "Citigroup Inc's Dividend Analysis", "summary": "Citigroup Inc (NYSE:C) recently announced a dividend of $0.53 per share, payable on 2024-05-24, with the ex-dividend date set for 2024-05-03.  As investors look forward to this upcoming payment, the spotlight also shines on the company's dividend history, yield, and growth rates.  Using the data from GuruFocus, let's look into Citigroup Inc's dividend performance and assess its sustainability."}, {"date": "20240502065200", "headline": "See How Citigroup Ranks Among Analysts' Top Picks With Strong Buyback Activity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502070016", "headline": "Citigroup Inc. (C) Is a Trending Stock: Facts to Know Before Betting on It", "summary": "Recently, Zacks.com users have been paying close attention to Citigroup (C). This makes it worthwhile to examine what the stock has in store."}, {"date": "20240502092509", "headline": "Night Vision Firm Exosens Seeks Up to €400 Million Paris IPO", "summary": "(Bloomberg) -- French night-vision technology company Exosens is planning an initial public offering in Paris that may raise between €300 million and €400 million, according to people familiar with the matter.Most Read from BloombergSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineBiden Calls Ally Japan ‘Xenophobic’ Along With China, RussiaUS and Saudis Near Defense Pact Meant to Reshape Middle EastTurkey Halts All Trade With Israel Over War in GazaIn Jamie Dimon's America, the Stoc"}, {"date": "20240502153011", "headline": "ECB Isn’t Pre-Committing to Particular Rate Path, Lane Says", "summary": "(Bloomberg) -- The European Central Bank is taking a meeting-by-meeting approach for it’s next steps on monetary policy, according to Chief Economist Philip Lane.Most Read from BloombergSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineTurkey Confirms All Trade Halt With Israel Over War in GazaHuawei Secretly Backs US Research, Awarding Millions in PrizesBiden Calls Ally Japan ‘Xenophobic’ Along With China, RussiaIn Jamie Dimon's America, the Stock Market Has Already Voted“We are not"}, {"date": "20240502193300", "headline": "Citi Just Cut Its Price Target on These 3 Stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502234900", "headline": "IN BRIEF: Hiscox completes first of two tranches of share buyback", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503021252", "headline": "Bank of America: Wait For A Better Price", "summary": "Bank of America's Q1 2024 results showed negative revenue growth and a decline in net income. Find out why BAC stock is a Hold."}, {"date": "20240503050925", "headline": "Citigroup : Joining Forces to Fight World Hunger", "summary": "As a global bank, our mission has always been about enabling progress, which puts us in a strong position to stand for important issues and catalyze change. That is why we are announcing a..."}, {"date": "20240503055311", "headline": "Notice", "summary": "CITIGROUP INCThis announcement has been issued through the Companies Announcement Service ofEuronext Dublin.To view the announcement in full, please click..."}, {"date": "20240503055940", "headline": "Dive Deposits: Citi’s climate portrait shows a big contrast", "summary": "This week, Citi disclosed it is on pace to reach its 2030 sustainable finance goals, but Reuters also found a draft indicating the losses the bank would incur if the world goes net zero."}, {"date": "20240503064500", "headline": "From Speculation To Revelation: JPMorgan Reportedly Unveils IndexGPT AI Tool", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503080000", "headline": "Citigroup's Rally Still Has Legs - Pay Attention To Its ROTCE", "summary": ""}, {"date": "20240503164711", "headline": "Citi Says European Authorities Are Scrutinizing 2022 Flash Crash", "summary": "(Bloomberg) -- Two years after a Citigroup Inc. trader’s fat-finger error briefly sent European stocks swooning, the bank said authorities are investigating what happened.Most Read from BloombergEverything Apple Plans to Show at May 7 ‘Let Loose’ iPad EventSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineApple Rallies Most in 18 Months on Upbeat Forecast, BuybackTrump Auditions VP Picks Before Wealthy Donors in Palm BeachEven the World’s Most-Envied Retirement Plan Is Falling Short“"}]}