{"news": [{"date": "20240420010100", "headline": "Bull Market Buys: 3 Dividend Stocks to Own for the Long Run", "summary": "If you are looking to buy good dividend stocks to hold for years to come, this varied trio should be atop your list today."}, {"date": "20240420090000", "headline": "Big Oil’s Carbon Capture Conundrum", "summary": "Energy experts and environmentalists express concerns about Big Oil's overreliance on carbon capture technology as a means to decarbonize operations while maintaining high fossil fuel output."}, {"date": "20240420140100", "headline": "2 No-Brainer Oil Stocks to Buy With $1,000 Right Now", "summary": "Oil prices are being affected by geopolitical forces right now, which is exactly why investors will want to own these two energy leaders."}, {"date": "20240420224900", "headline": "Can Magnificent 7 Help Script Market Turnaround? Earnings Pick Up Pace With Microsoft, Meta, Alphabet And Tesla Expected This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421004642", "headline": "Wall Street Breakfast: The Week Ahead", "summary": "Stay updated with the latest financial news and market trends by listening to the Wall Street Breakfast podcast available on Seeking Alpha, iTunes, and..."}, {"date": "20240421010500", "headline": "Earnings week ahead: Tesla, Meta Platforms, Google, Microsoft, Intel, Exxon Mobil, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421034500", "headline": "Think Crude Oil Is Going to $100 a Barrel? Then You'll Love These 3 Dividend Stocks.", "summary": "The energy sector continues to be an excellent opportunity for income and value-orientated investors."}, {"date": "20240421070000", "headline": "ExxonMobil and Chevron Stock Have 22%-30% Upside, According to 1 Wall Street Analyst", "summary": "These two oil stocks are attractive, but they might not necessarily be the best way for retail investors to play the energy sector."}, {"date": "20240421072122", "headline": "Shell: A NYSE Listing Won't Be A Game Changer", "summary": "Shell considers a NYSE listing to bridge the valuation gap with US peers."}, {"date": "20240421184026", "headline": "Oil Falls After Weekly Loss as Traders Focus on Middle East Risk", "summary": "(Bloomberg) -- Oil fell after its first back-to-back weekly decline this year as traders weighed the potential next steps from Iran and Israel amid simmering tensions in the Middle East.Most Read from BloombergTikTok to Remove Executive Tasked With Fending Off US ClaimsElon Musk’s Robotaxi Dreams Plunge Tesla Into ChaosTesla Spends Weekend Cutting Prices of Cars and FSD SoftwareThe Fed’s Forecasting Method Looks Increasingly Outdated as Bernanke Pitches an AlternativeTrump Has Only $6.8 Million"}, {"date": "20240421184139", "headline": "SCHD: If You've Won The Game, Take A Little Off The Top", "summary": "SCHD is a great capital gains storage for positions that may be getting over-concentrated in your portfolio. Read why SCHD ETF is a Buy."}, {"date": "20240421224700", "headline": "Commodity Roundup: Oil sheds over 2%, gold down 1% as Mideast tensions ease", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422000200", "headline": "Options Volatility and Implied Earnings Moves This Week, April 22 – April 26, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422030000", "headline": "Chevron Q1 Earnings Preview: Guidance Boost Expected", "summary": "Chevron's Q1 revenue stagnated, but positive market sentiment likely to boost the fiscal 2024 outlook. Find why I reiterate my \"Strong Buy\" rating for CVX stock."}, {"date": "20240422033000", "headline": "Time To Buy Chevron's Stock As Q1 Earnings Approach?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422035100", "headline": "Meet the Surprising Oil Stock Lawmakers Couldn't Stop Buying in 2023 (Hint: It's Not Chevron or ExxonMobil)", "summary": "This stock edged out Apple as the top stock bought by members of Congress last year."}, {"date": "20240422040405", "headline": "As shale oil gains slow, deepwater port struggles for customers", "summary": "As U.S. shale oil boomed last decade, an oil pipeline company pitched an ambitious multi-billion-dollar export port off the Texas coast to ship domestic crude to buyers in Europe and Asia.  In April, Enterprise Products Partners' SPOT became the first project to receive a license from the U.S. maritime regulator for a deepwater port that could load two supertankers, each of which can carry up to 2 million barrels of oil at a time.  But multi-year regulatory delays, a loss of commercial backers and slowing U.S. shale production has left SPOT, or Sea Port Oil Terminal, and its three rival projects without any secured customers, energy industry executives say."}, {"date": "20240422041000", "headline": "Dividend yield and growth stock list by Goldman", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422062900", "headline": "Time to Buy Chevron's (CVX) Stock as Q1 Earnings Approach?", "summary": "Chevron (CVX) has exceeded the earnings mark in three of the past four quarters."}, {"date": "20240422091006", "headline": "Chevron : Helping the earth is a team sport", "summary": "Most recently, Woodard joined co-workers from a facility in Belle Chasse, Louisiana, to plant trees at the Woodlands Conservancy, a nonprofit land trust. It..."}, {"date": "20240422154516", "headline": "Chevron (CVX) Laps the Stock Market: Here's Why", "summary": "In the latest trading session, Chevron (CVX) closed at $161.92, marking a +1.2% move from the previous day."}, {"date": "20240423000200", "headline": "Fuel Your Profits: Why Shell Stock Is Poised to Soar Amid Global Turmoil", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423003300", "headline": "7 Stocks With the Most Potential to Rocket on Q1 Earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423030300", "headline": "The 7 Best Positioned Dow Stocks for April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423054500", "headline": "If You'd Invested $1,000 in Chevron 5 Years Ago, Here's How Much You'd Have Today", "summary": "The oil company's gushing dividend is a crucial part of its return."}, {"date": "20240423074545", "headline": "Best Energy Stocks To Invest In Now? 3 To Know", "summary": "Energy stocks to watch in the stock market today."}, {"date": "20240423161600", "headline": "Energy Earnings: Two Reports to Watch This Week", "summary": "We've got a busy slate of earnings this week, with representation from two well-known energy heavyweights. How do expectations stack up?"}, {"date": "20240424065700", "headline": "XOM vs CVX: Which Energy Stock Shows Promise Ahead of Q1 Earnings?", "summary": "Considering the current uncertainty surrounding Chevron's (CVX) acquisition of Hess, we can say that ExxonMobil (XOM) is on a better footing than Chevron ahead of Q1 earnings."}, {"date": "20240424095900", "headline": "Billionaire Texas oilman inks deal with Venezuela's state-run oil giant as US sanctions loom", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424144500", "headline": "Analysts Predict 20%+ Upside For These 3 Dividend Aristocrats", "summary": "Analysts are bullish on three well-known Dividend Aristocrats, forecasting upside potential as high as 25%. NextEra Energy Inc. (NYSE:NEE), Chevron Corp. (NYSE:CVX), and Exxon Mobil Corp. (NYSE:XOM) have all received recent positive analyst coverage ..."}, {"date": "20240424164501", "headline": "UPDATE 1-Hess sets April 12 record date for shareholder vote on Chevron merger", "summary": "Hess Corp on Wednesday said its board has set April 12 as the record date for the determination of the stockholders entitled to vote on the proposed merger with Chevron Corp.  Shareholders will vote on the proposed deal in a meeting whose date is yet to be set, the company said in a U.S. securities filing.  Neither Chevron nor Hess can predict the actual date on which the transaction will be completed, it said in the filing."}, {"date": "20240424165300", "headline": "Breaking Down Q1 Earnings Results", "summary": "The picture emerging from the Q1 earnings season is one of steady improvement and resilience, with the earnings growth pace modestly accelerating and estimates for the coming periods starting to increase. But will the positivity continue?"}, {"date": "20240424200700", "headline": "Chevron Corporation (CVX) Shares Cross 4% Yield Mark", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424201200", "headline": "Crude Awakening: 3 Energy Plays Set to Strike Liquid Gold for Investors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424201700", "headline": "Top 10 S&P 500 energy stocks of 2024, with earnings from XOM and CVX on deck", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424214000", "headline": "Chevron Corp. stock rises Thursday, outperforms market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424231500", "headline": "Chevron affiliate Tengizchevroil commences operations at oil field in Kazakhstan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425015400", "headline": "US Faces Mounting Plastic Waste Challenge With Limited Recycling Solutions After China's 2018 Import Ban: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425022900", "headline": "Chevron's Kazakhstan JV starts WPMP operations at Tengiz oil field", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425030300", "headline": "Chevron, Hess extend merger completion date by six months", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425033000", "headline": "Tengizchevroil starts WPMP operations at Tengiz oil field in Kazakhstan", "summary": "SAN RAMON, Calif., April 25, 2024--Chevron Corporation (NYSE: CVX) announced today that its 50 percent owned affiliate Tengizchevroil LLP (TCO) has safely commenced operations at its Wellhead Pressure Management Project (WPMP) at the Tengiz oil field in Kazakhstan."}, {"date": "20240425040700", "headline": "Notable earnings before Friday's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425055800", "headline": "Zacks Earnings Trends Highlights: Exxon and Chevron", "summary": "Exxon and Chevron are part of the Zacks Earnings Trends article."}, {"date": "20240425061100", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425062809", "headline": "Chevron-target Hess reports Q1 profit beat on higher production", "summary": "Hess Corp reported a first-quarter profit on Thursday that beat analysts' estimates, helped by higher production from the oil and gas company that is set to be acquired by U.S. energy major Chevron in a $53 billion deal.  Net production at Hess jumped 27.3% to 476,000 barrels of oil equivalent per day (boepd) in the quarter, primarily due to higher production in Guyana and the Bakken oil field in the United States.  Hess' lucrative assets in oil-rich Guyana have sparked a major corporate tug-of-war among large North American energy firms."}, {"date": "20240425065100", "headline": "Exxon and Chevron Q1 2024 earnings on deck; what to expect", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425083626", "headline": "UPDATE 1-Hess profit jumps on Guyana output in positive sign for Exxon", "summary": "Hess Corp on Thursday reported first-quarter earnings well above analysts' forecasts, driven by a 28% increase in Guyana oil output, a sign Exxon Mobil's results out Friday could also top forecasts.  Last October, Hess agreed to sell itself to Chevron for $53 billion in stock, but the deal has been stalled by a regulatory review and challenged by Exxon, which claims a right to Hess's Guyana assets."}, {"date": "20240425100559", "headline": "20 Countries That Increased Oil Production the Most in A Decade", "summary": "In this article, we discuss the 20 Countries That Increased Oil Production the Most in A Decade. If you want to skip our discussion of the oil markets, you can go directly to 5 Countries That Increased Oil Production the Most in A Decade. Oil stands as an important commodity that has influence across industries […]"}, {"date": "20240425104230", "headline": "Hydrogen Energy Lags In The Climate Race. But Don't Count It Out.", "summary": "Billions of dollars are being spent to extract hydrogen energy from water at an industrial scale. Can this green dream come true?"}, {"date": "20240425124410", "headline": "Chevron, Exxon profits expected to drop despite rising oil prices", "summary": "Chevron and ExxonMobil are expected to report a year-over-year decline in earnings per share."}, {"date": "20240425140108", "headline": "Exxon, Chevron Earnings Are Coming. Supermajors Spar Over South America's Oil Jewel.", "summary": "Exxon Mobil and Chevron will announce first-quarter earnings and revenue early Friday as the two U.S. supermajors continue to squabble over Chevron's attempt to move into oil-rich Guyana.  Both XOM stock and Chevron stock initially edged lower Thursday.  Analysts expect Exxon Mobil Q1 EPS to fall 23% to $2.19 with sales declining 8% to $79.69 billion, according to FactSet."}, {"date": "20240425141700", "headline": "Exxon and Chevron Both Face Lower Earnings. Why Exxon Could Pull Ahead.", "summary": "Both companies are growing their oil production, and both have become more efficient at turning that oil into cash.  Exxon’s dividend yield is 3.1% and Chevron’s is 3.9%.  The uptick in oil may not be reflected in Exxon and Chevron earnings, however, because it didn’t happen until the end of the first quarter."}, {"date": "20240425183500", "headline": "GLOBAL BRIEFING: Yen slumps to new multi-decade low as BoJ stands pat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425192411", "headline": "Oil Heads for Weekly Advance Ahead of Critical US Inflation Data", "summary": "(Bloomberg) -- Oil headed for a weekly gain ahead of US inflation data that may give further clues on the path forward for monetary policy, shaping appetite for risk assets including commodities such as crude.Most Read from BloombergUS Economy Slows and Inflation Jumps, Damping Soft-Landing HopesJavier Milei Fuels Wild Rally That Makes Peso No. 1 in WorldMalaysia in Talks With Tycoons on Casino to Revive $100 Billion Forest CityBig Tech Surges in Late Hours on Blowout Earnings: Markets WrapAlpha"}, {"date": "20240425200400", "headline": "Investor Sentiment Improves Slightly, But Dow Tumbles Over 350 Points", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425200400", "headline": "Microsoft, Alphabet And 3 Stocks To Watch Heading Into Friday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425204600", "headline": "Exxon CEO reiterates that he's not interested in buying Hess", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425210900", "headline": "What You Missed On Wall Street On Friday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425213400", "headline": "Strong Quarterly Earnings Fuel Market Optimism Despite Inflation Concerns, Slowing Economic Growth: This Week In The Market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425225700", "headline": "Commodity Roundup: Gold snaps 5-week winning run, Brent hovers near $90/bbl", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425231600", "headline": "Chevron reports Q1 adjusted EPS $2.93, consensus $2.68", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425231800", "headline": "Chevron reports Q1 worldwide production 12% higher than a year ago", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425232000", "headline": "Chevron Non-GAAP EPS of $2.93 beats by $0.03, revenue of $48.72B misses by $1.99B", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425232500", "headline": "Chevron declares $1.63 dividend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425234200", "headline": "Chevron in charts: U.S. Upstream production expands in Q1 while international output slips", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425235300", "headline": "Wall Street Futures Ride High On Microsoft, Alphabet Cheer, But Will Inflation Data Burst The Bubble? Why This Analyst Thinks Bull Run Isn't Over Yet", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426000600", "headline": "Options Volatility and Implied Earnings Moves Today, April 26, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426001630", "headline": "Chevron reports Q1 profit beat", "summary": "Oil giant Chevron Corp beatestimates for first-quarter profit on Friday as higherproduction volumes helped offset an impact from weak natural gasprices. The company, which is in the..."}, {"date": "20240426002510", "headline": "Chevron: Q1 Earnings Snapshot", "summary": "SAN RAMON, Calif. — SAN RAMON, Calif. — Chevron Corp. on Friday reported first-quarter profit of $5.5 billion. On a per-share basis, the San Ramon, California-based company said it had..."}, {"date": "20240426004900", "headline": "Chevron stock pulls back as profit drops, amid a plunge in natural-gas prices", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426005400", "headline": "Exxon Mobil profit declines in 1st quarter as natural gas prices fall", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426005600", "headline": "Chevron expects to receive HSR approval for Hess within a few weeks  -  CNBC", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426010000", "headline": "Chevron’s Mixed Q1: $2.93 Adj. EPS, $48.72 B In Revenue", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426010100", "headline": "Chevron CEO expects to receive HSR approval for Hess within a few weeks  -  CNBC", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426012800", "headline": "Chevron's Strategic Advances In Oil Production Overshadowed By Q1 Revenue Miss", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426012900", "headline": "Exxon's steady spending has widened gap with Chevron that could grow - WSJ", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426013117", "headline": "Chevron Corporation - tengizchevroil starts WPMP operations at tengiz oil field in Kazakhstan", "summary": "San Ramon - Chevron Corporation announced today that its 50 percent owned affiliate Tengizchevroil LLP has safely commenced operations at its Wellhead Pressure Management Project at the Tengiz oil..."}, {"date": "20240426013800", "headline": "TOP NEWS: Chevron earnings dip on lower gas prices and reduced margins", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426015025", "headline": "Chevron: EPS down 17% in Q1", "summary": "Chevron reports adjusted earnings of $5.4 billion for the first three months of 2024, or $2.93 per share, down 17% year-on-year, despite a 12% increase in global production.The energy group attributes..."}, {"date": "20240426020800", "headline": "CVX Earnings: Chevron’s Q1 Revenues Beat Estimates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426021000", "headline": "5 stocks to watch on Friday: XOM, CVX, ABBV and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426022600", "headline": "Buy Rating Affirmed for Chevron: Strategic Growth and Operational Efficiency Highlighted", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426023000", "headline": "CEMATRIX Announces $7.6 Million in New Contracts and a Reduction in Scope of a Previously Awarded Tunnel Project", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426030300", "headline": "Chevron CEO expects to receive HSR approval for Hess within a few weeks  -  CNBC (update)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426035500", "headline": "CVX Stock Earnings: Chevron Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426050400", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426050403", "headline": "UPDATE 1-Exxon misses on Q1 profit despite big gains in Guyana", "summary": "Exxon Mobil Corp on Friday missed analysts' estimates with a 28% year-on-year drop in first quarter profits as weaker refining margins and lower natural gas prices offset volume gains.  The largest U.S. oil company, which is in the process of closing a $60 billion deal for top shale oil producer Pioneer Natural Resources, posted first-quarter earnings of $8.22 billion, or $2.06 per share, compared to an $11.43 billion net profit a year ago.  The stock was down 2% in pre-market trading to $118.50 after reporting a profit per share of $2.06, 6% shy of Wall Street analysts' consensus for $2.20 per share, LSEG estimates showed."}, {"date": "20240426050800", "headline": "CEMATRIX Secures New Contracts Amidst Project Downsizing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426052502", "headline": "Chevron (CVX) Tops Q1 Earnings Estimates", "summary": "Chevron (CVX) delivered earnings and revenue surprises of 3.17% and 2.45%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240426053208", "headline": "Chevron Corp (CVX) Reports Q1 2024 Earnings: A Close Call with Analyst Projections", "summary": "Key Financial Metrics Nearly Align with Market Expectations Amidst Strategic Expansions"}, {"date": "20240426054300", "headline": "Exxon and Chevron Earnings Fall Back to Earth", "summary": "The oil companies are still printing big profits, but their postpandemic run of record earnings is slowing down."}, {"date": "20240426055200", "headline": "Chevron’s stock pulls back as profit drops amid plunge in natural-gas prices", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426065000", "headline": "Tech Stocks Rebound As Magnificent 7 Roar On Strong Earnings, Energy Giants Tumble: What's Driving Markets Friday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426070400", "headline": "Chevron (CVX) Q1 Earnings Beat on Strong U.S. Production", "summary": "Chevron (CVX) pays $3 billion in dividends during the first quarter and spends around $4.1 billion in capital and exploratory expenditures."}, {"date": "20240426073301", "headline": "PCE, big tech, and energy earnings: 3 Things", "summary": "The Personal Consumption Expenditure (PCE) index, the Federal Reserve's preferred measure of inflation, came in hotter-than-expected for March at 2.8%, potentially delaying the Fed's next round of rate cuts. Shares of Alphabet (GOOG,GOOGL) and Microsoft (MSFT) are trading higher on Friday morning as both companies affirm their commitment to investing in AI. The companies also reported their latest quarterly earnings, beating expectations. Shares of Exxon Mobil (XOM) and Chevron (CVX) are trading lower as both companies reported mixed earnings results for the first quarter, citing lower refining margins. Yahoo Finance reporters Jennifer Schonberger, Jared Blikre, and Ines Ferre join the Morning Brief to discuss the three things investors need to watch for the trading day. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Nicholas Jacobino"}, {"date": "20240426073726", "headline": "Exxon, Chevron Fall as First-Quarter Earnings Miss Estimates", "summary": "(Bloomberg) -- Exxon Mobil Corp. and Chevron Corp. declined after disappointing first-quarter performances despite posting strong production gains in marquee oil projects in Guyana and the Permian Basin.Most Read from BloombergJavier Milei Fuels Wild Rally That Makes Peso No. 1 in WorldPlunging Home Prices, Fleeing Companies: Austin’s Glow Is FadingHuawei’s New Phone Runs Latest Version of Made-in-China ChipUS Economy Slows and Inflation Jumps, Damping Soft-Landing HopesAlphabet Beats Revenue Es"}, {"date": "20240426075648", "headline": "Chevron, Exxon face energy headwinds, lower profits in Q1", "summary": "Exxon Mobil (XOM) and Chevron (CVX) reported their first quarter earnings, with both companies revealing a fall in revenue for the quarter compared to the same period last year. However, both companies beat Wall Street expectations for revenue for the quarter. Chevron claims the revenue drop is partly due to lower margins on refined product sales. Yahoo Finance Reporter Ines Ferre joins The Morning Brief to analyze the latest developments for these companies and what they mean for the stocks moving forward. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief."}, {"date": "20240426081018", "headline": "Chevron : Kazakhstan project reaches new milestone", "summary": "When the Tengiz Field was developed, each well operated under high pressure. Over time, reservoir pressure declined, and the oil and gas no longer flow at the same intensity. ..."}, {"date": "20240426082011", "headline": "Chevron First-Quarter Results Fall Annually Amid Lower Refining Margins", "summary": "Chevron First-Quarter Results Fall Annually Amid Lower Refining Margins"}, {"date": "20240426083300", "headline": "Exxon Spent Money to Make Money", "summary": "The oil and gas giant’s spending in recent years has opened up a huge gap with Chevron, and it might widen further."}, {"date": "20240426090700", "headline": "Exxon and Chevron Stocks Fall After Earnings. The Bar Was High.", "summary": "With shares of  Exxon Mobil  and  Chevron  near their 52-week highs, the companies faced a high bar for their first-quarter earnings reports, both of which were released early on Friday.  Chevron, which beat analysts’ earnings estimates by a penny, was down 0.8%.  Exxon, which missed estimates, was down 3.6%."}, {"date": "20240426090841", "headline": "Exxon's Guyana 'mega-project' to fuel 'big growth': Strategist", "summary": "Shares of Exxon Mobil (XOM) and Chevron (CVX) are trading lower on Friday as both companies revealed a dip in first quarter revenue compared to the same period last year. However, both companies beat Wall Street revenue expectations for the quarter. While some of the forecasts for these companies are mixed, upcoming projects have the potential to turn things around. Truist Managing Director of Energy Research Neal Dingmann joins The Morning Brief to give insight into the energy sector and what investors can expect from Exxon and Chevron moving forward. Dingmann explains that growth will be accelerated by two upcoming projects in particular: \"They're going to have big growth...in Guyana and the Permian [Basin]. That's going to keep the remainder of their overall portfolio flat. Guyana is the one worth pointing out. If you look at the projects coming on through 2027 on a gross basis, which Exxon has 45% of this, that could do almost 1.2 billion barrels a day. You think that: the US alone is doing about 13 billion barrels. This is encroaching on over 10% of what the US alone could do with this project by 2027. That's why it's obviously a big deal on this litigation between Chevron and Exxon on the Hess deal. I cannot say enough about this Ghana project...It's a mega project to say the least. \" For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Nicholas Jacobino"}, {"date": "20240426091210", "headline": "Chevron Corporation (CVX) Q1 2024 Earnings Call Transcript", "summary": "Chevron Corporation (NYSE:NYSE:CVX) Q1 2024 Earnings Conference Call April 26, 2024 11:00 AM ETCorporate ParticipantsJake Spiering - General Manager, IRMike..."}, {"date": "20240426091237", "headline": "Chevron Corporation 2024 Q1 - Results - Earnings Call Presentation", "summary": "The following slide deck was published by Chevron Corporation in conjunction with their 2024 Q1 earnings call."}, {"date": "20240426101600", "headline": "NEW YORK MARKET CLOSE: Bullish Alphabet and Microsoft fuel tech rally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426102425", "headline": "What Chevron, Exxon Q1 earnings mean for gas prices", "summary": "Shares of Exxon Mobil (XOM) and Chevron (CVX) traded lower on Friday as both companies revealed a year-over-year decline in first quarter revenue due to refining margins being lower. Will these reports have an effect at the pump? Yahoo Finance Reporter Ines Ferré joins Wealth! to break down the potential impact on gas prices and what consumers and investors should keep in mind moving forward. For more expert insight and the latest market action, click here to watch this full episode of Wealth! This post was written by Nicholas Jacobino"}, {"date": "20240426110200", "headline": "Earnings for Big Oil backpedal as natgas prices tumble", "summary": "HOUSTON (Reuters) -U.S. and European oil companies reported weaker first quarter results on Friday due to a sharp drop in natural gas prices  compared with a year ago.  Results at oil and gas firms are still retreating from record levels in 2022 that were boosted by a surge in demand after the COVID-19 pandemic and then when prices spiked after Russia invaded Ukraine.  In the U.S., Exxon Mobil missed Wall Street earnings targets on fuel derivatives and Chevron beat tempered expectations with better-than-expected U.S. oil production."}, {"date": "20240426121031", "headline": "US Energy Stocks Fall Following Oil Giants' Subdued Earnings Reports", "summary": "Shares of major U.S. energy companies experienced widespread declines in the first hour of trading on Friday, subsequent to the recently released subdued earnings reports from oil giants Exxon Mobil Corp. (NYSE:XOM) and Chevron Corp. (NYSE:CVX). The Energy Select Sector SPDR Fund (NYSE:XLE), a gauge for energy sector performance, experienced a 1.7% drop, setting it up for its worst session since the end of January. Chart: Energy Stocks Witness Their Sharpest Decline Since Late January As Major O"}, {"date": "20240426134308", "headline": "Exxon, Chevron Earnings Fall As Supermajors Spar Over South America's Oil Jewel", "summary": "Exxon Mobil and Chevron reported first-quarter earnings and revenue declines early Friday as lower refining margins and natural gas prices took a toll on the energy giants.  Meanwhile, the two U.S. supermajors continue to squabble over Chevron's attempt to move into oil-rich Guyana.  XOM stock fell Friday while Chevron stock shook off early losses and advanced."}, {"date": "20240426140016", "headline": "Chevron (CVX) Q1 2024 Earnings Call Transcript", "summary": "CVX earnings call for the period ending March 31, 2024."}, {"date": "20240426140807", "headline": "What Exxon, Chevron Q1 earnings mean for the energy sector", "summary": "Energy giants Exxon Mobil (XOM) and Chevron (CVX) are experiencing divergent stock performance following the release of their respective first quarter earnings reports today. Both companies faced headwinds from lower national gas prices and narrowing refining margins, which put pressure on their first quarter profits. However, Chevron managed to surpass expectations on adjusted earnings per share. Yahoo Finance's Jared Blikre and Julie Hyman discuss each company's first quarter earnings report, providing insights into how their financial performance is impacting share prices. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Angel Smith"}, {"date": "20240426152020", "headline": "UPDATE 1-Hess sets May 28 shareholder vote on Chevron buyout", "summary": "Hess Corp set May 28 for a special meeting of shareholders to vote on Chevron Corp 's $53 billion buyout offer, the company said in a securities filing on Friday.  Chevron last October offered to acquire Hess Corp in a move to gain a foothold in oil-rich Guyana's lucrative offshore fields.  The deal has been stalled by a regulatory review and challenged by Exxon Mobil, which has filed an arbitration claim that could block the deal."}, {"date": "20240426191900", "headline": "Warren Buffett Bolsters Holdings in Liberty SiriusXM Group", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426212914", "headline": "Exxon Mobil: We Are Only Looking", "summary": "Exxon Mobil's keen on acquiring Hess Guyana interest, focusing on competitive advantages and cost-cutting goals to bolster their production. Explore more here."}, {"date": "20240426213300", "headline": "What Investing Account Types Are The Best Fit For You And Your Dividends?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426230700", "headline": "7 Dividend Stocks to Buy Now for Steady Returns in Any Market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426230700", "headline": "The Top 7 Oil & Gas Stocks to Buy in April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426232034", "headline": "Q1 2024 Chevron Corp Earnings Call", "summary": "Q1 2024 Chevron Corp Earnings Call"}, {"date": "20240427010000", "headline": "16 High-Yield Dividend Aristocrats Yielding Almost 5%", "summary": "Attempting to time the market is not a successful strategy. Read why long-term investing has consistently outperformed market timing."}, {"date": "20240427011613", "headline": "Chevron Corp (CVX) Q1 2024 Earnings Call Transcript Highlights: Robust Growth and Strategic ...", "summary": "Discover how Chevron achieved a historic production milestone and plans for future expansions in renewable energy."}, {"date": "20240427070000", "headline": "Exxon and Chevron Output Booms in World’s Hottest Oil Patches", "summary": "(Bloomberg) -- If you want to understand why the two largest US oil companies are together spending in excess of $100 billion on acquisitions right now, look no further than the amount of crude they’re extracting from the two hottest oil fields on the planet.Most Read from BloombergPlunging Home Prices, Fleeing Companies: Austin’s Glow Is FadingWall Street Humbled as Fast-Reversing Markets Confound the ProsApple Intensifies Talks With OpenAI for iPhone Generative AI FeaturesThe Long, Slow Death"}, {"date": "20240427075250", "headline": "Chevron First Quarter 2024 Earnings: EPS Beats Expectations, Revenues Lag", "summary": "Chevron ( NYSE:CVX ) First Quarter 2024 Results Key Financial Results Revenue: US$48.7b (down 1.0% from 1Q 2023). Net..."}, {"date": "20240427082500", "headline": "Chevron Showcases How Integration Can Pay Big Dividends in the Oil Patch", "summary": "The integrated energy company delivered solid first-quarter results despite much weaker natural gas prices."}, {"date": "20240428001505", "headline": "Exxon Mobil: Positioned For Strong Growth And Current Buying Opportunity", "summary": "Exxon Mobil's Q1 2024 earnings results were mixed, beating revenue expectations but missing earnings expectations. See why I rate XOM stock a strong buy."}, {"date": "20240428013500", "headline": "2 Incredible Stocks That Billionaires Are Buying Hand Over Fist", "summary": "Billionaire investors are aggressively buying both Chevron and Altria Group stock."}, {"date": "20240428043700", "headline": "The Top 3 Blue-Chip Stocks to Buy in April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428085738", "headline": "Republicans are Buying These 10 Oil and Gas Stocks", "summary": "In this article, we will take a detailed look at Republicans are Buying These 10 Oil and Gas Stocks. For a quick overview of such stocks, read our article Republicans are Buying These 5 Oil and Gas Stocks. Energy stocks are in the limelight this year amid geopolitical tensions in the Middle East and recession fears. The […]"}, {"date": "20240428164038", "headline": "20 States with Highest Hispanic Population Growth Rates", "summary": "In this article, we will take a look at the 20 states with highest Hispanic population growth rates. If you want to skip our discussion on the distribution of the Hispanic population, you can go directly to the 5 States with Highest Hispanic Population Growth Rates. In 2020, the Diversity Index for the entire population […]"}, {"date": "20240428165443", "headline": "Dividend Stock Portfolio For Income: Top 15 Stocks", "summary": "In this article, we will discuss dividend stocks for regular income. You can skip our detailed analysis of dividend stocks and their historical performance, and go directly to read Dividend Stock Portfolio For Income: Top 5 Stocks. It is generally believed that dividend stocks are primarily suitable for people approaching retirement. However, this is far from […]"}, {"date": "20240428191500", "headline": "RBC Capital Remains a Buy on Chevron (CVX)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428191800", "headline": "Looking At Chevron's Recent Unusual Options Activity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428211100", "headline": "Stock Market Crash Alert: 3 Must-Buy Energy Stocks When Prices Plunge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428213628", "headline": "Namibia's NAMCOR signs deal with Chevron to develop offshore block", "summary": "Namibia's national oilcompany has signed a development deal with Chevron thatwill see the U.S. oil major take an 80% operating workinginterest in an offshore block in the Walvis Basin, it said..."}, {"date": "20240428222600", "headline": "Do You Have $500? Buy These 3 Stocks Now or Regret It Later", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428225000", "headline": "Analysts Offer Insights on Energy Companies: Chevron (CVX) and Phillips 66 (PSX)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429002400", "headline": "Chevron price target raised by $5 at TD Cowen, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429004600", "headline": "Analysts Offer Insights on Energy Companies: Chevron (CVX) and Imperial Oil (IMO)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429010300", "headline": "Namibia oil company says signed deal with Chevron to develop offshore block", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429013628", "headline": "UPDATE 2-Namibia's NAMCOR signs deal with Chevron to develop offshore block", "summary": "Namibia's national oil company (NAMCOR) has signed a development deal with Chevron that will see the U.S. oil major take an 80% operating working interest in an offshore block in the Walvis Basin, NAMCOR said on Monday.  Oil companies are flocking to Namibia, excited by the southern African country's plans to open up a major new frontier basin, with recent offshore finds ranking among the largest this century.  The farm-out agreement with Chevron Namibia Exploration Limited (CNEL) will see the National Petroleum Corporation of Namibia (NAMCOR) and local company Custos Energy each retain a 10% interest in petroleum exploration license 82."}, {"date": "20240429034900", "headline": "Here are the most efficient companies within the S&P 500’s bargain-stock sector", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429041600", "headline": "Wells Fargo Remains a Buy on Chevron (CVX)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429045046", "headline": "Chevron reports first quarter 2024 results", "summary": "San Ramon - Chevron Corporation reported earnings of $5.5 billion for first quarter 2024, compared with $6.6 billion in first quarter 2023.Foreign currency effects increased earnings by $85..."}, {"date": "20240429053817", "headline": "Phillips 66: Turnaround Still Very Much A Work In Progress", "summary": "Phillips 66's Q1 earnings report was another in a long line of disappointing results. Learn why PSX's refining \"turnaround\" is still a work in progress."}, {"date": "20240429063100", "headline": "How Much Will Chevron Pay in Dividends This Year?", "summary": "Chevron is one of the top dividend stocks in the oil patch."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429083408", "headline": "Exxon Mobil, Chevron Strategies Hinge On Latest Oil Hotspot", "summary": "Exxon Mobil and Chevron reported first-quarter earnings and revenue declines Friday as lower refining margins and natural gas prices took a toll on the energy giants.  Meanwhile, the two U.S. supermajors continue to squabble over Chevron's attempt to move into oil-rich Guyana.  Exxon Mobil Q1 EPS came in at $2.06, down 27% compared to Q1 2023, while revenue decreased 4% to $83.08 billion."}, {"date": "20240429102000", "headline": "Energy ETFs in Focus Post Exxon, Chevron's Weak Q1 Earnings", "summary": "Two energy behemoths, Exxon Mobil Corp. (XOM) and Chevron Corp. (CVX), reported disappointing first-quarter 2024 results. Both companies lagged estimates on revenues, while Chevron managed to beat earnings estimates."}, {"date": "20240429110058", "headline": "20 Biggest Oil Producing Countries in Asia", "summary": "In this article, we will look at the 20 Biggest Oil Producing Countries in Asia. If you want to skip our discussion of the energy markets, you can go directly to the 5 Biggest Oil Producing Countries in Asia. Oil demand is surging! The International Energy Agency (IEA) reports a jump of 2.3 million barrels […]"}, {"date": "20240429110500", "headline": "Chevron CEO: Permian, D-J Basin Production Fuels US Output Growth", "summary": "Chevron continued to prioritize Permian Basin investment for new production and is seeing D-J Basin growth after closing its $6.3 billion acquisition of PDC Energy last year, CEO Mike Wirth said."}, {"date": "20240429130431", "headline": "Sintana Energy Up 10%, Went Close To 52 Week Highs As Notes Chevron Entry into PEL 82, Offshore Namibia", "summary": "Sintana Energy Up 10%, Went Close To 52 Week Highs As Notes Chevron Entry into PEL 82, Offshore Namibia"}, {"date": "20240429135000", "headline": "Oil Producers Flush With Cash Cut Reliance on Loans", "summary": "(Bloomberg) -- Last year, the demand for loans from fossil-fuel companies fell 6% year-on-year and that followed a decline of 1% in 2022.Most Read from BloombergTesla Soars on Tentative China Approval for Driving SystemStocks Trade for 390 Minutes a Day. Increasingly, Only 10 MatterUS Warns ICC Action on Israel Would Hurt Cease-Fire ChancesYen Sparks Intervention Suspicion After U-Turn From 1990 LowsWhat 60,000 Headlines Say About the Fed’s Next MoveFrom a climate perspective, this may sound lik"}, {"date": "20240429144438", "headline": "Chevron CEO Sees Exxon Arbitration Resolved in Coming Months", "summary": "(Bloomberg) -- Chevron Corp. expects a resolution to a dispute with Exxon Mobil Corp. over a Guyana oil contract in coming months that would allow for the completion of the $53 billion acquisition of Hess Corp. this year. Most Read from BloombergTesla Soars on Tentative China Approval for Driving SystemStocks Trade for 390 Minutes a Day. Increasingly, Only 10 MatterUS Warns ICC Action on Israel Would Hurt Cease-Fire ChancesYen Sparks Intervention Suspicion After U-Turn From 1990 LowsWhat 60,000"}, {"date": "20240429160000", "headline": "Lower Natural Gas Prices Squeeze Big Oil's Profits in Q1 2024", "summary": "U.S. supermajors ExxonMobil and Chevron, as well as France's TotalEnergies, all cited lower natural gas prices as a key downward pressure on earnings"}, {"date": "20240429160524", "headline": "Diamondback Energy and Endeavor receive second FTC request over $26 bln deal", "summary": "Oil and gas firm Diamondback Energy said on Monday it had received a second request from the U.S. Federal Trade Commission (FTC) in connection with the $26 billion deal to buy privately-held Endeavor.  The U.S. antitrust regulator has asked for additional information and documentary material as part of its review of the proposed merger.  Midland, Texas-based Diamondback had said in February it would buy privately held rival Endeavor Energy Partners in a cash-and-stock deal, which is expected to close in the fourth quarter."}, {"date": "20240429194800", "headline": "Chevron (CVX) Buy Rating Affirmed Amid Strong Q1 Performance and Promising Strategic Initiatives", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429230400", "headline": "3 Deeply Undervalued Dividend Stocks to Buy for High Total Returns in Q2", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429233000", "headline": "Chevron price target raised by $8 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429234000", "headline": "Inflation-Proof Fortunes: 7 Dividend Aristocrats to Keep Your Wealth Growing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429234800", "headline": "Chevron price target raised by $3 at HSBC, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430005100", "headline": "Analysts Offer Insights on Energy Companies: Chevron (CVX) and MPLX (MPLX)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430053700", "headline": "Big Oil Battle: Exxon Is Better Than Chevron in This Key Area, and It's Not Even Close", "summary": "Exxon is a financial fortress."}, {"date": "20240430070015", "headline": "Chevron Corporation (CVX) is Attracting Investor Attention: Here is What You Should Know", "summary": "Zacks.com users have recently been watching Chevron (CVX) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects."}, {"date": "20240430072818", "headline": "4 Buyable Berkshire DiviDogs From April, Plus 5 To Watch", "summary": "25 of 41 current BKH owned stocks pay dividends.Â Read more to see a detailed analysis of the stocks listedÂ in this article."}, {"date": "20240430082911", "headline": "Chevron : $500 million investment in emerging lower carbon technologies", "summary": "Jim Gable, president of Chevron Technology Ventures , recently spoke at a BloombergNEF event in New York. He talked about Chevron's continued support for innovative energy technologies..."}, {"date": "20240430100000", "headline": "WTI Finds Support After Sell Off Suddenly Halts", "summary": "WTI crude found resistance at $81 per barrel this morning, countering a sell-off as traders discount geopolitical risk."}, {"date": "20240430104800", "headline": "Q1 Earnings Season Scorecard and Fresh Research Reports for Apple, Walmart & Chevron", "summary": "Today's Research Daily features a real-time update on the Q1 earnings season and updated new research reports on Apple (AAPL), Walmart (WMT) and Chevron (CVX)."}, {"date": "20240430114124", "headline": "Exxon, Chevron, Other Oil Majors Blamed for Deceiving Public on Climate Change in New House Committee Report", "summary": "Exxon, Chevron, Other Oil Majors Blamed for Deceiving Public on Climate Change in New House Committee Report"}, {"date": "20240430120000", "headline": "Why SCHD Should Be A Strategic Core Position Of Your Dividend Income Portfolio", "summary": "Discover why adding SCHD positions to your dividend income portfolio is a smart move, a superior choice in terms of risk and reward. Read here for more details."}, {"date": "20240430142524", "headline": "Analysts Are Boosting Price Targets On These Oil and gas Stocks. Is It Time To Lock In The Dividend At Current Prices?", "summary": "The energy sector has been a standout performer in recent years, with many oil and gas companies delivering strong returns and generous dividends. Now, analysts are raising their price targets on some of the industry’s biggest names, suggesting that ..."}, {"date": "20240430144833", "headline": "Why energy plays are for long-term investors", "summary": "The energy sector (XLK) has continued to outperform throughout 2024. Alpine Saxon Woods Chief Market Strategist Sarah Hunt and CFRA Energy Equity Analyst and Deputy Research Director Stewart Glickman join Market Domination to share insight on navigating this sector. Glickman emphasizes that investors looking to capitalize on the energy sector should first consider their outlook for crude oil prices. He believes that with crude oil prices are expected to average between $80 and $90 per barrel in 2024: \"In that kind of environment, you want to be positioned in upstream,\" the analyst tells Yahoo Finance. He recommends exploring names like Exxon (XOM), citing \"a lot of growth potential.\" With an uptick in mergers and acquisitions (M&A) activity throughout the sector, Glickman notes that the \"common theme\" is exposure to the Permian Basin, a trend he believes is \"likely to persist.\" Hunt acknowledges that supply and demand issues have been a headwind for the sector since the pandemic. However, with an \"energy transition underway\" she remains bullish on energy \"from a longer-term perspective.\" She also highlights the significant consolidation within the sector, with companies combining forces to boost operations and enhance their competitive edge. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Angel Smith"}, {"date": "20240430150238", "headline": "Diamondback Energy, Permian Giant Reports 16% Revenue Gain", "summary": "Diamondback Energy reported better-than-expected first-quarter earnings and revenue late Tuesday. FANG shares angled lower after the market closed."}, {"date": "20240430150238", "headline": "Diamondback Energy, Top Permian Basin Producer, Reports 16% Revenue Growth Amid 30% Run", "summary": "Diamondback Energy reported better-than-expected first-quarter earnings and revenue late Tuesday. FANG shares angled lower after the market closed."}, {"date": "20240430210028", "headline": "Chevron: The Fast Way To Hot Spots", "summary": "Chevron has a lot of potential from both the acquisitions and the growth and income strategy. Find out why CVX stock is a Buy."}, {"date": "20240430230400", "headline": "Stocks to Sell: 3 Earnings Disasters to Ditch Before It’s Too Late", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501011500", "headline": "European Oil Companies Weigh U.S. Listings to Boost Their Stock Prices", "summary": "American investors have continued buying stocks of oil companies even as most European fund managers have shunned them."}, {"date": "20240501013900", "headline": "XOM, SLB, or CVX: Which Energy Stock is the Most Attractive Pick?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501022700", "headline": "Chevron Remains Confident It Will Close This Needle-Moving Acquisition", "summary": "Chevron firmly believes Exxon's case against it has no merit."}, {"date": "20240501050700", "headline": "Chevron-Hess M&A is a long-short equity strategy opportunity - Steamboat Capital Partners 1Q letter", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501095307", "headline": "Exxon Mobil: ~12% Mid-Term EPS Growth Justifies Premium Valuation", "summary": "Exxon reported a soft Q1 with earnings down 29% YoY as refining income declined by 67% on significantly weaker margins. Find out why XOM stock is a Strong Buy."}, {"date": "20240501100247", "headline": "Chevron Corporation (NYSE:CVX) Q1 2024 Earnings Call Transcript", "summary": "Chevron Corporation (NYSE:CVX) Q1 2024 Earnings Call Transcript April 26, 2024 Chevron Corporation beats earnings expectations. Reported EPS is $2.93, expectations were $2.84. Chevron Corporation isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning. My name is Katie, and […]"}, {"date": "20240501120800", "headline": "EnerCom Announces Mike Wirth, Chairman and Chief Executive Officer of Chevron, as Keynote Speaker at the 29th Annual EnerCom Denver - The Energy Investment Conference", "summary": "Register now for the 29th annual EnerCom Denver – The Energy Investment Conference featuring a diverse group of public and private energy companies at www.enercomdenver.com"}, {"date": "20240501214000", "headline": "Tom Lee Weighs In On Market Implications Of A Potential Trump Victory: 'I Think Energy Stocks...Healthcare Would Come Under Pressure'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501221400", "headline": "Iran slaps sanctions on US, UK over Israel support", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502015513", "headline": "Cyprus gives Chevron another 6 months to come up with a timetable on a natural gas field development", "summary": "The Cyprus government has given Chevron another six months to come up with a revised plan to develop a sizeable natural gas deposit off the island nation’s southern coastline after an earlier plan proposed by the U.S. energy company lacked a timetable, an official said Thursday.  Chevron’s development proposal from March 29 for the Aphrodite deposit estimated to hold 4.2 trillion cubic feet of gas “wasn’t considered targeted and was without specific timetables,” the official with knowledge of the matter told The Associated Press.  In a reply letter last Thursday, Cypriot Energy Minister George Papanastasiou asked Chevron for “specific, targeted actions” and a “specific timetable” that would confirm its commitment to developing the gas field."}, {"date": "20240502023000", "headline": "Jamie Raskin Slams Big Oil For 'Lying' About Climate Change: 'They Acted Like Maleficent...And Cursed Everyone To Try To Go To Sleep For 100 Years'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502024400", "headline": "Shell Beat Expectations on Earnings, Buys Back Shares. The Stock Is Rising.", "summary": "Chief Executive Officer Wael Sawan is working to close the valuation gap between his company and American rivals Exxon and Chevron."}, {"date": "20240502035000", "headline": "My Top 5 Favorite High-Yield Dividend Stocks to Buy in May", "summary": "Income investors can buy in May and go away with these stocks."}, {"date": "20240502050033", "headline": "With 67% ownership, Chevron Corporation (NYSE:CVX) boasts of strong institutional backing", "summary": "Key Insights Institutions' substantial holdings in Chevron implies that they have significant influence over the..."}, {"date": "20240502064000", "headline": "Here's Why You Should Bet on BP Stock Ahead of Q1 Earnings", "summary": "Given its substantial buyback programs, a pipeline of upstream projects, significant downstream operations, and attractive valuation, it is wise for investors to buy BP before its Q1 earnings release."}, {"date": "20240502064057", "headline": "Exxon to Close Pioneer Deal as FTC Forces Out Founder Sheffield", "summary": "(Bloomberg) -- The US Federal Trade Commission declined to challenge Exxon Mobil Corp.’s $60 billion purchase of Pioneer Natural Resources Co. but asserted that Scott Sheffield, Pioneer’s co-founder, must not take a seat on the supermajor’s board. Most Read from BloombergUS and Saudis Near Defense Pact Meant to Reshape Middle EastBiden Calls Ally Japan ‘Xenophobic’ Along With China, RussiaSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineTesla Axes Supercharger Team in Blow to Broade"}, {"date": "20240502065100", "headline": "Warren Buffett Increases Stake in Liberty SiriusXM Group", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502074700", "headline": "Marathon (MRO) Q1 Earnings Beat on Oil Price Improvement", "summary": "Marathon Oil (MRO) spends $503 million in capital and exploratory expenditures during the quarter and rakes in $$239 million in adjusted free cash flow."}, {"date": "20240502080433", "headline": "Chevron : Gathering and exporting gas is a win-win for reducing flaring", "summary": "Saudi Arabian Chevron's flaring and methane reduction efforts extend into Kuwait, because it operates within the Partitioned Zone between the two countries.  ..."}, {"date": "20240502081242", "headline": "Cyprus seeks improvements to Chevron-led plans for offshore gas field", "summary": "Cyprus said on Thursday it wanted to see improvements to Chevron-led plans to extract gas from an offshore field, giving the consortium led by the U.S. major six months to meet its requirements.  There have been protracted talks on the future development of the Aphrodite field south-east of Cyprus since Chevron attempted to introduce changes to a 2019 field development plan.  A new field development proposal was submitted by Chevron on March 29."}, {"date": "20240502083500", "headline": "Exxon Mobil deal with Pioneer gets FTC nod, but former Pioneer CEO Scott Sheffield barred from board", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502102034", "headline": "25 Most Profitable Companies in the US", "summary": "In this piece, we will take a look at the 25 most profitable companies in the US. If you want to skip our overview of the US economy and the current business climate, you can jump ahead to the 5 Most Profitable Companies in the US. With the second quarter of 2024 with us, Wall Street […]"}, {"date": "20240502103851", "headline": "3 Dividend Champions For Long-Term Investors Seeking Dividend Growth And Safety", "summary": "Bank OZK, Aflac, and Chevron areÂ threeÂ recommended Dividend Champions toÂ buyÂ for long-term investors at the end of April 2024. Read my analysis here."}, {"date": "20240502111913", "headline": "Chevron: Solid Q1 2024 Earnings And A Good Long-Term Holding", "summary": ""}, {"date": "20240502230413", "headline": "Decoding Chevron Corp (CVX): A Strategic SWOT Insight", "summary": "Insightful Analysis of Chevron Corp's Financials and Strategic Position"}, {"date": "20240502231800", "headline": "Oil companies expand offshore drilling, bet on gas, NY Times reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503002545", "headline": "Chevron works to resume full production at Gorgon LNG after mechanical fault", "summary": "Chevron Australia isworking to resume full production at its Gorgon gas facilityafter a mechanical fault affected one liquefied natural gas production train, a company spokesperson said on Friday...."}, {"date": "20240503024100", "headline": "3 Dow Stocks That Are No-Brainer Buys in May", "summary": "The 30-component Dow Jones Industrial Average is housing three phenomenal deals that are hiding in plain sight."}, {"date": "20240503032700", "headline": "Warren Buffett's Berkshire To Rake In $226M Passively In A Jiffy, Thanks To Its Core Holding Apple", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503041634", "headline": "A Volatile Chevron Is Expensive Again (Rating Downgrade)", "summary": "Chevron Corporation's share price has performed three times better than the S&P 500 YTD, driven by volatility in the Middle East. Click here for our CVX update."}, {"date": "20240503045427", "headline": "UPDATE 2-Chevron works to resume full production at Gorgon LNG after turbine fault", "summary": "Chevron Australia is working to resume full production at its Gorgon gas facility after a mechanical fault caused one liquefied natural gas (LNG) production train to go offline, a company spokesperson said on Friday.  Domestic gas and the other two LNG trains at Gorgon are unaffected and producing at full capacity.  Gorgon exports LNG to customers across Asia and produces domestic gas for the Western Australian market."}, {"date": "20240503070100", "headline": "Why You Should Bet on Sunoco (SUN) Ahead of Q1 Earnings", "summary": "Investors may find it advantageous to purchase Sunoco (SUN) before Q1 earnings release, given its strategic acquisition deal and strong and sustainable business model."}, {"date": "20240503091707", "headline": "Explainer: what do we mean by hard-to-abate industries", "summary": "What do steel, cement and chemical production all have in common? They're sectors that are trying to meet increasing demand while lowering their greenhouse gas..."}, {"date": "20240503125307", "headline": "Chevron : Renewable fuels VP takes on challenge of lifetime", "summary": "Nuray Elci has been overcoming obstacles since childhood, when her father's sudden passing set a difficult upbringing in motion. His death left the family, which..."}, {"date": "20240503163000", "headline": "Most Investments Are Bad. Here's Why, And What To Do About It", "summary": ""}, {"date": "20240503213935", "headline": "SCHD: A Must-Have In Every Dividend Portfolio", "summary": "Schwab U.S. Dividend Equity ETF (SCHD) offers diversification and resilience with a focus on healthy dividend-paying companies, but lower total returns. Read more here."}, {"date": "20240504012000", "headline": "Berkshire says 75% of fair value concentrated in five companies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504013100", "headline": "3 Companies Growing Shareholder Value Through Aggressive Stock Buybacks", "summary": "These energy and industrial companies pay dividends and are rewarding shareholders with stock repurchases."}, {"date": "20240504023600", "headline": "Berkshire Hathaway's Q1 Operating Earnings Surged 39% — Here's Why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504031100", "headline": "Buffett's Berkshire Hathaway slashes Apple stake in Q1", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504041800", "headline": "What’s next for the big oil players? SA analysts discuss", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504050800", "headline": "Warren Buffett's Confidence In Apple Wanes? Berkshire Cuts Stake By 18% Amid Tech Giant's Troubles.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504050900", "headline": "Buffett says Apple likely to be largest investment at 2024-end, despite Q1 stake cut (update)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}]}