{"news": [{"date": "20240415053000", "headline": "3 Reasons Disney Investors Don't Have to Worry About Epic Universe", "summary": "Comcast's Epic Universe is going to live up to its name, but that doesn't mean Disney won't win."}, {"date": "20240415080518", "headline": "Disney to completely rework park, build new adventure area", "summary": "The company says the change involves “the overhaul of more than 90%” of Walt Disney Studios Park.”"}, {"date": "20240415104600", "headline": "Disney's (DIS) Disney+ Premieres Queen Rock Montreal With IMAX", "summary": "Disney's (DIS) Disney+ debuts \"Queen Rock Montreal\" on May 15, offering the first concert film with IMAX Enhanced sound by DTS."}, {"date": "20240415154522", "headline": "Walt Disney (DIS) Stock Moves -0.93%: What You Should Know", "summary": "The latest trading day saw Walt Disney (DIS) settling at $112.95, representing a -0.93% change from its previous close."}, {"date": "20240415180956", "headline": "Decoding Netflix's Market Dominance (Rating Upgrade)", "summary": "Netflix has low churn, high retention rates, rapid user growth, and industry-leading average revenue per user. See why NFLX stock is a Buy."}, {"date": "20240415205000", "headline": "U.S. lawmakers raise concerns about sports-streaming JV, Variety reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415212600", "headline": "Disney/Warner/Fox sports venture draws lawmaker concerns on competition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415220325", "headline": "What Winnie the Pooh and Mickey Mouse can tell us about the public domain and remix culture", "summary": "Christopher Robin begs for his life.  Thus unfolds the trailer for the 2023 movie “Winnie the Pooh: Blood and Honey,” a slasher-film riff on A.A. Milne's beloved characters, brought to you by ... the expiration of copyright and the arrival of the classic children's novel into the American public domain.  Then began a parade of characters and stories, led by Winnie the Pooh and Mickey Mouse with many more to follow, marching into the public domain, where anyone can do anything with anything and shape it into a new generation of stories and ideas."}, {"date": "20240415220604", "headline": "Characters enter the public domain. Winnie the Pooh becomes a killer. Where is remix culture going?", "summary": "Christopher Robin begs for his life.  Thus unfolds the trailer for the 2023 movie “Winnie the Pooh: Blood and Honey,” a slasher-film riff on A.A. Milne's beloved characters, brought to you by ... the expiration of copyright and the arrival of the classic children's novel into the American public domain.  Then began a parade of characters and stories, led by Winnie the Pooh and Mickey Mouse with many more to follow, marching into the public domain, where anyone can shape something into new stories and ideas."}, {"date": "20240415224100", "headline": "Market Today: Berkshire Hathaway's Slide Continues Amidst Mixed Market Movements", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416023300", "headline": "See Which Of The Latest 13F Filers Holds Walt Disney", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416143839", "headline": "Author Ethan Mollick on 4 Rules for Using AI", "summary": "We've also got a look at Why Disney and Nelson Peltz were both winners in the company's board fight and other market news."}, {"date": "20240416162628", "headline": "Two US lawmakers raise concerns over Disney, Fox, Warner sports streaming venture", "summary": "The congressmen questioned how the new offering would affect access, competition, and choice in the sports streaming market in a letter to the media companies' CEOs.  \"We are concerned that this consolidation will result in higher prices for consumers and less fair licensing terms for upstream sports leagues and downstream video distributors,\" they said in a letter addressed to Disney's Bob Iger, Fox's Lachlan Murdoch and Warner Bros' David Zaslav."}, {"date": "20240416170000", "headline": "Murdoch Partner Helps Asia’s Richest Man Build a Media Empire", "summary": "(Bloomberg) -- On a breezy April evening some 45,000 Indian Premier League cricket fans are packed into Wankhede Stadium to watch the hometown Mumbai Indians battle the Rajasthan Royals.Most Read from BloombergDubai Grinds to Standstill as Cloud Seeding Worsens FloodingUS Yields Spike as Hawkish Powell Puts 5% in Play: Markets WrapChina Tells Iran Cooperation Will Last After Attack on IsraelWhat If Fed Rate Hikes Are Actually Sparking US Economic Boom?Powell Signals Rate-Cut Delay After Run of I"}, {"date": "20240416220100", "headline": "Summer’s Coming: 3 Exciting Stocks to Buy That Aren’t Disney", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416232600", "headline": "Peltz failed to secure a Disney board seat, making a comeback harder, WSJ says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417024409", "headline": "Planned Disneyland expansion in California clears major hurdle", "summary": "Plans to expand the Disneyland Resort cleared a major hurdle Wednesday, as local officials endorsed a new blueprint governing the development of Walt Disney's Southern California theme parks over the next 40 years.  The Anaheim city council approved a plan, called DisneylandForward, that one researcher estimated would create as many as 4,520 construction jobs per year of development and an additional 26,764 parks-related positions over the coming decades.  A second procedural council vote, to consider zoning changes, revisions in the city's development agreement with Disney and an analysis of environmental impacts, is scheduled for May 7."}, {"date": "20240417033000", "headline": "Nelson Peltz Got Crushed by Disney. Can He Recover?", "summary": "Nelson Peltz’s  proxy fight at  Disney  had the potential to help turn around his hedge fund after a tumultuous stretch.  Instead, the activist investor’s unsuccessful quest for two seats on the media giant’s board could make a comeback even harder.  Trian Partners has been grappling with lackluster returns, an investor exodus and the acrimonious departure of one of its founders."}, {"date": "20240417033000", "headline": "Disney gets Anaheim's OK for major Disneyland expansion", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417041651", "headline": "Southern California city council gives a key approval for Disneyland expansion plan", "summary": "Disney would spend at least $1.9 billion over the next decade to transform its 490-acre (488-hectare) campus in densely-populated Southern California.  It would be the biggest expansion of Disney’s Southern California theme parks in decades, aiming to create more immersive experiences for guests."}, {"date": "20240417050000", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417060500", "headline": "IMF Raises Global Growth Forecast Amid High Inflation: 5 Picks", "summary": "We have narrowed our search to five U.S. corporate giants. These are: NVDA, MU, PGR, META, DIS."}, {"date": "20240417061500", "headline": "Before You Buy and Hold Roku Stock, You Should Know About Its Biggest Risk", "summary": "Investors should gain a better understanding of the industry landscape."}, {"date": "20240417063300", "headline": "Disney’s (NYSE:DIS) Anaheim Project Cleared, Shares Slip", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417064000", "headline": "‘Punishing myself would not help’: My credit card was stolen — the thief revealed lots of nasty surprises about my finances", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417095000", "headline": "The Smartest Dividend Stocks to Buy With $400 Right Now", "summary": "It's the right time to buy some of your favorite dividend stocks."}, {"date": "20240417101315", "headline": "Disneyland performers file petition to form labor union", "summary": "Workers who help bring Disneyland’s beloved characters to life said Wednesday they collected enough signatures to support their push for a union.  A group of 1,700 performers, including those who represent characters and dance in parades at Disney's Southern California theme parks, said they filed an election petition with the National Labor Relations Board.  The workers said they also asked The Walt Disney Co. to recognize their union, which they are calling “Magic United.”"}, {"date": "20240417114506", "headline": "Disney: Continued Stagnation Amid Failed Proxy Bid", "summary": "Disney's focus on cost-cutting and streaming profitability may indicate plateau in Disney+ subs and limited growth potential. Find out why DIS stock is a Sell."}, {"date": "20240417120242", "headline": "Mickey, Minnie, Donald and Goofy file for union vote at Disneyland", "summary": "Disneyland employees who perform as many of the theme park’s beloved characters have filed to have a vote on whether to join the Actors’ Equity Association, which represents live performers all over the country, from actors on Broadway to strippers in Los Angeles."}, {"date": "20240417172943", "headline": "United Parks & Resorts: EBITDA To See Healthy Growth In FY24", "summary": "United Parks & Resorts operates 13 theme parks and is tied to consumer spending power. Learn why I recommend a buy rating for PRKS stock."}, {"date": "20240417190400", "headline": "EXCLUSIVE: Streaming Platform Winner Picked By Benzinga Readers: Did Disney+, Netflix, Amazon Prime Video Or Max Take Top Honors?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417193500", "headline": "NBA's TV rights negotiating window expected to pass without deal, CNBC says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417203000", "headline": "Disney, WBD not likely to make NBA deal before exclusive window closes: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417203800", "headline": "EA's Black Panther Game Takes Shape As Open-World Marvel Sandbox", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417205300", "headline": "Peltz Faces Uphill Battle After Disney Defeat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417210300", "headline": "KeyBanc: Who Has the Edge This Theme Park Season? Disney? (NYSE:DIS) Or Universal? (NASDAQ:CMCSA)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417211900", "headline": "KeyBanc: Who Has the Edge This Theme Park Season — Disney or Universal?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418013400", "headline": "Sony's Latest Bravia Series Elevates At-Home Streaming with Advanced Picture Settings and AI Features", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418050900", "headline": "Disney parks benefiting from global gains, with Universal challenged - KeyBanc", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418051000", "headline": "What Wall Street's experts say about Netflix ahead of earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418053500", "headline": "If I Could Buy Only 3 Stocks in 2024, I'd Pick These", "summary": "A company is more than its numbers. The qualitative characteristics, assumptions and perceptions, and the environment itself all matter."}, {"date": "20240418060025", "headline": "Shareholders in Walt Disney (NYSE:DIS) have lost 38%, as stock drops 3.6% this past week", "summary": "The Walt Disney Company ( NYSE:DIS ) shareholders should be happy to see the share price up 22% in the last quarter..."}, {"date": "20240418082520", "headline": "Disney Stock: I Expect More Upside", "summary": "Why Walt Disney Company stock is a smart investment choice: reasonable P/E, projected EPS growth, and positive catalysts like Disney+. Read more on DIS stock here."}, {"date": "20240418100117", "headline": "Disneyland cast members file for union election", "summary": "Disneyland's cast members who portray beloved characters like Mickey Mouse and Donald Duck have file a union election request with the National Labor Relations Board."}, {"date": "20240418100338", "headline": "Disneyland characters look to unionize as major expansion looms", "summary": "Actors behind the characters are one of the few groups at the park not already organized."}, {"date": "20240418104300", "headline": "Netflix now has nearly 270 million subscribers after another strong showing to begin 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418130013", "headline": "I've Been to Disney World 3 Times and Have Saved a Ton of Money by Doing This One Thing", "summary": "This writer has pulled off three budget-friendly trips to Disney. Read on to see how."}, {"date": "20240418130053", "headline": "UPDATE 2-NBA's TV rights talks with Disney, Warner likely to end without deal, CNBC reports", "summary": "The National Basketball Association's exclusive media rights negotiating period with current partners Walt Disney and  Warner Bros Discovery is likely to expire without a new deal on Monday, CNBC reported on Thursday.  NBA will be able to engage with new partners to show packages of games from the start of next week, the report said, citing people familiar with the matter.  Warner began airing the games in 1984, while Disney's ESPN sport network began broadcasting NBA in 2002."}, {"date": "20240418142028", "headline": "Netflix Q1 Results: What Happened", "summary": "Netflix's strong Q1 earnings report failed to impress as NFLX stock price fell, raising concerns of overly optimistic assumptions. Click for my NFLX update."}, {"date": "20240418161457", "headline": "'We've evolved': Netflix explains decision to stop reporting crucial subscriber data", "summary": "Netflix will no longer report membership numbers starting next year."}, {"date": "20240418190300", "headline": "Robert Olstein Bolsters Portfolio with a 1% Stake in The Middleby Corp", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418195000", "headline": "Netflix Is Dumping Quarterly Subscriber Reports: Co-CEO Greg Peters Says This Is What Motivated The Change", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418201337", "headline": "Column: Disneyland just promised electric cars at Autopia. Gas will be gone by 2026", "summary": "Disney had previously committed to ditching gasoline engines but left open hybrids as a possibility."}, {"date": "20240418201600", "headline": "3 Potential Turnaround Stocks Ready to Reclaim Their Thrones in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418202100", "headline": "Notable Friday Option Activity: DIS, WING, DDOG", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418211700", "headline": "Netflix Won't Reveal Quarterly Subscriber Numbers Anymore: Co-CEO Greg Peters Says This Is What Motivated The Change", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419033749", "headline": "Warner Bros. Discovery: Debt Reductions Boost Future", "summary": "Warner Bros. Discovery, Inc. faces challenges with a significant share price decline and substantial remaining debt. Click to see if WBD is worth looking into."}, {"date": "20240419050000", "headline": "Disneyland Performers Push to Unionize, Protesting Pay, Costume Injuries and ‘the Dungeon’", "summary": "Mickey, Goofy and their friends at Disneyland are planning to join a union.  Hundreds of Disneyland employees who perform in parades, high-five visitors and pose for photos while dressed as famous  Disney  characters—from Darth Vader to Princess Jasmine—have backed the creation of a new unit of the Actors’ Equity Association, a union that primarily represents theater actors and stage managers.  Hourly workers receive annual wage increases, and base pay for parade and character performers rose from $20 to $24.15 per hour starting in January, she said."}, {"date": "20240419050000", "headline": "‘Going Against the Mouse’: Disneyland Performers Advance Unionization Efforts", "summary": "Mickey, Goofy and their friends at Disneyland are planning to join a union.  Hundreds of Disneyland employees who perform in parades, high-five visitors and pose for photos while dressed as famous  Disney  characters—from Darth Vader to Princess Jasmine—have backed the creation of a new unit of the Actors’ Equity Association, a union that primarily represents theater actors and stage managers.  Hourly workers receive annual wage increases, and base pay for parade and character performers rose from $20 to $24.15 per hour starting in January, she said."}, {"date": "20240419060100", "headline": "Warner Bros. Discovery CEO's Pay Soars in 2023 Amid Industry Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419064100", "headline": "9 Communication Services Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419080316", "headline": "11 Most Popular Stocks on Robinhood in 2024", "summary": "In this article, we will take a detailed look at the 11 Most Popular Stocks on Robinhood in 2024. For a quick overview of such stocks, read our article 5 Most Popular Stocks on Robinhood in 2024. Amid rising inflation and economic uncertainty, millions of young Americans are starting to invest in different asset classes to secure their future […]"}, {"date": "20240419090024", "headline": "12 Best Diversified Stocks To Invest In", "summary": "In this article, we will take a look at the 12 best diversified stocks to invest in. To know more about the top stocks, go directly to 5 Best Diversified Stocks To Invest In. Forbes asked a group of experts about the changing global landscape and its effect on investors. These experts included Justin Onuekwusi (JO), […]"}, {"date": "20240419103829", "headline": "Understanding Netflix, Disney Market Maneuvers: Decoding The Streaming Strategy", "summary": "In the fast-paced realm of digital entertainment, the battle for supremacy between streaming giants Netflix Inc (NASDAQ:NFLX) and Walt Disney Co (NYSE:DIS) has captured the attention of investors and industry observers alike. As the media and entertainment market surges towards a projected value of $40.36 billion by 2029 (per Mordor Intelligence data), the competition intensifies, fueled by evolving consumer preferences and technological advancements. Streaming platforms such as Netflix and Disn"}, {"date": "20240419104323", "headline": "Streaming: Are consumers fed up with subscription costs yet?", "summary": "Streaming services have raised subscriptions costs in recent years with a potential for prices to keep increasing down the line. With inflation making its way through consumer goods and services, how are consumers feeling about these price increases? Will they continue to opt in to select services or should streaming companies like Amazon Prime Video (AMZN) be worried? D’Amore-McKim School of Business at Northeastern University Associate Dean of Research and Professor of Marketing Koen Pauwels joins Wealth! to give insight into how consumers are reacting to rising subscription costs from streaming providers.  \"If you're the kind of consumer who is relatively price insensitive and you don't want to be bothered with ads and you want all of your shows to be on one kind of data provider so you don't have to lose the time to figure out which show is where, then you're going to settle [and] select for this ad-free tier,\" Pauwels points out, \"which also means that Netflix (NFLX) can continue raising prices on that one because their pool of consumers choosing for this non-ad service is going to be more restricted, more selective who don't care about prices that much.\" For more expert insight and the latest market action, click here to watch this full episode of Wealth! This post was written by Nicholas Jacobino"}, {"date": "20240419112823", "headline": "Netflix Once Again Evolved And Eclipsed Its Streaming War Rivals", "summary": "With its first quarter results, Netflix Inc (NASDAQ: NFLX) blew past estimates on all fronts. While waiting for its streaming rivals to catch up, like the legacy entertainment giant, Walt Disney Company (NYSE: DIS), Netflix eclipsed them. An impressive fiscal first quarter. For the quarter ended on March 31st, Netflix posted revenue of $9.37 billion, surpassing LSEG’s estimate of $9.28 billion as revenue rose almost 16% YoY. Net income significantly jumped from last year’s comparable quarter whe"}, {"date": "20240419234300", "headline": "Investing for the Long-Term: 3 Stocks With Proven Track Records", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420073000", "headline": "Billionaire Nelson Peltz Has 50% of His Portfolio Invested in These 2 Growth Stocks", "summary": "The vocal activist investor has a pretty concentrated portfolio."}, {"date": "20240420221100", "headline": "Box Office Battle: â����Civil Warâ���� beats â����Abigailâ���� to stay atop with $11M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421010500", "headline": "‘Punishing myself would not help’: My credit card was stolen — the theft revealed lots of nasty surprises about my finances", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421025455", "headline": "10 Undervalued Cyclical Stocks To Invest In According to Analysts", "summary": "In this article, we discuss the 10 undervalued cyclical stocks to invest in according to analysts. To skip the detailed analysis of current market conditions and cyclical stocks, go directly to the 5 Undervalued Cyclical Stocks To Invest In According to Analysts. The stocks that follow the patterns of the economy are known as cyclical […]"}, {"date": "20240421035352", "headline": "Caesars: Sector Leaders In A SWOT Analysis Turn Up A Strategy Insight", "summary": "Investing in a combined entity of Caesars, MGM Resorts, and Las Vegas Sands may be a more attractive choice. Read more to see my thoughts."}, {"date": "20240421063017", "headline": "This CEO has battled billionaire activist Carl Icahn twice — here's his advice to Disney CEO Bob Iger", "summary": "Illumina chairman and Hologic CEO Stephen MacMillan is no stranger to dealing with well-known activist investors."}, {"date": "20240421063400", "headline": "7 places to retire for people who love cruises", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421132100", "headline": "Could Netflix Stock Help You Become a Millionaire?", "summary": "The streaming video giant hasn't stopped growing yet."}, {"date": "20240421193600", "headline": "Disney CTO LeBarge is headed to Penn Entertainment in June", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421195500", "headline": "Disney tech exec leaving to join Penn Entertainment", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421211700", "headline": "Disney CTO LaBerge is headed to Penn Entertainment in June", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421212600", "headline": "UBS Sticks to Their Buy Rating for Walt Disney (DIS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422023500", "headline": "Wells Fargo Remains a Buy on Walt Disney (DIS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422033008", "headline": "Walt Disney : Marvel Studios Debuts New Trailer for ‘Deadpool & Wolverine…", "summary": "Today, Marvel Studios debuted a brand-new trailer and new posters for its highly anticipated feature film Deadpool & Wolverine. Shawn Levy directs Deadpool & Wolverine, which stars Ryan Reynolds, Hugh..."}, {"date": "20240422051600", "headline": "Verizon Outperforms Earnings Expectations But Faces Market Skepticism", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422064600", "headline": "7 High-Flying Stocks That Are Majorly Overdue for a Pullback", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422065000", "headline": "CTO Aaron LaBerge to leave Disney for personal reasons, CNBC reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422070018", "headline": "The Walt Disney Company (DIS) Is a Trending Stock: Facts to Know Before Betting on It", "summary": "Disney (DIS) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects."}, {"date": "20240422071707", "headline": "Netflix's Selloff Isn't Justified", "summary": "The ad-supported membership tier is expected to drive significant revenue growth through ads and subscriptions for Netflix. Read more on NFLX stock here."}, {"date": "20240422074925", "headline": "Disney Technology Executive Aaron Laberge To Leave Company - CNBC", "summary": "April 22 - * DISNEY TECHNOLOGY EXECUTIVE AARON LABERGE TO LEAVE COMPANY-CNBC * LABERGE IS TAKING A JOB AS CTO OF PENN ENTERTAINMENT -CNBCSource text:..."}, {"date": "20240422075347", "headline": "DraftKings Looks Appealing As TAM Expands Led By New Markets And Robust Tech Stack", "summary": "DraftKings is set to become profitable next year with strategic updates and strong growth potential. Click here to read an analysis of DKNG stock now."}, {"date": "20240422080001", "headline": "Netflix's Strong FCF Growth Could Push the Stock Higher", "summary": "The company's membership and free cash flow growth could bring its value to $800 per share"}, {"date": "20240422083447", "headline": "PENN Entertainment Names Disney's Aaron LaBerge as Tech Chief", "summary": "By Ben Glickman PENN Entertainment on Monday named Disney executive Aaron LaBerge as its chief technology officer, effective July 1. The appointment confirms a prior report from The Wall..."}, {"date": "20240422110506", "headline": "Walt Disney : ‘The Sign’ Marks Biggest ‘Bluey’ Episode Premiere…", "summary": "The world can't get enough of Bluey. The Sign, the series' first-ever extended-length special, now ranks as both the most-viewed Bluey episode premiere and the most-viewed..."}, {"date": "20240422112329", "headline": "Telcoms Advance as Traders Await Deal Developments -- Communications Services Roundup", "summary": "Communications services companies ticked up as traders awaited developments in the deal market. Paramount Global was more or less flat as traders digested reports that Sony has thrown its hat..."}, {"date": "20240422123500", "headline": "Disney Technology Chief Departs", "summary": "Penn said Monday it named LaBerge as its new chief technology officer, effective July 1.  LaBerge’s departure comes amid several high-stakes technological initiatives within Disney as it works to build a streaming-centric future."}, {"date": "20240422135849", "headline": "Disney's Aaron LaBerge to step down, join Penn Entertainment as CTO", "summary": "LaBerge, who has spent more than 20 years at Walt Disney Co, will assume a similar role at Penn, effective July 1.  Walt Disney's ESPN and Penn had agreed in August last year to jointly launch a sports betting business under the brand ESPN BET.  \"I plan to use my experience from Disney and ESPN to help make ESPN BET an essential piece of the sports fan experience,\" LaBerge was quoted as saying in a separate press release from Penn."}, {"date": "20240422140702", "headline": "Disney tech executive Aaron LaBerge leaves company after more than 20 years", "summary": "Aaron LaBerge, longtime tech executive at Disney and ESPN, is leaving the company for a new job at sports betting platform Penn Entertainment."}, {"date": "20240422141421", "headline": "Disney Entertainment CTO to depart, join Penn Entertainment", "summary": "Aaron LeBerge, the chief technology officer of Disney Entertainment and ESPN, is leaving the company to join Penn Entertainment (PENN). In a memo, LeBerge described the move as a \"personal decision driven by the needs of my family.\" It comes as Disney (DIS) faces questions about who will succeed Bob Iger as CEO when his contract is up. In the video above, Yahoo Finance's Alexandra Canal and Josh Lipton discuss what's next for Disney. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Stephanie Mikulich."}, {"date": "20240422154517", "headline": "Walt Disney (DIS) Stock Sinks As Market Gains: What You Should Know", "summary": "In the latest trading session, Walt Disney (DIS) closed at $111.99, marking a -0.55% move from the previous day."}, {"date": "20240422194800", "headline": "Penn Entertainment Upgraded Based On ESPN Bet's Zero Valuation, Analyst Says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422195400", "headline": "Penn Entertainment Upgraded After Analyst Challenges ESPN Bet's Zero Valuation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422200700", "headline": "Wells Fargo Hikes Disney (NYSE:DIS) Rating, Says “Focus on Execution” Now in Play", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422210300", "headline": "Wells Fargo Hikes Disney (NYSE:DIS) Rating, Shares Rise", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422231800", "headline": "Disney price target raised by $13 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423002930", "headline": "UPDATE 2-Netflix's Nordic rival Viaplay logs much slower Q1 growth, shares slide", "summary": "Swedish video streaming company Viaplay said sales growth at its core operations slowed markedly in the first quarter due to price hikes, knocking its shares 7% lower.  After replacing its CEO and laying off 30% of its workforce last year, Viaplay unveiled a turnaround plan in December that included raising equity, restructuring debt, and focusing on its core Nordic, Dutch and Viaplay Select operations.  The group, which competes with Netflix Inc and Walt Disney Co's Disney+, said sales from those operations grew 5.6% organically to 4.46 billion Swedish crowns ($410 million), far below 27.3% growth a year earlier."}, {"date": "20240423045000", "headline": "Madison Covered Call And Equity Income Fund Q1 2024 Investment Strategy Letter", "summary": "Early in the first quarter, the S&P 500 blasted through the previous all-time high set at the end of 2021 and momentum carried the market steadily higher with very little resistance."}, {"date": "20240423050156", "headline": "With 67% institutional ownership, The Walt Disney Company (NYSE:DIS) is a favorite amongst the big guns", "summary": "Key Insights Given the large stake in the stock by institutions, Walt Disney's stock price might be vulnerable to their..."}, {"date": "20240423055100", "headline": "Disney set to execute, Wells Fargo says in raising estimates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423063800", "headline": "10 Communication Services Stocks Whale Activity In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423121544", "headline": "Market Chatter: Walt Disney, Warner Bros. Exclusive Discussion Period for New NBA Contract Ends Without Deal", "summary": "Market Chatter: Walt Disney, Warner Bros. Exclusive Discussion Period for New NBA Contract Ends Without Deal"}, {"date": "20240423201300", "headline": "NFL Draft Action: Tune In, Check Out Betting Odds For Top 5 Picks And Join Benzinga's Live Event Coverage", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423202500", "headline": "Custom X-Men '97 Xbox Wrapped In A Comic Book, Plus Controllers Available For Limited Time", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424001300", "headline": "Bluey Dominates Ratings For Disney+: Kids, Parents Hoping Hit Show Not Over", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424030500", "headline": "BUZZ Investing: CPI Surge Spikes Bond Yields", "summary": "The BUZZ NextGen AI US Sentiment Leaders Index returned 5.39% during the month of March, compared to a return of 3.22% for the S&P 500 Index during the same period. Click to read."}, {"date": "20240424061223", "headline": "Walt Disney : Disney+ Debuts ‘Jim Henson Idea Man’ Trailer", "summary": "Today, Disney+ released the official trailer for the upcoming documentary Jim Henson Idea Man. Directed by Academy Award®-winner Ron Howard, Jim Henson Idea Man chronicles..."}, {"date": "20240424084500", "headline": "5 Reasons to Buy Disney Stock Like There's No Tomorrow", "summary": "Disney stock is finally beating the market this year, but the upticks could just be getting started."}, {"date": "20240424111710", "headline": "With lawsuits in rearview mirror, Disney World government gets back to being boring", "summary": "For the first time in more than a year, the monthly board meeting of Walt Disney World's governing district on Wednesday was back to being what many municipal government forums often are — boring.  There were no rants against Disney by the board's chairman nor demands by local opponents for board members appointed by Gov. Ron DeSantis to resign immediately.  Instead, board members approved contracts for the installation of pipelines for chilled water, sediment removal, the replacement of a wastewater lift pump and the removal of compost waste."}, {"date": "20240424180228", "headline": "25 Safest and Cheapest Cities To Retire in Florida", "summary": "This article takes a look at the 25 safest and cheapest cities to retire in Florida. If you wish to skip our detailed analysis on navigating retirement living in the US, you may go to 5 Safest and Cheapest Cities To Retire in Florida. Does the Sunshine State Still Hold Retirement Charm? Moving for retirement […]"}, {"date": "20240424195900", "headline": "IBM, Caterpillar share losses contribute to Dow's 329-point fall", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424214000", "headline": "Walt Disney Co. stock underperforms Thursday when compared to competitors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425005600", "headline": "3 Dow Stocks That Could Be Heading Six Feet Under", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425010600", "headline": "3 Tech Stocks to Sell Now Before the Next Market Downturn Hits", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425065100", "headline": "Amazon, YouTube vying for new NBA streaming package, WSJ reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425073010", "headline": "Is It Worth Investing in Disney (DIS) Based on Wall Street's Bullish Views?", "summary": "According to the average brokerage recommendation (ABR), one should invest in Disney (DIS). It is debatable whether this highly sought-after metric is effective because Wall Street analysts' recommendations tend to be overly optimistic. Would it be worth investing in the stock?"}, {"date": "20240425074011", "headline": "Is Disney (DIS) Stock Outpacing Its Consumer Discretionary Peers This Year?", "summary": "Here is how Walt Disney (DIS) and K12 (LRN) have performed compared to their sector so far this year."}, {"date": "20240425114000", "headline": "Amazon, YouTube Vie for NBA Streaming Rights as League’s Media Talks Heat Up", "summary": "The league is advancing toward lucrative deals with incumbent partners and is in talks with tech giants as well as NBCUniversal."}, {"date": "20240425161112", "headline": "10 Best Streaming Service Stocks To Buy", "summary": "In this article, we will discuss the 10 best streaming service stocks to buy. If you want to skip our detailed analysis of the streaming industry and recent trends shaping the streaming market, go directly to 5 Best Streaming Service Stocks To Buy. In recent years, the streaming TV landscape has seen a rapid expansion, […]"}, {"date": "20240425210700", "headline": "Bet On It: Disney and ESPN CTO switches over to Penn", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425220600", "headline": "NBA media talks: Amazon said to be front-runner for streaming rights, YouTube in mix", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425233000", "headline": "Amazon said to near streaming NBA deal; TNT, NBC square off", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426041300", "headline": "June 7th Options Now Available For Walt Disney", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426044300", "headline": "Game On: Amazon, YouTube, And NBCUniversal Reportedly Battle for NBA Rights", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426045000", "headline": "Battle for NBA Deals Among Media Companies Heats Up", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426045200", "headline": "Media Companies Battle for NBA Broadcast Rights", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426045300", "headline": "Media Companies Battle for NBA Streaming Rights", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426061500", "headline": "This Year's Top-Performing Dow Stock Is Down Over 8% In April. Is There More Pain Ahead?", "summary": "Disney stock is having a good year for all the right reasons."}, {"date": "20240426063900", "headline": "Netflix Stock (NASDAQ:NFLX): A Buy After Earnings for Long-Term Play", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426065700", "headline": "Google, How Does One Get A Stock Higher? And What’s Stagflation?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426104811", "headline": "Disney: Proxy Victory Leaves Questions Unanswered As Q2 Earnings Release Looms", "summary": "Disney's success of new content and revival of aging IP remains uncertain. Here's why I feel DIS stock owners should be neutral and hold the stock."}, {"date": "20240426110243", "headline": "25 Most Underrated Cities in Europe to Visit in 2024", "summary": "In this article, we will list the 25 most underrated cities in Europe to visit in 2024. If you want to skip our discussion about tourism rebound, over-tourism, and the global tourism industry, go to the 10 Most Underrated Cities in Europe to Visit in 2024. Over-tourism is creating a problem for European locals in […]"}, {"date": "20240426112249", "headline": "20 States With the Most Beautiful Flags According to Reddit", "summary": "In this article, we will list 20 states with the most beautiful flags according to Reddit. If you want to skip our discussion about Minnesota’s new flag, the importance of flags for tourism, and international and domestic tourism in the United States, go to 5 States With the Most Beautiful Flags According to Reddit. As we […]"}, {"date": "20240426122400", "headline": "Netflix’s Password Crackdown Worked. What’s Next?", "summary": "Netflix will stop reporting subscriber numbers next year to focus on revenue. Heard on the Street deputy editor Aaron Back breaks down Netflix’s lead in the streaming wars and what investors are watching now. Photo: Gabby Jones/Bloomberg News"}, {"date": "20240427060124", "headline": "Returns On Capital At Walt Disney (NYSE:DIS) Paint A Concerning Picture", "summary": "If we want to find a stock that could multiply over the long term, what are the underlying trends we should look for..."}, {"date": "20240427181100", "headline": "California Disney characters are unionizing decades after Florida peers. Hollywood plays a role", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427195600", "headline": "'Deadpool & Wolverine' is (almost) ready to shake up the Marvel Cinematic Universe", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428002400", "headline": "Box Office Battle: Zendayaâ����s â����Challengersâ���� wins weekend with $15M debut", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428031800", "headline": "Here Are the 3 ETFs I Can't Stop Buying in 2024", "summary": "I've been focusing on index funds in my retirement account, and here are three I've been buying this year."}, {"date": "20240428032700", "headline": "California Disney workers move to unionize", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428034300", "headline": "California Disney character workers move to unionize", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428043700", "headline": "The Top 3 Blue-Chip Stocks to Buy in April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428162558", "headline": "10 Leisure and Recreation Services Stocks to Buy", "summary": "In this article, we discuss the 10 leisure and recreation services stocks to buy. To skip our detailed analysis, go directly to the 5 Leisure and Recreation Services Stocks to Buy. During the market downturns of the last five years, the leisure and recreation industry bore the brunt of the damage. Nevertheless, the industry showed […]"}, {"date": "20240428203600", "headline": "Notable Monday Option Activity: DIS, DASH, CHGG", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429001300", "headline": "Wall Street Breakfast: Self-Driving Push", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429013100", "headline": "Morning Brew: Tesla's New Strategy Shakes Auto Sector", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429054200", "headline": "Top 50 stocks with the highest sensitivity to interest rates changes - GS", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429062800", "headline": "Google's AI ad enhancements push for stronger ties to streaming partners", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429065025", "headline": "25 Richest Billionaires in Media and Entertainment", "summary": "In this article, we discuss the 25 richest billionaires in media and entertainment industry. To skip our detailed analysis of the media and entertainment industry, go directly to the 5 Richest Billionaires in Media and Entertainment Industry. Media and Entertainment Industry Outlook Media and entertainment is a vast industry with many sectors including social media, […]"}, {"date": "20240429095002", "headline": "13 Most Popular Retail Investor Stocks in 2024", "summary": "In this piece, we will take a look at the 13 most popular retail investor stocks in 2024. If you want to skip our introduction to how retail trading has changed over these past couple of years and some recent trends, then you can check out 5 Most Popular Retail Investor Stocks in 2024. The […]"}, {"date": "20240429115859", "headline": "NBC Prepares Roughly $2.5 Billion A Year Offer To Steal Nba Rights Away From Tnt - WSJ", "summary": "April 29 - * NBC PREPARES ROUGHLY $2.5 BILLION A YEAR OFFER TO STEALNBARIGHTS AWAY FROM TNT - WSJ * NBA IS IN ADVANCED STAGES OF A NEW ROUND OF..."}, {"date": "20240429154519", "headline": "Walt Disney (DIS) Stock Declines While Market Improves: Some Information for Investors", "summary": "The latest trading day saw Walt Disney (DIS) settling at $112.08, representing a -0.58% change from its previous close."}, {"date": "20240429155500", "headline": "NBC Prepares $2.5-Billion-a-Year Bid to Pluck NBA Rights From TNT", "summary": "The league is in advanced stages of a new round of media-rights deals. Disney’s payments would increase under a proposed deal."}, {"date": "20240429164035", "headline": "UPDATE 1-NBC plans about $2.5 bln offer for NBA broadcast rights, WSJ reports", "summary": "Comcast's NBCUniversal is planning to pay an average of about $2.5 billion a year to broadcast a package of National Basketball Association (NBA) games, the Wall Street Journal reported on Monday, citing people familiar with the matter.  Warner Bros Discovery's TNT  has paid an average fee of $1.2 billion under its current deal, but was unable to reach a new pact with the NBA before an exclusive negotiating window expired last week, according to the report.  Warner began airing the games in 1984, while Walt Disney's ESPN sports network began broadcasting the NBA in 2002."}, {"date": "20240429190600", "headline": "Ryan Reynolds, Rob McElhenney Buy Another Soccer Team: Can Dynamic Duo Turn Around Mexico Club?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429200200", "headline": "Distil plc Celebrates Blackwoods Gin Milestone", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429205500", "headline": "Roku (NASDAQ:ROKU) Augments Advertising with New Partnership", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429210500", "headline": "Warner Bros Discovery (NASDAQ:WBD) Plunges As it May Lose NBA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429213300", "headline": "NBC pitches paying $2.5B a year for NBA TV rights to edge out Warner Bros' TNT", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429214639", "headline": "India's Tata Sons raises stake in Tata Play, Temasek exits, Economic Times reports", "summary": "Tata Sons, the holding company of India's Tata Group, has increased its stake in satellite TV provider Tata Play to 70% by buying a 10% stake from Singapore state investment firm Temasek for about $100 million, the Economic Times reported on Tuesday.  Tata Play has informed the Ministry of Information and Broadcasting about the change in shareholding, complying with regulations governing direct-to-home (DTH) companies, according to the report, which cited people familiar with the matter."}, {"date": "20240430005038", "headline": "Wall Street Breakfast Podcast: NBC Pitches $2.5B A Year For NBA TV Rights", "summary": "NBC pitches paying $2.5B a year for NBA TV rights to edge out Warner Bros' TNT. FCC fines U.S. wireless carriers nearly $200M for illegally sharing location data."}, {"date": "20240430021100", "headline": "From ‘Bridgerton’ to ‘Hacks’ to ‘Wrexham,’ here’s what’s worth streaming in May 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430035600", "headline": "NBC, Amazon Ready To Dunk On Warner As NBA Media Rights Get Competitive", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430063400", "headline": "5 Stocks to Buy on a Solid Jump in Consumer Spending", "summary": "Consumer discretionary stocks like The Walt Disney Company (DIS), Churchill Downs Incorporated (CHDN), H&R Block, Inc. (HRB), Netflix, Inc. (NFLX) and American Public Education, Inc. (APEI) are likely to benefit from the steady growth in consumer spending."}, {"date": "20240430070011", "headline": "How to Find Strong Consumer Discretionary Stocks Slated for Positive Earnings Surprises", "summary": "Finding stocks expected to beat quarterly earnings estimates becomes an easier task with our Zacks Earnings ESP."}, {"date": "20240430080112", "headline": "Walt Disney (DIS) Earnings Expected to Grow: Should You Buy?", "summary": "Disney (DIS) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240430091000", "headline": "3 Dates for Disney Stock Investors to Circle in May", "summary": "Big earnings, a Disney World passholder celebration, and a pair of theatrical releases will keep the month ahead busy."}, {"date": "20240430194400", "headline": "Kroger in talks with Disney about streaming deal, Bloomberg says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430200600", "headline": "Formula 1 Stops Trump Fundraiser; Miami Grand Prix Connection To Dolphins Owner Draws Attention", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430201900", "headline": "Stock Market Crash Warning: Don’t Get Caught Holding These 3 Blue-Chip Stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430213500", "headline": "What You Missed On Wall Street On Wednesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501024900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501053700", "headline": "Spotlight on Walt Disney: Analyzing the Surge in Options Activity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501080127", "headline": "Sphere Entertainment (SPHR) Expected to Beat Earnings Estimates: What to Know Ahead of Q3 Release", "summary": "Sphere Entertainment (SPHR) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240501091133", "headline": "Kroger in talks to bring Disney+ to its grocery delivery program, Bloomberg News says", "summary": "Kroger and Walt Disney's are in talks to bring streaming service Disney+ to the food retailer's grocery delivery program, Bloomberg News reported on Wednesday, citing people familiar with the..."}, {"date": "20240501104003", "headline": "George W. Bush's portraits of veterans are heading to Disney World", "summary": "Walt Disney World will host dozens of portraits of service members and veterans from the nation's Painter-in-Chief.  The George W. Bush Institute will loan the 60 color portraits by the former U.S. president to the Florida theme park resort.  The paintings of service members and veterans will be displayed for a year at Epcot's American Adventure pavilion starting next month."}, {"date": "20240501133100", "headline": "Veteran portrait exhibit by George W. Bush heading to Disney World", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501162500", "headline": "Top Research Reports for Thermo Fisher Scientific, Walt Disney & Southern Copper", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Thermo Fisher Scientific Inc. (TMO), The Walt Disney Company (DIS) and Southern Copper Corporation (SCCO)."}, {"date": "20240501224900", "headline": "Kroger To Boost Customer Perks With Disney+ Streaming: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501231600", "headline": "Kroger, Walt Disney explore retail-streaming partnership - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502004700", "headline": "Penn Entertainment confirms hiring of Aaron LaBerge as CTO", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502005300", "headline": "Airbnb is debuting an ‘Up’ house that levitates and 10 other pop-culture-themed rentals", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502014300", "headline": "Airbnb goes pop culture with experiential listings such as the Ferrari Museum, Pixar houses and Prince's Purple Rain House", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502021000", "headline": "AppLovin initiated at Buy, The Trade Desk upgraded to Buy: Jefferies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502022925", "headline": "XLC: An Eclectic Growth ETF", "summary": "XLC ETF is a surprisingly high growth portfolio (18% EPS growth) at a reasonable valuation at 1.1x PEG. Read why I think the fund has substantial upside."}, {"date": "20240502053400", "headline": "The Zacks Analyst Blog Highlights Thermo Fisher Scientific, Disney, Southern Copper, Tractor Supply and Omnicom", "summary": "Thermo Fisher Scientific, Disney, Southern Copper, Tractor Supply and Omnicom are included in this Analyst Blog."}, {"date": "20240502054900", "headline": "1 Green Flag and 1 Red Flag for Roku Stock", "summary": "The stock won't be southbound forever."}, {"date": "20240502071519", "headline": "Gear Up for Disney (DIS) Q2 Earnings: Wall Street Estimates for Key Metrics", "summary": "Besides Wall Street's top -and-bottom-line estimates for Disney (DIS), review projections for some of its key metrics to gain a deeper understanding of how the company might have fared during the quarter ended March 2024."}, {"date": "20240502075107", "headline": "Walt Disney : Disney’s ‘Launchpad’ Returns for a Third Season, Inviting S…", "summary": "Today, The Walt Disney Studios announced a third season of Disney's Launchpad. The live action shorts program, an initiative dedicated to fostering emerging talent and amplifying diverse voices in..."}, {"date": "20240502082313", "headline": "Kroger considers Disney+ perk for grocery delivery members", "summary": "The move comes as the market attempts to compete with e-commerce leaders such as Amazon."}, {"date": "20240502082600", "headline": "Will Modest Top-Line Growth Buoy Disney's (DIS) Q2 Earnings?", "summary": "Disney's (DIS) fiscal second-quarter results are expected to reflect strength in IP and continued growth in the theme park business globally, offset by a decline in Linear TV revenues."}, {"date": "20240502091206", "headline": "Grand Theft Auto Parent Shuts Two Iconic Game Studios as Part of Sweeping Layoffs", "summary": "Take-Two Interactive Software Inc (NASDAQ:TTWO), the maker of the Grand Theft Auto franchise, plans to close two subsidiaries, Roll7 and Intercept Games, as part of mass layoffs. Roll7, based in London, known for Rollerdrome, and Intercept Games, in Seattle, known for Kerbal Space Program 2, will be shut down, affecting around 70 jobs, Bloomberg reports. Last month, Take-Two announced a 5% staff reduction, which will affect roughly 600 employees, including those from the Private Division, founde"}, {"date": "20240502140100", "headline": "‘Prequel’: Disney’s ‘Mufasa’ and the Back Story on Hollywood Back Stories", "summary": "The trend of sequels that look backward started in early 20th-century literature but has become a staple of the 21st-century film business"}, {"date": "20240502153754", "headline": "Paramount has spent a decade as the source of buyout rumors. That might finally come to an end.", "summary": "Paramount's exclusivity window with Skydance expires on Friday."}, {"date": "20240502160659", "headline": "Tracking Yacktman Asset Management Portfolio - Q1 2024 Update", "summary": "Discover the latest portfolio updates from Yacktman Asset Management, including new stakes and stake disposals, driving an increase in value."}, {"date": "20240502224000", "headline": "Google urges US court to deny changes to app store Play sought by Epic Games - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502230300", "headline": "Stock Market Crash Alert: 3 Must-Buy Travel Stocks When Prices Plunge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503000000", "headline": "Paramount, the Final Season: It’s Scions Versus Shareholders", "summary": "Will Shari Redstone close a sweetheart deal with Skydance’s David Ellison, or be forced to accept a fairer one? A standoff with Charter over fees adds a plot twist."}, {"date": "20240503022100", "headline": "FuboTV’s stock surges after losses narrow to half what was expected", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503023900", "headline": "TRADING UPDATES: Kelso raises stake in NCC; Transense joins project", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503050100", "headline": "June 14th Options Now Available For Walt Disney (DIS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503070013", "headline": "The Walt Disney Company (DIS) is Attracting Investor Attention: Here is What You Should Know", "summary": "Disney (DIS) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock."}, {"date": "20240503091129", "headline": "Stocks to watch next week: BP,  Saudi Aramco, Uber, and interest rates", "summary": "Earnings preview of key companies reporting next week and what to look out for."}, {"date": "20240503094012", "headline": "PARA vs. DIS: Which Stock Is the Better Value Option?", "summary": "PARA vs. DIS: Which Stock Is the Better Value Option?"}, {"date": "20240503153447", "headline": "Disney earnings, Fedspeak: What to Watch Next Week", "summary": "As the trading week draws to a close, it's time to look ahead at the key events that will take center stage for Yahoo Finance in the upcoming week. The earnings season continues to unfold, with notable companies such as Disney (DIS), Uber (UBER), and Toyota (TM) scheduled to report their quarterly financial results on Tuesday. Additionally, another round of Federal Reserve commentary is on the horizon. Richmond Fed President Tom Barkin and Fed Governor Lisa Cook are expected to share their perspectives on the central bank's policy outlook. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Angel Smith"}, {"date": "20240503155834", "headline": "A Week Of Fast-Moving Stocks Ahead: Disney, Toyota, Ferrari, Constellation", "summary": "As the earnings season moves into final innings, some fast-moving names led by Disney, Ferrari and Constellation are due to report."}, {"date": "20240503161430", "headline": "Disney: Finding Bob Iger's successor is still a chief priority", "summary": "Get in line and look out for the Walt Disney Co.'s (DIS) fiscal second-quarter earnings, set to report on Tuesday, May 7. TD Cowen Managing Director of TMT — Media & Entertainment Doug Creutz sits down with Yahoo Finance's Market Domination to look over Disney's next objectives after rebuffing activist investor Nelson Peltz in his latest proxy campaign. \"They've been trying to replace [CEO] Bob Iger for ten years and haven't, successfully anyway. Replacing him is very hard. and not just because... he's been, I think, a balanced and very good executive, but one thing he hadn't [done] is developed a really good bench of people who could potentially replace him... people like Tom Staggs, Jay Rasulo got essentially pushed out of the company because they were told they weren't good enough,\" Creutz elaborates. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Luke Carberry Mogan."}, {"date": "20240504040000", "headline": "Eyes On Apple, Uber, Disney, Rivian And Coupang", "summary": "Stay informed about upcoming market events and earnings reports with Seeking Alpha's Stocks to Watch."}, {"date": "20240504050000", "headline": "The 10 Best Dividend Stocks to Buy Now in May", "summary": "This list of dividend stocks includes high-yield, dividend-growth, and lower-yielding dividend stocks with the potential for increasing payments."}, {"date": "20240504050307", "headline": "Walt Disney : Disney+ Celebrates Star Wars Day with Debut of New Trailer for ‘The…", "summary": "In celebration of the annual Star Wars fan holiday, Disney+ debuted an exciting, brand-new trailer and poster for Lucasfilm's upcoming Star Wars series The Acolyte. The thrilling, suspenseful..."}]}