{"news": [{"date": "20240306190320", "headline": "Elevance Health: Financial Growth And Technical Strength Indicate A Buy", "summary": "Elevance Health demonstrates impressive financial growth in 2023, with increased revenues and earnings per share, suggesting a potential stock rally. Read more."}, {"date": "20240306224500", "headline": "Overview: Where Gurus Found Value in the 4th Quarter", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240307060700", "headline": "Elevance Heath: Financial Growth And Technical Strength Indicate A Buy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240307065200", "headline": "Silk Road Medical's (SILK) New Stent Expands Its TCAR Portfolio", "summary": "Silk Road Medical (SILK) announces the launch of its Tapered ENROUTE Transcarotid Stent System to hospitals in the United States."}, {"date": "20240308065000", "headline": "Stereotaxis (STXS) Seeks Clearance for MAGiC Catheter", "summary": "Stereotaxis (STXS) announces the regulatory submissions of its MAGiC catheter in Europe and the United States, which are intended for use in minimally invasive cardiac ablation treatments."}, {"date": "20240310050027", "headline": "Those who invested in Elevance Health (NYSE:ELV) five years ago are up 76%", "summary": "If you buy and hold a stock for many years, you'd hope to be making a profit. Furthermore, you'd generally like to see..."}, {"date": "20240311041541", "headline": "Elevance completes Paragon Health acquisition", "summary": "The infusion services and drug therapy company will operate under CarelonRx, Elevance’s pharmacy benefit manager."}, {"date": "20240311051300", "headline": "Elevance Health Announces Closing of Paragon Healthcare Acquisition", "summary": "INDIANAPOLIS, March 11, 2024--Elevance Health (NYSE: ELV) today announced the closing of its acquisition of Paragon Healthcare, Inc., a company specializing in life-saving and life-giving infusible and injectable therapies."}, {"date": "20240312091600", "headline": "Elevance Health (ELV) Bolsters CarelonRx With Paragon Buyout", "summary": "The infusion services from Paragon Healthcare are expected to complement Elevance Health's (ELV) suite of pharmacy services."}, {"date": "20240313043400", "headline": "$100 Invested In Elevance Health 15 Years Ago Would Be Worth This Much Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313073011", "headline": "Brokers Suggest Investing in Elevance Health (ELV): Read This Before Placing a Bet", "summary": "Based on the average brokerage recommendation (ABR), Elevance Health (ELV) should be added to one's portfolio. Wall Street analysts' overly optimistic recommendations cast doubt on the effectiveness of this highly sought-after metric. So, is the stock worth buying?"}, {"date": "20240313094800", "headline": "3 Medical Services Stocks to Buy as Industry Trends Improve", "summary": "The Zacks Medical - Services industry is growing on digital healthcare adoption. ELV, COR and ICLR are set to gain the most. However, staffing shortages continue to disrupt the growth trend."}, {"date": "20240314060009", "headline": "Elevance Health Insiders Sell US$2.4m Of Stock, Possibly Signalling Caution", "summary": "Many Elevance Health, Inc. ( NYSE:ELV ) insiders ditched their stock over the past year, which may be of interest to..."}, {"date": "20240314064100", "headline": "Zacks Industry Outlook Highlights Elevance Health, Cencora and ICON", "summary": "Elevance Health, Cencora and ICON are part of the Zacks Industry Outlook article."}, {"date": "20240314161517", "headline": "Elevance Health (ELV) Ascends While Market Falls: Some Facts to Note", "summary": "The latest trading day saw Elevance Health (ELV) settling at $510.57, representing a +0.21% change from its previous close."}, {"date": "20240315054500", "headline": "Health insurers to meet with US officials over UnitedHealth cyberattack", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240315064800", "headline": "Meta, Salesforce, Booking Holdings: Top Dividend Growth Stocks Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240315105700", "headline": "Why Elevance (ELV) is a Smart Addition to Your Portfolio Now", "summary": "Elevance's (ELV) top line is poised to gain from rising product revenues, administrative fees and other revenues."}, {"date": "20240317040139", "headline": "Dividend Champion, Contender, And Challenger Highlights: Week Of March 17", "summary": "A weekly summary of dividend activity for Dividend Champions, Contenders, and Challengers. Read more to see the weekly update for March 17."}, {"date": "20240317105547", "headline": "20 Countries that Spend the Most on Welfare", "summary": "In this article, we will discuss the 20 countries that spend the most on welfare. If you want to skip our analysis, you can proceed to the section highlighting the 5 Countries that Spend the Most on Welfare. Welfare programs assist in areas such as healthcare, food, housing, education, transportation, child care, and monetary help […]"}, {"date": "20240317211700", "headline": "Kroger to sell specialty pharmacy business to CarelonRx, terms not disclosed", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240318001600", "headline": "Kroger to sell its specialty pharmacy business", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240318004625", "headline": "More Big Changes To My Dividend Growth Portfolio", "summary": "I have been actively reshaping my portfolio by selling off low-conviction holdings and focusing on high-growth compounders. Explore more details here."}, {"date": "20240318055600", "headline": "Kroger (NYSE:KR) Agrees to Offload Specialty Pharmacy Unit", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240318055800", "headline": "Kroger (NYSE:KR) Agrees to Divest Specialty Pharmacy Unit", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240318060015", "headline": "Elevance Health (NYSE:ELV) Could Easily Take On More Debt", "summary": "Warren Buffett famously said, 'Volatility is far from synonymous with risk.' So it seems the smart money knows that..."}, {"date": "20240318144828", "headline": "UPDATE 1-Kroger to sell specialty pharmacy business to Elevance Health's CarelonRx", "summary": "Grocer Kroger said on Monday it had entered a definitive agreement for the sale of its specialty pharmacy business to CarelonRx, a unit of U.S. health insurer Elevance Health.  The retailer's specialty pharmacy business serves patients with chronic illnesses that require complex care.  Kroger Specialty Pharmacy is separate from other Kroger Family of Pharmacies, including in-store retail pharmacies and The Little Clinics, which are not included in the deal."}, {"date": "20240318145030", "headline": "Kroger to sell specialty pharmacy business to Elevance Health's CarelonRx", "summary": "The financial terms of the deal were not disclosed.  The retailer's specialty pharmacy business serves patients with chronic illnesses that require complex care.  Kroger Specialty Pharmacy is separate from other Kroger Family of Pharmacies, including in-store retail pharmacies and The Little Clinics, which are not included in the deal."}, {"date": "20240318162300", "headline": "Kroger to Sell Specialty Pharmacy Business", "summary": "Kroger  said it plans to sell its specialty pharmacy business to an  Elevance Health  subsidiary.  The grocery-store chain said Monday it will sell the business to CarelonRx, a pharmacy benefit manager owned by Elevance.  Kroger said the deal was expected to close in the second half of 2024 and wouldn’t affect 2024 guidance."}, {"date": "20240318225100", "headline": "Analysts Conflicted on These Healthcare Names: Illumina (ILMN) and Elevance Health (ELV)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240319052400", "headline": "Kroger Passes The Baton: Sells Specialty Pharmacy Division To CarelonRx", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240319061900", "headline": "International Paper, Unilever rise; Super Micro, Freeport-McMoRan fall, Tuesday, 3/19/2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240319074800", "headline": "Cencora (COR) Hits 52-Week High: What's Driving the Stock?", "summary": "Investors are optimistic about Cencora's (COR) strength in the U.S. Healthcare Solutions business."}, {"date": "20240319151503", "headline": "HealthEquity (HQY) Beats Q4 Earnings and Revenue Estimates", "summary": "HealthEquity (HQY) delivered earnings and revenue surprises of 12.50% and 1.48%, respectively, for the quarter ended January 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240320093400", "headline": "HealthEquity (HQY) Q4 Earnings Surpass Estimates, Margins Up", "summary": "HealthEquity (HQY) witnesses solid growth in HSAs, besides recording robust performances in the majority of its segments, in the fourth quarter of fiscal 2024."}, {"date": "20240320152002", "headline": "Sera Prognostics, Inc. (SERA) Reports Q4 Loss, Lags Revenue Estimates", "summary": "Sera Prognostics (SERA) delivered earnings and revenue surprises of 0% and 56.84%, respectively, for the quarter ended December 2023. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240320160842", "headline": "Tracking Ruane, Cunniff, & Goldfarb's Portfolio - Q4 2023 Update", "summary": "Ruane, Cunniff & Goldfarb's 13F portfolio value rose to $6.26B, driven by top holdings in ICE, GOOG, and SCHW. Read more on the portfolio update here."}, {"date": "20240321021831", "headline": "Elevance: A Healthy Dose Of Dividend Growth", "summary": ""}, {"date": "20240321113900", "headline": "Humana (HUM), DUOS Unveil Program to Improve Veterans' Health", "summary": "Humana (HUM) collaborates with DUOS to develop a program that aims to provide personalized care and assure the well-being of Louisiana's Veteran community, who have a HUM MA plan and suffer from chronic conditions."}, {"date": "20240321180229", "headline": "25 Largest Insurance Companies in the World in 2024", "summary": "In this article, we will cover the 25 largest insurance companies in the world in 2024. If you want to skip our detailed analysis of the insurance industry, you can go directly to 5 Largest Insurance Companies in the World in 2024. Insights into the Global Insurance Market The insurance sector plays a crucial role […]"}, {"date": "20240321214200", "headline": "Elevance Health Inc. stock outperforms competitors despite losses on the day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240321234500", "headline": "Sequoia Strategy 2023 Year-End Letter", "summary": "Sequoia returned 26.3% in 2023 vs. 26.3% for S&P 500. Since June 2016, Sequoia and S&P 500 have compounded at 10.9% & 13.6%, respectively. Click here to read more."}, {"date": "20240322040000", "headline": "Sequoia Fund 2023 Year-End Letter", "summary": "Sequoia Fund returned 27.83% in 2023 vs. 26.29% for S&P 500. Since June 2016, Sequoia and S&P 500 have compounded at 11.25% and 13.59%, respectively. Click here to read more."}, {"date": "20240322094013", "headline": "ELV or GDRX: Which Is the Better Value Stock Right Now?", "summary": "ELV vs. GDRX: Which Stock Is the Better Value Option?"}, {"date": "20240322161517", "headline": "Elevance Health (ELV) Dips More Than Broader Market: What You Should Know", "summary": "In the latest trading session, Elevance Health (ELV) closed at $513.85, marking a -0.16% move from the previous day."}, {"date": "20240322223400", "headline": "3 Stocks To Buy For Decreased Volatility", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240325233100", "headline": "Analysts Offer Insights on Healthcare Companies: Walgreens Boots Alliance (WBA), Elevance Health (ELV) and Stoke Therapeutics (STOK)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240327214600", "headline": "Elevance Health Inc. stock underperforms Thursday when compared to competitors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328030200", "headline": "Wegovy will be covered by some insurers, but not for weight loss: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328030200", "headline": "CVS, Elevance Health to cover Novo Nordisk’s Wegovy: WSJ", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328032800", "headline": "Insurance Coverage For Weight Loss Drugs - Elevance, CVS Health Become First To Extend Coverage To Novo Nordisk's Successful Wegovy For Certain Patients", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328060000", "headline": "How Much Does It Cost To Make Novo Nordisk's Ozempic? Shockingly Low Against $1,000 Price Tag, Study Shows", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328070700", "headline": "First Medicare Health Plans to Start Paying for Weight-Loss Drug Wegovy", "summary": "The first major U.S. health insurers have agreed to start paying for the popular anti-obesity drug Wegovy for certain people on Medicare with heart-related conditions."}, {"date": "20240328140518", "headline": "50 Percent of Billionaire Cooperman’s Portfolio is Invested in These 12 Dividend Stocks", "summary": "In this piece, we will take a look at the stocks in which half of Leon Cooperman’s latest investment portfolio is invested. If you want to skip our overview of the billionaire investor and dividend investing, then you can take a look at 29 Percent of Billionaire Cooperman’s Portfolio is Invested in These 5 Dividend […]"}, {"date": "20240328214200", "headline": "Analysts and Technical Indicators Agree: These 3 Stocks Are “Strong Buys” – 03/29/2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240330045007", "headline": "25 Largest Insurance Companies in the US by Assets in 2024", "summary": "In this piece, we will take a look at the 25 largest insurance companies in the US by assets in 2024. If you want to skip our overview of the US insurance industry and the latest trends and news, then you can take a look at the 5 Largest Insurance Companies in the US by […]"}, {"date": "20240330080013", "headline": "Elevance Health (NYSE:ELV) Is Doing The Right Things To Multiply Its Share Price", "summary": "If we want to find a potential multi-bagger, often there are underlying trends that can provide clues. Firstly, we'd..."}, {"date": "20240331213300", "headline": "$100 Invested In This Stock 10 Years Ago Would Be Worth $500 Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240331222000", "headline": "Health insurer stocks slide on Medicare Advantage payment update", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401001600", "headline": "Fly Intel: After-Hours Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401074751", "headline": "My Top 15 High Growth Dividend Stocks For April 2024", "summary": "Discover the recent performance of S&P 500 ETF Trust, top dividend growth stocks for April 2024, and a watchlist's annualized return in this financial..."}, {"date": "20240401180157", "headline": "UnitedHealth, Health Insurers Tumble On Medicare Advantage Rates", "summary": "UnitedHealth, Humana and other big health insurers fell Monday night on lower-than-expected Medicare Advantage rates for 2025."}, {"date": "20240401191500", "headline": "Medicare Advantage Payment Updates Impact Health Insurance Stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401231618", "headline": "The Standard Closes Acquisition of Life & Disability Business From Elevance Health, Enters Distribution Partnership", "summary": "StanCorp Financial Group, Inc. today announced the closing of the acquisition of the Life & Disability business from Elevance Health in accordance with the terms of the agreement reported on March..."}, {"date": "20240402004400", "headline": "Medicare Advantage rate disappointment sinks stocks of UnitedHealth, Humana", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402034700", "headline": "Managed care stocks drop after Medicare rate decision", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402040600", "headline": "Why the CMS’ Medicare Advantage rate is hurting stocks of Humana, UnitedHealth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402050212", "headline": "Health Stocks Fall on Medicare Rate Surprise", "summary": "Federal payment rates to Medicare insurers next year will come in lower than Wall Street had expected—a decision that weighed down shares in the sector.  The Centers for Medicare and Medicaid Services said late Monday that 2025 payment rates for Medicare Advantage plans will be largely identical to a January proposal the insurance industry had argued was too low.  There is particular pressure on Humana, which focuses almost exclusively on Medicare."}, {"date": "20240402052012", "headline": "Elevance Health (ELV) Benefitting From Continued Growth In Health Care Expenditure", "summary": "Artisan Partners, an investment management company, released its “Artisan Select Equity Fund” fourth quarter 2023 investor letter. A copy of the same can be downloaded here. In the fourth quarter, Investor Class: ARTNX returned 12.84%, its Advisor Class: APDNX returned 12.92%, and Institutional Class: APHNX returned 12.88% compared to S&P 500 Index’s 11.69% return. In addition, […]"}, {"date": "20240402144102", "headline": "Health stocks drop after Medicare Advantage rates disappoint", "summary": "Healthcare stocks are under pressure Tuesday after Medicare Advantage plan payments for 2025 came in lower than expected. TD Cowen Senior Equity Research Analyst at Gary Taylor joins Yahoo Finance Live to explain the implications for the healthcare industry. Taylor describes it as an \"annual political dance\" that occurs between the industry and Centers for Medicare & Medicaid Services (CMS). He explains that when a proposed rule is issued, such as the 2025 Medicare Advantage (MA) proposed rule, \"generally the industry lobbies...to make a case\" for higher proposed rates. Typically, the final notice reflects increased rates; however, this time, CMS did not make any adjustments. Taylor states that the potential fallout could \"drive the industry to reduce the benefits they're offering seniors\" next year, which could bolster margins for these businesses. Coupled with the low rate for 2025, he says, this dynamic could result in higher earnings growth. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. Editor's note: This article was written by Angel Smith"}, {"date": "20240403052200", "headline": "Elevance Health Achieves #14 Analyst Rank, Surpassing Halliburton", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403055200", "headline": "Video: S&P 500 Analyst Moves: ELV", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403061400", "headline": "Wall Street Set to See a Broad-Based Rally in Q2: 5 Picks", "summary": "It will be prudent to invest in non-technology stocks with a favorable Zacks Rank to gain in the near future. Five such stocks are: WELL, GIS, ELV, RCL, RYAAY."}, {"date": "20240403070010", "headline": "Want Better Returns? Don't Ignore These 2 Medical Stocks Set to Beat Earnings", "summary": "Finding stocks expected to beat quarterly earnings estimates becomes an easier task with our Zacks Earnings ESP."}, {"date": "20240403101015", "headline": "Why Elevance Health (ELV) is Poised to Beat Earnings Estimates Again", "summary": "Elevance Health (ELV) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report."}, {"date": "20240403145100", "headline": "Elevance Health to Hold Conference Call and Webcast to Discuss First Quarter 2024 Results on April 18, 2024", "summary": "INDIANAPOLIS, April 03, 2024--Elevance Health (NYSE: ELV) will release first quarter 2024 financial results on April 18, 2024, at 6:00 a.m. Eastern Daylight Time (\"EDT\"). Management will review these results and its outlook during a conference call at 8:30 a.m. EDT that same morning. The conference call should be accessed at least 15 minutes prior to its start with the following numbers:"}, {"date": "20240403190300", "headline": "Deep Dive Into Elevance Health Stock: Analyst Perspectives (7 Ratings)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404030817", "headline": "Elevance Health to Hold Conference Call and Webcast to Discuss First Quarter Results on April 18, 2024", "summary": "INDIANAPOLIS, IN - Elevance Health will release first quarter 2024 financial results on April 18, 2024, at 6:00 a.m. . Management will review these results and its outlook during a conference call..."}, {"date": "20240404214500", "headline": "Elevance Health Inc. stock outperforms competitors on strong trading day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240406080011", "headline": "Is Elevance Health, Inc.'s (NYSE:ELV) Recent Performance Tethered To Its Attractive Financial Prospects?", "summary": "Elevance Health's (NYSE:ELV) stock up by 5.7% over the past three months. Given its impressive performance, we decided..."}, {"date": "20240408050400", "headline": "Piedmont & Anthem Blue Cross and Blue Shield Extend Contract", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409094011", "headline": "ELV vs. GDRX: Which Stock Is the Better Value Option?", "summary": "ELV vs. GDRX: Which Stock Is the Better Value Option?"}, {"date": "20240409121300", "headline": "Elevance Health (ELV) Brand Inks Deal to Better Serve Georgia", "summary": "Elevance Health's (ELV) brand, Anthem Blue Cross and Blue Shield, collaborates to make the benefits of Piedmont's healthcare network available to its members across specific Georgia regions."}, {"date": "20240409190000", "headline": "Fitch flags Medicare utilization trends ahead of managed care earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410184307", "headline": "Elevance Health: Not Doing Enough In 2024 To Justify Premium Price", "summary": "Elevance's Q1'24 earnings announcement is approaching as ELV stock price soars; low Medicare Advantage exposure ensures strong performance. Explore more here."}, {"date": "20240411080017", "headline": "Elevance Health (ELV) Earnings Expected to Grow: What to Know Ahead of Next Week's Release", "summary": "Elevance Health (ELV) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240412050600", "headline": "If You Invested $1000 In This Stock 20 Years Ago, You Would Have $11,000 Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412060021", "headline": "Is It Time To Consider Buying Elevance Health, Inc. (NYSE:ELV)?", "summary": "Today we're going to take a look at the well-established Elevance Health, Inc. ( NYSE:ELV ). The company's stock saw..."}, {"date": "20240413035600", "headline": "AbbVie keeps Humira market share near 100% despite biosimilars: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414212700", "headline": "Barclays Keeps Their Buy Rating on Elevance Health (ELV)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414230700", "headline": "Elevance Health (ELV) Receives a Buy from Wells Fargo", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414231600", "headline": "Centene price target raised by $4 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414231700", "headline": "Molina Healthcare price target lowered by $30 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415000100", "headline": "Options Volatility and Implied Earnings Moves This Week, April 15 – April 19, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415002900", "headline": "Elevance Health and Clayton, Dubilier & Rice join hands to advance primary care delivery", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415003800", "headline": "Elevance Health,CD&R in primary care delivery pact, terms undisclosed", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415033800", "headline": "Centene rises, Molina slides following Floridaâ����s managed Medicaid awards", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415045700", "headline": "Netflix and United Airlines to report highest move post earnings: BofA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415050000", "headline": "Elevance Health and Clayton, Dubilier & Rice Sign Agreement to Launch Strategic Partnership to Advance Primary Care Delivery", "summary": "INDIANAPOLIS, April 15, 2024--Elevance Health, Inc. (NYSE: ELV) and Clayton, Dubilier & Rice (CD&R) announced an agreement to form a strategic partnership to accelerate innovation in primary care delivery, enhance the healthcare experience, and improve health outcomes. This effort, which will operate across multiple regions of the United States, will bring together certain care delivery and enablement assets of Elevance Health’s Carelon Health and CD&R portfolio companies, apree health and Mille"}, {"date": "20240415071918", "headline": "What Analyst Projections for Key Metrics Reveal About Elevance Health (ELV) Q1 Earnings", "summary": "Besides Wall Street's top -and-bottom-line estimates for Elevance Health (ELV), review projections for some of its key metrics to gain a deeper understanding of how the company might have fared during the quarter ended March 2024."}, {"date": "20240415080020", "headline": "Medpace (MEDP) Earnings Expected to Grow: Should You Buy?", "summary": "Medpace (MEDP) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240415092200", "headline": "Top Analyst Reports for Microsoft, Novo Nordisk & United Parcel", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Microsoft Corporation (MSFT), Novo Nordisk A/S (NVO) and United Parcel Service, Inc. (UPS)."}, {"date": "20240415092800", "headline": "Will Elevance (ELV) Beat Q1 Earnings on Carelon Strength?", "summary": "The first-quarter results of Elevance (ELV) are likely to reflect higher product revenues and Commercial Individual membership growth."}, {"date": "20240415141706", "headline": "See How Florida's Much Awaited Medicaid Re-Procurement Awards Impact Centene, Humana, Molina", "summary": "Friday, the Agency for Health Care Administration announced contracts to five health plans due for the re-procurement of the Statewide Medicaid Managed Care (SMMC) program. Florida has finally announced its long-awaited Medicaid contract awards, keeping Centene Inc (NYSE:CNC), Elevance Health Inc (NYSE:ELV), and Humana Inc (NYSE:HUM) as the only providers in each state region. Stephens noted that Centene and Elevance Health re-procured specialty contracts (MMASC) while Centene also retained its"}, {"date": "20240415191100", "headline": "UnitedHealth sends beaten-down peers higher after Q1 results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415220200", "headline": "GE Aerospace Takes Center Stage in T. Rowe Price Equity Income Fund's Q1 Portfolio Adjustments", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416013722", "headline": "Elevance Health and Clayton, Dubilier and Rice Sign Agreement to Launch Strategic Partnership to Advance Primary Care Delivery", "summary": "INDIANAPOLIS - Elevance Health, Inc. and Clayton, Dubilier & Rice announced an agreement to form a strategic partnership to accelerate innovation in primary care delivery, enhance the healthcare..."}, {"date": "20240416030700", "headline": "The Zacks Analyst Blog Highlights Microsoft, Novo Nordisk, United Parcel Service, Booking and Elevance Health", "summary": "Microsoft, Novo Nordisk, United Parcel Service, Booking and Elevance Health are included in this Analyst Blog."}, {"date": "20240416041600", "headline": "UnitedHealth (UNH) Surges 5%: Q1 Earnings Triumph Amid Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416060018", "headline": "Possible Bearish Signals With Elevance Health Insiders Disposing Stock", "summary": "Over the past year, many Elevance Health, Inc. ( NYSE:ELV ) insiders sold a significant stake in the company which may..."}, {"date": "20240416101300", "headline": "Elevance Health (ELV), CD&R to Unveil Primary Care Offering", "summary": "Elevance Health (ELV) forms an alliance with CD&R to enhance primary care delivery by making collective use of the partners' assets and subsequently, reduce overall costs of care."}, {"date": "20240416162500", "headline": "UnitedHealth Stock Soars After Earnings Beat Expectations, Despite Cyberattack", "summary": "UnitedHealth  shares staged a relief rally Tuesday, soaring more than 5% after the healthcare giant delivered a surprise: better-than-expected earnings.  The stock move marks a recovery after share prices across the sector suffered for months, largely due to investor worries about rising medical costs and changes in the Medicare business.  Shares of competitors, including Humana and Elevance, also showed increases after UnitedHealth posted results."}, {"date": "20240417022809", "headline": "Elevance Health : Health Equity Assessment", "summary": "Advancing Health Equity at Elevance Health A Review of Approach and Capabilities March 2024 ..."}, {"date": "20240417051500", "headline": "Elevance Health Q1 2024 Earnings Preview", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417052700", "headline": "5 Giants Likely to Win Big on Earnings Results This Week", "summary": "We have narrowed our search to five large-cap stocks that are poised to beat on earnings results this week. These are: NFLX, ISRG, ELV, EFX, CSX."}, {"date": "20240417062000", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417083300", "headline": "Is a Surprise Coming for Elevance (ELV) This Earnings Season?", "summary": "Elevance (ELV) is seeing favorable earnings estimate revision activity and has a positive Zacks Earnings ESP heading into earnings season."}, {"date": "20240417092815", "headline": "Elevance notches $2.3B in profit, unfazed by Change attack", "summary": "The insurer says it has caught up on claims delayed due to the cyberattack on the claims clearinghouse earlier this year, and shared more details on a new primary care venture with a private equity firm."}, {"date": "20240417193900", "headline": "Thursday Sector Leaders: Financial, Consumer Products", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417212600", "headline": "What You Missed On Wall Street On Thursday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417221800", "headline": "Stock market today: Asian markets sink, with Japan’s Nikkei down 3.5%, as Mideast tensions flare", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417221800", "headline": "Stock market today: Wall Street drifts following more reports showing a resilient US economy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417230100", "headline": "Elevance Health reports Q1 adjusted EPS $10.64, consensus $10.53", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417230200", "headline": "Elevance Health raises FY24 adjusted EPS view to greater than $37.20 per share", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417230300", "headline": "Elevance Health reports Medical membership totaled ~46.2M at March 31", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417230800", "headline": "Elevance Health Non-GAAP EPS of $10.64 beats by $0.11, revenue of $42.58B beats by $140M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417233200", "headline": "Elevance Health Inc (ELV) Q1 2024 Earnings: Aligns with Analyst Projections", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418000600", "headline": "Options Volatility and Implied Earnings Moves Today, April 18, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418001008", "headline": "Elevance Health: Q1 Earnings Snapshot", "summary": "INDIANAPOLIS — INDIANAPOLIS — Elevance Health Inc. on Thursday reported first-quarter net income of $2.25 billion. The Indianapolis-based company said it had net income of $9.59 per..."}, {"date": "20240418004808", "headline": "Elevance Health : Q1 2024 Supplemental Earnings Presentation", "summary": "Elevance Health 1Q 2024 Earnings Presentation April 18, 2024 Key Highlights ..."}, {"date": "20240418004826", "headline": "Elevance Health 1Q Revenue Rises, Membership Keeps Declining; Raises Guidance", "summary": "By Sabela Ojea Elevance Health said revenue rose slightly in the first quarter due to higher premium yields amid an additional decline in its membership base, and raised its adjusted earnings..."}, {"date": "20240418004900", "headline": "Elevance Health declares $1.63 dividend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418011200", "headline": "Earnings Scheduled For April 18, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418015800", "headline": "Fly Intel: Pre-market Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418023100", "headline": "Analysts Offer Insights on Healthcare Companies: Abbott Labs (ABT) and Elevance Health (ELV)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418025600", "headline": "Early notable gainers among liquid option names on April 18th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418033000", "headline": "Hospital survey weakened 'dramatically' in March, says TD Cowen", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418033700", "headline": "Elevance hits 52-week high after Q1 earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418033907", "headline": "Elevance Health : 2024 Q1 Earnings Call", "summary": "Elevance Health 2024 Q1 Earnings Call April 18, 2024 8:30 AM ET Webcast Attachments Original Link \t\t\t\t\t\t ..."}, {"date": "20240418035400", "headline": "ELV Stock Earnings: Elevance Health Beats EPS, Misses Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418040000", "headline": "Elevance Health Reports First Quarter 2024 Results", "summary": "INDIANAPOLIS, April 18, 2024--Elevance Health, Inc. (NYSE: ELV) reported first quarter 2024 results."}, {"date": "20240418040120", "headline": "Elevance Health, Inc. 2024 Q1 - Results - Earnings Call Presentation", "summary": "The following slide deck was published by Elevance Health, Inc."}, {"date": "20240418050100", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418051002", "headline": "Elevance Health (ELV) Beats Q1 Earnings Estimates", "summary": "Elevance Health (ELV) delivered earnings and revenue surprises of 0.95% and 0.36%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240418060000", "headline": "Elevance Health’s quarterly profit tops estimates to offset a revenue shortfall", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418061400", "headline": "Elevance Health price target raised by $20 at Cantor Fitzgerald, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418061555", "headline": "14 Best Large Cap Dividend Growth Stocks To Buy Now", "summary": "In this article, we discuss 14 best large-cap dividend growth stocks to buy now. You can skip our detailed analysis of large-cap dividend stocks and their historical performance, and go directly to read 5 Best Large Cap Dividend Growth Stocks To Buy Now. Large-cap stocks have remained ideal for investors as they typically form the […]"}, {"date": "20240418061903", "headline": "Elevance Health, Inc. (ELV) Q1 2024 Earnings Call Transcript", "summary": "Elevance Health, Inc. (NYSE:NYSE:ELV) Q1 2024 Earnings Call Transcript April 18, 2024 8:30 AM ETCompany ParticipantsSteve Tanal - VP of IRGail Boudreaux -..."}, {"date": "20240418062452", "headline": "Wall St ticks up on megacaps, earnings boost", "summary": "* Elevance Health up after Q1 profit beat ..."}, {"date": "20240418073014", "headline": "Compared to Estimates, Elevance Health (ELV) Q1 Earnings: A Look at Key Metrics", "summary": "While the top- and bottom-line numbers for Elevance Health (ELV) give a sense of how the business performed in the quarter ended March 2024, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values."}, {"date": "20240418074153", "headline": "Elevance Raises Forecast Amid Industry Cyberattack Concerns", "summary": "(Bloomberg) -- Elevance Health Inc. raised its outlook for the year on first-quarter results that offered some relief to investors after a cyberattack against a rival roiled the health-insurance sector. Most Read from BloombergDubai Grinds to Standstill as Flooding Hits CityElon Wants His Money BackSingapore Loses ‘World’s Best Airport’ Crown to QatarRecord Rainfall in Dubai? Blame Climate Change, Not Cloud SeedingRed Lobster Considers Bankruptcy to Deal With Leases and Labor CostsProfit was $10"}, {"date": "20240418084542", "headline": "Elevance Health Offers More Relief on Medical Costs for Worried Investors", "summary": "Elevance Health offered skittish investors another signal that health insurers aren’t getting hit with higher-than-expected costs, reporting results that beat Wall Street expectations.  Elevance stock rose over 5% early Thursday, on track for its highest close since December 2022.  The earnings may help sustain a rally that began Tuesday, when UnitedHealth released results that also came in above analysts’ projections and said healthcare expenses were running at expected rates."}, {"date": "20240418091800", "headline": "Elevance (ELV) Q1 Earnings Beat on Rate Hikes, Guidance Raised", "summary": "Elevance Health (ELV) has a leftover capacity of around $3.6 billion under its share buyback authorization."}, {"date": "20240418095847", "headline": "Elevance Health Clocks $2.2B Q1 Net Profit Despite 21% Drop In Medicaid Enrollment, Lifts Annual Guidance", "summary": "Elevance Health Inc. (NYSE:ELV) reported first-quarter revenues of $42.3 billion, up 0.9% year over year, marginally missing the consensus of $42.6 billion. Higher premium yields drove this increase to reflect medical cost trends and growth in Carelon, including a full quarter of revenue from BioPlus, partially offset by attrition in Medicaid membership. “First quarter results reflect disciplined execution of our strategic initiatives during a dynamic time for our industry,” CEO Gail Boudreaux s"}, {"date": "20240418101511", "headline": "Elevance Health (ELV) Q1 2024 Earnings Call Transcript", "summary": "ELV earnings call for the period ending March 31, 2024."}, {"date": "20240418142703", "headline": "13 Best Low Volatility Stocks to Buy According to Hedge Funds", "summary": "In this article, we discuss the 13 best low volatility stocks to buy according to hedge funds. To skip the detailed analysis of the current market conditions, go directly to the 5 Best Low Volatility Stocks to Buy According to Hedge Funds. The S&P 500 had a remarkable year in 2023 and the first quarter […]"}, {"date": "20240418211200", "headline": "Analysts Have Conflicting Sentiments on These Healthcare Companies: Elevance Health (ELV) and Adaptimmune Therapeutics (ADAP)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418214926", "headline": "Q1 2024 Elevance Health Inc Earnings Call", "summary": "Q1 2024 Elevance Health Inc Earnings Call"}, {"date": "20240418221900", "headline": "Elevance Health price target raised by $37 at Barclays, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418225100", "headline": "Analysts’ Top Healthcare Picks: Elevance Health (ELV), Argenx Se (ARGX)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418230130", "headline": "Decoding Elevance Health Inc (ELV): A Strategic SWOT Insight", "summary": "Uncovering the Financial Dynamics and Strategic Directions"}, {"date": "20240419000400", "headline": "Elevance Health price target raised by $20 at UBS, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419001300", "headline": "Analysts Offer Insights on Healthcare Companies: Elevance Health (ELV), Sarepta Therapeutics (SRPT) and Intuitive Surgical (ISRG)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419002100", "headline": "Analysts Offer Insights on Healthcare Companies: Intuitive Surgical (ISRG) and Elevance Health (ELV)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419010221", "headline": "Elevance Health Inc (ELV) Q1 2024 Earnings Call Transcript Highlights: Robust Growth and ...", "summary": "Discover how Elevance Health Inc achieved significant earnings growth and strategic advancements in the first quarter of 2024."}, {"date": "20240419012100", "headline": "Elevance Health price target raised by $43 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419015300", "headline": "Elevance Health price target raised by $1 at RBC Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419020600", "headline": "Elevance Health Analysts Boost Their Forecasts After Upbeat Earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419023400", "headline": "Elevance Health price target raised by $20 at Truist, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419052133", "headline": "Elevance Health First Quarter 2024 Earnings: EPS Misses Expectations", "summary": "Elevance Health ( NYSE:ELV ) First Quarter 2024 Results Key Financial Results Revenue: US$42.6b (up 1.0% from 1Q 2023..."}, {"date": "20240419073231", "headline": "Elevance Health Inc. (NYSE:ELV) Q1 2024 Earnings Call Transcript", "summary": "Elevance Health Inc. (NYSE:ELV) Q1 2024 Earnings Call Transcript April 18, 2024 Elevance Health Inc. misses on earnings expectations. Reported EPS is $ EPS, expectations were $10.54. ELV isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Ladies and gentlemen, thank […]"}, {"date": "20240420060300", "headline": "THQ: Collecting A High Yield From Increased Medical Spending", "summary": "abrdn Healthcare Opportunities Fund (THQ) offers a high dividend yield and exposure to diverse healthcare subsectors, outperforming peers. Explore more here."}, {"date": "20240420232000", "headline": "Tracking Last Week's Top Performers: Are These 7 Large-Cap Stocks In Your Portfolio?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421194700", "headline": "Elevance Health: Strong Q1 Performance and Strategic Initiatives Underpin Buy Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421210600", "headline": "Elevance Health Outperforms with Strong MLR and EPS Growth Potential: A Buy Rating Justified", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422020000", "headline": "Dividend Income Summary: Lanny's March 2024 Summary", "summary": "Retirement accounts brought in a total dividend income amount of $2,367.19 or 40% of the dividend income total. Read what investors need to know."}, {"date": "20240422040300", "headline": "Elevance Health Inc (ELV)'s Winning Formula: Financial Metrics and Competitive Strengths", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422042251", "headline": "Elevance Health (NYSE:ELV) Will Pay A Dividend Of $1.63", "summary": "The board of Elevance Health, Inc. ( NYSE:ELV ) has announced that it will pay a dividend of $1.63 per share on the..."}, {"date": "20240422050000", "headline": "Insurer Earnings Make Hospital Investors Sweat", "summary": "What is good for hospitals and healthcare providers can be bad for health insurers.  When hospitals are full of patients, insurers aren’t likely to do well.  Investors had been betting that medical utilization would continue to stay elevated in the first quarter, supported by reports of strong hospital volumes early on this year and the fact that prior authorizations were waived as a result of the cyberattack on Change Healthcare, a major clearinghouse for medical claims."}, {"date": "20240422061600", "headline": "Elevance Health: A Strong Buy on Sustained Margin Growth and Operational Excellence", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422105054", "headline": "Elevance Health: Overlooked Risks Have Appeared (Rating Downgrade)", "summary": "Elevance Health's Q1 earnings echoed various risk factors worth considering.Â Check out the reasons why we downgrade our outlook on ELV stock to hold."}, {"date": "20240423061455", "headline": "Elevance Health: It's Not Too Late To Buy Their Dividend Growth", "summary": "Elevance Health's financial positioning is solid, which is supported by the interest coverage ratio. Click here to read an analysis of ELV stock now."}, {"date": "20240423074012", "headline": "Why Elevance Health (ELV) is a Top Value Stock for the Long-Term", "summary": "Whether you're a value, growth, or momentum investor, finding strong stocks becomes easier with the Zacks Style Scores, a top feature of the Zacks Premium research service."}, {"date": "20240423093100", "headline": "Top Research Reports for Meta Platforms, Elevance Health & Canadian Natural Resources", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Meta Platforms, Inc. (META), Elevance Health, Inc. (ELV) and Canadian Natural Resources Limited (CNQ)."}, {"date": "20240423234000", "headline": "Elevance Health price target raised by $10 at Mizuho, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424010800", "headline": "Decoding 13 Analyst Evaluations For Elevance Health", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424045000", "headline": "3 Healthcare Stocks to Buy Now: Q2 Edition", "summary": "Over the years, the healthcare industry in the United States has morphed into a complex web of insurance companies, hospital corporations and medical providers. Since the 2020 Coronavirus pandemic, U.S. healthcare spending and government subsidization have ballooned to nearly double pre-pandemic levels. Despite this involvement of taxpayer dollars, approximately 100 million Americans are burdened by some level of medical debt. This has resulted in a difficult medical system for consumers, but an"}, {"date": "20240424064500", "headline": "The Zacks Analyst Blog Highlights Meta Platforms, Elevance Health, Canadian Natural Resources, The Coca-Cola and The Progressive", "summary": "Meta Platforms, Elevance Health, Canadian Natural Resources, The Coca-Cola and The Progressive are part of the Zacks top Analyst Blog"}, {"date": "20240424074510", "headline": "Why Elevance Health (ELV) is a Top Growth Stock for the Long-Term", "summary": "The Zacks Style Scores offers investors a way to easily find top-rated stocks based on their investing style. Here's why you should take advantage."}, {"date": "20240425020000", "headline": "Polaris Global Equity Composite Q1 2024 Commentary", "summary": "Global equity markets enjoyed consecutive months of gains, with the MSCI World Index returning 9.01% for the quarter."}, {"date": "20240425020500", "headline": "Looking Into Elevance Health's Recent Short Interest", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425074011", "headline": "Is Adlai Nortye Ltd. Sponsored ADR (ANL) Stock Outpacing Its Medical Peers This Year?", "summary": "Here is how Adlai Nortye Ltd. Sponsored ADR (ANL) and Elevance Health (ELV) have performed compared to their sector so far this year."}, {"date": "20240425090700", "headline": "3 Medical Services Industry Stocks to Buy as Nursing Market Booms", "summary": "The Zacks Medical - Services industry is growing on nursing care market growth and digital healthcare adoption. ELV, MEDP and DOCS are set to gain the most. However, staffing shortages continue to put brakes on growth."}, {"date": "20240425094011", "headline": "ELV or AVTR: Which Is the Better Value Stock Right Now?", "summary": "ELV vs. AVTR: Which Stock Is the Better Value Option?"}, {"date": "20240425100008", "headline": "All You Need to Know About Elevance Health (ELV) Rating Upgrade to Buy", "summary": "Elevance Health (ELV) has been upgraded to a Zacks Rank #2 (Buy), reflecting growing optimism about the company's earnings prospects. This might drive the stock higher in the near term."}, {"date": "20240425104700", "headline": "Universal Health (UHS) Q1 Earnings Beat on Rising Patient Days", "summary": "Universal Health's (UHS) first-quarter results benefit from improved patient days in both segments. However, higher expenses partially offset the positives."}, {"date": "20240425122700", "headline": "Molina Healthcare (MOH) Q1 Earnings Beat on Growing Membership", "summary": "Molina Healthcare's (MOH) Q1 results reflect strong premium revenue growth. It continues to estimate adjusted EPS at a minimum of $23.50 for 2024."}, {"date": "20240425124400", "headline": "Community Health (CYH) Q1 Earnings Top on Better Occupancy Rates", "summary": "Community Health's (CYH) first-quarter results benefit from improved occupancy and reimbursement rates. However, declining admissions partially offset the positives."}, {"date": "20240425193100", "headline": "Here's How Much You Would Have Made Owning Elevance Health Stock In The Last 5 Years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426011500", "headline": "Top 4 Health Care Stocks That May Plunge This Month", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426061800", "headline": "Zacks Industry Outlook Highlights Elevance Health Medpace and Doximity", "summary": "Elevance Health, Medpace and Doximity are part of the Zacks Industry Outlook article."}, {"date": "20240426062600", "headline": "Elevance Health Inc EVP & President, Gov Health Felicia Norwood Sells 20,310 Shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426075010", "headline": "Here's Why Elevance Health (ELV) is a Strong Momentum Stock", "summary": "Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores."}, {"date": "20240426114400", "headline": "HCA Healthcare's (HCA) Q1 Earnings Beat on Rising Admissions", "summary": "HCA Healthcare's (HCA) quarterly results gain from broad volume-based growth along with a rising number of surgeries. Rising expenses act as a partial offset."}, {"date": "20240427050156", "headline": "Investing in Elevance Health (NYSE:ELV) five years ago would have delivered you a 118% gain", "summary": "The most you can lose on any stock (assuming you don't use leverage) is 100% of your money. But on the bright side, you..."}, {"date": "20240429054200", "headline": "Top 50 stocks with the highest sensitivity to interest rates changes - GS", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501002100", "headline": "CVS Health drops as medical cost trends prompt guidance cut", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501044500", "headline": "How To YieldBoost Elevance Health From 1.2% To 5.8% Using Options", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501063002", "headline": "If You Invested $1000 in Elevance Health a Decade Ago, This is How Much It'd Be Worth Now", "summary": "Investing in certain stocks can pay off in the long run, especially if you hold on for a decade or more."}, {"date": "20240501073009", "headline": "Is Elevance Health (ELV) a Buy as Wall Street Analysts Look Optimistic?", "summary": "Based on the average brokerage recommendation (ABR), Elevance Health (ELV) should be added to one's portfolio. Wall Street analysts' overly optimistic recommendations cast doubt on the effectiveness of this highly sought-after metric. So, is the stock worth buying?"}, {"date": "20240502070022", "headline": "The Return Trends At Elevance Health (NYSE:ELV) Look Promising", "summary": "There are a few key trends to look for if we want to identify the next multi-bagger. In a perfect world, we'd like to..."}, {"date": "20240504010200", "headline": "U.S. expands federal health coverage for DACA immigrants", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}]}