{"news": [{"date": "20240405050300", "headline": "GE Aerospace declares 28c per share quarterly dividend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405060000", "headline": "An engine on a Southwest Airlines jet caught fire before taking off from Texas. FAA is investigating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405063752", "headline": "GE Aerospace Declares First Dividend After Breakup", "summary": "By Will Feuer GE Aerospace declared its first quarterly dividend after spinning off its power businesses, which now operate under GE Vernova, a separate company. GE Aerospace said it will..."}, {"date": "20240405093447", "headline": "Why GE Aerospace Stock Is Up Today", "summary": "Freed from its baggage, this aerospace stock is positioned to soar."}, {"date": "20240405111740", "headline": "Why Shares in This Aerospace Supplier Soared in March", "summary": "An upbeat assessment from a leading industry player encouraged investors to be bullish on this supplier's prospects."}, {"date": "20240405142627", "headline": "GE Vernova has 'multi-year pathway' to profitability: Analyst", "summary": "General Electric (GE) has successfully split its business into three independent companies, with GE Vernova (GEV) representing the energy-focused division. RBC Capital Markets Analyst Chris Dendrinos joins Yahoo Finance Live to discuss his bullish initiation of coverage on GE Vernova, rating the stock as Outperform with a $160 price target. Dendrinos explains that with \"multi-national conglomerate[s],\" funds are often invested in certain parts of the business while others remain underinvested. With General Electric's company splitting into standalone businesses, he believes all investments for GE Vernova will be directed into the energy business, boosting transformation efforts. When asked about competition concerns, Dendrinos says that GE Vernova is a \"leader\" in all of its segments. However, he notes that on the wind front, Siemens Energy (ENR.DE) could be a competitor, and in the power segment, Mitsubishi (6503.T) could pose a challenge. Dendrinos highlights that GE Vernova has a \"multi-year pathway\" to financial improvement, emphasizing that it will be a long-term effort to reach normalization. Nevertheless, he believes the company will eventually achieve the desired free cash flow, which should boost the stock's valuation. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. Editor's note: This article was written by Angel Smith"}, {"date": "20240405190000", "headline": "Stock Market This Week - Saturday, April 6", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240406010750", "headline": "Wall Street Breakfast: What Moved Markets", "summary": "The article discusses the worst weekly performance of the S&P 500, Walt Disney's re-elected board of directors, General Electric's breakup completion, the..."}, {"date": "20240406080800", "headline": "Can a New CEO Save Boeing?", "summary": "Despite all the doom and gloom, the stock still has a value case, and the company's strategy makes sense."}, {"date": "20240406184244", "headline": "Wall Street Analysts Just Trimmed Price Targets for These 10 Stocks", "summary": "In this article, we will discuss the 10 stocks whose price targets were recently trimmed by analysts. If you want to see more such stocks on the list, go directly to Wall Street Analysts Just Trimmed Price Targets for These 5 Stocks. Amidst fading expectations of interest rate cuts, the stock market exhibited mixed trends, with […]"}, {"date": "20240407210300", "headline": "GE Aerospace boosts dividend by 250% to $0.28", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407213400", "headline": "General Electric Announces Leadership Changes in Aerospace Division", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407230100", "headline": "Analysts Conflicted on These Industrial Goods Names: Paychex (PAYX) and General Electric (GE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407235700", "headline": "GE Aerospace price target lowered by $10 at BofA, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408010737", "headline": "GE Aerospace Board of Directors Authorizes Regular Quarterly Dividend", "summary": "Ohio - The Board of Directors of GE Aerospace today declared a $0.28 per share dividend on the outstanding common stock of the Company.The dividend is payable April 25, 2024, to shareholders of..."}, {"date": "20240408012600", "headline": "General Electric (GE) Gets a Buy from Jefferies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408031900", "headline": "How Is The Market Feeling About GE Aero?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408041800", "headline": "US Job Growth Beats Expectations And What That Means For You -  Market Review", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408045100", "headline": "GE Vernova Stock (NYSE:GEV): GE Spins Off an Electrifying Energy Business", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408053417", "headline": "GE Aerospace: BofA adjusts post-merger target", "summary": "Bank of America announced on Monday that it had lowered its price target on GE Aerospace shares from $175 to $165, to take account of the GE Vernova spin-off.In a research note, the broker says it..."}, {"date": "20240408122655", "headline": "GE Aerospace Stock Has 22% Upside, According to 1 Wall Street Analyst", "summary": "A (sort of) new stock gets a new look from a market professional."}, {"date": "20240408141912", "headline": "Tesla, Two Huge Spinoffs Among Big S&P 500 Stock Movers Monday", "summary": "Lithium giant Albemarle and Tesla stock were among top S&P 500 performers Monday. Two big recent spinoffs were notable movers as well."}, {"date": "20240408151700", "headline": "Time to Buy GE Aerospace (GE) or General Mills (GIS) Stock for More Upside?", "summary": "Let's see if it's time to invest in these iconic companies for more upside with GE Aerospace's (GE) stock soaring +23% this year and General Mills' (GIS) shares up a respectable +8%."}, {"date": "20240408211600", "headline": "Buy Rating on GE Supported by Strong Aerospace Division and Growth Potential in Engine Market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408221600", "headline": "GE Aerospace assumed with a Buy at Goldman Sachs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408223700", "headline": "TD Cowen gets more bullish on GE Aerospace, upgrades shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409002800", "headline": "TD upgrades GE Aerospace to Buy on visibility amid Boeing problems", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409010400", "headline": "GE Aerospace rated Buy at Goldman Sachs after energy spinoff", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409014400", "headline": "Robinhood To Rally Around 51%? Here Are 10 Top Analyst Forecasts For Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409020300", "headline": "4 stocks to watch on Tuesday: GE, TSM and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409024800", "headline": "GE Aerospace upgraded, AmEx downgraded: Wall Street's top analyst calls", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409025000", "headline": "GE vs. GEHC: Which General Electric Stock Is Better?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409031600", "headline": "Video: S&P 500 Movers: GE, MRNA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409073335", "headline": "IPO Stock Check Up: How Are Recent Launches Trump Media, Reddit And Others Faring?", "summary": "It's been a busy couple of weeks for IPO stocks, with Reddit and Astera Labs launching, and a number of IPO-like new issues, including Trump Media & Technology Group and GE Vernova all beginning to trade since late March.  Astera stock and Reddit stock both surged as much as 70% on their first trading days while Trump Media jumped more than 16% on March 26, its first day trading under the DJT ticker.  Meanwhile, GEV traded up more than 16% between March 28 and April 2 after its spinoff from General Electric."}, {"date": "20240409074900", "headline": "Wall Street Lunch: Small Biz Optimism Vs. AI Enthusiasm", "summary": "Small business owners feel the pain while stock market bulls feel confident about inflation and rate cuts. Google unveils its latest in-house processors."}, {"date": "20240409124400", "headline": "Top Stock Reports for AbbVie, Salesforce & General Electric", "summary": "Today's Research Daily features new research reports on 16 major stocks, including AbbVie Inc. (ABBV), Salesforce, Inc. (CRM) and General Electric Company (GE)."}, {"date": "20240409130638", "headline": "Housing Crisis Havens: 3 Stocks to Shelter Your Wealth", "summary": "The U.S. housing market looks to be on shaky ground. Lofty mortgage rates have set a high bar for first-time buyers to enter the housing market, with many consumers finding it difficult to qualify for a mortgage as rates are currently near 7%. At the same time, a lack of housing supply across America has pushed home prices to near-record levels. The National Association of Realtors (NAR) reports that the median price of a home in the U.S. of $384,500 seen in February of this year is not far from"}, {"date": "20240409193600", "headline": "Smart Money Is Betting Big In GE Aero Options", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410012236", "headline": "TD Cowen Upgrades General Electric (GE)", "summary": ""}, {"date": "20240410022200", "headline": "GE Aerospace price target lowered by $15 at Jefferies, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410053500", "headline": "Vulcan Value Partners Q1 2024 Letter", "summary": "All strategy composites of Vulcan Value Partners produced positive returns; several were ahead of their benchmarks. Click here to read the full letter."}, {"date": "20240410070300", "headline": "The Zacks Analyst Blog Highlights AbbVie, Salesforce, General Electric, The TJX Companies and UBS Group", "summary": "AbbVie, Salesforce, General Electric, The TJX Companies and UBS Group are part of the Zacks top Analyst Blog."}, {"date": "20240410080000", "headline": "Biggest Gains in Employee Engagement in the Management Top 250", "summary": "The Management Top 250 ranking, compiled by researchers at the Drucker Institute, part of Claremont Graduate University, compares companies using the late management guru  Peter Drucker’s  principles to identify the most effectively managed businesses.  The five main components of the ranking are customer satisfaction, employee engagement and development, innovation, social responsibility and financial strength.  ON’s score for employee engagement and development rose 20.5 points from a year earlier to 45.3, S&P Global’s score for the component climbed 16.8 points to 64.2, and KBR’s employee score jumped 13.9 points to 62.2."}, {"date": "20240410084505", "headline": "1 Wall Street Analyst Just Gave GE Vernova Stock its First Buy Rating Upgrade. Is It Time to Buy Now?", "summary": "If the next investment supercycle is for a transition to cleaner energy, GE Vernova is very well positioned."}, {"date": "20240410112100", "headline": "Hexcel Surprises Investors With a New CEO. The Stock Is Tumbling.", "summary": "Hexcel  stock dived Wednesday after the structural materials maker said CEO Nick Stanage will be replaced by  Spirit AeroSystems  ’ former chief executive.  Hexcel  said Stanage, who has helmed the company since 2013, will become executive board chairman to help with the transition before he retires at the end of the year.  Gentile had been CEO of  Spirit AeroSystems  an aerospace parts supplier, since 2016 until he stepped down as CEO and resigned from the board in October 2023."}, {"date": "20240410141452", "headline": "GE Aerospace's Slattery to step down in June, remain adviser", "summary": "The chief commercial officer of GEAerospace, John Slattery, will step down from the jetengine maker in June and will remain an adviser, CEO Larry Culpsaid on Wednesday. The Irish-born..."}, {"date": "20240410142917", "headline": "$100K Starter Kit: 3 Stocks to Become a Millionaire by 2034", "summary": "Investing legend Peter Lynch coined the term “10-bagger.” That is a stock that grows to 10 times the value of its initial investment. He knows a thing or two about hitting home runs with stocks. During his time as Fidelity Magellan’s money manager, he took the fund from $20 million in assets under management (AUM) in 1977 to $14 billion AUM in 1990 when he retired for a 29% compounded annual growth rate. In other words, if you put $10,000 into the fund and never added another dollar, you would h"}, {"date": "20240411010300", "headline": "GE Aerospace Finalizes Spin-Off of GE Vernova Inc.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411041000", "headline": "Is GE Aerospace Stock Going to $190? 1 Wall Street Analyst Thinks So.", "summary": "Wall Street continues to warm to the trimmed-down company, and for good reason."}, {"date": "20240411101759", "headline": "All-Time High Flyers: 7 Stocks to Buy as the Market Peaks", "summary": "If you’re wondering which stocks to buy in April, here’s a good place to start. The stock market is off to a difficult start in the second quarter. With the timing of interest rates getting pushed out further, the major averages have turned downwards. Since peaking on March 28, the benchmark S&P 500 index has declined nearly 2%. The dip has some on Wall Street wondering aloud if we’re at or close to the market’s peak and now entering what could be a steep selloff. Many analysts say a pullback is"}, {"date": "20240411111728", "headline": "GE Aerospace: The Pure Turbofan Powerhouse To Propel Your Aerospace Portfolio", "summary": "GE Aerospace is a pure aerospace and defense stock with a strong market share in commercial airplane engines. Find out why GE stock is a Buy."}, {"date": "20240411203600", "headline": "$1000 Invested In GE Aero 5 Years Ago Would Be Worth This Much Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412034800", "headline": "Stocks with the highest swings in option premium price over 3 months - JPM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412111500", "headline": "GE Aerospace Is Shining Bright. 2 Other Stocks That Could Brighten.", "summary": "GE finished its three-way breakup on April 2 when GE Aerospace—a pure-play aerospace company—and  GE Vernova  —GE’s power generation businesses—became independent companies.  GE HealthCare Technologies  was spun in early 2023.  Adjusted for the spin, GE Aero shares are up roughly 15%—not a bad early return."}, {"date": "20240413080232", "headline": "11 Best Nanotechnology Stocks To Invest In", "summary": "In this piece, we will take a look at the 11 best nanotechnology stocks to invest in. If you want to skip our introduction to the nanotechnology sector and how it covers a variety of applications ranging from healthcare to consumer technology, then you can skip ahead to read 5 Best Nanotechnology Stocks To Invest […]"}, {"date": "20240413220300", "headline": "Boeing weighs on large-cap industrials in turbulent week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414020500", "headline": "General Electric is said to sell its famed Crotonville campus", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414234300", "headline": "GE's Historic Crotonville Academy Reportedly Sold: End Of An Era?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415011137", "headline": "PRESS DIGEST- Wall Street Journal - April 15", "summary": "The following are the top stories in the Wall Street Journal.  - General Electric sold Crotonville, a training ground for its managers, for $22 million to an entity made up of real-estate investors and family offices.  - Samsung Electronics has overtaken Apple as the top smartphone provider in the first quarter, while Chinese companies took a bigger slice of the global market."}, {"date": "20240415060900", "headline": "What's Going On With GE Vernova Shares Today?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415061100", "headline": "GE sells Crotonville management academy, WSJ reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415092800", "headline": "GE Vernova Stock Is Getting No Help From Buy Rating. Here’s Why.", "summary": "Mizuho analyst Maheep Mandloi launched coverage of the stock with a target of $154 for the price. Shares closed Friday at $134."}, {"date": "20240416003300", "headline": "Defense spending and defense stocks: Why they don't always reflect each other", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416011200", "headline": "Boeing price target lowered by $10 at RBC Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416043113", "headline": "Province to refurbish electricity generating plants in Niagara Region for $1 billion", "summary": "NIAGARA FALLS, Ont. — Ontario is spending $1 billion to refurbish hydro power stations in Niagara Falls, Ont.Energy Minister Todd Smith says the refurbishment will extend the life of the generating..."}, {"date": "20240416063900", "headline": "10 Industrials Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416080051", "headline": "JetBlue Airways (JBLU) Expected to Beat Earnings Estimates: What to Know Ahead of Q1 Release", "summary": "JetBlue (JBLU) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240416160131", "headline": "GE Aerospace Takes Center Stage in T. Rowe Price Equity Income Fund's Q1 Portfolio Adjustments", "summary": "Insight into the Fund's Latest Investment Moves and Stock Market Strategies"}, {"date": "20240416211100", "headline": "Analysts Have Conflicting Sentiments on These Industrial Goods Companies: Airbus Group SE (OtherEADSF), Otis Worldwide (OTIS) and GE Aerospace (GE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416223200", "headline": "TipRanks’ ‘Perfect 10’ List: Analysts See Opportunity in These 2 Top-Scoring Stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417052700", "headline": "New constituents of Goldman Sachs’ ROE growth basket", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417102527", "headline": "General Electric (GE) Price Target Decreased by 5.65% to 169.83", "summary": ""}, {"date": "20240417110100", "headline": "A New Buy Rating Pushes Up GE Vernova Stock, Finally", "summary": "Investors appear to be warming up to the idea that shares of the newly independent company are a Buy."}, {"date": "20240417114614", "headline": "FIDU: Industrials Dashboard For April", "summary": "Industrials are the second most overpriced sector behind technology, but some subsectors are moderately overvalued. Read more on FIDU ETF here."}, {"date": "20240418025446", "headline": "GE signs contract for 6 vessels in Singapore", "summary": "GE Vernova's power conversion business has been awarded a contract by Singapore shipbuilder ST Engineering Marine.The contract covers the supply of its power system with integrated electric propulsion..."}, {"date": "20240418032800", "headline": "Want to Double Your Tax Refund in 2024? 7 Stocks to Buy Now.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418073809", "headline": "Corrective to April 16 story on hydro power stations being refurbished in Ontario", "summary": "In an April 16 story on the refurbishment of hydro power stations in Niagara Falls, Ont., The Canadian Press incorrectly reported Ontario would be spending $ 1 billion on the project. In fact, Ontario..."}, {"date": "20240418085500", "headline": "GE Stock Rose When the Stock Market Fell. Here’s Why.", "summary": "Coming into Thursday trading, GE Aerospace stock is the best performer in the entire index for April. Analysts have been lifting price targets on the shares."}, {"date": "20240419004100", "headline": "Intelligent Ultrasound launches GE AI software on ultrasound machines", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419005800", "headline": "GE Aerospace price target raised by $5 at RBC Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419044600", "headline": "Defense and infrastructure improves Industrials - SSGA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419065252", "headline": "Boeing Faces Cash Flow Crash", "summary": "Boeing's March deliveries decreased 35 units vs. the same month last year due to weakness in 737 MAX and 777F deliveries. Learn more about BA stock here."}, {"date": "20240419114237", "headline": "UPDATE 1-New York fails to reach contracts with 3 major offshore wind farms", "summary": "A New York state agency on Friday said it had failed to reach final contract agreements with the developers of three major offshore wind projects, blaming a decision by General Electric Vernova to scrap plans for a new turbine.  The projects affected include Attentive Energy One, being developed by TotalEnergies, Rise Light & Power and Corio Generation, Community Offshore Wind, backed by RWE and National Grid Ventures, the New York State Energy Research and Development Authority said in a statement.  Excelsior Wind, being developed by Vineyard Offshore, is also affected, it said."}, {"date": "20240419154511", "headline": "Tesla, Boeing, Big Tech earnings, PCE data: What to watch", "summary": "As the week draws to a close at Yahoo Finance, anchors Julie Hyman and Madison Mills preview the key events to watch in the upcoming week. Earnings results will be in focus. Tuesday sees a number of big names reporting, such as Tesla (TSLA), PepsiCo (PEP), and General Electric (GE). On Wednesday, Boeing (BA) will unveil its first quarter earnings, an eagerly anticipated report as the company continues to navigate significant headwinds and operational challenges.  There are also earnings from Big Tech companies Meta (META), Alphabet (GOOGL, GOOG), and Microsoft (MSFT). Friday energy giants Chevron (CVX) and ExxonMobil (XOM) are scheduled to release their earnings reports, providing insights into the health and dynamics of the oil market. Last, the Personal Consumption Expenditures Price Index, the Federal Reserve's preferred inflation gauge, will be released on Friday. It's a crucial metric for the central bank's future monetary policy decisions. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Angel Smith"}, {"date": "20240420224900", "headline": "Can Magnificent 7 Help Script Market Turnaround? Earnings Pick Up Pace With Microsoft, Meta, Alphabet And Tesla Expected This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421010500", "headline": "Earnings week ahead: Tesla, Meta Platforms, Google, Microsoft, Intel, Exxon Mobil, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421165515", "headline": "Nvidia Down 10%, Time To Buy Tech", "summary": "The stock market has been experiencing unusual volatility in the past few weeks. Click here to read why high-flying stocks experienced significant sell-offs."}, {"date": "20240422000200", "headline": "Options Volatility and Implied Earnings Moves This Week, April 22 – April 26, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422054200", "headline": "GE Aerospace Q1 preview: Favorably placed on robust aircraft demand", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422062700", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422064600", "headline": "7 High-Flying Stocks That Are Majorly Overdue for a Pullback", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422064606", "headline": "Ain't No Stopping Us Now: CFM's RISE Program Gaining Momentum", "summary": "We are at a stage of the program in which we're doing real testing on real hardware and making real progress. Mohamed Ali, vice president and general manager of engineering for GE Aerospace, was..."}, {"date": "20240422084510", "headline": "GE Aerospace To Benefit From Boeing Woes, Analyst Says; First Stand-Alone Earnings Due", "summary": "GE Aerospace reports Q1 results Tuesday after its April 2 split into a pure play. Analysts will watch commercial aftermarket sales."}, {"date": "20240422101600", "headline": "NEW YORK MARKET CLOSE: Stocks rebound as key week of earnings looms", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422130244", "headline": "Is GE Aerospace Going to $165? 1 Wall Street Analyst Thinks So", "summary": "Investors' concerns over the impact of Boeing's delivery delays may be overdone."}, {"date": "20240422183500", "headline": "GLOBAL BRIEFING: Japan's business activity growth speeds up in April", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422191500", "headline": "GE Aerospace Soars with Strong Demand and Upbeat FY24 Outlook Post-Spinoff", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422210800", "headline": "Stock market today: Tokyo's Nikkei leads Asian gains following Wall Street rally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422210800", "headline": "Stock market today: Wall Street rallies and adds to its hot start to the week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422212600", "headline": "What You Missed On Wall Street On Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422232600", "headline": "Nasdaq, S&P, Dow futures show little change as investors await more earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422232600", "headline": "GE Aerospace Non-GAAP EPS of $0.82 beats by $0.12, revenue of $16.1B beats by $400M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422234500", "headline": "GE Aerospace in charts: Q1 revenue maintains double-digit Y/Y growth; orders jump to $11B", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000200", "headline": "Earnings Scheduled For April 23, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000200", "headline": "Wall Street Set To Open Higher As Tesla To Kick Off 'Magnificent 7' Earnings: Why This Analyst Thinks Market Weakness Is A 'Healthy Pullback'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000600", "headline": "Options Volatility and Implied Earnings Moves Today, April 23, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000800", "headline": "Layoffs 2024: 3 Stocks That Ought to Copy Tesla’s Job Cuts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000800", "headline": "GE Aerospace reports Q1 adjusted EPS 82c, consensus 65c", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423001100", "headline": "GE Aerospace sees FY24 adjusted EPS $3.80-$4.05, consensus $3.94", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423002307", "headline": "GE Aerospace : 1Q 2024 Earnings Presentation", "summary": "GE Aerospace first quarter 2024 performance Financial results & company highlights April 23, 2024 ..."}, {"date": "20240423002308", "headline": "GE Aerospace : 1Q 2024 Earnings Release", "summary": "GE AEROSPACE ANNOUNCES FIRST QUARTER 2024 RESULTS GE delivers strong consolidated results; GE Aerospace raises full-year guidance ..."}, {"date": "20240423002400", "headline": "Wall Street Set To Open Higher As Tesla Kicks Off 'Magnificent 7' Earnings: Why This Analyst Thinks Market Weakness Is A 'Healthy Pullback'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423002600", "headline": "GE’s stock gains, as combined results of GE Aerospace and GE Vernova rose above forecasts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423003800", "headline": "GE Aerospace’s shares rise on improved earnings guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423004700", "headline": "GE Aerospace says experiencing 'tremendous demand cycle' for services", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423005400", "headline": "GE Aerospace raises FY24 operating profit view to $6.2B-$6.6B from $6B-$6.5B", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423005500", "headline": "GE lifts profit guidance for remaining aerospace arm after spin-offs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423012035", "headline": "GE Aerospace : Announces First Quarter 2024 Results", "summary": "BOSTON - April 23, 2024 - GE Aerospace announced results today for the first quarter ending March 31, 2024. The consolidated results below include the operations of GE Vernova Inc. ,..."}, {"date": "20240423012500", "headline": "GE Aerospace says 'never more confident' in path ahead", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423015600", "headline": "Buy Rating Affirmed for GE Aerospace Amid Strong Q1 Results and Promising Market Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423020500", "headline": "Fly Intel: Pre-market Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423020700", "headline": "GE Aerospace’s stock surges toward a 16-year high after earnings beat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423021800", "headline": "GE Aerospace Announces SEC Filing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423021900", "headline": "GE Announces First-Quarter 2024 Financial Results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423021917", "headline": "GE Aerospace: annual targets revised upwards", "summary": "GE Aerospace announced on Tuesday that it had raised its annual targets after reporting a marked improvement in its financial performance over the first three months of the year.In its first..."}, {"date": "20240423023400", "headline": "Nasdaq, S&P, Dow advance as investors await more earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423024100", "headline": "Unusually active option classes on open April 23rd", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423024100", "headline": "Analysts’ Opinions Are Mixed on These Industrial Goods Stocks: Transurban Group Ltd. (OtherTRAUF), GE Aerospace (GE) and Kirby (KEX)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423032900", "headline": "GE Earnings: GE Aerospace Reports Better-Than-Expected Q1 Results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423035400", "headline": "GE Stock Earnings: GE Aero Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423042500", "headline": "GE Aerospace hits record high on improved earnings guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423042747", "headline": "GE Aerospace lifts 2024 profit forecast on strong demand for engine parts, services", "summary": "The company now expects 2024 operating profit of $6.2 billion to $6.6 billion, compared with its earlier forecast of $6 billion to $6.5 billion.  Analysts say planemaker Boeing's production challenges are also expected to be a near-term benefit for GE Aerospace as it increases demand for older engines and allows the company to supply more of its LEAP engines in the aftermarket."}, {"date": "20240423045800", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423052017", "headline": "Stock Market Today: Stocks higher amid earnings parade; GM, GE, UPS report", "summary": "Stocks are looking at their first back-to-back gains for the month Tuesday with a host of blue-chip earnings reporting first-quarter earnings."}, {"date": "20240423052900", "headline": "GE Aerospace’s stock leaps toward a 16-year high after earnings beat forecasts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423053055", "headline": "General Electric Company 2024 Q1 - Results - Earnings Call Presentation", "summary": "The following slide deck was published by General Electric Company in conjunction with their 2024 Q1 earnings call."}, {"date": "20240423054420", "headline": "GE Aerospace leaps after boosting profit forecast following historic split", "summary": "General Electric posted its final earnings as a combined company Tuesday, with the now stand-alone GE Aerospace boosting its full-year-profit forecast."}, {"date": "20240423055010", "headline": "GE Aerospace Surges On Earnings, Outlook After Spinoff", "summary": "GE stock rallied 5% early Tuesday as GE Aerospace topped quarterly results and raised its operating profit outlook."}, {"date": "20240423055139", "headline": "GE Aerospace Surpasses Q1 Revenue Estimates and Raises Full-Year Guidance", "summary": "Strong Performance in Commercial Engines & Services and Defense & Propulsion Technologies Drive Growth"}, {"date": "20240423060010", "headline": "GE Aerospace (GE) Q1 2024 Earnings Call Transcript", "summary": "GE Aerospace (NYSE:NYSE:GE) Q1 2024 Earnings Conference Call April 23, 2024 7:30 AM ETCompany ParticipantsSteve Winoker â\u0080\u0093 Vice President-Investor..."}, {"date": "20240423060010", "headline": "GE Electric Company (GE) Q1 2024 Earnings Call Transcript", "summary": "GE Electric Company (NYSE:NYSE:GE) Q1 2024 Earnings Conference Call April 23, 2024 7:30 AM ETCompany ParticipantsSteve Winoker â\u0080\u0093 Vice President-Investor..."}, {"date": "20240423063800", "headline": "Stocks Rally On Weaker PMI Data, Tech Earnings Optimism, Dollar Falls: What's Driving Markets Tuesday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423092833", "headline": "Boeing's problems are good for GE Aerospace: Analyst explains", "summary": "GE Aerospace (GE) has reported its first quarterly results since becoming an independent company after its spin-off from General Electric. The aerospace developer raised its 2024 profit forecast, buoyed by strong sales for jet engine parts and services. GE Aerospace shares are boosted in Tuesday's trading session after topping first-quarter earnings and revenue estimates. Argus Research President John Eade joins the Morning Brief to provide insights into GE Aerospace's performance. Eade describes the current period as \"a good time right now for GE Aerospace\" citing multiple tailwinds in the aviation industry — namely Boeing's (BA) production backlog and assembly concerns — coupled with the company's outstanding quarterly report, painting \"a great story\" for its future. Eade highlights that the separation into an independent entity allowed investors to \"capture value\" that was previously missing under GE's original broad business model. Shifting his focus to Lockheed Martin (LMT), Eade mentions that the aerospace manufacturer and defense contractor lacks \"commercial exposure\" and cannot grow as rapidly as GE Aerospace \"despite the good news out of Washington\" surrounding potential foreign aid packages to Israel and Ukraine. Eade ultimately recommends Lockheed Martin to investors looking for value. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Angel Smith"}, {"date": "20240423093024", "headline": "Why GE Aerospace Stock Is Taking Off Today", "summary": "The stand-alone aerospace business looks poised to outperform."}, {"date": "20240423094947", "headline": "GE Aerospace Stock Lifts Off After Earnings Top Expectations", "summary": "GE Aerospace shares jumped after the maker of jet engines’ first quarterly report since separating from General Electric’s power business topped expectations.  The company’s report includes the results of GE Vernova, the unit that finished separating from GE Aerospace on April 2.  GE Aerospace’s first-quarter report, by the numbers:  + **Revenue** rose 11% to $16.1 billion, ahead of analysts' projections for $15.25 billion, according to FactSet."}, {"date": "20240423101513", "headline": "General Electric (GE) Q1 2024 Earnings Call Transcript", "summary": "GE earnings call for the period ending March 31, 2024."}, {"date": "20240423101900", "headline": "GE Aerospace (GE) Q1 Earnings Surpass Estimates, Up Y/Y", "summary": "GE Aerospace (GE) first-quarter 2024 results reflect 11% increase in revenues, driven by solid performance from its Aerospace segment."}, {"date": "20240423102200", "headline": "How major US stock indexes fared Tuesday, 4/23/2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423113211", "headline": "Industrials Advance After GE Aerospace Earnings -- Industrials Roundup", "summary": "Shares of industrial and transportation companies rose after a strong report from one aerospace firm. GE Aerospace rallied after the maker of jet engines posted first-quarter earnings ahead of..."}, {"date": "20240423124959", "headline": "Installed offshore wind capacity in U.S. sees nearly six-fold jump in first-quarter, report says", "summary": "Installed offshore wind capacity in the U.S. grew to 242 megawatt (MW) in the first quarter of the year from 42 MW in the previous quarter, the Oceantic Network said in its report, showcasing a recovery in a previously volatile industry.  The offshore wind industry is expected to play a major role in helping several states and, the Biden administration meet goals to decarbonize the power grid and combat climate change.  Last year, companies highlighted that offshore wind projects may not move forward unless the requirements for subsidies under the Inflation Reduction Act (IRA) are eased."}, {"date": "20240423131211", "headline": "The Top 3 Retirement Stocks to Buy in April 2024", "summary": "Investing in retirement is a little different. While people may focus on growth and gains when they are accumulating wealth and trying to enlarge their nest egg, once retired, the focus tends to switch to preserving existing capital and adding new money through regular dividend payments. For these reasons, investors in retirement should seek out stable blue-chip stocks that offer a combination of safety, share price appreciation and hefty dividend payouts. Fortunately, there are plenty of these"}, {"date": "20240423132852", "headline": "GE Aerospace: Shares Have Flown Too High (Rating Downgrade)", "summary": "GE Aerospace, a division of General Electric, specializes in aircraft engines and services. General Electric just reported Q1 earnings, click for my update."}, {"date": "20240423143000", "headline": "The Top Manufacturing Stocks to Buy in April 2024", "summary": "Manufacturing companies are vital for investors to keep within their portfolios and for the economy to subsist and expand. Industrials should be a major portion of any investment portfolio due to the fact that it’s typically a robust industry that can provide substantial growth and profound resiliency. Here are some options for investors who are interested in investing in the manufacturing industry. These are a wide range of industrials with various market caps and businesses that have all exper"}, {"date": "20240423145528", "headline": "GE Aerospace stock flies high on Q1 beat, 2024 outlook", "summary": "GE Aerospace (GE) shares are trading higher in Tuesday's afternoon session after the company surpassed analyst estimates on both revenue and earnings in its first quarterly report since becoming a standalone entity following General Electric's split into three separate companies. The company's better-than-expected performance, coupled with an upward revision of its 2024 profit guidance, has boosted investor confidence in the stock. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Angel Smith"}, {"date": "20240423162429", "headline": "Tech Giants Roar as Tesla Spikes in Late Hours: Markets Wrap", "summary": "(Bloomberg) -- A rally in tech heavyweights lifted the broader stock market, with the group’s high-stakes earnings seen by Wall Street investors as a major test of the bull run in equities.Most Read from BloombergTaylor Swift Is Proof That How We Critique Music Is BrokenTech Giants Roar as Tesla Spikes in Late Hours: Markets WrapTesla Stock in ‘No Man’s Land’ After 43% Rout Ahead of EarningsBiden’s New Chopper Is Demoted After Scorching White House LawnRay Dalio’s Famous Trade Is Sputtering, Inv"}, {"date": "20240423200123", "headline": "Q1 2024 General Electric Co Earnings Call", "summary": "Q1 2024 General Electric Co Earnings Call"}, {"date": "20240423223600", "headline": "GE Aerospace: Poised for Leadership in Aerospace Revival", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423230402", "headline": "Decoding GE Aerospace (GE): A Strategic SWOT Insight", "summary": "Comprehensive Analysis Post-GE Vernova Spin-off"}, {"date": "20240423235000", "headline": "Analysts Offer Insights on Industrial Goods Companies: CAE (CAE), Canadian National Railway (CNI) and GE Aerospace (GE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423235900", "headline": "GE Aerospace price target raised by $15 at BofA, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424010054", "headline": "GE Aerospace (GE) (Q1 2024) Earnings Call Transcript Highlights: Soaring Profits and Strategic ...", "summary": "GE Aerospace reports a robust first quarter with significant growth in revenue, profits, and strategic initiatives including a massive share buyback program."}, {"date": "20240424011617", "headline": "Heard on the Street Tuesday Recap: They're Playing Our Song", "summary": "Paid subscriber growth in 2022 was identical to the previous year.  Revenue jumped 20% on the year, and the company projected 20% growth again for the second quarter, beating Wall Street’s estimates.  Shares of General Motors jumped 4.4% on its own strong set of quarterly numbers."}, {"date": "20240424014000", "headline": "Artisan Global Opportunities Fund Q1 2024 Commentary", "summary": "Artisan Global Opportunities Fund portfolio outperformed the MSCI AC World Index in Q1 2024 due to broad-based positive security selection. Click here to read more."}, {"date": "20240424020800", "headline": "GE Aerospace price target raised by $5 at Deutsche Bank, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424022500", "headline": "GE Aerospace price target raised by $10 at RBC Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424023400", "headline": "GE Aerospace price target raised by $10 at Argus, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424024608", "headline": "GE Aerospace : 1st Quarter 2024 Earnings Webcast - Transcript", "summary": "REFINITIV STREETEVENTS EDITED TRANSCRIPT Q1 2024 General Electric Co Earnings Call EVENT..."}, {"date": "20240424033000", "headline": "Artisan Global Equity Fund Q1 2024 Commentary", "summary": "Artisan Global Equity Fund's portfolio solidly outperformed the MSCI AC World Index. Click here to read the full fund letter."}, {"date": "20240424040000", "headline": "Artisan International Fund Q1 2024 Commentary", "summary": "Artisan International Fund's portfolio meaningfully beat the benchmark MSCI EAFE Index and the MSCI All Country World ex USA Index. Click here to read more."}, {"date": "20240424090801", "headline": "General Electric Company (NYSE:GE) Q1 2024 Earnings Call Transcript", "summary": "General Electric Company (NYSE:GE) Q1 2024 Earnings Call Transcript April 23, 2024 General Electric Company misses on earnings expectations. Reported EPS is $ EPS, expectations were $0.67. General Electric Company isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good day, […]"}, {"date": "20240424214000", "headline": "GE Aerospace stock outperforms competitors on strong trading day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424214000", "headline": "Artisan Focus Fund Q1 2024 Commentary", "summary": "The Artisan Focus Fund gained 15.86% in Q1, exceeding the S&P 500Â® Index by 5.30%. Our performance in Q1 can be directly tied to strong fundamental research execution."}, {"date": "20240424233600", "headline": "GE Aerospace price target raised by $65.57 at Citi, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425052923", "headline": "GE Vernova reports wider-than-expected Q1 loss in first post-spinoff results", "summary": "General Electric's energy spin-off company, GE Vernova, reported wider-than-expected first-quarter loss on Thursday, as weakness in its wind segment offset demand for natural-gas related equipment and services.  GE Vernova, which became an independent company this month following a three-way split of General Electric, provides services and equipment to the energy sector, operating through three main businesses - power, wind, and electrification.  In contrast, the power segment saw higher orders for gas turbines and more demand for gas power services due to outages, leading to a 6% jump in sales."}, {"date": "20240425055119", "headline": "GE Aerospace Q1: A Standalone Company With Strong Order Growth", "summary": "GE Aerospace Q1 organic revenue grew 10%, organic order grew 14% and raised FY24 operating profit guidance. Read my earnings analysis of GE stock here."}, {"date": "20240425062811", "headline": "GE Aerospace : Inspection Solutions Team ‘Making Waves’ with Enhanced Safety and Quality", "summary": "An expertly trained diagnostician carefully moves the ultrasound probe, looking to figure out what's inside. But this specialist is not in a doctor's office conducting a medical exam. She's leaning..."}, {"date": "20240425063800", "headline": "10 Industrials Stocks Whale Activity In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425100715", "headline": "UPDATE 1-GE Vernova reports wider-than-expected Q1 loss in first post-spinoff results", "summary": "General Electric's energy spin-off company, GE Vernova, reported a wider-than-expected first-quarter loss on Thursday, as weakness in its wind segment offset demand for natural-gas related equipment and services.  GE Vernova, which became an independent company this month following a three-way split of General Electric, provides services and equipment to the energy sector, operating through three main businesses - power, wind, and electrification.  In contrast, the power segment saw higher orders for gas turbines and more demand for gas power services due to outages, leading to a 6% jump in sales."}, {"date": "20240425170300", "headline": "Analysts reboot stock price target for GE Aerospace after earnings", "summary": "This is what could happen next to GE Aerospace shares."}, {"date": "20240425190300", "headline": "30 out of 34 industrial stocks post EPS wins, while half of them beat revenue estimates - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426035000", "headline": "Check Out What Whales Are Doing With GE Aero", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426093457", "headline": "Stock Market Rebounds; Tesla, Microsoft, Google, Meta, Chipotle, GE In Focus: Weekly Review", "summary": "The stock market rebounded this week fueled by big-cap earnings winners Microsoft, Tesla, Google, GE and Chipotle. Meta was a notable loser."}, {"date": "20240426124000", "headline": "GE Aerospace Stock Has 14% Upside, According to 1 Wall Street Analyst", "summary": "The aerospace company's broad-based exposure to the commercial aerospace markets means it can benefit from various end-market conditions."}, {"date": "20240427060000", "headline": "The Top 3 Transportation Stocks to Buy in April 2024", "summary": "The transportation sector literally helps to drive the U.S. economy forward. According to the U.S. Department of Transportation, the transportation and warehouse sector made up of planes, trains and automobiles contributed $1.7 trillion to the economy in 2022 (latest statistics available). That equates to 6.7% of the nation’s gross domestic product (GDP). Employment in transportation and warehousing stood at 6.7 million workers in 2022, up more than 8% from the previous year. Whether it is autow"}, {"date": "20240427064200", "headline": "RTX: Surging OE Offsets Continuing Aftermarket Normalization", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427212500", "headline": "GE Aerospace price target raised by $27 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428033900", "headline": "Is It Too Late to Buy GE Aerospace Stock?", "summary": "The slowdown in deliveries at Boeing is good news from a near-term profit perspective at its engine supplier. It will also lead to more aftermarket revenue from its legacy engines."}, {"date": "20240428053100", "headline": "Analysts Offer Insights on Industrial Goods Companies: Saia (SAIA) and GE Aerospace (GE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429004200", "headline": "GE Aerospace price target raised by $5 at Jefferies, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429010100", "headline": "Jefferies Gives a Buy Rating to GE Aerospace (GE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429030600", "headline": "Behind the Scenes of GE Aero's Latest Options Trends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429040400", "headline": "Is GE Aerospace (GE) Set to Underperform? Analyzing the Factors Limiting Growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429071910", "headline": "GE Aerospace : Germaine Hunter and Savannah Frazier Have a Vision for Making GE Aerospace Stronger Through the Principles of DEI", "summary": "On May 6, when GE Aerospace employees converge in Atlanta for the company's inaugural four-day Employee Resource Group Summit, two key leaders in the company's diversity, equity, and inclusion space..."}, {"date": "20240429092900", "headline": "How GE Created $200 Billion in Market Value by Breaking Into Pieces", "summary": "Wall Street has hiked the average price target for GE Aerospace stock in the latest stage of upbeat news for longtime investors."}, {"date": "20240429123300", "headline": "GE Vernova Doing Fine As It Toddles Away From Former Parent GE", "summary": "A Relative Strength Rating upgrade for GE Vernova shows improving technical performance. Will it continue?"}, {"date": "20240429195600", "headline": "Stock market today: Asian stocks follow Wall St tumble. Most markets in the region close for holiday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429195600", "headline": "Stock market today: An ugly April for Wall Street is closing with some more losses", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430002500", "headline": "GE HealthCare: Q1 Earnings Snapshot", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430011500", "headline": "GE HealthCare slips on Q1 miss", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430021200", "headline": "GE Healthcare maintains guidance after mixed first-quarter results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430034815", "headline": "GE Aerospace : Additive rebrands as Colibrium Additive", "summary": "Cincinnati, OH and Lichtenfels, Germany - April 25, 2024. Today, GE Additive is relaunching as Colibrium Additive - a GE Aerospace company. Part of GE Aerospace's Propulsion &..."}, {"date": "20240430121800", "headline": "GE Aerospace Is the S&P 500’s Top-Performing Stock in April. Globe Life Is the Worst.", "summary": "April has been a tough month for stock investors.  The index is on track to fall more than 3% in April; the drop has been largely driven by hotter-than-expected inflation data that have eroded investors’ hopes that the Federal Reserve would cut interest rates as soon as this summer.  GE Aerospace  was the best-performing stock in the S&P 500 in April after the aircraft company had an exciting couple of weeks."}, {"date": "20240430122400", "headline": "Why GE HealthCare Technologies Stock Just Crashed 14%", "summary": "On balance, this stock seems no great bargain."}, {"date": "20240430203100", "headline": "Stock market today: Asian markets follow Wall Street swings after Fed keeps interest rates high", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430203100", "headline": "Stock market today: Wall Street drifts as it waits to hear from the Federal Reserve on rates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501015629", "headline": "GE Aerospace: Strong Q1 And Upside Momentum", "summary": "GE Aerospace beats estimates and raises forecast for operating profitability in 2024. Find out why GE stock is a Buy."}, {"date": "20240501102601", "headline": "GE Aerospace Stock Has 17% Upside, According to 1 Wall Street Analyst", "summary": "GE Aerospace shares are soaring, but turbulence may lie ahead."}, {"date": "20240501102925", "headline": "General Electric (GE) Price Target Increased by 10.468% to 187.61", "summary": ""}, {"date": "20240502042100", "headline": "Is GE Aerospace Stock Going to $185? 1 Wall Street Analyst Thinks So.", "summary": "Can giant industrial stock GE Aerospace continue growing fast enough, long enough to justify its high share price?"}, {"date": "20240502044209", "headline": "GE Aerospace : Launches GE Aerospace Foundation", "summary": "Builds on company's purpose 'to lift people up' by committing $20M to expand Next Engineers, $2M to workforce development, and $2M to disaster relief May 2, 2024, Cincinnati, OH -..."}, {"date": "20240502223200", "headline": "If You Invested $100 In This Stock 5 Years Ago, You Would Have $300 Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}]}