{"news": [{"date": "20240403124351", "headline": "REFILE-Canadian lender RBC's CEO says City National will be a 'net contributor'", "summary": "Royal Bank of Canada expects its struggling unit in the U.S. to be \"a net contributor\" to Canada's biggest lender and is bullish about the opportunities south of the border, CEO Dave McKay told Reuters on Wednesday.  City National Bank, which RBC acquired in 2015 under McKay's watch, required capital injection and saw shake-up of its top executives last year as the regional banking crisis in the United States roiled smaller financial institutions.  \"This is, for us, a good pause to reset the foundation for the next leg of growth and we're very positive that City National will be a net contributor to the bank going forward,\" McKay said in an interview after wrapping up the purchase of HSBC Canada over the weekend."}, {"date": "20240403124752", "headline": "Canadian lender RBC's CEO says City National will be a 'net contributor'", "summary": "Royal Bank of Canada expects its struggling unit in the U.S. to be \"a net contributor\" to Canada's biggest lender and is bullish about the opportunities south of the border, CEO Dave McKay told Reuters on Wednesday.  City National Bank, which RBC acquired in 2015 under McKay's watch, required capital injection and saw shake-up of its top executives last year as the regional banking crisis in the United States roiled smaller financial institutions.  \"This is, for us, a good pause to reset the foundation for the next leg of growth and we're very positive that City National will be a net contributor to the bank going forward,\" McKay said in an interview after wrapping up the purchase of HSBC Canada over the weekend."}, {"date": "20240403195800", "headline": "HSBC Continues Share Buy-Back Program", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404035800", "headline": "HSBC Explores Selling Few German Business Units Amid Asia Focus", "summary": "HSBC considers selling its wealth-management, custody and fund administration units in Germany in an effort to focus more on Asia operations."}, {"date": "20240404192800", "headline": "HSBC Progresses with Share Buy-Back Plan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405015900", "headline": "HSBC Director Nominated for Role at Kering SA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405040041", "headline": "Why the loss of HSBC leaves Canada's mortgage market less transparent", "summary": "Robert McLister: Borrowers better shop around for the best rate possible because Canada's big banks won't hand it to you"}, {"date": "20240405043900", "headline": "Viking Holdings files for IPO", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405045600", "headline": "Cruise line operator Viking Holdings files for IPO", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405110915", "headline": "TD And Royal Bank: Buy The Mortgage Renewal Panic", "summary": "Canada's biggest banks, TD and Royal Bank face risks associated with Canadian mortgages up for renewal at higher interest rates. Learn why I consider TD stock a buy."}, {"date": "20240407041800", "headline": "Hong Kong's Financial Markets to Receive Boost Amid Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407192800", "headline": "HSBC Progresses With Multimillion-Dollar Buy-Back", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407193000", "headline": "HSBC Helps Funds Navigate India’s Bond Market as Inclusion Nears", "summary": "(Bloomberg) -- HSBC Holdings Plc is engaging with over 200 overseas funds to help establish their presence in India ahead of the nation’s entry into global debt indexes.Most Read from BloombergTrumpism Is Emptying ChurchesRBC Fires CFO Ahn After Probe Into Personal RelationshipThe Odds of $100 Oil Are Rising as Supply Shocks Convulse the MarketSaudis Scale Back Ambition for $1.5 Trillion Desert Project NeomTurkey Joins NATO Allies in Suspending Europe Arms TreatyThe bank is among custodians help"}, {"date": "20240407204300", "headline": "LONDON BRIEFING: Astra hails neurology data; CVS flags cyberattack", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408000413", "headline": "HSBC targets wealthy expats, bullish Asian firms to drive Europe unit, exec says", "summary": "HSBC's European chief is betting on rising regional wealth and overseas expansion by Asian corporate clients to boost his unit's contribution to group profit after a multi-year reboot turned the business from laggard to profit engine.  The turnaround in Europe, some details of which are reported here for the first time, has helped HSBC overcome investor scepticism about its \"network strategy\" after a 2022 campaign by number one shareholder Ping An Insurance Group of China raised questions over whether HSBC's fast-growing Asian business was being held back by its outsized presence in slower-growth Western markets.  At the core of the strategy is the notion that big corporate clients in Asia, many of which already borrow from HSBC, will use a wider range of its services in Europe as they expand into the region, as well as tapping it for advice on local deals and fundraising."}, {"date": "20240408000858", "headline": "UPDATE 1-Hong Kong looking at more steps to boost stock market, says Lee", "summary": "Hong Kong's leader John Lee said on Monday the authorities were considering additional measures to bolster the securities market in the Asian financial hub, which has taken a hit from China's economic slowdown and geopolitical tensions.  The city's economy expanded by just 3.2% last year, and capital flight turned the Hong Kong stock market into the worst-performing major index last year.  India has now overtaken Hong Kong in terms of the value of listed shares."}, {"date": "20240408012251", "headline": "HSBC’s Quinn Targets Lifting Wealth Business in China, India", "summary": "(Bloomberg) -- HSBC Holdings Plc’s top boss said he’s pushing to improve his firm’s wealth management capabilities in China and India to be on par with its key market of Hong Kong. Most Read from BloombergTrumpism Is Emptying ChurchesRBC Fires CFO Ahn After Probe Into Personal RelationshipThe Odds of $100 Oil Are Rising as Supply Shocks Convulse the MarketSaudis Scale Back Ambition for $1.5 Trillion Desert Project NeomIsrael Backs Out of Khan Younis to Prepare ‘Future Operations’“We have a reall"}, {"date": "20240408033000", "headline": "Global Investment Summit: HSBC fills Credit Suisse's Hong Kong void by hosting 2,800-person conference", "summary": "HSBC, the biggest commercial bank in Hong Kong, is hosting the largest investment conference in the city by bringing together thousands of global investors and companies to discuss top issues challenging the industry and the world. The HSBC Global Investment Summit, to be held April 8 to 10, will create a platform for participants to better understand the opportunities and issues in financial markets, Surendra Rosha, co-CEO for Asia-Pacific, said in an interview. The Hong Kong Sevens, a rugby co"}, {"date": "20240408130826", "headline": "UPDATE 1-West Virginia treasurer adds four finance firms to ESG blacklist", "summary": "West Virginia added four financial firms on Monday to a list of institutions that may be barred from some state business because the state's treasurer deems they are boycotting the fossil fuel industry.  It was the latest move in a bubbling dispute between Republican officials and Wall Street firms over use of environmental, social and governance (ESG) factors in banking and business.  West Virginia, a major energy-producing state, created the list in 2002, placing five firms on it at the time."}, {"date": "20240408195800", "headline": "The top 10 names with relative cheap earnings volume for the season - Barclays", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408203900", "headline": "LONDON BRIEFING: HSBC sells Argentinian arm for USD550 million", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408204800", "headline": "HSBC to sell Argentina business for $550M, expects $1B pre-tax loss", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408214400", "headline": "LONDON MARKET OPEN: Stocks shaky ahead of US CPI data, ECB decision", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408215200", "headline": "TOP NEWS: HSBC to take USD1 billion loss on sale of Argentina business", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408222258", "headline": "HSBC to sell Argentina business to Galicia in $550 million deal", "summary": "The Asia-focussed bank said its unit, HSBC Latin America B.V., has signed a deal to sell the operations in Argentina to Galicia.  \"HSBC Argentina is largely a domestically focused business, with limited connectivity to the rest of our international network,\" the company said in a statement."}, {"date": "20240408223900", "headline": "HSBC to Sell Argentina Business for $550.0 Million", "summary": "HSBC Holdings has agreed to sell its Argentina business to the country’s largest private financial group as it looks to spend resources on higher-value opportunities."}, {"date": "20240408230400", "headline": "M&A News: HSBC to Record $1B Loss from Disposal of Argentina Operations", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408230400", "headline": "HSBC agrees to sell its Argentina business to Grupo Financiero Galicia for $550M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409014400", "headline": "Adios Argentina: HSBC Divests Banking Operations In Argentina For $550M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409015711", "headline": "HSBC to sell Argentina business in $550 million deal", "summary": "HSBC has agreed to sell its business in Argentina to Grupo Financiero Galicia, the largest private financial group in the country, for $550 million, the UK-based bank said on Tuesday."}, {"date": "20240409020300", "headline": "Asia pivot: HSBC moves ahead with expansion of wealth business in China", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409021702", "headline": "Trending tickers: BP, TSMC, HSBC and Auddia", "summary": "The latest investor updates on stocks that are trending on Tuesday."}, {"date": "20240409021704", "headline": "HSBC exits Argentina nursing $1 billion in losses", "summary": "Argentina exit followers earlier Mexican cocaine scandal"}, {"date": "20240409022800", "headline": "HSBC Divests Argentine Unit to Grupo Financiero Galicia", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409024119", "headline": "HSBC pulls out of Argentina as ‘anarcho-capitalist’ president battles hyperinflation", "summary": "HSBC is offloading its business in Argentina at a $1bn (£790m) loss amid a battle to calm hyperinflation by Javier Milei, the country’s new “anarcho-capitalist” president."}, {"date": "20240409030447", "headline": "Stocks to Watch Tuesday: Tesla, BP, Newmont", "summary": "? **Tesla (TSLA)**: The electric-vehicle company reached a settlement with the family of a driver who died in a 2018 crash involving its Autopilot system, days before attorneys were poised to deliver opening statements."}, {"date": "20240409031927", "headline": "HSBC Still Committed to U.S. After Taking $1 Billion Hit to Exit Argentina", "summary": "HSBC stressed its commitment to the U.S., after striking the latest of several deals that will substantially reduce its presence in the Americas.  Europe's largest bank by market value agreed to sell its business in Argentina for $550 million to Grupo Financiero Galicia, one of the Latin American country's biggest lenders.  + HSBC expects to incur a roughly $1 billion hit to quarterly pretax profit."}, {"date": "20240409041422", "headline": "HSBC to accelerate China wealth expansion, on track to meet hiring target", "summary": "HSBC plans to accelerate the expansion of its wealth business in China despite economic headwinds and is on track to nearly double its headcount by next year, its global wealth head said, as the lender pushes ahead with its Asia pivot strategy.  The bank, which makes the bulk of its revenues in Asia, also plans to expand its mainstay wealth business in India, where it re-launched private banking services last year, said wealth and personal banking CEO Nuno Matos.  \"We certainly are in an acceleration mode because we are seeing the confirmation of our expectations when we started our wealth journey in China onshore,\" Matos told Reuters on the sidelines of the HSBC Global Investment Summit in Hong Kong on Tuesday."}, {"date": "20240409045944", "headline": "Citi, TD, HSBC, Northern Trust added to West Virginia restricted list", "summary": "The state warned the banks in February of consequences if they \"boycott\" fossil fuels. BMO and Fifth Third avoided being added to the list, the state said."}, {"date": "20240409065700", "headline": "HSBC Advances Share Buy-Back, Cancels Millions", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409072100", "headline": "HSBC to Divest Argentina Business Under Asia Pivot Strategy", "summary": "HSBC to divest its Argentina business in order to sharpen its focus on Asia. The deal, valued at $550 million, is expected to be completed within the next 12 months."}, {"date": "20240409085500", "headline": "UBS Group (UBS) to Swap Stake in CS Securities in China", "summary": "UBS Group (UBS) is seeking to swap its holding in Credit Suisse Securities in order to gain the complete ownership of its joint venture UBS Securities in China."}, {"date": "20240409112158", "headline": "Thames Water collapse fears spread to rivals", "summary": "Troubles at Thames Water are starting to take their toll on rivals as investors turn their attention to debt burdens at other utility companies."}, {"date": "20240409154559", "headline": "Argentina's Banco Galicia bets on lower inflation, rates after HSBC deal", "summary": "Argentina's Banco Galicia, buying HSBC's local assets in a near $500 million deal, is betting that new libertarian President Javier Milei will bring down soaring inflation and ease rates to boost lending in the South American nation.  The local financial group's chief executive Fabian Kon told Reuters after the HSBC deal was confirmed that Milei's pro-market approach and tough fiscal policies should benefit the banking sector and help bring down inflation running over 275%.  \"As Argentina converges to lower inflation rates and lower interest rates you will see an explosive increase in credit,\" he said in a phone interview."}, {"date": "20240409181905", "headline": "PRESS DIGEST-Financial Times - April 10", "summary": "HSBC  has agreed to sell its business in Argentina to domestic lender Grupo Financiero Galicia for $550mn as it exits a market where its business has been affected by hyperinflation and a volatile currency.  - Rupert Murdoch's UK newspaper empire has incurred fresh costs of more than 51 million pounds ($64.64 million) related to claims made in the phone hacking scandal against The Sun and now-defunct News of the World."}, {"date": "20240410004700", "headline": "GLOBAL BROKER RATINGS: UBS cuts Hugo Boss, Exane BNP raises Shell", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410033000", "headline": "HSBC to host next investment summit in early 2025 after resounding success of 'Hong Kong is back' pitch", "summary": "HSBC plans to host another global investment summit within the first four months of 2025 in the city, after this year's sell-out inaugural conference drew 3,500 attendees, an overwhelming success that CEO Noel Quinn said was proof that \"Hong Kong is back\". The bank hosted more than 5,000 meetings over three days for attendees and customers from over 40 countries, Quinn said during a post-conference interview on Wednesday. The attendance, right after the Cathay/HSBC Hong Kong Sevens rugby tournam"}, {"date": "20240410040547", "headline": "Thai Central Bank Holds Rate, Deepening Rift With Government", "summary": "(Bloomberg) -- Thailand’s central bank left interest rates unchanged Wednesday, underlining the limits of monetary policy to support economic growth especially when fiscal settings are loose.Most Read from BloombergUS Slams Strikes on Russia Oil Refineries as Risk to Oil MarketsUS Core CPI Tops Forecasts Again, Likely Delaying Fed Rate CutsChinese Cement Maker Halted After 99% Crash in 15 MinutesBond Trader Places Record Futures Bet on Eve of Inflation DataApple’s India iPhone Output Hits $14 Bi"}, {"date": "20240410101109", "headline": "HSBC Joins Firms Exiting Argentina Amid Milei Economic Makeover", "summary": "(Bloomberg) -- Argentine President Javier Milei is trying to draw foreign investment to help stabilize a faltering economy. Some big international companies are abandoning the country instead.Most Read from BloombergUS Slams Strikes on Russia Oil Refineries as Risk to Oil MarketsUS Inflation Refuses to Bend, Fanning Fears It Will StickChinese Cement Maker Halted After 99% Crash in 15 MinutesUS Sees Missile Strike on Israel By Iran, Proxies as ImminentS&P 500 Hit by Fed-Pivot Rethink and War Jitt"}, {"date": "20240410204700", "headline": "HSBC price target raised by 60 GBp at JPMorgan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410213900", "headline": "HSBC Progresses Share Buy-Back and Cancellation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410215400", "headline": "LONDON MARKET OPEN: European markets mixed ahead of ECB decision", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411005800", "headline": "HSBC Announces Employee Share Awards", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411041500", "headline": "Interesting HSBC Put And Call Options For May 31st", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411042600", "headline": "KKR (NYSE:KKR) Aims for $1T in AUM in Five Years, EPS of $15 in Ten", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411042800", "headline": "KKR (NYSE:KKR) Aims for $1 Trillion in AUM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411055300", "headline": "LONDON MARKET CLOSE: Dwindling US Fed cut hope unnerves markets", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411110950", "headline": "HSBC, Barclays Are Making Markets for Thames Water Short Bets", "summary": "(Bloomberg) -- Credit traders at Barclays Plc and HSBC Holdings Plc are among those making a market for clients to bet against the debt of Thames Water amid an escalating crisis at the UK’s largest water utility. Most Read from BloombergUS Sees Imminent Missile Strike on Israel by Iran, ProxiesVietnam Tycoon Lan Sentenced to Death Over $12 Billion FraudUS Slams Strikes on Russia Oil Refineries as Risk to Oil MarketsRussia Destroys Largest Power Plant in Ukraine’s Kyiv RegionChinese Cement Maker"}, {"date": "20240412045800", "headline": "HSBC Announces Redemption of Senior Unsecured Notes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412060600", "headline": "Indian Traders Command Big Bucks as Demand Outweighs Talent Supply", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412062900", "headline": "HSBC Holdings Advances Share Buy-Back Plan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414031800", "headline": "Zomato (ZOMATO) Shares Skyrocket, Analysts Hustle to Update Forecasts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414180709", "headline": "Grupo Financiero Galicia: HSBC Argentina Acquisition Adds New Fuel To The Bull Case", "summary": "Grupo Financiero Galicia is very well-placed to capitalize on a consolidating industry. Read why there might still be a lot more upside ahead for GGAL stock."}, {"date": "20240415015900", "headline": "HSBC Declares Q4 Dividend for Shareholders", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415020600", "headline": "HSBC Executes Major Share Buy-Back", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415195400", "headline": "HSBC Subsidiary Files Liquidation Petition Against Chinese Developer", "summary": "A Hong Kong bank majority-owned by HSBC Holding has filed a liquidation petition against Times China, another instance of creditors seeking to recoup funds from developers amid China’s protracted property slump."}, {"date": "20240415195700", "headline": "HSBC Executes Major Share Buy-Back and Cancellation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415205500", "headline": "LONDON BRIEFING: DS Smith backs International Paper takeover", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415220900", "headline": "Chinese Developer Sinks After HSBC Subsidiary Files Liquidation Petition", "summary": "A subsidiary of HSBC wants to liquidate debt-troubled Times China, in another instance of creditors seeking to recoup funds from developers amid China’s protracted property slump."}, {"date": "20240415233100", "headline": "Ashtead Technology benefits from rising demand across energy sector", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415234500", "headline": "AIM WINNERS & LOSERS: Seed Innovations leaps on special dividend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416155200", "headline": "Why HSBC Stock Got Rocked Today", "summary": "The investment-banking sector across the Pacific Ocean isn't exactly thriving."}, {"date": "20240416192800", "headline": "HSBC Progresses With Share Buy-Back Program", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416223300", "headline": "LONDON BROKER RATINGS: BofA cuts Ashmore; JPMorgan lifts Fresnillo", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416230034", "headline": "Insurers impose 'tax on being poor' through monthly price hike, says Which?", "summary": "Which? asked 39 car insurers and 34 home insurers what annual percentage rates were being applied to monthly payments."}, {"date": "20240416235900", "headline": "Morgan Stanley To Slash Jobs In Asia-Pacific Region: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417011900", "headline": "Morgan Stanley and HSBC Cut Asia-Pacific Jobs Amid Slowing Deals.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417021237", "headline": "WRAPUP 1-Morgan Stanley, HSBC cutting dozens of Asia investment banking jobs as deals slump", "summary": "Morgan Stanley and HSBC are cutting dozens of investment banking jobs in the Asia Pacific this week, sources with knowledge of the matter said, as weaker deal activities and sluggish markets in China and Hong Kong weigh on their business prospects.  Morgan Stanley is cutting at least 50 investment banking jobs in the region starting this week, three sources with knowledge of the matter said, affecting around 13% of the Wall Street bank's Asia investment banking workforce of 400."}, {"date": "20240417030100", "headline": "Morgan Stanley, HSBC said to cut Asia investment-banking jobs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417054223", "headline": "WRAPUP 3-Morgan Stanley, HSBC cutting Asia investment banking jobs on China deals slowdown", "summary": "Morgan Stanley and HSBC are cutting dozens of investment banking jobs in the Asia Pacific region this week, sources said, as they ramp up cost-cutting, with weaker dealmaking and sluggish markets in China and Hong Kong weighing on business prospects.  Morgan Stanley is cutting at least 50 investment banking jobs in the region starting this week, three sources with knowledge of the matter said, affecting around 13% of the Wall Street bank's Asia investment banking workforce of 400."}, {"date": "20240417065900", "headline": "Morgan Stanley, HSBC laying off APAC investment bank staff, Reuters says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417204900", "headline": "LONDON BRIEFING: Embattled Hipgnosis Songs Fund agrees takeover", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417224300", "headline": "LONDON BROKER RATINGS: HSBC likes Haleon, cuts Flutter to 'hold'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418022700", "headline": "HSBC to Discuss Q1 Earnings and Dividends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418035800", "headline": "December 20th Options Now Available For HSBC Holdings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418065800", "headline": "HSBC Holdings Advances Share Buy-Back Program", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418192700", "headline": "HSBC Advances Share Buy-back Program", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418221800", "headline": "Venture Life renews revolving credit facility with Santander and HSBC", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419010000", "headline": "Body Shop collapse triggered by buyer’s failure to refinance loan", "summary": "The Body Shop collapsed after HSBC withdrew a line of credit and the chain’s private equity buyer failed to secure new funding, The Telegraph can reveal."}, {"date": "20240419042800", "headline": "Deutsche Bank said to have culled dozens of private banking roles in Asia", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421053351", "headline": "65 Graham Value Stocks: 54 Fit To Buy For April", "summary": "Discover the top large cap value stocks and dividend winners in the market."}, {"date": "20240421215600", "headline": "Keefe Bruyette gets more bullish on HSBC, upgrades shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421220400", "headline": "LONDON BROKER RATINGS: Jefferies raises B&M to 'hold'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422011600", "headline": "GLOBAL BROKER RATINGS: Jefferies raises B&M, Bernstein raises Prysmian", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422065800", "headline": "HSBC Completes Multi-Market Share Buy-Back", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422091133", "headline": "Mortgage lenders hike interest rates as market jitters set in", "summary": "The moves come as bets ramp up on the timing for Bank of England interest rate cuts, with forecasters predicting a fall of 75bps by the end of 2024."}, {"date": "20240422195800", "headline": "HSBC Concludes Multi-Billion Dollar Buy-Back", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423080000", "headline": "HSBC Accelerates Wealth Management Strategy in U.S. with Opening of Flagship Wealth Center at Hudson Yards", "summary": "NEW YORK, April 23, 2024--HSBC today announced the opening of its flagship wealth center at The Spiral in New York City’s Hudson Yards neighborhood. The new center is a key part of the bank’s wealth management strategy and will include wealth advisors dedicated to supporting high-net worth and ultra-high-net worth clients with a focus on individuals and families with international ties. The new flagship wealth center is part of a network of strategically positioned wealth centers across the U.S."}, {"date": "20240423170100", "headline": "Which? urges banks to address online security ‘loopholes’", "summary": "With many people increasingly banking online or on their phones, it is crucial that security protections are up to scratch, Which? said."}, {"date": "20240423204200", "headline": "LONDON BRIEFING: Lloyds profit takes hit; Jet2 cuts guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423230008", "headline": "Best UK banks for online and mobile security revealed", "summary": "Banking customers could be exposed to scammers as online and mobile security risks highlighted."}, {"date": "20240424080325", "headline": "HSBC says growing Chinese wealth fuels client investments in US", "summary": "HSBC's wealthy clients in China and Hong Kong are still eager to invest in the U.S., according to Michael Roberts, the bank's CEO for the USA and Americas.  China's economic growth remains strong relative to other nations, and its wealthy citizens are focused on overseas investments, Roberts told Reuters in an interview.  “Chinese investors are becoming very sophisticated,\" he said."}, {"date": "20240425063800", "headline": "10 Financials Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425193600", "headline": "HSBC June 7th Options Begin Trading", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425204300", "headline": "LONDON BRIEFING: Anglo American rejects BHP takeover offer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426063000", "headline": "The Zacks Analyst Blog Highlights Oracle, HSBC, RTX, Marsh & McLennan and Chipotle Mexican Grill", "summary": "Oracle, HSBC, RTX, Marsh & McLennan and Chipotle Mexican Grill are part of the Zacks top Analyst Blog."}, {"date": "20240426073139", "headline": "Market Chatter: HSBC Wins Investor Lawsuit Over Film Financing Program", "summary": "Market Chatter: HSBC Wins Investor Lawsuit Over Film Financing Program"}, {"date": "20240426080925", "headline": "Stocks to watch next week: Amazon, Apple, Anglo American and Novo Nordisk", "summary": "Earnings preview of key companies reporting next week and what to look out for."}, {"date": "20240427215900", "headline": "PRESS: Ofwat explores Thames Water break-up and sale - Telegraph", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428064500", "headline": "U.S. CFOs’ top priority is cost-cutting amid economic uncertainty, survey finds", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428205000", "headline": "LONDON BRIEFING: Hipgnosis Songs Fund backs new Blackstone bid", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428224600", "headline": "Supermarket Income REIT buys Carrefour portfolio in France", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429032900", "headline": "UK earnings, trading statements calendar - next 7 days", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429033000", "headline": "UK earnings, trading statements calendar - next 21 days", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429042100", "headline": "Notable earnings before Tuesday's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429045700", "headline": "HSBC Management Invests in Company’s Shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429054000", "headline": "HSBC Holdings Non-GAAP EPS of $0.34, revenue of $20.8B; reaffirms FY24 outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429055100", "headline": "HSBC Holdings Non-GAAP EPS of $0.34, revenue of $20.8B; Group CEO Noel Quinn to retire", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429055800", "headline": "LONDON MARKET CLOSE: FTSE 100 as investors look to Fed rate decision", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429060200", "headline": "HSBC Holdings Adjusts Share Capital", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429091600", "headline": "BNY Mellon (BK) Plans to Divest Canada Unit to Computershare", "summary": "BNY Mellon (BK) signs a deal to divest its Canada business while at the same time focusing on global expansion efforts. The financial terms of the deal remain undisclosed."}, {"date": "20240429193100", "headline": "GET READY: Whitbread, Glencore, and St James's Place at 0700 BST", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429194100", "headline": "HSBC says chief executive to retire after ‘intense’ five years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429195700", "headline": "LONDON MARKET EARLY CALL: FTSE 100 to open flat as Fed decision looms", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429204800", "headline": "TOP NEWS: HSBC first-quarter profit beats forecasts; CEO to step down", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429205300", "headline": "LONDON BRIEFING: Prudential APE sales up; Coca-Cola HBC backs outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429215500", "headline": "LONDON MARKET OPEN: HSBC and Prudential bookend FTSE 100", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429220700", "headline": "HSBC Earnings: Sales and PBT Top Q1 Estimates; CEO to Leave", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429220947", "headline": "HSBC Chief Quinn, architect of sweeping overhaul, announces surprise exit", "summary": "HSBC Chief Executive Noel Quinn said on Tuesday that he plans to step down, marking the surprise departure of a hard-nosed leader who has overseen a raft of asset sales, guided the lender to record profit and lifted its share price.  The bank is aiming to complete the succession process in the second half of this year, with both internal and external candidates to be considered.  Chief Financial Officer Georges Elhedery is likely the leading internal candidate for the job."}, {"date": "20240429224800", "headline": "HSBC announces retirement of CEO Noel Quinn", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429232400", "headline": "HSBC reports Q1 profit before tax $12.7B vs. $12.9B last year", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429232600", "headline": "HSBC continues to target RoTE in mid-teens for 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429232900", "headline": "HSBC board approves special dividend of 21c per share, plans $3B share buy-back", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430002023", "headline": "HSBC beats estimates and announces buyback as CEO retires unexpectedly", "summary": "CEO Noel Quinn announced early retirement after a five-year stint leading the bank."}, {"date": "20240430002805", "headline": "HSBC boss Quinn suddenly quits", "summary": "Search for successor begins, says Europe’s biggest bank"}, {"date": "20240430004400", "headline": "Why T-bill and chill is here to stay, these strategists say", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430005800", "headline": "HSBC Reports Solid Q1 Results, Rewards Shareholders", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430010400", "headline": "LONDON MARKET MIDDAY: FTSE 100 outperforms; carmakers slide in Europe", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430014855", "headline": "HSBC boss reveals surprise departure plans after ‘intense’ five years", "summary": "The bank has begun the process to find his successor and hopes to make an appointment in the second half of the year."}, {"date": "20240430015900", "headline": "HSBC Webcast Unveils Financial Insights", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430020000", "headline": "HSBC Group Chief Executive Noel Quinn Retires", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430022500", "headline": "Why high returns for cash are here to stay, these strategists say", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430022900", "headline": "Bank of America Securities Sticks to Their Buy Rating for HSBC Holdings (HSBC)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430023502", "headline": "HSBC CEO Quinn Unexpectedly Steps Down After Almost 5 Years", "summary": "(Bloomberg) -- HSBC Holdings Plc’s Chief Executive Officer Noel Quinn is stepping down, an unexpected move that comes as Europe’s largest lender tries to navigate the deterioration of ties between China and the US.Most Read from BloombergTesla Soars on Tentative China Approval for Driving SystemHSBC CEO Quinn Unexpectedly Steps Down After Almost 5 YearsStocks Trade for 390 Minutes a Day. Increasingly, Only 10 MatterBinance and CZ’s Fortunes Are Set to Grow, Jail or no JailUS Warns ICC Action on"}, {"date": "20240430023506", "headline": "UPDATE 1-European shares slip in earnings deluge ahead of inflation data", "summary": "European shares edged lower on Tuesday as investors parsed a raft of mixed earnings reports from industry heavyweights like Mercedes-Benz and HSBC, while also keeping an eye out for economic data, including the April euro zone's inflation numbers.  The continent-wide STOXX 600 stocks index slipped 0.2% as of 0817 GMT, set to log its first monthly decline in six, knocked down by record-high interest rates, Middle East tensions and uncertainty about the European Central Bank's monetary policy outlook.  On the day, the automobile sector shed 1.5%, with Mercedes-Benz declining 3.7% after a first-quarter earnings fall, Stellantis dropping 1.8% on a plunge in first-quarter revenue and Volkswagen losing 2.2% after reporting a lower first-quarter operating profit."}, {"date": "20240430031706", "headline": "HSBC stable in Q1 2024 as chief executive steps down", "summary": "However, profit after tax totalled $10,837m in Q1 2024 for HSBC, a drop from the $11,026m in Q1 2023."}, {"date": "20240430031709", "headline": "HSBC Holdings PLC (HSBC) Q1 2024 Earnings Call Transcript", "summary": "HSBC Holdings PLC (NYSE:NYSE:HSBC) Q1 2024 Earnings Conference Call April 30, 2024 2:45 AM ETCompany ParticipantsMark Tucker - ChairmanNoel Quinn - Group..."}, {"date": "20240430035800", "headline": "HSBC Announces Robust Q1 Earnings and Dividends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430041657", "headline": "HSBC chief steps down unexpectedly after 37 years at bank", "summary": "HSBC chief executive Noel Quinn is unexpectedly stepping down after five years, triggering a search for a successor at one of the biggest banks in the world."}, {"date": "20240430045711", "headline": "HSBC CEO Noel Quinn plans to retire", "summary": "HSBC, Europe's largest bank, says that CEO Noel Quinn plans to retire after serving nearly five years in the post.  Quinn has worked at HSBC since 1987.  In 2021, HSBC said that it was closing its U.S. retail banking business in order to refocus its efforts on wealth management."}, {"date": "20240430045900", "headline": "S&P 500 Futures Edge Down as More Earnings Roll In", "summary": "NEWSPLUS  The Federal Reserve’s two-day policy meeting is set to begin. Futures point to stock indexes being largely on hold ahead of the Fed’s interest-rate decision. Before then, a slew of major earnings are coming up, including from Coca-Cola and McDonald’s in the morning."}, {"date": "20240430050100", "headline": "HSBC UK Chief Executive Acquires Shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430050701", "headline": "Stocks to Watch Tuesday: 3M, Eli Lilly, Stellantis, Coca-Cola, Amazon", "summary": "**↗️** **Eli Lilly (LLY)**: The pharmaceutical major raised its full-year guidance by $2 billion. Its shares jumped in premarket trading. ? **McDonald’s (MCD)**: The fast-food chain's quarterly adjusted earnings missed analysts' expectations; its revenue came in just ahead."}, {"date": "20240430053500", "headline": "HSBC’s CEO Steps Down After More Than Four Years", "summary": "Noel Quinn steered the bank through a tumultuous period, and sharpened its focus on Asia."}, {"date": "20240430054005", "headline": "HSBC CEO to step down", "summary": "“After an intense five years, it is now the right time for me to get a better balance between my personal and business life,” Noel Quinn said Tuesday. HSBC will consider internal and external candidates for the role, it said."}, {"date": "20240430055300", "headline": "LONDON MARKET CLOSE: London stocks take hit as Wall Street slips", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430055455", "headline": "FTSE 100 Live 30 April: Index at yet another record and mid-caps hit  20000, shock as HSBC boss retires", "summary": "The FTSE 100 hit a record high for the sixth straight trading day today, as its strong run goes on.  Change at the top of HSBC and the performance of Premier Inn owner Whitbread are among today’s City talking points.  Noel Quinn surprised HSBC investors by announcing plans for his departure after nearly five years as chief executive, having joined the business in 1987."}, {"date": "20240430060200", "headline": "CORRECT: London stocks take hit as Wall Street slips", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430060800", "headline": "HSBC Holdings Group CEO Noel Quinn to retire", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430064500", "headline": "HSBC Holdings declares $1.55/ADS interim dividend and special dividend; share buyback of $3b", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430085210", "headline": "HSBC Stock Hits Multiyear Highs", "summary": "HSBC shares hit multiyear highs after the international lender unveiled strong results and a near-$4 billion special dividend, and said Chief Executive Noel Quinn would step down. + HSBC's Hong Kong-listed stock (HK:5) jumped more than 2% to 67 Hong Kong dollars a share."}, {"date": "20240430093856", "headline": "Analysis-HSBC must prioritise Asian expertise in surprise CEO search", "summary": "Under Chief Executive Noel Quinn, HSBC navigated a global pandemic and a push by rebel investors to break up the 160-year bank.  Top of Chairman Mark Tucker's CEO wishlist for replacing Quinn, who gave notice of his departure on Tuesday, should be someone who can galvanise the bank's 220,000-strong workforce to meet those goals in an uncertain global economy and amid rising tensions between East and West.  \"I'd expect the candidate would be someone with vast experience in Asian and Middle East markets, who is open minded on the bank's strategy and could re-consider the option of re-domicile HSBC's headquarters to Asia,\" said Simon Yuen, Hong Kong-based founder of Surich Asset Management."}, {"date": "20240430100400", "headline": "HSBC Q1 Pre-Tax Earnings Decline as Expenses Increase Y/Y", "summary": "HSBC records a y/y increase in revenues in the first quarter of 2024."}, {"date": "20240430115921", "headline": "Taxpayer to fork out £85bn to cover Bank of England losses", "summary": "Taxpayers will cover £85bn of losses made by the Bank of England on its quantitative easing programme which began during the global financial crisis, according to the latest estimates."}, {"date": "20240430124300", "headline": "HSBC: Q1 Earnings Snapshot", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430152300", "headline": "Why HSBC Stock Topped the Market Today", "summary": "The company did quite well with its initial earnings report of the year."}, {"date": "20240430204100", "headline": "HSBC price target raised by 10 GBp at Barclays", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430204600", "headline": "LONDON BRIEFING: GSK ups outlook; Next first-quarter beats forecast", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430212600", "headline": "HSBC Holdings: Strong Q1 Performance and Undervalued Growth Prospects Justify Buy Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430222600", "headline": "LONDON BROKER RATINGS: UBS double upgrades AJ Bell to 'buy'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430230000", "headline": "China tensions rise to the surface as HSBC seeks its next boss", "summary": "HSBC chief executive Noel Quinn and chairman Mark Tucker were in an unusually jovial mood in the early hours of Tuesday morning."}, {"date": "20240430233200", "headline": "HSBC CEO Quinn's departure may be due to chair Tucker, FT reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501004500", "headline": "Berenberg introduces Buy rating, $52 target on HSBC", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501005800", "headline": "HSBC Stock Earnings: HSBC Holdings Reported Results for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501011200", "headline": "GLOBAL BROKER RATINGS: Bernstein raises Deutsche Lufthansa", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501024800", "headline": "UK shareholder meetings calendar - next 21 days", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501024900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501052000", "headline": "Wanted: Megabank Chief Willing to Work for Half Pay", "summary": "HSBC, one of the world’s largest banks, is looking for a new CEO to run its sprawling operations at a fraction of the pay of a U.S. bank boss."}, {"date": "20240501063026", "headline": "HSBC Holdings plc (NYSE:HSBC) Q1 2024 Earnings Call Transcript", "summary": "HSBC Holdings plc (NYSE:HSBC) Q1 2024 Earnings Call Transcript April 30, 2024 HSBC Holdings plc isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Welcome, ladies and gentlemen, to the analyst and investor webinar on the 2024 first quarter results for […]"}, {"date": "20240501065800", "headline": "HSBC Director Appointed to Prestigious Committee", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501065800", "headline": "HSBC Releases Update on Debt Issuance Program", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501111045", "headline": "HSBC Innovation Banking chair departs in latest boardroom reshuffle", "summary": "The chair of HSBC Innovation Banking has stepped down in the latest sign of a boardroom reshuffle at the firm formerly known as Silicon Valley Bank UK.  Darren Pope, who had been a director of the bank since 2021, formally resigned at the beginning of last week, according to company filings.  The 58-year-old, who also serves as a board member of Virgin Money and previously worked at Lloyds, is to be replaced by Mridul Hegde, is an existing independent non-executive director at HSBC Innovation Banking UK and its parent HSBC UK, where she chairs the risk committee."}, {"date": "20240501111057", "headline": "HSBC investors demand greater focus on Asia under new boss", "summary": "HSBC’s Hong Kong shareholders have demanded the bank appoint an Asian chief executive and focus more on the region after the unexpected retirement of Noel Quinn."}, {"date": "20240501194800", "headline": "HSBC price target raised by 40 GBp at JPMorgan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501214400", "headline": "LONDON MARKET OPEN: FTSE 100 up as Powell keeps lid on hawkishness", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501224800", "headline": "LONDON BROKER RATINGS: Deutsche Bank likes TP ICAP but says sell CMC", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501230059", "headline": "Best UK mortgage deals of the week", "summary": "Find out the latest mortgage rates and deals from HSBC, NatWest, Santander, Barclays and more."}, {"date": "20240502010200", "headline": "LONDON MARKET MIDDAY: FTSE 100 shines but \"mixed feelings\" after Fed", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502013300", "headline": "GLOBAL BROKER RATINGS: Deutsche Bank cuts Starbucks, CFRA ups Logitech", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502024800", "headline": "UK shareholder meetings calendar - next 7 days", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502060053", "headline": "HSBC Holdings Q1: Off To A Good Start In 2024", "summary": "HSBC Holdings' Q1 results and attractive valuation make it promising, with potential for good returns and capital gains. Click here for my HSBC Q1 earnings update."}, {"date": "20240502183200", "headline": "GLOBAL BRIEFING: Apple shares climb as firm announces buyback", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502193000", "headline": "HSBC facing shareholder pressure over green finance ahead of AGM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502205000", "headline": "LONDON BRIEFING: InterContinental Hotels makes first-quarter progress", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503010400", "headline": "HSBC Reports Record Profits and Optimistic Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503023700", "headline": "UK dividends calendar - next 7 days", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503023800", "headline": "UK dividends calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503032400", "headline": "HSBC’s Green Credentials Come Under Fresh Scrutiny", "summary": "Activist shareholders are pressing HSBC to clarify plans to spend up to $1 trillion on sustainable finance in the coming years."}, {"date": "20240503042700", "headline": "HSBC June 14th Options Begin Trading", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503042900", "headline": "HSBC Announces AGM Results and Board Changes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503064502", "headline": "HSBC fields anger from pensioners amid plans to scrap bankers’ bonus cap", "summary": "A vote on the decision was held during the banking giant’s annual general meeting in London."}, {"date": "20240503074700", "headline": "3 Foreign Bank Stocks Worth a Look in a Prospering Industry", "summary": "Despite concerns related to high restructuring costs, Zacks Foreign Bank industry stocks like HSBC, BCS and DB will benefit from higher rates."}, {"date": "20240504015945", "headline": "HSBC Holdings First Quarter 2024 Earnings: Beats Expectations", "summary": "HSBC Holdings ( LON:HSBA ) First Quarter 2024 Results Key Financial Results Revenue: US$20.0b (up 1.5% from 1Q 2023..."}]}