{"news": [{"date": "20240417071700", "headline": "Company News for Apr 17, 2024", "summary": "Companies In The Article Are:LYV,JNJ,AMD,PNC"}, {"date": "20240417080000", "headline": "JNJ Beats Q1 Earnings Estimates, Misses on Sales: ETFs in Focus", "summary": "Johnson & Johnson (JNJ) continued with its long streak of earnings beat but lagged revenue estimates."}, {"date": "20240418004000", "headline": "GLOBAL BROKER RATINGS: UBS raises Givaudan; HSBC cuts Flutter", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418012839", "headline": "Johnson & Johnson: Buy This Bargain Before It's Gone", "summary": "Johnson & Johnson exceeds expectations with strong financial results and impressive sales growth. Read more to see why I am bullish on JNJ stock."}, {"date": "20240418013200", "headline": "Morning Brew: Tech Giants Lead Market Movements Amid Earnings Surprises", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418021400", "headline": "HSBC gets more bullish on Johnson & Johnson, upgrades shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418024400", "headline": "Johnson & Johnson upgraded to Buy at HSBC with shares at three year lows", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418025500", "headline": "Top Stock Reports For Nvidia, Alphabet And Johnson & Johnson", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418032800", "headline": "Want to Double Your Tax Refund in 2024? 7 Stocks to Buy Now.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418033600", "headline": "Unpacking the Latest Options Trading Trends in Johnson & Johnson", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418035307", "headline": "Johnson & Johnson : First Quarter 2024 2024 First-Quarter Earnings Transcript", "summary": "REFINITIV STREETEVENTS EDITED TRANSCRIPT Q1 2024 Johnson & Johnson Earnings Call EVENT..."}, {"date": "20240418051200", "headline": "Recession-Proof Riches: 3 Stocks That Thrive in Any Economy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418061555", "headline": "14 Best Large Cap Dividend Growth Stocks To Buy Now", "summary": "In this article, we discuss 14 best large-cap dividend growth stocks to buy now. You can skip our detailed analysis of large-cap dividend stocks and their historical performance, and go directly to read 5 Best Large Cap Dividend Growth Stocks To Buy Now. Large-cap stocks have remained ideal for investors as they typically form the […]"}, {"date": "20240418065700", "headline": "Hold Rating on Johnson & Johnson Amidst Growth, Competition, and Legal Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418102200", "headline": "Top Stock Reports for NVIDIA, Alphabet & Johnson & Johnson", "summary": "Today's Research Daily features new research reports on 16 major stocks, including NVIDIA Corporation (NVDA), Alphabet Inc. (GOOGL) and Johnson & Johnson (JNJ)."}, {"date": "20240418152323", "headline": "J&J wins trial over Florida woman who claimed its baby powder caused her cancer", "summary": "A Florida jury on Thursday concluded that Johnson & Johnson's baby powder talc product did not cause the ovarian cancer of a Florida woman who died in 2019.  The lawsuit was brought by family members of Patricia Matthey, a Sarasota County resident who used Johnson's baby powder daily from 1965 until August 2016, when she was diagnosed with ovarian cancer, according to her family's lawsuit.  J&J's Worldwide Vice President of Litigation Erik Haas said  the company was vindicated by the jury's decision."}, {"date": "20240418163309", "headline": "US FDA mandates label updates on CAR-T cancer therapies", "summary": "The U.S. Food and Drug Administration said on Thursday cancer therapies that use CAR-T technology will require changes to the so-called \"boxed warning\" to highlight the serious risk of T-cell blood cancer in patients who use these therapies.  The health regulor has required related updates to other sections of the label such as warnings and precautions, postmarketing experience, patient counseling information and medication guide.  In January, the FDA asked a host of drugmakers including Gilead Sciences, Johnson & Johnson and Novartis to add a boxed warning to their CAR-T cancer therapies, as it received reports of patients developing a type of T-cell blood cancer after being treated with them."}, {"date": "20240418163722", "headline": "HSBC Upgrades Johnson & Johnson (JNJ)", "summary": ""}, {"date": "20240418195100", "headline": "WHO considering safety alert on Kenvue kids cough syrup (update)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418200200", "headline": "Catalyst Watch: Tesla, Boeing and General Motors brace for earnings fireworks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418203700", "headline": "Johnson & Johnson (NYSE:JNJ) Notches Up After Talc Win", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418211400", "headline": "Johnson & Johnson (NYSE:JNJ) Notches Up after Talc Lawsuit Win", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418231400", "headline": "FDA requires labeling changes to CAR-T cell therapies to reflect cancer risk", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419000100", "headline": "Essential Pharma buys rights to J&J's Reminyl Alzheimer's treatment", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419011900", "headline": "Dividend Roundup: Johnson & Johnson, Dell, Lowe’s, Qualcomm and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419023000", "headline": "FDA Mandates \"Boxed Warning\" For Bristol Myers, Johnson & Johnson CAR-T-Based Blood Cancer Therapies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419040000", "headline": "The Zacks Analyst Blog Highlights NVIDIA, Alphabet, Johnson & Johnson, Broadridge Financial and Textron", "summary": "NVIDIA, Alphabet, Johnson & Johnson, Broadridge Financial and Textron are included in this Analyst Blog."}, {"date": "20240419044300", "headline": "Brexit Impact On Drugs - Rising Shortages in UK Highlight Brexit Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419045700", "headline": "Johnson & Johnson wins trial over talc-related cancer claim in Florida", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419052631", "headline": "Top 12 Ultra-High Yield Dividend Stocks to Buy", "summary": "In this article, we will take a detailed look at the Top 12 Ultra-High Yield Dividend Stocks to Buy. For a quick overview of such stocks, read our article Top 5 Ultra-High Yield Dividend Stocks to Buy. Dividend investing is back in the limelight as investors seek stable income sources to protect their cash in inflation […]"}, {"date": "20240419054000", "headline": "Mayar Capital Q1 2024 Letter To Partners", "summary": "For the three months ending March 31, 2024, the Mayar Responsible Global Equity Fund (Class A) was up 4.31% net. Click here to read the full letter. "}, {"date": "20240419054757", "headline": "WHO says wider alert on contaminated J&J cough syrup 'likely'", "summary": "The World Health Organization is likely to issue a wider warning about contaminated Johnson and Johnson-made children's cough syrup found in Nigeria last week, it said in an email.  Nigeria's regulator recalled a batch of Benylin syrup last Wednesday, having found a high level of diethylene glycol in the product during routine testing.  The batch of Benylin syrup recalled was made by J&J in South Africa in May 2021, although Kenvue now owns the brand after a spin-off from J&J last year."}, {"date": "20240419055400", "headline": "WHO considering safety alert on Kenvue kids cough syrup", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419065020", "headline": "UPDATE 2-WHO likely to issue wider alert on contaminated J&J cough syrup", "summary": "The World Health Organization is likely to issue a wider warning about contaminated Johnson and Johnson-made children's cough syrup found in Nigeria last week, it said in an email.  Nigeria's regulator recalled a batch of Benylin paediatric syrup last Wednesday, having found a high level of diethylene glycol in the product during routine testing.  The contaminant, alongside another closely related toxin, ethylene glycol, has been linked to the deaths of more than 300 children in Cameroon, Gambia, Indonesia and Uzbekistan since 2022, though there is no evidence that these incidents are linked with the latest recalls."}, {"date": "20240419084728", "headline": "Analyst updates Johnson & Johnson stock price target after earnings", "summary": "This is what could happen next to Johnson & Johnson shares."}, {"date": "20240419090024", "headline": "12 Best Diversified Stocks To Invest In", "summary": "In this article, we will take a look at the 12 best diversified stocks to invest in. To know more about the top stocks, go directly to 5 Best Diversified Stocks To Invest In. Forbes asked a group of experts about the changing global landscape and its effect on investors. These experts included Justin Onuekwusi (JO), […]"}, {"date": "20240419101714", "headline": "Johnson & Johnson Children's Cough Syrup Contaminated In Some Batches - WHO Poised to Issue Global Alert", "summary": "The World Health Organization (WHO) is poised to issue a broader alert regarding contaminated children’s cough syrup produced by Johnson and Johnson (NYSE:JNJ) in response to the discovery of tainted batches in Nigeria. Last week, Nigeria’s regulatory body recalled a specific batch of Benylin syrup after detecting elevated levels of diethylene glycol during routine testing. This compound, along with a related toxin, has been implicated in the deaths of over 300 children across several countries"}, {"date": "20240419123020", "headline": "These 3 Small-Cap Stocks Are Up 304% in 2024. Can They Run Higher?", "summary": "Small-cap stocks tend to outperform their larger brethren over time. After several years of underperformance, it looked like the little guys were going to start winning again. Inflation was moderating and the Federal Reserve was hinting it would cut interest rates at least three times this year. Beginning last October, the performance of the Russell 2000 index of small-cap stocks started pulling away from that of the S&P 500. But it wouldn’t last. Runaway government spending drove inflation high"}, {"date": "20240419204000", "headline": "J&J and Kenvue ordered to pay $45M in latest talc-related cancer claim", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420010000", "headline": "20 Years To $300k? Building A $10,000 Dividend Portfolio From Scratch", "summary": "Focusing on consistent dividend growth can lead to higher returns in lower-risk areas. Read an analysis of the portfolio here."}, {"date": "20240420010000", "headline": "10 High-Yield Dividend Aristocrats Perfect For An Uncertain Market", "summary": "Volatility in the stock market is normal and healthy. Click here to read more about the ten lowest-volatility dividend aristocrats."}, {"date": "20240420035305", "headline": "Dividend Champion, Contender, And Challenger Highlights: Week Of April 21", "summary": "Stay informed about the latest dividend activity with this weekly summary, including updates on dividend changes, ex-dividend dates, and pay dates of top..."}, {"date": "20240420043700", "headline": "Investing for the Long-Term: 3 Stocks With Proven Track Records", "summary": "With continued volatility in the stock market right now, it’s no wonder investors are looking for stocks with proven track records to bolster their portfolios. While U.S. stocks opened strong on Monday after a concerning ending to the prior week, investors are still uneasy about the current state of the market. Tensions in the Middle East, concerns that the Federal Reserve may not reduce interest rates as fast as previously hoped and fears over continued inflation are still top of mind for many"}, {"date": "20240420060300", "headline": "THQ: Collecting A High Yield From Increased Medical Spending", "summary": "abrdn Healthcare Opportunities Fund (THQ) offers a high dividend yield and exposure to diverse healthcare subsectors, outperforming peers. Explore more here."}, {"date": "20240420194400", "headline": "Goldman picks top capex and R&D stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421052258", "headline": "10 Best Soaps and Cleaning Materials Stocks to Buy", "summary": "In this article, we discuss the 10 best soaps and cleaning materials stocks to buy. To skip the detailed analysis of related industries and current market conditions, go directly to the 5 Best Soaps and Cleaning Materials Stocks to Buy. Although the US economy seems resilient with easing inflation and low unemployment rates, we still […]"}, {"date": "20240421063914", "headline": "10 Stocks American Politicians are Buying in 2024", "summary": "In this article, we will take a detailed look at the 10 Stocks American Politicians are Buying in 2024. For a quick overview of such stocks, read our article 5 Stocks American Politicians are Buying in 2024. American politicians using their insider knowledge and influence to make money off the stock market has piqued the curiosity of researchers and […]"}, {"date": "20240421192700", "headline": "WHO no longer planning safety alert on Kenvue cough syrup: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422005700", "headline": "Stryker added to 'Tactical Outperform' list at Evercore ISI", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422010300", "headline": "Wall Street Breakfast: Change Comes Slowly", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422010400", "headline": "3 Dividend Kings Down 11% You’ll Regret Not Buying on the Dip", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422015411", "headline": "Johnson & Johnson : CARVYKTI®▼ (ciltacabtagene autoleucel; cilta-cel) is the first BCMA-targeted treatment approved by the European Commission for patients with relapsed and refractory multiple myeloma who have received at least one prior line of therapy", "summary": "Media contact: Investor contact: ..."}, {"date": "20240422020000", "headline": "Dividend Income Summary: Lanny's March 2024 Summary", "summary": "Retirement accounts brought in a total dividend income amount of $2,367.19 or 40% of the dividend income total. Read what investors need to know."}, {"date": "20240422025117", "headline": "PKW: Buyback ETF Combining Value And Growth", "summary": "Invesco BuyBack Achievers ETF invests in companies that have reduced shares outstanding by at least 5% in last 12 months. Read more on PKW ETF here."}, {"date": "20240422033250", "headline": "RPT-Contaminated cough syrup in Africa no longer available - WHO", "summary": "A contaminated batch of Benylin Paediatric Syrup is no longer available in the African countries where it was sold, the World Health Organization said on Monday.  Earlier this month, Nigeria recalled a batch of the children's cough and allergy medicine after tests found that it contained unacceptable levels of the toxin, diethylene glycol.  Five other African countries have also pulled the product from shelves - Kenya, Rwanda, Tanzania, Zimbabwe and South Africa, where the drug was made."}, {"date": "20240422043447", "headline": "J&J: EU green light for Carvykti in multiple myeloma", "summary": "Janssen-Cilag International NV, a Johnson & Johnson company, announced today that the European Commission has approved a type II variant for Carvykti . This latest approval is for the treatment of..."}, {"date": "20240422060000", "headline": "5 Crash-Proof Stocks to Buy Immediately", "summary": "In February, I recommended five one-month momentum plays to buy as Bitcoin (BTC-USD) prices surged. The world’s largest cryptocurrency is a surprisingly good gauge of bubbly investor sentiment, and our writers at InvestorPlace.com had found several strong candidates to ride the market higher. Over the following month, these picks would rocket 47%, on average. Even assets with relatively weak fundamentals will go up if investors are bullish enough. Ticker Name 18-Feb Price 18-Mar Price Change PLU"}, {"date": "20240422060800", "headline": "Legend Biotech says Carvykti approved by EC for second-line multiple myeloma", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422070016", "headline": "Johnson & Johnson (JNJ) Is a Trending Stock: Facts to Know Before Betting on It", "summary": "Johnson & Johnson (JNJ) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock."}, {"date": "20240422070438", "headline": "Johnson & Johnson: Legal Woes Are Detrimental But Not Fatal", "summary": "JohnsonÂ &Â Johnson has continued to underperform the healthcare sectorÂ with the likely massive talc-related legal liabilities. Check out more on JNJ stock here."}, {"date": "20240422085900", "headline": "3 Dividend Stocks to Buy Now for Lifelong Income", "summary": "Securing a consistent income stream while guaranteeing long-term growth potential is a top priority in today’s volatile investing environment. Dividend stocks appeal to our search since they provide a stable and profitable mix. Three dividend stocks to buy now stand out with their strong business models, calculated efforts, and optimistic financial outlooks. These businesses, representing the breadth of dividend investment, range from consumer staples to healthcare. The first one’s unwavering em"}, {"date": "20240422091059", "headline": "10 Best Performing Biotech ETFs in 2024", "summary": "In this article, we discuss the 10 best performing biotech ETFs in 2024. If you want to skip our detailed introduction to the biotech industry and just want to take a look at some more ETFs, go directly to the 5 Best Performing Biotech ETFs in 2024. Biotechnology is a challenging field, not ideal for […]"}, {"date": "20240422103407", "headline": "Johnson & Johnson to Participate in the Bernstein’s 40th Annual Strategic Decisions Conference (SDC)", "summary": "Johnson & Johnson will participate in the Bernstein’s 40th Annual Strategic Decisions Conference on Wednesday, May 29th, at the New York Hilton Midtown, New York, NY. Joaquin Duato, Chairman and..."}, {"date": "20240422212600", "headline": "Johnson & Johnson Children's Cough Syrup Contaminated In Some Batches - WHO Poised to Issue Global Alert (Updated)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422213300", "headline": "Warning! These 3 Blue-Chip Stocks Will Have You Seeing Red", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422223438", "headline": "PPH: Buy The Pullback In This Big Pharma ETF For Long-Term Total Returns", "summary": "PPH is a popular option for exposure to leading pharmaceutical companies. Check out the technical analysis of PPH ETF and why it presents a buying opportunity."}, {"date": "20240423010020", "headline": "Not A Millionaire? No Problem! Here's A 10-Stock Portfolio To Retire Comfortably", "summary": "Most retirees are managing to thrive in retirement with less savings than expected. Check here to learn more about a 10-stock portfolio to retire comfortably."}, {"date": "20240423020100", "headline": "Takeda Pharmaceutical: A Long-Term Cash Cow", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423033000", "headline": "Baron Health Care Fund Q1 2024 Shareholder Letter", "summary": "In the quarter ended March 31, 2024, Baron Health Care Fund advanced 8.92% compared with the 8.52% gain for the Russell 3000 Health Care Index and the 10.56% gain for the S&P 500 Index."}, {"date": "20240423040741", "headline": "Janssen - CARVYKTI is the first BCMA-targeted treatment approved by the European Commission for patients with relapsed and refractory multiple myeloma who have received at least one prior line of therapy", "summary": "BEERSE, BELGIUM - Janssen-Cilag International NV, a Johnson & Johnson company, announced today that the European Commission has approved a Type II variation for CARVYKTI .This latest approval is..."}, {"date": "20240423040849", "headline": "Johnson & Johnson to participate in the Bernstein's 40th Annual Strategic Decisions Conference", "summary": "New Brunswick - Johnson & Johnson will participate in the Bernstein's 40th Annual Strategic Decisions Conference on Wednesday, May 29th, at the New York Hilton Midtown, New York, NY.Joaquin Duato,..."}, {"date": "20240423063400", "headline": "Sanofi reportedly lining up banks for consumer products spinoff", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423064200", "headline": "4 Stocks to Watch on Their Recent Dividend Hikes", "summary": "Stocks like KB Home (KBH), Interactive Brokers Group, Inc. (IBKR), QUALCOMM Incorporated (QCOM) and Johnson & Johnson (JNJ) recently hiked dividends."}, {"date": "20240423201913", "headline": "Welfare Plan Class Action Litigation Underscores Importance Of Minding Your Fiduciary Duties", "summary": "As mentioned in our recent blog post, the recently filed class action lawsuit against Johnson & Johnson ) over alleged excessive prescription drug costs takes a new approach with respect to familiar..."}, {"date": "20240423211300", "headline": "Cidara Therapeutics reacquires rights to CD388 from Johnson & Johnson for $85M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423214900", "headline": "Cidara stock rallies amid $240M private placement, drug update", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423233700", "headline": "Johnson & Johnson Stocks Elliott Wave Technical Analysis", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424000923", "headline": "March Readers Marked 20 Ideal-To-Buy Dividend Dogs", "summary": "Prior to March 31, 2024, my readers mentioned 32 equities in their comments on my articles. Read more to see my recommendation."}, {"date": "20240424010232", "headline": "14 Dividend Growth Stocks with Highest Growth Rates", "summary": "In this article, we discuss 14 dividend growth stocks with highest growth rates. You can skip our detailed analysis of dividend growth stocks and their overall performance, and go directly to read 5 Dividend Growth Stocks with Highest Growth Rates. According to a report by ProShares, the S&P 500 Dividend Aristocrats Index, which tracks the […]"}, {"date": "20240424032500", "headline": "Got $5,000? Here Are 3 Undervalued Stocks to Buy and Hold Forever", "summary": "Buying great stocks when they're on sale is a lucrative long-term strategy."}, {"date": "20240424035000", "headline": "Video: Dow Movers: JNJ, BA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424041000", "headline": "These Are the 10 High-Profile Stocks U.S. Politicians Have Gravitated to Most Over the Last 3 Years", "summary": "These stocks kept members of Congress especially busy."}, {"date": "20240424042400", "headline": "LLY vs. JNJ: Which Big Pharma Stock Is Better?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424044000", "headline": "Surprise! These 3 Dividend Giants Are at 52-Week Lows. Buy Them Before They Soar", "summary": "We love it when a retailer puts our favorite jeans on sale. We go out and buy two pairs. It is the same when the local supermarket cuts the price of steak. We end up grilling all week long after loading up on the T-bones. However, when the stock market puts a stock we own on sale, too often we’re dumping the shares helping to lead a rout lower. Furthermore, when some dividend giants are at the lowest price we’ve seen in awhile, we don’t act on it. Fear and greed are the two biggest motivators on"}, {"date": "20240424050400", "headline": "Neurocrine Biosciences upgraded at Wells Fargo on pipeline", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424052500", "headline": "The Top 7 Dividend Stocks to Buy in 2024 to Build Lasting Wealth", "summary": "In the changing environment of 2024, astute investors have a plethora of options to strengthen their financial portfolios strategically by purchasing dividend stocks. These prospects result from industry titans’ forward-thinking initiatives and solid performance. The top seven of them are listed here. For example, the first company distinguishes itself by spending substantial research and development to gain a competitive advantage in several therapeutic areas. Similarly, the second company’s su"}, {"date": "20240424065000", "headline": "The Zacks Analyst Blog Highlights KB Home, Interactive Brokers Group, Qualcomm and Johnson & Johnson", "summary": "KB Home, Interactive Brokers Group, Qualcomm and Johnson & Johnson are part of the Zacks top Analyst Blog."}, {"date": "20240424115800", "headline": "Vanda (VNDA) to Report Q1 Earnings: What's in the Cards?", "summary": "On Vanda's (VNDA) first-quarter 2024 earnings call, investors' focus is likely to be on the sales performance of its marketed drugs and certain pipeline and regulatory updates."}, {"date": "20240424200700", "headline": "The Top 3 Small-Cap Stocks to Buy in April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424230600", "headline": "Medtech Marvels: 3 Groundbreaking Medical Device Stocks to Watch in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424234500", "headline": "US Stock: Johnson & Johnson", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424235300", "headline": "7 blue chip stocks to Buy on the Dip: April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425021000", "headline": "March's Dividend Portfolio Update Sets New All-Time Record - 100 Holdings, 21 Buys", "summary": "Portfolio changes in March focus on BDCs, aiming to increase dividend income by at least $100 each month. Click here for a detailed analysis."}, {"date": "20240425041800", "headline": "What's Driving AstraZeneca PLC's Surprising 14% Stock Rally?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425053637", "headline": "Johnson & Johnson's (NYSE:JNJ) Dividend Will Be Increased To $1.24", "summary": "Johnson & Johnson ( NYSE:JNJ ) has announced that it will be increasing its dividend from last year's comparable..."}, {"date": "20240425073500", "headline": "Bert's March Dividend Income Summary", "summary": "We have two other individual stocks that paid us individual dividends that were over $100 per share. Those two companies were Target and T.Rowe Price. Click to read."}, {"date": "20240425102253", "headline": "Cidara buys back rights to flu therapy from J&J for $85m", "summary": "Marking another chapter in the long-running saga, J&J has deprioritised the CD388 influenza programme allowing Cidara to buy it back."}, {"date": "20240425114916", "headline": "These Are The Biotechs Showing Up At The Biggest Cancer Meeting Of The Year (Oral Presentations)", "summary": "The Annual Meeting of ASCO is a major event for clinicians and researchers in the field of oncology. Explore more details here."}, {"date": "20240425122844", "headline": "Neurocrine: Success Continues To Roll In With Positive MDD Treatment Data", "summary": "Neurocrine achieved positive results achieved from phase 2 SAVITRI study for the treatment of patients with MDD. Check out why NBIX stock is a strong buy."}, {"date": "20240425230200", "headline": "Steady Eddies: 7 Rock-Solid Stocks to Anchor Your Portfolio in April", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425230700", "headline": "How Much Will $10k Invested in These Dividend Aristocrats Grow to by 2025?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426054502", "headline": "Johnson & Johnson : receives positive CHMP opinion for RYBREVANT®▼ (amivantamab) in combination with chemotherapy for the first-line treatment of patients with advanced non-small cell lung cancer with activating EGFR exon 20 insertion mutations", "summary": "Media contact: Investor contact: ..."}, {"date": "20240426061300", "headline": "5 Stocks in Focus on Their Recent Dividend Hike", "summary": "Five stocks to focus with recent dividend hike are: JNJ, TRV, SON, KBH, SPFI."}, {"date": "20240426094509", "headline": "Are You Looking for a High-Growth Dividend Stock?", "summary": "Dividends are one of the best benefits to being a shareholder, but finding a great dividend stock is no easy task. Does Johnson & Johnson (JNJ) have what it takes? Let's find out."}, {"date": "20240426101000", "headline": "AbbVie (ABBV) Beats on Q1 Earnings & Sales, Ups '24 EPS View", "summary": "AbbVie's (ABBV) first-quarter earnings and sales beat estimates. Management hikes the EPS guidance on the back of encouraging Skyrizi product sales."}, {"date": "20240426204000", "headline": "5 Stocks In Focus On Their Recent Dividend Hikes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426213300", "headline": "What Investing Account Types Are The Best Fit For You And Your Dividends?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426230700", "headline": "Generational Wealth Builders: 3 Stocks to Own for Decades of Gains", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426234300", "headline": "7 Stocks to Buy if Inflation Continues to Reign in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427054500", "headline": "Johnson & Johnson Stock: Buy, Sell, or Hold?", "summary": "Is this top healthcare stock worth adding to your portfolio today?"}, {"date": "20240427071546", "headline": "10 Best Long Term Low Risk Stocks to Buy", "summary": "In this article, we will take a look at the 10 best long term low risk stocks to buy. To see more such companies, go directly to 5 Best Long Term Low Risk Stocks to Buy. As the latter part of 2022 unfolded, artificial intelligence stocks emerged as a beacon of hope for the market […]"}, {"date": "20240427210000", "headline": "Pharma Stock Roundup: Merck, Sanofi, AstraZeneca, Novartis' Q1 Results, Pipeline & Regulatory Updates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428022000", "headline": "Better Dividend Stock: AbbVie or Johnson & Johnson?", "summary": "One thing is for sure: Dividend seekers can't go wrong with either."}, {"date": "20240428060400", "headline": "J&J, Roche, AstraZeneca poised to have highest orphan drug sales by end of decade", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428064500", "headline": "2 Top Growth Stocks to Buy Right Now and Hold Forever", "summary": "These healthcare stocks can provide enviable long-term portfolio growth."}, {"date": "20240428165443", "headline": "Dividend Stock Portfolio For Income: Top 15 Stocks", "summary": "In this article, we will discuss dividend stocks for regular income. You can skip our detailed analysis of dividend stocks and their historical performance, and go directly to read Dividend Stock Portfolio For Income: Top 5 Stocks. It is generally believed that dividend stocks are primarily suitable for people approaching retirement. However, this is far from […]"}, {"date": "20240428213500", "headline": "Johnson & Johnson stock outperforms competitors on strong trading day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428221100", "headline": "Cutting Edge Picks: 3 Med Tech Stocks With Room to Run", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429000100", "headline": "The Art of Valuation: Discovering Johnson & Johnson's Intrinsic Value", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429023145", "headline": "Apple, Cardinal Health Among 12 Companies To Announce Dividend Increases In First Half Of May", "summary": "Eleven long-term dividend growth companies announced their annual dividend increases in the second half of April. Read more to see a full review."}, {"date": "20240429030500", "headline": "7 Retirement Stocks to Buy at a 52-Week Low in April", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429032100", "headline": "J&J receives positive CHMP opinion recommending approval of Sirturo in MDR TB", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429042100", "headline": "EU regulators recommend full approval for J&J TB drug Sirturo", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429043419", "headline": "J&J: positive CHMP opinion for lung cancer", "summary": "Johnson & Johnson receives a positive CHMP opinion for Rybrevant® in combination with chemotherapy for the first-line treatment of patients with advanced non-small cell lung cancer with activating..."}, {"date": "20240429050154", "headline": "Johnson & Johnson's (NYSE:JNJ) Stock Has Shown Weakness Lately But Financial Prospects Look Decent: Is The Market Wrong?", "summary": "It is hard to get excited after looking at Johnson & Johnson's (NYSE:JNJ) recent performance, when its stock has..."}, {"date": "20240429050800", "headline": "Addex stock plunges 50% on failed study for epilepsy drug", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429082300", "headline": "Johnson & Johnson Is a King of Dividend Safety", "summary": "The healthcare behemoth has fortified its dividend."}, {"date": "20240429105351", "headline": "Johnson & Johnson-Partnered Addex Therapeutics' Epilepsy Candidate Fails Mid-Stage Study, Stock Tanks", "summary": "Monday, Addex Therapeutics (NASDAQ:ADXN) released top-line data from a Phase 2 epilepsy study evaluating adjunctive ADX71149 (JNJ-40411813) administration in patients with focal onset seizures with suboptimal response to levetiracetam or brivaracetam. The company is collaborating with Johnson & Johnson’s (NYSE:JNJ) Janssen Pharmaceuticals Inc. The Phase 2 study did not achieve statistical significance for the primary endpoint of time for patients to reach baseline seizure count when ADX71149 was"}, {"date": "20240429155236", "headline": "J&J, Bristol Myers lose challenges to US drug price negotiation program", "summary": "A U.S. judge on Monday rejected a challenge by Bristol Myers Squibb and Johnson & Johnson to a law requiring them to negotiate the prices of their blockbuster blood clot prevention drugs with the U.S government's Medicare health insurance program or pay heavy penalties.  U.S. District Judge Zahid Quraishi in Trenton, New Jersey, became the fourth federal judge to uphold the program, one of Democratic President Joe Biden's signature initiatives, against drug industry challenges, rejecting their argument that it was an illegal taking of their property.  \"In short, defendants are not taking drugs from plaintiffs,\" Quraishi wrote, adding that they were free to stop participating in Medicare if they did not want to negotiate."}, {"date": "20240429195200", "headline": "Spotlight on Johnson & Johnson: Analyzing the Surge in Options Activity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429213300", "headline": "7 Dividend Aristocrats Paying Sky-High Yields: April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430002200", "headline": "Slump Survivors: 3 Stocks That Will Outlast the S&P 500 Downturn", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430024700", "headline": "Stock Market Crash Warning: Don’t Get Caught Holding These 3 Healthcare Stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430025300", "headline": "J&J, Bristol Myers latest to lose bids to halt Medicare price negotiations", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430031400", "headline": "FTC expands patent listing challenges for drugs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430040142", "headline": "Addex stock tanks after lead drug flops in Phase II epilepsy trial", "summary": "Addex and J&J co-developed the allosteric modulator therapy, which failed to meet the primary endpoint in a Phase II epilepsy trial."}, {"date": "20240430061500", "headline": "Stifel, Morgan Stanley bullish on newly public Contineum", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430191300", "headline": "Dow Jones Industrial Average Struggles To Recover From Recent Backslide As Fed Rounds Corner", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430210200", "headline": "Stock Market Crash Alert: 3 Must-Buy Healthcare Stocks When Prices Plunge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430211000", "headline": "Dow rallies nearly 325 points on gains for Johnson & Johnson, Amazon.com Inc. shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430211500", "headline": "BeiGene, AbbVie patent spat to get trial from USPTO appeals board", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430213500", "headline": "What You Missed On Wall Street On Wednesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430233500", "headline": "J&J's LLT proposes to resolve all ovarian cancer talc claims via reorganization", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430233800", "headline": "J&J says talc plan commits company to pay claimants $6.475B", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501001300", "headline": "Johnson & Johnson Announces Major Talc Litigation Settlement Plan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501001500", "headline": "Johnson & Johnson unveils latest plan to settle ovarian cancer talc claims", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501003208", "headline": "Johnson & Johnson Announces Plan by its Subsidiary, LLT Management LLC, to Resolve All Current and Future Ovarian Cancer Talc Claims Through a Consensual “Prepackaged” Reorganization", "summary": "The Plan would resolve 99.75% of all pending talc lawsuits against Johnson & Johnson and its affiliates in the United States..."}, {"date": "20240501005000", "headline": "J&J seeks over $6B settlement to resolve talc-related cancer claims", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501011611", "headline": "J&J subsidiary proposes paying about $6.48B over 25 years to settle talc lawsuits", "summary": "A subsidiary of Johnson & Johnson is now proposing paying approximately $6.48 billion over 25 years as part of a settlement to cover allegations that its baby powder containing talc caused ovarian..."}, {"date": "20240501012400", "headline": "J&J's proposed $6B+ talc settlement negatively impacts some Q1 results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501015600", "headline": "Fly Intel: Pre-market Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501031700", "headline": "TOP NEWS: J&J proposes USD6.48 billion settlement of cancer lawsuits", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501032100", "headline": "3 No-Brainer Stocks to Buy With $200 Right Now", "summary": "You don't need a mountain of cash to grow your wealth on Wall Street."}, {"date": "20240501033300", "headline": "Unveiling Johnson & Johnson (JNJ)'s Value: Is It Really Priced Right? A Comprehensive Guide", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501043000", "headline": "Johnson & Johnson Has a New Plan to Settle Talc Bankruptcy", "summary": "Johnson & Johnson  on Wednesday unveiled its latest effort to put to rest the sweeping litigation it has faced over alleged injuries caused by its talc products, offering deals under which it would pay roughly $11 billion to various groups of plaintiffs.  The talc lawsuits have dogged  Johnson & Johnson  for years.  Earlier efforts to settle the claims involving complex maneuverings in bankruptcy court system have repeatedly failed."}, {"date": "20240501043000", "headline": "Johnson & Johnson Announces Plan by its Subsidiary, LLT Management LLC, to Resolve All Current and Future Ovarian Cancer Talc Claims Through a Consensual \"Prepackaged\" Reorganization", "summary": "NEW BRUNSWICK, N.J., May 01, 2024--Johnson & Johnson (NYSE: JNJ) (the \"Company\") today announced a proposed Plan of Reorganization (the \"Plan\") by its subsidiary, LLT Management LLC (\"LLT\"), for the comprehensive and final resolution of all current and future claims related to ovarian cancer arising from cosmetic talc litigation against it and its affiliates in the United States."}, {"date": "20240501043100", "headline": "JNJ Stock: J&J Proposes $6.5 Billion Settlement for Talc Cancer Lawsuits", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501043444", "headline": "J&J advances $6.48 billion settlement of talc cancer lawsuits", "summary": "NEW YORK(Reuters) -Johnson & Johnson said on Wednesday it is moving forward with a $6.48 billion proposed settlement of tens of thousands of lawsuits alleging that its baby powder and other talc products contain asbestos and cause ovarian cancer.  The deal would allow it to resolve the lawsuits through a third bankruptcy filing of a subsidiary company, J&J said.  J&J will begin a three-month voting period in hopes of reaching consensus on a settlement of all current and future ovarian cancer claims."}, {"date": "20240501043444", "headline": "J&J advances $6.475 billion settlement of talc cancer lawsuits", "summary": "Johnson & Johnson is moving forward with a $6.475 billion proposed settlement of tens of thousands of lawsuits alleging that its baby powder and other talc products contain asbestos and cause ovarian cancer, the company said Wednesday in a statement.  The deal would allow it to resolve the lawsuits through a third bankruptcy filing of a subsidiary company.  It will begin a three month voting period in hopes of reaching consensus on a settlement of all current and future ovarian cancer claims."}, {"date": "20240501044500", "headline": "Johnson & Johnson management to meet with Oppenheimer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501044700", "headline": "Why Is CytomX (CTMX) Stock Up 180% Today?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501050300", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501051112", "headline": "J&J Seeks Backing for $11 Billion Baby Powder Cancer Deal", "summary": "(Bloomberg) -- Johnson & Johnson will ask thousands of people suing over its allegedly tainted baby powder to vote in favor of a settlement that would allow the company to resolve all litigation for $11 billion — $2.1 billion more than it offered last year.Most Read from BloombergTesla Axes Supercharger Team in Blow to Broader EV MarketNYC Police Break Up Columbia Protest and Clashes Erupt at UCLAAmazon Posts Strongest Cloud Sales Growth in a Year on AI DemandPot Stocks Surge on Report DEA Set t"}, {"date": "20240501051400", "headline": "Cannabis Stocks CGC, ACB, TLRY Drop After Huge Rescheduling Rally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501051517", "headline": "J&J subsidiary proposes paying about $6.48B over 25 years to settle talc ovarian cancer lawsuits", "summary": "A subsidiary of Johnson & Johnson is now proposing to pay approximately $6.48 billion over 25 years as part of a settlement in the U.S. to cover allegations that its baby powder containing talc caused ovarian cancer.  The lawsuits filed against J&J had alleged its talcum powder caused users to develop ovarian cancer, through use for feminine hygiene, or mesothelioma, a cancer that strikes the lungs and other organs.  The claims contributed to drop in J&J’s sales of baby powder, prompting the company to stop selling its talc-based products in 2020."}, {"date": "20240501051600", "headline": "Johnson & Johnson (NYSE:JNJ) Is Paying $6.5B to Settle Lawsuit", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501064300", "headline": "Noteworthy Wednesday Option Activity: JNJ, NFLX, AIG", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501073513", "headline": "UPDATE 2-J&J advances $6.48 billion settlement of talc cancer lawsuits", "summary": "Johnson & Johnson said on Wednesday it is moving forward with a $6.48 billion proposed settlement of tens of thousands of lawsuits alleging that its baby powder and other talc products contain asbestos and cause ovarian cancer.  The deal would allow it to resolve the lawsuits through a third bankruptcy filing of a subsidiary company, J&J said.  J&J will begin a three month voting period in hopes of reaching consensus on a settlement of all current and future ovarian cancer claims."}, {"date": "20240501073606", "headline": "Johnson & Johnson moves forward with $6.475 billion settlement of talc cancer lawsuits", "summary": "Johnson & Johnson is moving forward with a proposed settlement of tens of thousands of lawsuits alleging its baby powder and other talc products cause ovarian cancer."}, {"date": "20240501081553", "headline": "Update: Johnson & Johnson Announces $6.48 Billion Plan for Unit to Resolve Ovarian Cancer Talc Claims", "summary": "Update: Johnson & Johnson Announces $6.48 Billion Plan for Unit to Resolve Ovarian Cancer Talc Claims"}, {"date": "20240501084105", "headline": "Eli Lilly Shoots Higher: It's Time To Be Cautious", "summary": "If we see shares continue to climb like this, a downgrade for Eli Lilly and Company stock could be on the horizon. Learn why we rate LLY stock a hold."}, {"date": "20240501090228", "headline": "Janssen adopts J&J name as part of global rebranding effort", "summary": "‘Janssen’ will no longer be seen on drug labels following the Johnson & Johnson brand name adoption."}, {"date": "20240501102300", "headline": "NEW YORK MARKET CLOSE: Stocks mixed as Powell calms rate hike jitters", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501102700", "headline": "J&J Offers $6.5 Billion for Talc Lawsuits Ahead of Third Bankruptcy Filing", "summary": "The healthcare-products company plans to file a third bankruptcy case to resolve talc-related liabilities if enough injury claimants accept its offer first."}, {"date": "20240501112500", "headline": "Johnson & Johnson wants to pay $6.5B to settle talcum-powder lawsuits over cancer claims", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501121704", "headline": "Fed holds rates as it warns fight against inflation has hit a bump", "summary": "The world’s largest central bank has warned that its fight against inflation has hit a bump in the road, forcing it to keep interest rates at a 23-year-high."}, {"date": "20240501134806", "headline": "Johnson & Johnson’s latest gambit to solve its massive talcum powder asbestos issue: A $6.5 billion settlement, paid out over 25 years", "summary": "J&J’s proposed settlement represents just 7.8% of its $85.2 billion in annual sales for 2023."}, {"date": "20240501140037", "headline": "US STOCKS-S&P 500 ends lower after Fed rate decision, Powell press conference", "summary": "U.S. stocks closed mixed on Wednesday after the Federal Reserve left its key interest rate unchanged, as expected, but indicated that its next move will probably be to cut rates.  The S&P 500 and the Nasdaq ended lower while the Dow Jones Industrial Average notched a modest gain.  The Federal Open Markets Committee (FOMC) concluded its two-day monetary policy meeting with a unanimous decision to let the Fed funds target rate stand at 5.25%-5.50%."}, {"date": "20240501141154", "headline": "Sector Update: Health Care Stocks Rise Late Afternoon", "summary": "Sector Update: Health Care Stocks Rise Late Afternoon"}, {"date": "20240501142601", "headline": "US STOCKS-S&P 500, Nasdaq end lower after Fed rate decision, Powell press conference", "summary": "U.S. stocks closed mixed on Wednesday after the Federal Reserve left its key interest rate unchanged, as expected, and indicated that while its next move will likely be a rate cut, continued progress on inflation is not assured.  The S&P 500 and the Nasdaq ended lower while the Dow Jones Industrial Average notched a modest gain."}, {"date": "20240501221700", "headline": "Hold Rating on Johnson & Johnson Amid Ongoing Talc Litigation Uncertainties and Settlement Efforts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501222000", "headline": "Johnson & Johnson’s Strategic Settlement Plan for Ovarian Cancer Talc Claims: Financial Implications and Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501223700", "headline": "Cantor Fitzgerald healthcare/pharma analysts analyst/industry conference call", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501230437", "headline": "Decoding Johnson & Johnson (JNJ): A Strategic SWOT Insight", "summary": "Unveiling the Financial and Strategic Landscape Post Q1 2024"}, {"date": "20240501235500", "headline": "Nasdaq, S&P 500 Futures Rise Ahead Of Apple Earnings: Why This Analyst Thinks 'No Cut' Scenario May Not Be Negative For Market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502004630", "headline": "Johnson & Johnson : 2024 First-Quarter Press Release & Supplemental Schedules (April 16, 2024)", "summary": "Media contact: Investor contact: ..."}, {"date": "20240502010106", "headline": "The top pharmaceutical companies by R&D expenditure", "summary": "From Merck & Co to Sanofi, Pharmaceutical Technology lists the leading pharmaceutical companies spending the most on R&D in 2023."}, {"date": "20240502034201", "headline": "J&J: applies to the EMA for an extended MA for Tremfya", "summary": "Janssen-Cilag International NV, a Johnson & Johnson company, announced today that it has submitted applications to the European Medicines Agency to extend the marketing authorization application for..."}, {"date": "20240502040600", "headline": "Genmab reports Q1 revenue increased 46% vs. last year", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502045135", "headline": "Janssen-Cilag seeks expanded EMA approval for TREMFYA", "summary": "TREMFYA’s (guselkumab) safety profile was in line with previous findings for the therapy in approved indications."}, {"date": "20240502102034", "headline": "25 Most Profitable Companies in the US", "summary": "In this piece, we will take a look at the 25 most profitable companies in the US. If you want to skip our overview of the US economy and the current business climate, you can jump ahead to the 5 Most Profitable Companies in the US. With the second quarter of 2024 with us, Wall Street […]"}, {"date": "20240502160659", "headline": "Tracking Yacktman Asset Management Portfolio - Q1 2024 Update", "summary": "Discover the latest portfolio updates from Yacktman Asset Management, including new stakes and stake disposals, driving an increase in value."}, {"date": "20240502193400", "headline": "New Prostate Cancer Treatment Data Not Much Help to Johnson & Johnson (NYSE:JNJ)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502195200", "headline": "Cancer Treatment Data Doesn’t Help Johnson & Johnson (NYSE:JNJ) Much", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503035942", "headline": "J&J: to present advances in retinal diseases", "summary": "Johnson & Johnson announces that it will sponsor eight data presentations at the 2024 annual meeting of the Association for Research in Vision and Ophthalmology , to be held in Seattle from May 5 to..."}, {"date": "20240503042000", "headline": "Johnson & Johnson announces updated results from Cohort 2 of SunRISe-1 study", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503051005", "headline": "Kenvue Q1 Earnings Preview: A Potentially Troubling Trend", "summary": "Over the lastÂ 3Â years, Kenvue's R&D spend averaged only 2.5% of net sales, well below the 2016-2018 baseline of 4.0%. Read my earnings preview of KVUE stock here."}, {"date": "20240503052900", "headline": "Johnson & Johnson says Phase 2 Apa-RP study meets primary endpoint", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503054328", "headline": "Johnson & Johnson Announces Plan by its Subsidiary, LLT Management LLC, to Resolve All Current and Future Ovarian Cancer Talc Claims Through a Consensual 'Prepackaged' Reorganization", "summary": "NEW BRUNSWICK, N.J. - Johnson & Johnson today announced a proposed Plan of Reorganization by its subsidiary, LLT Management LLC , for the comprehensive and final resolution of all current and..."}, {"date": "20240503054330", "headline": "Johnson & Johnson submits regulatory applications to European Medicines Agency for TREMFYA (guselkumab) for treatment of patients with ulcerative colitis and Crohn's disease", "summary": "Beerse, Belgium - Janssen-Cilag International NV, a Johnson & Johnson company, today announced it has submitted applications to the European Medicines Agency seeking to expand the Marketing..."}, {"date": "20240503060025", "headline": "Shareholders in Johnson & Johnson (NYSE:JNJ) are in the red if they invested three years ago", "summary": "For many investors, the main point of stock picking is to generate higher returns than the overall market. But the risk..."}, {"date": "20240503061000", "headline": "J&J releases new Erleada data buoying benefit of prostate cancer treatment", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503063000", "headline": "3 Dividend Growth Stocks that Just Raised Their Payouts", "summary": "One of these stocks boosted its payouts by as much as 13%."}, {"date": "20240503063002", "headline": "Intuitive Surgical Builds On Its Robotic Surgery Prowess. But Challengers Are Coming.", "summary": "Robotic surgery isn't the future — it's here. And, as rivalries mount, Intuitive Surgical has launched what doctors call a \"game-changer.\""}, {"date": "20240503064300", "headline": "5 Expected Dividend Increases In May 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503070012", "headline": "Johnson & Johnson (JNJ) is Attracting Investor Attention: Here is What You Should Know", "summary": "Johnson & Johnson (JNJ) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects."}, {"date": "20240503071002", "headline": "How to Maximize Your Retirement Portfolio with These Top-Ranked Dividend Stocks", "summary": "The traditional retirement planning approaches no longer cover all expenses in nest egg years. So what can retirees do? Thankfully, there are alternative investments that provide steady, higher-rate income streams to replace dwindling bond yields."}, {"date": "20240503124133", "headline": "30 Most Profitable Companies with Highest Margins in the World", "summary": "In this article, we will be taking a look at the 30 Most Profitable Companies with Highest Margins in the World. To learn about other Most Profitable Companies with Highest Margins in the World, you can go directly to the 5 Most Profitable Companies with Highest Margins in the World. In today’s competitive global marketplace, […]"}, {"date": "20240503150404", "headline": "4 Dividend Kings Poised for Growth, According to Analysts", "summary": "Dividend Kings are an elite group of companies that have consistently increased their dividends for at least 50 consecutive years. These companies have demonstrated a remarkable ability to generate steady cash flows and reward shareholders with ..."}, {"date": "20240504030000", "headline": "5 Relatively Secure And Cheap Dividend Stocks To Invest In - May 2024", "summary": "There are safe, dividend-paying companies with large discounts to historical norms. Check out our selection process and our top 5 dividend stocks."}, {"date": "20240504060000", "headline": "Johnson & Johnson: A Healthcare Giant That's Looking More Attractive By The Day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}]}