{"news": [{"date": "20240417064000", "headline": "‘Punishing myself would not help’: My credit card was stolen — the thief revealed lots of nasty surprises about my finances", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417101311", "headline": "Jamie Dimon Has a New Vision for Money in an AI World", "summary": "(Bloomberg) -- JPMorgan Chase & Co. Chief Executive Officer Jamie Dimon makes no secret that his firm is all-in on artificial intelligence. Now, the head of the world’s biggest bank is laying out his vision for the future of money in an AI world. Most Read from BloombergDubai Grinds to Standstill as Cloud Seeding Worsens FloodingTesla Asks Investors to Approve Musk’s $56 Billion Pay AgainRed Lobster Considers Bankruptcy to Deal With Leases and Labor CostsBankers Hit With Millions in Breakup Fees"}, {"date": "20240417101400", "headline": "NEW YORK MARKET CLOSE: Chip stocks weigh as tech retreat gathers pace", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417143353", "headline": "Bank of America CEO: The Federal Reserve is winning the war on inflation", "summary": "Bank of America CEO Brian Moynihan weighs in on the fight against inflation and another solid quarter of consumer spending."}, {"date": "20240417172140", "headline": "US to Reinstate Venezuela Sanctions, Says Maduro Broke Deal", "summary": "(Bloomberg) -- President Joe Biden’s administration reimposed oil sanctions on Venezuela, ending a six-month reprieve after determining that Nicolas Maduro’s regime failed to honor an agreement to allow a fairer vote in elections scheduled for July.Most Read from BloombergDubai Grinds to Standstill as Cloud Seeding Worsens FloodingTesla Asks Investors to Approve Musk’s $56 Billion Pay AgainRed Lobster Considers Bankruptcy to Deal With Leases and Labor CostsBankers Hit With Millions in Breakup Fe"}, {"date": "20240417191900", "headline": "The 3 Best Bank Stocks to Buy on Q1 Earnings Results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417200300", "headline": "$1000 Invested In This Stock 10 Years Ago Would Be Worth $3,200 Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417201800", "headline": "Impact of Federal Reserve's Interest Rate Strategy on Global Markets Featuring Brazil's ...", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418020100", "headline": "Why Citigroup Is My Favorite Buffett Stock", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418020300", "headline": "IN THE KNOW: Danone on track after Water arm drives first quarter beat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418021012", "headline": "Margin Optimization: Balancing Growth, Investment And Cost", "summary": "In today's business environment, the tangible pressures to grow profitably are an ever-present challenge. Achieving enduring success demands that companies master a complex balance of growth,..."}, {"date": "20240418022400", "headline": "JPMorgan: Bitcoin Price May Drop After Halving Despite Miner Shakeup", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418023500", "headline": "CEO Uncertainty Spikes After Improving Last Quarter", "summary": "Banks kicked off Q1 earnings season with mixed results, proving that sizeable economic headwinds still persist. Read what investors need to know."}, {"date": "20240418052000", "headline": "AIA Group's Market Value Plunge Contrasts With Bullish Analyst Views", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418053400", "headline": "Impact Disclosure Taskforce Releases Impact Disclosure Guidance, Helping Scale Financing for the UN Sustainable Development Goals", "summary": "NEW YORK, April 18, 2024--The Impact Disclosure Taskforce today released its draft impact disclosure guidance, helping entities committed to addressing development needs and reducing global inequality to access growing pools of sustainable capital."}, {"date": "20240418060100", "headline": "Biden Tariffs Could Make This Steel Company a Steal", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418070500", "headline": "Patient Capital Management Opportunity Equity Strategy Q1 2024 Commentary", "summary": "Patient Opportunity Equity strategy advanced 11.8% net of fees in the first quarter, beating the S&P 500â\u0080\u0099s 10.6% gain. Click here to read the full letter."}, {"date": "20240418080853", "headline": "Citi Post Q1: I Like The Cost Cuts", "summary": "Citigroup is implementing strong cost-cutting measures through headcount reduction and organizational streamlining. Find out why C stock is a Buy."}, {"date": "20240418084806", "headline": "Jamie Dimon Knew Subprime 'Could Go Up In Smoke'; Now He's Worried About An Artificial Economy 'Fueled by Government Deficit Spending'", "summary": "In the chaos of the 2008 recession, perhaps no bank stood more prepared than Jamie Dimon's J.P Morgan Chase & Co. (NYSE:JPM). In advance of the crisis, Jamie Dimon realized that \"underwriting standards were deteriorating across the industry,\" with late payments on subprime loans rising. In late 2006, the bank led his firm to exit Wall Street's hot subprime business, starting with a frantic call made to J.P. Morgan's vacationing Chief of Securitized Products where he said, \"I really want you to w"}, {"date": "20240418095014", "headline": "JPMorgan Chase sues Russia's VTB Bank over effort to unfreeze assets", "summary": "NEW YORK (Reuters) -JPMorgan Chase sued Russia's state-owned VTB Bank on Thursday to halt its efforts to recover $439.5 million from an account that was blocked after Russia invaded Ukraine and VTB was hit with sanctions.  In a complaint filed in federal court in Manhattan, JPMorgan said VTB filed a lawsuit on Wednesday in Russia to recover the money in \"blatant breach\" of its agreement to have disputes addressed in New York.  The largest U.S. bank said American law prohibits it from releasing the $439.5 million, and VTB, Russia's second-largest bank, will try to seize its assets abroad if it prevails in the Russia lawsuit."}, {"date": "20240418105930", "headline": "Relatively High Chance of No Rate Cuts This Year, JPMorgan’s Pinto Says", "summary": "(Bloomberg) -- The Federal Reserve may not cut interest rates at all this year with inflation remaining high, said JPMorgan Chase & Co. President Daniel Pinto.Most Read from BloombergDubai Grinds to Standstill as Flooding Hits CityElon Wants His Money BackRecord Rainfall in Dubai? Blame Climate Change, Not Cloud SeedingSingapore Loses ‘World’s Best Airport’ Crown to QatarRed Lobster Considers Bankruptcy to Deal With Leases and Labor Costs“It may take a bit longer until they can cut rates,” Pinto"}, {"date": "20240418112708", "headline": "Treasuries Stumble on Mere Mention of Fed Rate Hike by Williams", "summary": "(Bloomberg) -- The US bond market’s recovery was cut short by a Federal Reserve official’s mere mention of the possibility of an interest-rate increase.Most Read from BloombergElon Wants His Money BackDubai Grinds to Standstill as Flooding Hits CityRecord Rainfall in Dubai? Blame Climate Change, Not Cloud SeedingSingapore Loses ‘World’s Best Airport’ Crown to QatarRed Lobster Considers Bankruptcy to Deal With Leases and Labor CostsIn response to a question during a conference in Washington, New"}, {"date": "20240418112841", "headline": "UPDATE 1-JPMorgan Chase sues Russia's VTB Bank over effort to unfreeze assets", "summary": "JPMorgan Chase sued Russia's state-owned VTB Bank on Thursday to halt its efforts to recover $439.5 million from an account that was blocked after Russia invaded Ukraine and VTB was hit with sanctions.  In a complaint filed in federal court in Manhattan, JPMorgan said VTB filed a lawsuit on Wednesday in Russia to recover the money in \"blatant breach\" of its agreement to have disputes addressed in New York."}, {"date": "20240418180100", "headline": "Bitcoin's latest 'halving' has arrived. Here's what you need to know", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418180100", "headline": "Bitcoin's next 'halving' is right around the corner. Here's what you need to know", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418191500", "headline": "Big banks have been a bright spot in tough week for markets", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418200900", "headline": "ShipBob selects JPMorgan to lead its planned IPO, Bloomberg reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418201900", "headline": "Regulators said to revive bid to rein in Wall Street bonus payouts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418205600", "headline": "Dow up 170 points on gains for shares of American Express, JPMorgan Chase", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418225300", "headline": "IN THE KNOW: L'Oreal pleases with high quality, broad-based sales beat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418234041", "headline": "Market Correction Expected: 20 Stocks To Buy If It Worsens", "summary": "A market correction of 10% or more occurs every 1.2 years, re-adjusting valuations and setting the stage for the next leg up. Click here for a detailed review."}, {"date": "20240419000700", "headline": "3 Stocks With the Most Potential to Plunge on Q1 Earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419013200", "headline": "Morning Brew: Tech Giants Lead Market Movements Amid Key Announcements", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419031900", "headline": "US Banks Accelerate Preferred Stock Deals Amid Rate Cut Speculation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419034200", "headline": "Could SoFi Become the Next JPMorgan Chase?", "summary": "SoFi has grown rapidly, but it's important to realize just how small it still is."}, {"date": "20240419051047", "headline": "JPMorgan, Russia’s VTB Bank sue each other", "summary": "VTB sued JPMorgan in Russia to regain access to assets frozen due to sanctions violations. JPMorgan countersued, saying VTB breached a 2008 agreement to handle any issues in New York."}, {"date": "20240419051500", "headline": "American Express Surpasses Q1 Earnings With Robust Member Spending", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419134644", "headline": "ShipBob Picks JPMorgan to Lead IPO As Soon As Late 2024", "summary": "(Bloomberg) -- E-commerce fulfillment service provider ShipBob Inc. has chosen JPMorgan Chase & Co. to lead its planned initial public offering, people familiar with the situation said. Most Read from BloombergElon Wants His Money BackNew York’s Rich Get Creative to Flee State Taxes. Auditors Are On to ThemDubai Grinds to Standstill as Flooding Hits City‘Mag Seven’ Get Crushed Before Next Week’s Results: Markets WrapIsrael Reported to Have Launched Retaliatory Strike on IranChicago-based ShipBob"}, {"date": "20240419152200", "headline": "JPMorgan Loses Multiple Former First Republic Advisor Teams With More Than $13 Billion in Assets", "summary": "JPMorgan  Chase’s wealth management business lost four large financial advisor teams overseeing a total of approximately $13.5 billion in assets to three rivals, including Merrill Lynch.  All the advisors who left on Friday once worked at  First Republic Bank  the troubled lender that was engulfed in the regional bank crisis and bought by JPMorgan almost a year ago.  The losses represent a setback for JPMorgan, which has been striving to build its wealth management business."}, {"date": "20240419192000", "headline": "The Nasdaq Plummets As Market Leader Nvidia Drops 10%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419204800", "headline": "SPDR ETF Report For Friday, April 19", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419225900", "headline": "3 Finance Stocks to Consider as Earnings Approach", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419233200", "headline": "LNG Export Clash: JPMorgan’s Top 3 Gas Stock Picks to Ride Out the Storm", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420014400", "headline": "Why I Keep Buying This Ultra-High-Yielding ETF for Passive Income", "summary": "The JPMorgan Equity Premium Income ETF produces a lucrative monthly passive income stream."}, {"date": "20240420033000", "headline": "Wall Street Has Abandoned Wall Street", "summary": "ON WALL STREET—America’s biggest bank is calling it quits on the street where American finance was born.  JPMorgan Chase  closed its branch Friday at 45 Wall St., ending more than 150 years of physical ties between the bank and the street that is a catchall term for the global money business.  The majority of the banks and brokerages that once populated Wall Street are already gone, finding new homes across Manhattan or beyond."}, {"date": "20240420232500", "headline": "Opening Day: Ibotta soars in strong market debut", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421010500", "headline": "‘Punishing myself would not help’: My credit card was stolen — the theft revealed lots of nasty surprises about my finances", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421011100", "headline": "Bull Market Buys: 3 Dow Stocks to Own for the Long Run", "summary": "If you don't know where to begin your search for long-term blue chip holdings, the 30 stocks that make up the Dow Jones Industrial Average are a great starting point."}, {"date": "20240421022100", "headline": "3 Things Billionaire CEO Jamie Dimon Wants You to Know", "summary": "The JPMorgan Chase CEO dropped some pearls of wisdom in his latest shareholder letter."}, {"date": "20240421040500", "headline": "Let's Spill The Tea: Top Consumer Tech News From Last Week That You Should Know", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421115515", "headline": "Dimon Meets With Development Bank Leaders Seeking Private Money", "summary": "(Bloomberg) -- JPMorgan Chase & Co. Chief Executive Officer Jamie Dimon met with executives from the World Bank Group and several other multilateral development lenders as they seek to pull more private money into initiatives across emerging markets.Most Read from BloombergTikTok to Remove Executive Tasked With Fending Off US ClaimsElon Musk’s Robotaxi Dreams Plunge Tesla Into ChaosTesla Spends Weekend Cutting Prices of Cars and FSD SoftwareThe Fed’s Forecasting Method Looks Increasingly Outdate"}, {"date": "20240421193600", "headline": "Goldman Sachs, JPMorgan Chase share gains lead Dow's 420-point rally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421211700", "headline": "Goldman Sachs, JPMorgan Chase share gains contribute to Dow's 314-point jump", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421225800", "headline": "JTC sights acquisition to expand US trust administration services", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422003000", "headline": "US consumers on lower incomes face loan stress while banks pull back", "summary": "U.S. borrowers on lowerincomes are increasingly struggling to keep up with their loanpayments, according to recent data and bank executives,prompting banks to become more cautious about dishing out..."}, {"date": "20240422003711", "headline": "Analysis-US consumers on lower incomes face loan stress while banks pull back", "summary": "U.S. borrowers on lower incomes are increasingly struggling to keep up with their loan payments, according to recent data and bank executives, prompting banks to become more cautious about dishing..."}, {"date": "20240422013100", "headline": "Morning Brew: Tech Giants Lead Market Movements Amid Earnings Reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422020016", "headline": "Why the stock market is having 'digestion problems' this earnings season", "summary": "After a strong market rally to start 2024, investors haven't been impressed by corporate earnings so far this season, even when they've been solid."}, {"date": "20240422023901", "headline": "Buyout Firm CVC Sets Price Range for €1.6 Billion Dutch IPO", "summary": "(Bloomberg) -- CVC Capital Partners and some of its investors are seeking to raise €1.6 billion ($1.7 billion) in an initial public offering in Amsterdam, as the buyout firm moves ahead with its long-delayed listing plans.Most Read from BloombergTrump Has Only $6.8 Million for Legal Fees With Trial UnderwayTikTok to Remove Executive Tasked With Fending Off US ClaimsChina Is Front and Center of Gold’s Record-Breaking RallyTesla Spends Weekend Cutting Prices of Cars and FSD SoftwareThe Fed’s Forec"}, {"date": "20240422042007", "headline": "Is JPMorgan Diversified Return Emerging Markets Equity ETF (JPEM) a Strong ETF Right Now?", "summary": "Smart Beta ETF report for JPEM"}, {"date": "20240422085748", "headline": "Forget Big Tech Earnings, Buy Income Instead", "summary": "Big tech earnings are approaching, but I'm not betting on them. Click here for the 2 high income stocks and one asset category that offers high yield."}, {"date": "20240422192000", "headline": "CFTC said to be probing big banks' confidential agreements in swaps, clearing businesses", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422192009", "headline": "Milei Trumpets Quarterly Budget Surplus in Argentina TV Address", "summary": "(Bloomberg) -- President Javier Milei announced Argentina’s first quarterly fiscal surplus since 2008 during a televised speech, promising his commitment to eliminating deficits wouldn’t waver throughout his term.Most Read from BloombergTrump Has Only $6.8 Million for Legal Fees With Trial UnderwayRay Dalio’s Famous Trade Is Sputtering and Investors Are BailingStocks Climb as US Earnings Kick Into High Gear: Markets WrapRussians Transform Dubai as They Flee Putin’s War: Photo EssaySea Billionair"}, {"date": "20240422194700", "headline": "Jamie Dimon praises House leaders for Ukraine, Israel aid deal, but flags difficulty of getting anything done in the U.S.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422205100", "headline": "Regulators probe potential use by big banks of nondisclosure agreements to discourage whistleblowers: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422222513", "headline": "JPMorgan Leads All Banks In AI World", "summary": "JPMorgan Chase leads in commercial bank AI adoption and performance, emphasizing responsible practices, achieving a 21% return on equity. Read more here."}, {"date": "20240422225400", "headline": "UBS Group Eyeing West? Plans New Office In Menlo Park, Hires Barclay's Lynch, Silicon Valley Expansion In Sight: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422230400", "headline": "3 Best Blue-Chip Stocks to Buy in April 2024, According to Analysts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423001300", "headline": "Halving Riches: The Top 3 Bitcoin Miners to Own in April", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423025629", "headline": "MOVES-JPMorgan China names new heads for China investment banking arm", "summary": "JPMorgan Chase & Co appoints Lu Fang to chair the board of its China investment banking arm, replacing former chair Park Pu, according to a company memo reviewed by Reuters and confirmed by a company spokesperson.  Greg Yu, recently deputy general manager of J.P. Morgan Securities China Company (JPMSC), has been promoted to general manager, according to the Memo issued on Wednesday."}, {"date": "20240423025753", "headline": "JPMorgan China names new heads of China securities unit", "summary": "JPMorgan Chase & Co appoints Lu Fang to chair the board of its China securities arm, replacing former chair Park Pu, according to a company memo reviewed by Reuters and confirmed by a company spokesperson.  Greg Yu, recently deputy general manager of J.P. Morgan Securities China Company, has been promoted to general manager, according to the memo issued on Wednesday.  The securities unit, which JPMorgan won the approval in 2021 to convert from a joint venture to a wholly owned subsidiary, employed 210 staff in China at the end of 2022, one of the largest among foreign securities firms."}, {"date": "20240423034128", "headline": "CORRECTED-MOVES-JPMorgan China names new heads of China securities unit", "summary": "JPMorgan Chase & Co appoints Lu Fang to chair the board of its China securities arm, replacing former chair Park Pu, according to a company memo reviewed by Reuters and confirmed by a company spokesperson.  Greg Yu, recently deputy general manager of J.P. Morgan Securities China Company, has been promoted to general manager, according to the memo issued on Wednesday.  The securities unit, which JPMorgan won the approval in 2021 to convert from a joint venture to a wholly owned subsidiary, employed 210 staff in China at the end of 2022, one of the largest among foreign securities firms."}, {"date": "20240423053400", "headline": "Stocks with the least price swings, most attractive option-sale candidates - JPM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423060000", "headline": "JPMorgan Chase Opens the Doors of Its New Glasgow Office", "summary": "GLASGOW, Scotland, April 23, 2024--JPMorgan Chase will today welcome employees and guests to a ribbon-cutting ceremony at its new state-of-the-art technology home in Glasgow. The building is located on Argyle Street in the heart of Glasgow’s International Finance District, and will bring employees together in one modern building after the firm had outgrown its previous premises."}, {"date": "20240423060700", "headline": "JPMorgan Chase Says Buy These 3 Stocks for Double-Digit Returns", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423061000", "headline": "JPMorgan CEO Jamie Dimon: U.S. economy is booming, but beware of fiscal dominance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423063019", "headline": "JPMorgan CEO Dimon says US economy is booming", "summary": "JPMorgan Chase CEO JamieDimon said the U.S. economy was booming and consumer spendingcontinued to be resilient. The U.S. economic boom is unbelievable, Dimon told theEconomic Club of..."}, {"date": "20240423095658", "headline": "Big Banks Face Probe Over Non-Disclosure Agreements in Swaps, Clearing Businesses", "summary": "(Bloomberg) -- A top financial regulator is asking large Wall Street banks for non-disclosure agreements in their swaps and clearing businesses to see whether they muzzle would-be whistleblowers.Most Read from BloombergRay Dalio’s Famous Trade Is Sputtering, Investors BailingTesla Stock in ‘No Man’s Land’ After 43% Rout Ahead of EarningsBillionaire Pinaults Fight to Pull Gucci Off the Discount RackApple’s China iPhone Sales Dive 19% in Worst Quarter Since 2020‘Magnificent Seven’ Roar Hours Away"}, {"date": "20240423105705", "headline": "Market Chatter: CFTC Asks Big Banks for Nondisclosure Agreements in Swaps, Clearing Amid Whistleblower Concerns", "summary": "Market Chatter: CFTC Asks Big Banks for Nondisclosure Agreements in Swaps, Clearing Amid Whistleblower Concerns"}, {"date": "20240423114341", "headline": "UPDATE 2-JPMorgan CEO Dimon says US economy is booming", "summary": "JPMorgan Chase CEO Jamie Dimon expressed confidence in a robust U.S. economy backed by strong employment and healthy consumer finances.  The U.S. economic boom is \"unbelievable,\" Dimon said at an Economic Club of New York event on Tuesday.  Dimon, who has run the largest U.S. lender for more than 18 years, has cautioned that inflation could be more persistent than expected, keeping interest rates higher for longer."}, {"date": "20240423115443", "headline": "Big banks face probe over NDAs in swaps, clearing businesses, Bloomberg reports", "summary": "CFTC is asking banks for non-disclosure agreements in their swaps and clearing businesses, and has also sought employment and customer agreements in those businesses, the report added, citing people familiar with the matter.  JPMorgan and Citigroup did not immediately respond to Reuters requests for comment, while CFTC and BofA declined to comment."}, {"date": "20240423122241", "headline": "Jamie Dimon is worried the US economy is headed back to the 1970s", "summary": "JPMorgan's CEO is concerned the US economy could be in for a repeat of the stagflation that hampered the country during the 1970s."}, {"date": "20240423124900", "headline": "JPMorgan’s ‘Bloody Friday’: Why Several Top Financial Advisors Jumped Ship the Same Day", "summary": "Six teams managing nearly $15 billion in total assets quit JPMorgan Chase’s brokerage unit to join competitors last Friday. Here’s what may have triggered their departures."}, {"date": "20240423135840", "headline": "UPDATE 1-Big banks face probe over NDAs in swaps, clearing businesses, Bloomberg reports", "summary": "The Commodity Futures Trading Commission (CFTC) has reached out to a number of banks, including JPMorgan Chase, Bank of America and Citigroup to see if they have been preventing would-be whistleblowers from speaking out, Bloomberg News reported on Wednesday.  CFTC is asking banks for non-disclosure agreements in their swaps and clearing businesses, and has also sought employment and customer agreements in those businesses, the report added, citing people familiar with the matter."}, {"date": "20240423175529", "headline": "JPMorgan: Solid Dividend Growth Stock With More Upside Potential", "summary": "JPMorgan is a strong dividend growth stock that has a low starting yield but delivers solid dividend growth. See why JPM is a Buy."}, {"date": "20240423190600", "headline": "JPMorgan Chase & Co's 4.55% Dep Shares Non-Cumulative Preferred Stock Series JJ Shares Cross 5.5% Yield Mark", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423203900", "headline": "Prepare for a Charge: 3 Electric Vehicle Stocks to Buy Before an EV Rebound", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423233435", "headline": "JPMorgan Rehires India ECM Head Abhinav Bharti in Management To and Fro", "summary": "(Bloomberg) -- Follow Bloomberg India on WhatsApp for exclusive content and analysis on what billionaires, businesses and markets are doing. Sign up here.Most Read from BloombergTaylor Swift Is Proof That How We Critique Music Is BrokenBiden’s New Chopper Is Demoted After Scorching White House LawnBiden’s Gains Against Trump Vanish on Deep Economic Pessimism, Poll ShowsTesla Soars as Musk’s Cheaper EVs Calm Fears Over StrategyBillionaire Pinaults Fight to Pull Gucci Off the Discount RackJPMorgan"}, {"date": "20240423235000", "headline": "Cashing In on Earnings: 3 Financial Stocks Set to Surge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424013200", "headline": "Morning Brew: Tesla's Innovative Moves Spark Market Interest", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424020127", "headline": "Wall Street bosses tested by calls to strip them of power", "summary": "Some of Wall Street’s most powerful bosses are facing new shareholder proposals this spring that would strip them of power by separating CEO and chairman seats."}, {"date": "20240424030751", "headline": "Russian court orders seizure of JPMorgan Chase funds in VTB lawsuit", "summary": "A Russian court has ordered the seizure of funds in JPMorgan Chase bank accounts in Russia, court filings showed on Wednesday, in a lawsuit filed by state-owned bank VTB as it seeks to regain funds blocked abroad.  JP Morgan Chase last week sued VTB in New York to halt its efforts to recover $439.5 million from an account that was blocked after Russia despatched its army to Ukraine in 2022 and VTB was hit with sanctions."}, {"date": "20240424050031", "headline": "Institutional investors have a lot riding on JPMorgan Chase & Co. (NYSE:JPM) with 73% ownership", "summary": "Key Insights Significantly high institutional ownership implies JPMorgan Chase's stock price is sensitive to their..."}, {"date": "20240424084211", "headline": "Top M&A financial advisers in Asia-Pacific for Q1 2024 revealed", "summary": "GlobalData’s financial advisers league table analyses top advisers by volume, deals, and mergers and acquisitions (M&A)."}, {"date": "20240424090639", "headline": "S&P 500 Is Ripe for Further Gains, JPMorgan’s Trading Desk Says", "summary": "(Bloomberg) -- A JPMorgan Chase & Co. indicator is flashing a resounding buy signal in US stocks, after it hit a threshold that typically precedes better-than-average gains.Most Read from BloombergTaylor Swift Is Proof That How We Critique Music Is BrokenBiden’s Gains Against Trump Vanish on Deep Economic Pessimism, Poll ShowsBiden’s New Chopper Is Demoted After Scorching White House LawnTesla Soars as Musk’s Cheaper EVs Calm Fears Over StrategyThe bank’s US Tactical Positioning Monitor, which m"}, {"date": "20240424101916", "headline": "Goldman's David Solomon defeats vote on CEO-chair split even as support for it increases", "summary": "David Solomon defeated a proposal seeking to separate his roles as CEO and chairman of Goldman Sachs, but the measure received double the support it did in 2023."}, {"date": "20240424104719", "headline": "JPMorgan Funds Seized in Russia in Legal Fight with State-Owned Bank Over Sanctions", "summary": "JPMorgan Funds Seized in Russia in Legal Fight with State-Owned Bank Over Sanctions"}, {"date": "20240424114703", "headline": "Sector Update: Financial Stocks Retreat Wednesday Afternoon", "summary": "Sector Update: Financial Stocks Retreat Wednesday Afternoon"}, {"date": "20240424151716", "headline": "JPMorgan Chase unveils its Glasgow office", "summary": "JPMorgan has branched out into Glasgow."}, {"date": "20240424214000", "headline": "JPMorgan Chase & Co. stock outperforms market on strong trading day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424231700", "headline": "Rivian Stock: Wall Street’s Whipping Boy or Sleeping Giant?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424235111", "headline": "India Stands Out for Cheap Bonds as Index Date Nears", "summary": "(Bloomberg) -- Follow Bloomberg India on WhatsApp for exclusive content and analysis on what billionaires, businesses and markets are doing. Sign up here.Most Read from BloombergBiden’s Gains Against Trump Vanish on Deep Economic Pessimism, Poll ShowsZuckerberg Asks for Patience After Meta’s AI Push Irks InvestorsTaylor Swift Is Proof That How We Critique Music Is BrokenMalaysia in Talks With Tycoons on Casino to Revive $100 Billion Forest CityTech Giants Hit in Late Hours After Meta’s Outlook:"}, {"date": "20240425010000", "headline": "Russia's VTB Bank eyes record 2024 profits despite Q1 drop", "summary": "Russia's second-largest bank VTB reported a 17% drop in first-quarter net profit to 122.4 billion roubles ($1.33 billion), CFO Dmitry Pyanov said, but expects to make record profits in 2024 as net fee and commission income continues growing.  VTB made a record 432.2 billion roubles in 2023, rebounding from a sanctions-induced loss of 667.5 billion roubles the year before, but still expects to surpass that total in 2024."}, {"date": "20240425010200", "headline": "Jamie Dimon thinks the odds of a ‘soft landing’ are about half of what Wall Street expects", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425013100", "headline": "Morning Brew: Tech Titans Lead Market Movements Amid Key Updates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425021000", "headline": "March's Dividend Portfolio Update Sets New All-Time Record - 100 Holdings, 21 Buys", "summary": "Portfolio changes in March focus on BDCs, aiming to increase dividend income by at least $100 each month. Click here for a detailed analysis."}, {"date": "20240425030000", "headline": "JPMorgan CEO Jamie Dimon Gives a Soft Landing Long Odds", "summary": "Jamie Dimon says the U.S. consumer is in good shape right now, but a huge fiscal deficit and geopolitical challenges make him cautious about the future. The JPMorgan Chase CEO sits down with WSJ Editor in Chief Emma Tucker. Photo: Adam Falk"}, {"date": "20240425030756", "headline": "JPMorgan Chase : 2023 Environmental Social Governance Report", "summary": "2023 Environmental Social Governance Report ..."}, {"date": "20240425033400", "headline": "Unpacking the Latest Options Trading Trends in JPMorgan Chase", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425055205", "headline": "Russian court orders seizure of nearly $440M in JPMorgan funds", "summary": "The ongoing legal battle between state-owned VTB Bank and the largest U.S. bank revolves around funds frozen in the wake of Russia’s invasion of Ukraine and subsequent sanctions."}, {"date": "20240425080506", "headline": "20 Most Profitable Banks in the US in 2024", "summary": "In this piece, we will take a look at the 20 most profitable banks in the US in 2024. If you want to skip our coverage of the latest news in the US banking industry, then you can take a look at the 5 Most Profitable Banks in the US in 2024. The US banking […]"}, {"date": "20240425095700", "headline": "TRADING UPDATES: Norcros sells Johnson Tiles UK; Trifast trading well", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425195600", "headline": "JPMorgan Chase & Co.: Strong Buy Rating Affirmed Amid Solid Financial Performance and Positive Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425220800", "headline": "JPM CEO Warns: Soft Landing Is Unlikely Amid Geopolitical Turmoil", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425225500", "headline": "J.P Morgan trades in the green for seven consecutive days", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425233500", "headline": "3 Recession-Proof Stocks to Add to Your Portfolio in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426002000", "headline": "Weitz Conservative Allocation Fund Q1 2024 Commentary", "summary": "The Conservative Allocation Fund's Institutional Class returned +4.22% for the first quarter compared to +2.52% for the Morningstar Moderately Conservative Target Risk Index."}, {"date": "20240426003400", "headline": "The Top 3 Quantum Computing Stocks to Buy in April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426024100", "headline": "3 Stocks to Buy if You Want to Turn Your $1,000 into $10,000 Within 2 Years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426033900", "headline": "Holding 10,000 Dogecoin Could Make You A Millionaire, Predicts Crypto Analyst", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426060310", "headline": "JPMorgan's Dimon says stagflation is possible outcome for US economy, but he hopes for soft landing", "summary": "NEW YORK — JPMorgan CEO Jamie Dimon says stagflation could be one of a number of possible outcomes for the U.S. economy as the Federal Reserve attempts to tame stubbornly high consumer prices...."}, {"date": "20240426063400", "headline": "JP Morgan Chase Launches Innovative Community Center Branch In Bronx, Investing $5M To Enhance Financial Access", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426064027", "headline": "JPMorgan's Dimon hopes for soft landing for US economy but says stagflation is a possible scenario", "summary": "NEW YORK — JPMorgan Chase CEO Jamie Dimon says he’s hopeful the Federal Reserve can bring down inflation without causing a recession but wouldn’t rule out more troubling possibilities, such..."}, {"date": "20240426073311", "headline": "Treasuries gain as traders find relief in key inflation readings", "summary": "US bond yields retreated from their highest levels since November as the PCE print came in less hot than feared."}, {"date": "20240426090000", "headline": "Chase Opens Innovative Branch in Bronx’s Grand Concourse Neighborhood", "summary": "NEW YORK, April 26, 2024--JPMorgan Chase leaders and community partners cut the ribbon on a new Community Center branch in the Grand Concourse neighborhood of the Bronx. This branch, the second of its kind in the city, is built to expand access to banking, tools and advice to help customers get on a path to financial health and resilience."}, {"date": "20240426094121", "headline": "15 Fastest Aging Countries in the World", "summary": "In this article, we will take a look at the 15 fastest aging countries in the world. If you want to skip our discussion on the aging trends, you can go directly to the 5 Fastest Aging Countries in the World. According to projections by the United Nations (UN), the world’s population will reach 10 […]"}, {"date": "20240426155111", "headline": "Why it may be time to start looking at value stocks", "summary": "Stocks (^DJI,^GSPC, ^IXIC) ended the week higher thanks to some strong quarterly reports from the likes of Alphabet (GOOG, GOOGL) and Microsoft (MSFT). Value stocks have been out of favor for the last few years, but value investor John Bailer, Newton Investment Management Deputy Head of Equity Income and Portfolio Manager, thinks that is going to change. Bailer believes that the decade following the 2008 financial crisis was an \"anomaly\" rather than the norm given how low rates had to be to spur economic growth. He says that rates have tended to skew, historically, to 4%-5% and, in that environment, value stocks tend to be what works. \"I do think that, for lots of reasons, we're going to have a little more inflation, a little higher interest rates. Money isn't going to be free any longer. And value will come back into favor,\" Bailer claims. Watch the video above to hear why Bailer says JPMorgan Chase (JPM) is a value stock to consider. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Stephanie Mikulich."}, {"date": "20240427010300", "headline": "Why I Just Added This Ultra-High-Yield Dividend ETF to My Retirement Account", "summary": "The JPMorgan Nasdaq Equity Premium Income ETF offers a compelling blend of income and upside to my portfolio."}, {"date": "20240427032958", "headline": "Dividend Champion, Contender, And Challenger Highlights: Week Of April 28", "summary": "Stay updated on dividend activity for Dividend Champions, Contenders, and Challengers."}, {"date": "20240427064927", "headline": "12 Most Profitable Dividend Stocks To Invest In", "summary": "In this article, we discuss 12 most profitable dividend stocks to invest in. You can skip our detailed analysis of dividend stocks and their performance in the past, and go directly to read 5 Most Profitable Dividend Stocks To Invest In. According to numerous analysts, the US has managed to steer clear of a recession […]"}, {"date": "20240427212400", "headline": "Credit card delinquency rates fall in March as consumers keep spending", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427230000", "headline": "FVAL: Attractive Valuation Despite A Heavy Weight In Technology", "summary": "Fidelity Value Factor ETF selects stocks based on four valuation ratios, with a focus on large companies. Read why FVAL stock is a Hold."}, {"date": "20240427231700", "headline": "Opening Day: Rubrik jumps 20% in market debut", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428030000", "headline": "How Stock Markets Will Likely React After FOMC Announcement", "summary": "Investors should pay attention to inflation rates, employment strength, & consumer spending trends. Know more about upcoming Fed meeting and its impact on stock market."}, {"date": "20240428212200", "headline": "Scotiabank names Travis Machen to head Global Banking and Markets", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429000100", "headline": "The Art of Valuation: Discovering JPMorgan Chase & Co's Intrinsic Value", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429020000", "headline": "American Express Can Sustain Its Rally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429050003", "headline": "Is JPMorgan Large Cap Value Fund A (OLVAX) a Strong Mutual Fund Pick Right Now?", "summary": "Mutual Fund Report for OLVAX"}, {"date": "20240429054009", "headline": "JPMorgan Chase : Commits $10 Million to Support Affordable Housing", "summary": "COLUMBUS, OHIO - Increasing the number of affordable housing units in Central Ohio is the focus of a new $10 million commitment from JPMorgan Chase to the Affordable Housing Trust . This long..."}, {"date": "20240429060014", "headline": "Here's Why We Think JPMorgan Chase (NYSE:JPM) Is Well Worth Watching", "summary": "It's common for many investors, especially those who are inexperienced, to buy shares in companies with a good story..."}, {"date": "20240429062900", "headline": "Got $1,000? This ETF Could Turn It Into an $85 Annual Passive Income Stream.", "summary": "The JPMorgan Equity Premium Income ETF provides investors with premium passive income."}, {"date": "20240429063300", "headline": "Check Out What Whales Are Doing With JPM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429063900", "headline": "10 Financials Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429064800", "headline": "JPMorgan Chase Preferred Stock Series EE About To Put More Money In Your Pocket", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429070015", "headline": "JPMorgan Chase & Co. (JPM) is Attracting Investor Attention: Here is What You Should Know", "summary": "Recently, Zacks.com users have been paying close attention to JPMorgan Chase & Co. (JPM). This makes it worthwhile to examine what the stock has in store."}, {"date": "20240429075022", "headline": "Measures by Colombia stock exchange may allow it to stay in JPMorgan index -president", "summary": "Measures adopted by the Colombian stock exchange and securities issuers to improve liquidity could be enough for the country to hold onto its \"emerging market\" classification and stay in a key JPMorgan index, but more progress is needed, the stock exchange's president said.  Last year JPMorgan warned Colombia could be excluded from its MSCI emerging markets index and be downgraded to a frontier market due to declining liquidity.  The warning sparked a sharp drop in share prices across the stock exchange as a downgrade would drive away foreign investors guided by the bank's indexes."}, {"date": "20240429084500", "headline": "2 Artificial Intelligence (AI) Stocks to Buy Now That Could Make You a Fortune", "summary": "Here's how you can profit from this game-changing technology."}, {"date": "20240429093256", "headline": "JPMorgan-backed Brazilian digital bank C6 posts first-ever profit in Q1", "summary": "Brazilian digital bank C6, which is backed by JPMorgan Chase, posted its first ever profit in the first quarter, as its revenue increased and credit losses fell. C6 posted a 416..."}, {"date": "20240429112744", "headline": "JPMorgan Looks to Fend Off Goldman and Other Private Credit for $1 Billion", "summary": "(Bloomberg) -- JPMorgan Chase & Co.’s leveraged finance desk and Goldman Sachs Group Inc.’s private credit team are among the firms in discussions to lead a $1.05 billion financing for metal and hardware producer ASC Engineered Solutions, according to a person familiar with the matter. Most Read from BloombergTesla Soars on Tentative China Approval for Driving SystemStocks Trade for 390 Minutes a Day. Increasingly, Only 10 MatterUS Warns ICC Action on Israel Would Hurt Cease-Fire ChancesYen Spar"}, {"date": "20240429133000", "headline": "CORRECTED-JPMorgan-backed Brazilian digital bank C6 posts first-ever profit in Q1", "summary": "Brazilian digital bank C6, which is backed by JPMorgan Chase, posted its first ever profit in the first quarter, as its revenue increased and credit losses fell.  C6 posted a 461 million-real ($90 million) profit in the first quarter, compared to a $57.3 million loss a year earlier.  The Brazilian digital bank, which has around 30 million clients, had a $131.23 million loss last year."}, {"date": "20240429152536", "headline": "Carlyle Picks JPMorgan, Morgan Stanley for IPO or Sale of StandardAero", "summary": "(Bloomberg) -- Carlyle Group Inc. is working with JPMorgan Chase & Co. and Morgan Stanley on options for aircraft maintenance services provider StandardAero, according to people familiar with the matter.Most Read from BloombergTesla Soars on Tentative China Approval for Driving SystemStocks Trade for 390 Minutes a Day. Increasingly, Only 10 MatterYen Sparks Intervention Suspicion After U-Turn From 1990 LowsWhat 60,000 Headlines Say About the Fed’s Next MoveUS Warns ICC Action on Israel Would Hur"}, {"date": "20240429211200", "headline": "Market Crash Counterpunch: 3 Stocks to Buy for the Coming Downturn", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429235815", "headline": "Another Bank Failure, What It Means", "summary": "CRE delinquency rates continue to rise, and banks face large 'unrealized losses' on their bond portfolios due to higher interest rates. Click here for a detailed analysis."}, {"date": "20240430014900", "headline": "Delta Air Lines, JPMorgan And More On CNBC's 'Final Trades'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430034700", "headline": "FED PREVIEW: Another hold expected as rate cut hopes dwindle", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430040600", "headline": "Seven bank-stock picks as industry nears ‘positive inflections’", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430042006", "headline": "Is JPMorgan Diversified Return International Equity ETF (JPIN) a Strong ETF Right Now?", "summary": "Smart Beta ETF report for JPIN"}, {"date": "20240430061647", "headline": "UPDATE 3-BBVA, Sabadell to explore possible merger", "summary": "Spanish lender BBVA and smaller rival Sabadell said on Tuesday that they had started negotiations to explore a possible merger, triggering a rise of more than 7% in Sabadell's shares.  BBVA said it had conveyed to the chair of the board of directors of Banco Sabadell the interest of BBVA's board of directors \"in initiating negotiations to explore a potential merger transaction between the two entities\".  Sabadell confirmed that it had received an indicative written proposal from BBVA for a merger on Tuesday afternoon."}, {"date": "20240430094110", "headline": "JPMorgan broadens roles for sales executives", "summary": "JPMorgan Chase has expanded the roles of some executives in its sales department, the bank said in an internal memo seen by Reuters on Tuesday.  Matthieu Wiltz will become the sole head of credit, securitized products group and public finance sales.  Adam Englander has been named the head of cash equities, prime financial services, capital advisory and data and analytics sales, the memo said, while Brad Tully will lead the corporate and private side unit."}, {"date": "20240430094540", "headline": "JPMorgan broadens roles for sales executives, memo says", "summary": "Matthieu Wiltz will become the sole head of credit, securitized products group and public finance sales.  Adam Englander has been named the head of cash equities, prime financial services, capital advisory and data and analytics sales, the memo said, while Brad Tully will lead the corporate and private side unit."}, {"date": "20240430101528", "headline": "Cocoa Prices Swing Wildly as Liquidity Overshadows Supply Issues", "summary": "(Bloomberg) -- The cocoa market was whipsawed by extreme volatility in the futures market on Tuesday amid a lack of liquidity.Most Read from BloombergHSBC CEO Quinn Unexpectedly Steps Down After Almost 5 YearsBinance and CZ’s Fortunes Are Set to Grow, Even in JailWall Street Hit by Fed Jitters to Close Wild April: Markets WrapTesla Soars on Tentative China Approval for Driving SystemPot Stocks Surge on Report DEA Set to Reclassify MarijuanaAfter more than doubling this year, futures traded in Ne"}, {"date": "20240430170009", "headline": "JPMorgan’s Global Head of ETF Solutions Bryon Lake Exiting Firm", "summary": "(Bloomberg) -- Bryon Lake, JPMorgan Asset Management’s global head of ETF solutions, is departing the firm.Most Read from BloombergTesla Axes Supercharger Team in Blow to Broader EV MarketNYC Police Break Up Columbia Protest and Clashes Erupt at UCLALilly Soars as Forecast Boost Shows Weight-Loss Drugs’ PowerPot Stocks Surge on Report DEA Set to Reclassify MarijuanaAmazon Posts Biggest Cloud Sales Growth in Year on AI DemandSince assuming the role in the US in 2021, the managing director has led"}, {"date": "20240430190700", "headline": "JPMorgan Chase's Preferred Stock Series EE Shares Cross 6% Yield Mark", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501003200", "headline": "Stock Market Crash Alert: 3 Must-Buy Blue-Chip Stocks When Prices Plunge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501020123", "headline": "Whether Wall Street garden leaves survive non-compete ban is an 'open question'", "summary": "Some 'garden leave' agreements that Wall Street uses to protect secrets are expected to survive the FTC's new non-compete ban, but some probably won't."}, {"date": "20240501033700", "headline": "Around the world, workers are back in the office. Just not in America.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501040011", "headline": "3 stocks with the biggest gains took April's biggest losses", "summary": "The stock market's very rough April saw some of the biggest gainers of the first three months take some of the biggest dings to their market caps. And at the same time, some of the sectors that struggled in Q1 saw a similar reversal of fortune in April."}, {"date": "20240501043200", "headline": "3 Top ETFs to Buy for Passive Income in May", "summary": "These ETFs provide investors with above-average income streams."}, {"date": "20240501044205", "headline": "JPMorgan’s ETF head quits abruptly after presiding over rapid growth", "summary": "The head of JPMorgan’s rapidly growing exchange traded funds business, Bryon Lake, has left the firm suddenly after steering the manager’s active..."}, {"date": "20240501052700", "headline": "Federal Reserve moving forward with bank capital rules, Bloomberg says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501064500", "headline": "U.S. banking regulators push to rework Basel III endgame rule - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501083753", "headline": "US Holds Quarterly Debt Sale Steady, Details Buybacks Start", "summary": "(Bloomberg) -- The US Treasury left its quarterly issuance of longer-term debt unchanged on Wednesday, with the government set to benefit from an expected slowdown in the Federal Reserve’s shrinking holdings of Treasuries.Most Read from BloombergTesla Axes Supercharger Team in Blow to Broader EV MarketNYPD Arrests Over 300 Protesters in Crackdown on College CampusesThe Ozempic Effect: How a Weight Loss Wonder Drug Gobbled Up an Entire EconomyFed to Signal Delay of Interest-Rate CutsLilly Soars a"}, {"date": "20240501103801", "headline": "JPMorgan Chase to pay $100 million to US regulator over trade reporting gaps", "summary": "JPMorgan Chase expects toenter into a resolution with a third U.S. regulator that willrequire it to pay a civil penalty of $100 million for reportingincomplete trading data to surveillance..."}, {"date": "20240501104708", "headline": "JPMorgan Chase : JPMC&Co. 1Q 2024 Form 10-Q", "summary": "UNITED STATES SECURITIES AND EXCHANGE COMMISSION Washington, D.C. 20549 FORM 10-Q Quarterly..."}, {"date": "20240501144154", "headline": "UPDATE 2-JPMorgan says its Russia assets may be seized after lawsuits in Russia, US", "summary": "JPMorgan Chase said in a filing on Wednesday that its assets in Russia may be seized after lawsuits in Russian and U.S. courts.  The bank faces several legal challenges over its Russian dealings after the U.S. and European nations imposed economic sanctions on Russia in response to its invasion of Ukraine.  The value of claims and orders to freeze assets exceeds JPMorgan's available assets in Russia, the largest U.S. lender said."}, {"date": "20240501145618", "headline": "JPMorgan Expects to Pay $100 Million in a Third Surveillance Case", "summary": "(Bloomberg) -- JPMorgan Chase & Co., fresh off settling complaints from two regulators over gaps in its trade-surveillance program, expects to pay an additional $100 million to settle a related inquiry from another watchdog.Most Read from BloombergUS and Saudis Near Defense Pact Meant to Reshape Middle EastTesla Axes Supercharger Team in Blow to Broader EV MarketNYPD Arrests Over 300 Protesters in Crackdown on College CampusesThe Ozempic Effect: How a Weight Loss Wonder Drug Gobbled Up an Entire"}, {"date": "20240501150500", "headline": "JPMorgan Chase Files Form 10-Q for the Quarter Ended March 31, 2024", "summary": "NEW YORK, May 01, 2024--JPMorgan Chase & Co. (NYSE: JPM) (\"JPMorgan Chase\" or the \"Firm\") has filed its Quarterly Report on Form 10-Q for the quarter ended March 31, 2024 with the SEC. The report is available on the SEC's website at www.sec.gov and will be available on the Firm's Investor Relations website at www.jpmorganchase.com/ir under SEC Filings & Other Disclosures."}, {"date": "20240501180000", "headline": "India’s Anthill Seeks $100 Million for Private Credit Cross Fund", "summary": "(Bloomberg) -- Follow Bloomberg India on WhatsApp for exclusive content and analysis on what billionaires, businesses and markets are doing. Sign up here.Most Read from BloombergUS and Saudis Near Defense Pact Meant to Reshape Middle EastJerome Powell Offered Markets a Reprieve. It Vanished in a BlinkTesla Axes Supercharger Team in Blow to Broader EV MarketNYPD Arrests Over 300 Protesters in Crackdown on College CampusesThe Ozempic Effect: How a Weight Loss Wonder Drug Gobbled Up an Entire Econo"}, {"date": "20240501200100", "headline": "Latest JPMorgan Chase (NYSE:JPM) Trading Settlement Sends Shares Down", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501210600", "headline": "Here's How Much $100 Invested In JPMorgan Chase 10 Years Ago Would Be Worth Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501232700", "headline": "JPMorgan Just Cut Its Price Target on These 3 Stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502001800", "headline": "3 Value Stocks to Snap Up During the Q2 Market Dip", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502002213", "headline": "Russian court cancels seizure of part of JPMorgan bank's funds in dispute with Russia's VTB", "summary": "A Russian court cancelled the seizure of part of JPMorgan Chase's funds in Russia in a dispute with Russian state-owned bank VTB, according to a court document.  JPMorgan said in a filing on Wednesday that its assets in Russia may be seized after lawsuits in Russian and U.S. courts.  The bank faces several legal challenges over its Russian dealings after the U.S. and European nations imposed economic sanctions on Russia in response to its invasion of Ukraine."}, {"date": "20240502003222", "headline": "Russian court cancels seizure of some JPMorgan funds in VTB dispute", "summary": "MOSCOW (Reuters) -A Russian court has cancelled the seizure of part of JPMorgan's funds in Russia in a lawsuit brought by state lender VTB, court documents show.  However, the ruling only applies to funds held by JPMorgan in so-called type C accounts which cannot be transferred out of Russia, and in a current account used to pay staff and taxes."}, {"date": "20240502020016", "headline": "Whether Wall Street garden leaves survive noncompete ban is an 'open question'", "summary": "Some 'garden leave' agreements that Wall Street uses to protect secrets are expected to survive the FTC's new noncompete ban, but some probably won't."}, {"date": "20240502024019", "headline": "UPDATE 1-Russian court cancels seizure of some JPMorgan funds in VTB dispute", "summary": "A Russian court has cancelled the seizure of part of JPMorgan's funds in Russia in a lawsuit brought by state lender VTB, court documents show.  However, the ruling only applies to funds held by JPMorgan in so-called type C accounts which cannot be transferred out of Russia, and in a current account used to pay staff and taxes."}, {"date": "20240502031300", "headline": "What's Driving ING Groep NV's Surprising 25% Stock Rally?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502040200", "headline": "JPMorgan expects to pay $100M in another trading surveillance settlement", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502042100", "headline": "Worried About Inflation? 3 Stocks Built to Thrive in a High-Price Environment", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502061112", "headline": "Chase opens Bronx branch", "summary": "JPMorgan Chase recently opened a branch in the Grand Concourse neighborhood of The Bronx, New York. The branch features a modern design for better community engagement, mentoring and financial advice,..."}, {"date": "20240502061458", "headline": "Russian court cancels seizure of some JPMorgan funds", "summary": "The court had ordered seizure of $439.5 million late last month in an ongoing sanctions dispute between JPMorgan and Russia-owned VTB Bank."}, {"date": "20240502083548", "headline": "Q3 2024 Wolfspeed Inc Earnings Call", "summary": "Q3 2024 Wolfspeed Inc Earnings Call"}, {"date": "20240502093843", "headline": "How Many Shares Of JPMorgan Chase & Co Do You Need To Earn $100 Per Month In Dividend Income?", "summary": "If you’re looking for a reliable dividend-paying stock, JPMorgan Chase & Co (NYSE:JPM) might be a great choice. As one of the largest financial institutions in the world, JPMorgan Chase has a strong track record of consistently paying and increasing ..."}, {"date": "20240502113550", "headline": "FNDB: Outperforming Most Passively Managed Value ETFs", "summary": ""}, {"date": "20240502151500", "headline": "JPMorgan Chase to Present at the AllianceBernstein Strategic Decisions Conference", "summary": "NEW YORK, May 02, 2024--Jamie Dimon, Chairman and Chief Executive Officer of JPMorgan Chase & Co., will present at the AllianceBernstein Strategic Decisions Conference on Wednesday, May 29, 2024, at 9:00 a.m. (Eastern). The conference will be held at the New York Hilton Midtown in New York City."}, {"date": "20240502190200", "headline": "JPMorgan’s Regulatory Tightrope: Navigating Complex Compliance Amidst $30 Billion Share Buyback Initiative", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502200000", "headline": "Tackling Options Trading Tactics, The Outlook For Tech, & 2024 Market Trends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502230232", "headline": "Decoding JPMorgan Chase & Co (JPM): A Strategic SWOT Insight", "summary": "Insightful Analysis of JPMorgan Chase & Co's Financial Dynamics and Strategic Positioning"}, {"date": "20240502233600", "headline": "3 Top Fintech Stocks to Bank On Now", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503021252", "headline": "Bank of America: Wait For A Better Price", "summary": "Bank of America's Q1 2024 results showed negative revenue growth and a decline in net income. Find out why BAC stock is a Hold."}, {"date": "20240503034800", "headline": "JPMorgan Chase's Options: A Look at What the Big Money is Thinking", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503042600", "headline": "June 14th Options Now Available For JPMorgan Chase (JPM)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503050700", "headline": "Video: Dow Movers: JPM, AMGN", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503064500", "headline": "From Speculation To Revelation: JPMorgan Reportedly Unveils IndexGPT AI Tool", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503102000", "headline": "NEW YORK MARKET CLOSE: Dow up as soft jobs data revives rate cut hopes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503134645", "headline": "TD Bank's Fentanyl Probe: Assessing The Damage", "summary": "What are the risks and potential costs TD Bank may face due to its involvement in an alleged Fentanyl money-laundering scandal? Read my analysis of TD stock here."}, {"date": "20240503135600", "headline": "J.P. Morgan Sues to Derail Former First Republic Advisors’ Finra Arbitration Claims", "summary": "An attorney for the advisors says the lawsuit is “an impermissible attempt to interfere in an ongoing Finra arbitration.”"}, {"date": "20240503143200", "headline": "JPMorgan Chase Investor Day 2024", "summary": "NEW YORK, May 03, 2024--JPMorgan Chase & Co. (NYSE: JPM) (\"JPMorgan Chase\" or the \"Firm\") will host an Investor Day in New York City on Monday, May 20, 2024 at 8:00 a.m. (Eastern). Presentations by members of executive management are expected to conclude at approximately 1:00 p.m. (Eastern)."}, {"date": "20240503223412", "headline": "SPMO: Heavy Into TMT Stocks After The March Reconstitution", "summary": "Invesco S&P 500 Momentum ETF's recent slowdown despite AI and semiconductor stocks' strong performance. Learn more on SPMO ETF here."}, {"date": "20240504054000", "headline": "JPMorgan: A 6% Preferred Dividend Yield Remains Appealing", "summary": "JPMorgan's preferred share dividends are very well covered. Read why investors should look at the banking giant's preferreds for income."}, {"date": "20240504070019", "headline": "JPMorgan Chase (NYSE:JPM) shareholders have earned a 14% CAGR over the last five years", "summary": "When you buy and hold a stock for the long term, you definitely want it to provide a positive return. Furthermore..."}]}