{"news": [{"date": "20240421190300", "headline": "Chicago Pepsi drivers vote in favor of strike", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421234300", "headline": "Put $5,000 in These 7 Blue-Chip Stocks Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422010400", "headline": "5 Crash-Proof Stocks to Buy Immediately", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422015839", "headline": "Coca-Cola: I Expect Market-Beating Returns", "summary": "Coca-Cola now offers an above-average dividend yield and some valuation discounts amid an expensive overall market. Read more on KO stock here."}, {"date": "20240422234200", "headline": "The Top 3 Stocks for Beginners With Little Money in April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422235000", "headline": "PepsiCo tops organic sales expectations as international business shines", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423010000", "headline": "Dive Into Dividends: Top 10 Yield Stocks (SA Quant)", "summary": "Investors want high-yielding stocks with solid growth for a steady flow of income amid market volatility and inflation. Click here for 10 top stocks."}, {"date": "20240423023200", "headline": "Microsoft, Coca-Cola announce five-year strategic partnership", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423030300", "headline": "The 7 Best Positioned Dow Stocks for April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423030900", "headline": "Coca-Cola expects significant benefits from generative AI partnership with Microsoft", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423041500", "headline": "3 Super-Safe Stocks That Could Reach 70 Consecutive Years of Dividend Raises By 2032", "summary": "When it comes to reliable passive income, these three dividend-paying companies are best in breed."}, {"date": "20240423041600", "headline": "PepsiCo (PEP) Q1 Earnings: A Mixed Bag with a Focus on Recovery", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423042500", "headline": "Chicago Pepsi drivers vote in favor of strike - updated", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423042900", "headline": "Microsoft and Coca-Cola sign AI-led business optimisation partnership", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423050147", "headline": "Here's Why Coca-Cola (NYSE:KO) Can Manage Its Debt Responsibly", "summary": "Some say volatility, rather than debt, is the best way to think about risk as an investor, but Warren Buffett famously..."}, {"date": "20240423051005", "headline": "PepsiCo (PEP) Q1 Earnings and Revenues Beat Estimates", "summary": "PepsiCo (PEP) delivered earnings and revenue surprises of 5.92% and 0.62%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240423053400", "headline": "Stocks with the least price swings, most attractive option-sale candidates - JPM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423054921", "headline": "3 Warren Buffett Dividend Stocks Analysts Predict Will Grow By As Much As 19%", "summary": "Warren Buffett, with a formidable net worth exceeding $130 billion, remains a titan of investment. His acumen for selecting robust stocks has cultivated decades of trust and admiration. As the financial markets continuously shift, his insights and ..."}, {"date": "20240423055044", "headline": "Coca-Cola Company, Keurig Dr Pepper and PepsiCo - America's Leading Beverage Companies Taking Aggressive Action to Reduce Use of New Plastic in Bottles", "summary": "Coca-Cola Company, Keurig Dr Pepper and PepsiCo - Beverage industry priority is a circular economy that gets back more bottles and cans to be turned into new ones and not end up in nature or wasted..."}, {"date": "20240423070015", "headline": "Here is What to Know Beyond Why CocaCola Company (The) (KO) is a Trending Stock", "summary": "Coke (KO) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects."}, {"date": "20240423071800", "headline": "Coca-Cola to spend $1.1B to use Microsoft’s cloud, AI services", "summary": "The beverage giant is exploring the use of the technology to streamline its operations, foster innovation, boost efficiency and discover growth opportunities."}, {"date": "20240423073000", "headline": "The Coca-Cola Company and Microsoft announce five-year strategic partnership to accelerate cloud and generative AI initiatives", "summary": "Microsoft Corp. and The Coca-Cola Company on Tuesday announced a five-year strategic partnership to align Coca-Cola's core technology strategy systemwide; enable the adoption of leading-edge technology; and foster innovation and productivity globally."}, {"date": "20240423073000", "headline": "Coca-Cola signs $1.1 bln deal to use Microsoft cloud, AI services", "summary": "Microsoft said on Tuesday that Coca-Cola had signed a $1.1 billion five-year deal to use its cloud computing and artificial intelligence services.  Coca-Cola had in 2020 signed a five-year deal worth $250 million to use Microsoft's cloud and business software.  The two companies said Coca-Cola would test Microsoft's Copilot offerings to see how the tools improve productivity for the beverage maker."}, {"date": "20240423073847", "headline": "Coca-Cola signs $1.1 billion deal to use Microsoft cloud, AI services", "summary": "Microsoft said on Tuesday that Coca-Cola had signed a $1.1 billion five-year deal to use its cloud computing and artificial intelligence services.  Coca-Cola had in 2020 signed a five-year deal worth $250 million to use Microsoft's cloud and business software.  The two companies said Coca-Cola would test Microsoft's Copilot offerings to see how the tools improve productivity for the beverage maker."}, {"date": "20240423080100", "headline": "Coca-Cola (KO) Earnings Expected to Grow: What to Know Ahead of Next Week's Release", "summary": "Coke (KO) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240423092100", "headline": "How Much Will Coca-Cola Pay in Dividends This Year?", "summary": "Coca-Cola's storied dividend has been increasing for decades."}, {"date": "20240423093100", "headline": "Top Research Reports for Meta Platforms, Elevance Health & Canadian Natural Resources", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Meta Platforms, Inc. (META), Elevance Health, Inc. (ELV) and Canadian Natural Resources Limited (CNQ)."}, {"date": "20240423102435", "headline": "Microsoft just got a $1.1 billion boost from Coca-Cola", "summary": "Coca-Cola is keen to explore Microsoft's enterprise-level artificial intelligence technology."}, {"date": "20240423210000", "headline": "Main Street’s Next Winners? 3 Stocks I’m Bullish on Using the Peter Lynch Approach.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424024700", "headline": "RBC Capital Reaffirms Their Buy Rating on Coca-Cola (KO)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424030400", "headline": "Coke creates AI-powered instrument that only plays ‘uplifting sounds’", "summary": "Coke SoundZ arrives as the beverage giant makes a $1.1 billion commitment to Microsoft Cloud and its generative AI capabilities."}, {"date": "20240424040052", "headline": "The corporate conversation around AI is changing: Morning Brief", "summary": "We're finally into the \"show me\" portion of the AI narrative, and Coca-Cola and Microsoft's new deal might be a glimpse of what the near-term future will be like for AI."}, {"date": "20240424044700", "headline": "Caffeine jolts: Coffee shop growth in China sizzles while a bubble tea IPO goes flat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424064500", "headline": "The Zacks Analyst Blog Highlights Meta Platforms, Elevance Health, Canadian Natural Resources, The Coca-Cola and The Progressive", "summary": "Meta Platforms, Elevance Health, Canadian Natural Resources, The Coca-Cola and The Progressive are part of the Zacks top Analyst Blog"}, {"date": "20240424084500", "headline": "3 High-Yielding Dividend Stocks That Can Help Bankroll Your Retirement Years", "summary": "These stocks yield between 3.2% and 7.7% in dividends."}, {"date": "20240424154516", "headline": "Coca-Cola (KO) Exceeds Market Returns: Some Facts to Consider", "summary": "In the most recent trading session, Coca-Cola (KO) closed at $61.55, indicating a +1.5% shift from the previous trading day."}, {"date": "20240424214000", "headline": "Coca-Cola Co. stock outperforms competitors on strong trading day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425003639", "headline": "Coca-Cola Europacific hails first quarter growth; increases payout", "summary": "Coca-Cola Europacific Partners PLC on Thursday reported quarterly revenue growth and upped its interim dividend. Coca-Cola Europacific is a bottling company which distributes Coca-Cola products and..."}, {"date": "20240425021000", "headline": "March's Dividend Portfolio Update Sets New All-Time Record - 100 Holdings, 21 Buys", "summary": "Portfolio changes in March focus on BDCs, aiming to increase dividend income by at least $100 each month. Click here for a detailed analysis."}, {"date": "20240425023816", "headline": "Coca Cola : Fanta Gives Fans Permission to Do More of What They ‘Wanta’", "summary": "Wanta Fanta is a shoutout to a generation craving more balance and time out for themselves, said Ibrahim Khan, Global Vice President of Marketing Fanta at The Coca-Cola Company...."}, {"date": "20240425024000", "headline": "Unusually active option classes on open April 25th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425030900", "headline": "Coca-Cola FEMSA: Q1 Earnings Snapshot", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425044736", "headline": "It's Unlikely That The Coca-Cola Company's (NYSE:KO) CEO Will See A Huge Pay Rise This Year", "summary": "Key Insights Coca-Cola's Annual General Meeting to take place on 1st of May Total pay for CEO James Robert Quincey..."}, {"date": "20240425060500", "headline": "Is Coca-Cola a No-Brainer Dividend Stock to Buy While It's Below $65?", "summary": "This business has been a favorite of Warren Buffett's for quite some time."}, {"date": "20240425063300", "headline": "Fanta Says, 'Do More of What You Wanta' With New Global Campaign", "summary": "The 2000s called, and they want to know: Don't ya Wanta, Wanta Fanta? Fanta®, the leading sparkling fruit beverage brand known for deliciously refreshing flavors, is introducing a reprise of one of its most iconic global platforms 'Wanta Fanta,' aiming to nudge fans to do more of what they want amid the constant hustle and daily pressure to do what they need."}, {"date": "20240425064908", "headline": "Pepsi Tops Estimates Despite A Weakened Domestic Market", "summary": "On Tuesday, Pepsi Co Inc (NASDAQ: PEP) showed it managed to navigate weaker U.S. demand that was the result of Quaker Oats recalls and backlash to higher prices for its drinks and snacks. But despite delivering better than expected earnings and revenue for its first quarter, Pepsi shares dipped about 2% upon the report as Wall Street watched at other things, such as a struggling domestic market. First quarter highlights For the quarter ended on March 23rd, Pepsi reported that revenue grew 2.3% t"}, {"date": "20240425071500", "headline": "Here Are My Top 5 Dividend Kings to Buy Right Now", "summary": "Dividend Kings are hard to come by, but these five stocks offer investors some great passive income opportunities."}, {"date": "20240425071524", "headline": "Stay Ahead of the Game With Coke (KO) Q1 Earnings: Wall Street's Insights on Key Metrics", "summary": "Evaluate the expected performance of Coke (KO) for the quarter ended March 2024, looking beyond the conventional Wall Street top-and-bottom-line estimates and examining some of its key metrics for better insight."}, {"date": "20240425081500", "headline": "Have $500? 4 Absurdly Cheap Stocks Long-Term Investors Should Buy Right Now", "summary": "These stocks are great buys after underperforming the broader indexes in recent months."}, {"date": "20240425104319", "headline": "PepsiCo, Nestlé and Danone among top plastic polluters, study claims", "summary": "Food and drinks producers were found to be \"disproportionately large polluters\" in the assessment."}, {"date": "20240425190800", "headline": "More than half of the S&P 500 names that reported results this week beat top and bottom line - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425200600", "headline": "Catalyst Watch: Apple earnings, Viking IPO, Chinese EV deliveries and Russell indices' Rank Day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425224600", "headline": "Who Owns Coca-Cola Stock (NYSE:KO)?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425230700", "headline": "How Much Will $10k Invested in These Dividend Aristocrats Grow to by 2025?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426000200", "headline": "3 High-Yield Dividend Stocks for Market Crash Protection", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426013113", "headline": "The Coca-Cola Company - Fanta Says, 'Do More of What You Wanta' With New Global Campaign", "summary": "ATLANTA - The 2000s called, and they want to know: Don't ya Wanta, Wanta Fanta Fanta, the leading sparkling fruit beverage brand known for deliciously refreshing flavors, is introducing a reprise of..."}, {"date": "20240426033300", "headline": "Fomento Economico: Q1 Earnings Snapshot", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426044149", "headline": "Mexico's Femsa Reports Higher Sales, Lower Net Profit for 1Q", "summary": "By Anthony Harrup MEXICO CITY -- Mexican retail and beverages company Fomento Económico Mexicano posted double-digit increases in sales and operating profit for the first quarter, while net..."}, {"date": "20240426051100", "headline": "Shift Your Gains to These 7 Stocks Before the Market Takes a Dive", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426071207", "headline": "The New Pepsi Challenge: A Dividend Stock Showdown Between Coca-Cola and PepsiCo", "summary": "Remember the Pepsi Challenge? The iconic marketing campaign where people were invited to participate in a blind taste test, choosing their favorite between Coca-Cola and Pepsi? Well, we’re bringing that concept back, but with a twist. Instead of ..."}, {"date": "20240426080925", "headline": "Stocks to watch next week: Amazon, Apple, Anglo American and Novo Nordisk", "summary": "Earnings preview of key companies reporting next week and what to look out for."}, {"date": "20240426083150", "headline": "UPDATE 1-Mexico's FEMSA revenues climb 11% on Oxxo, Coca-Cola growth", "summary": "Mexico's FEMSA, which controls one of the largest Coca-Cola bottlers and a string of convenience store chains, posted an 11% increase in revenue in the first quarter, boosted by growth across nearly all its business sectors.  Revenue came in at 178.20 billion pesos ($10.78 billion) in the three-month period, largely in line with expectations, as sales from chain store Oxxo, bottler Coca-Cola Femsa and Femsa's fuel division posted double-digit growth.  Sales only fell at Femsa's pharmacy division, down 2.3%, where it had fewer stores and faced challenges across Latin America."}, {"date": "20240426083455", "headline": "Mexico's FEMSA revenues climb 11% on Oxxo, Coca-Cola growth", "summary": "Mexico's FEMSA, which controls one of the largest Coca-Cola bottlers and a string of convenience store chains, posted an 11% increase in revenue in the first quarter, boosted by growth across nearly all its business sectors.  Revenue came in at 178.20 billion pesos ($10.78 billion) in the three-month period, largely in line with expectations, as sales from chain store Oxxo, bottler Coca-Cola Femsa and Femsa's fuel division posted double-digit growth.  Sales only fell at Femsa's pharmacy division, down 2.3%, where it had fewer stores and faced challenges across Latin America."}, {"date": "20240426101600", "headline": "NEW YORK MARKET CLOSE: Bullish Alphabet and Microsoft fuel tech rally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426140000", "headline": "S&P 500 Earnings: The Upward Revisions Are A Big Positive", "summary": "The forward 4-quarter estimate this week was $252.55, up from $252.51 last week."}, {"date": "20240426191900", "headline": "Warren Buffett Bolsters Holdings in Liberty SiriusXM Group", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426234300", "headline": "7 Stocks to Buy if Inflation Continues to Reign in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427010700", "headline": "All In on Microsoft Stock: How AI Turned MSFT Into the Hottest Tech Play of 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427071546", "headline": "10 Best Long Term Low Risk Stocks to Buy", "summary": "In this article, we will take a look at the 10 best long term low risk stocks to buy. To see more such companies, go directly to 5 Best Long Term Low Risk Stocks to Buy. As the latter part of 2022 unfolded, artificial intelligence stocks emerged as a beacon of hope for the market […]"}, {"date": "20240428010300", "headline": "Earnings week ahead: Amazon, Apple, Pfizer, AMD, Coca-Cola, Starbucks and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428012226", "headline": "Wall Street Breakfast: The Week Ahead", "summary": "This article discusses the upcoming events in the financial world, including the Federal Reserve meeting, corporate earnings, IPOs, and investor events."}, {"date": "20240428165443", "headline": "Dividend Stock Portfolio For Income: Top 15 Stocks", "summary": "In this article, we will discuss dividend stocks for regular income. You can skip our detailed analysis of dividend stocks and their historical performance, and go directly to read Dividend Stock Portfolio For Income: Top 5 Stocks. It is generally believed that dividend stocks are primarily suitable for people approaching retirement. However, this is far from […]"}, {"date": "20240429000100", "headline": "Options Volatility and Implied Earnings Moves This Week, April 29 – May 02, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429010153", "headline": "Coca-Cola (KO) Q1 Earnings Report Preview: What To Look For", "summary": "Beverage company Coca-Cola (NYSE:KO) will be reporting results tomorrow before market hours. Here's what you need to know."}, {"date": "20240429012800", "headline": "Microsoft Stock: Why This Magnificent 7 Baddie Is Leaving AMZN and GOOG in the Dust", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429024100", "headline": "Meet the 8 Phenomenal Stocks Warren Buffett Plans to Hold Forever", "summary": "Although Berkshire Hathaway's $373 billion portfolio contains 45 stocks and two index funds, not all of the Oracle of Omaha's holdings are equal."}, {"date": "20240429025400", "headline": "Microsoft Tops Estimates Across Its Business But Signals Near-Term Capacity Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429032900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429034100", "headline": "Big Tech Earnings Beats Stymie 2nd-Quarter Sell-Off", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429035100", "headline": "Coca-Cola Company Q1 earnings on deck: What to expect", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429050132", "headline": "The Coca-Cola Company (NYSE:KO) is largely controlled by institutional shareholders who own 62% of the company", "summary": "Key Insights Given the large stake in the stock by institutions, Coca-Cola's stock price might be vulnerable to their..."}, {"date": "20240429053100", "headline": "Coca-Cola readying IPO for African bottling business, Bloomberg says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429053400", "headline": "Coca-Cola plans IPO of African bottling business next year, Bloomberg says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429053500", "headline": "This Warren Buffett Dividend King Stock Just Invested $1.1 Billion Into Artificial Intelligence (AI)", "summary": "Coca-Cola is bringing AI to the beverage sector."}, {"date": "20240429062800", "headline": "Coca-Cola Q1 Earnings Preview: Will Beverage Giant Beat Revenue Estimates For 13th Straight Quarter?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429064600", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429065539", "headline": "Coca-Cola gears up for IPO of $8 bln African bottling arm, Bloomberg reports", "summary": "Coca-Cola is gearing up forthe initial public offering of $8 billion African bottlingarm, Bloomberg News reported on Monday. The company did not immediately respond to a Reuters..."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429100800", "headline": "Is Coca-Cola (KO) a Good Buy Option Just Before Q1 Earnings?", "summary": "Coca-Cola's (KO) market position, innovation and digital growth initiatives, along with solid business momentum, supported by robust consumer demand, place it well ahead of Q1 earnings."}, {"date": "20240429101200", "headline": "NEW YORK MARKET CLOSE: Stocks push higher while Tesla hits top gear", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429110326", "headline": "Coca-Cola gears up for IPO of $8 billion African bottling arm, Bloomberg reports", "summary": "Coca-Cola declined to comment on the news, when contacted by Reuters.  Last year, the company had noted during its third-quarter earnings it remains committed to listing Coca-Cola Beverages Africa (CCBA) as a public company once market conditions become more favorable.  The company in 2021 had said it was planning to list CCBA in 18 months, with primary listing in Amsterdam and a secondary listing on the Johannesburg Stock Exchange (JSE)."}, {"date": "20240429110944", "headline": "UPDATE 2-Coca-Cola gears up for IPO of $8 bln African bottling arm, Bloomberg reports", "summary": "Coca-Cola is gearing up for a potential initial public offering (IPO) of its African bottling business as soon as next year, Bloomberg News reported on Monday, citing people familiar with the matter.  Coca-Cola declined to comment on the news, when contacted by Reuters.  Last year, the company had noted during its third-quarter earnings it remains committed to listing Coca-Cola Beverages Africa (CCBA) as a public company once market conditions become more favorable."}, {"date": "20240429140500", "headline": "Coca-Cola Reports Tuesday Morning Before The Open - Earnings Preview", "summary": "When KO reports Tuesday morning, 4/30/24 before the market opens, the street consensus is expecting $0.70 in EPS on $11 billion in revenue, and $3.6 billion in operating income."}, {"date": "20240429183000", "headline": "Big Tech Earnings Beats Stymie Q2 2024 Sell-Off", "summary": "Markets finally turned positive late last week due to better-than-expected results from big tech."}, {"date": "20240429184800", "headline": "GLOBAL BRIEFING: HSBC CEO to retire; first-quarter profit edges down", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429190600", "headline": "Markets Up On Tesla, Q1 Earnings; Q1 Beats After The Bell", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429191900", "headline": "Investor Sentiment Improves Further, Dow Jumps Over 100 Points", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429191900", "headline": "Coca-Cola, Amazon And 3 Stocks To Watch Heading Into Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429202500", "headline": "Americans Swap $5 Burgers For $1,000 Weight Loss Drugs — Is Soda Getting Left Behind Too?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429212200", "headline": "What You Missed On Wall Street On Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429223500", "headline": "Analysts Offer Insights on Consumer Goods Companies: Oatly Group (OTLY) and Coca-Cola (KO)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429224626", "headline": "Coca-Cola HBC hails \"strong start\" to 2024 with first quarter sales up", "summary": "Coca-Cola HBC AG on Tuesday reiterated its growth guidance for 2024, following a strong first quarter in which the company grew both its revenue and sales volumes.Coca-Cola HBC is a Zug,..."}, {"date": "20240429230400", "headline": "7 Defensive Stocks Built to Withstand the Market’s Worst Storms", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429234000", "headline": "Inflation-Proof Fortunes: 7 Dividend Aristocrats to Keep Your Wealth Growing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429235600", "headline": "Coca-Cola reports Q1 adjusted EPS 72c, consensus 65c", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429235900", "headline": "Coca-Cola sees FY24 organic revenue growth 8%-9%, consensus $42.83B", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000000", "headline": "Coca-Cola beats Q1 estimates, updates outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000000", "headline": "Coca-Cola sees 8%-9% currency headwind to Q2 adjusted EPS growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000200", "headline": "Wall Street On Edge Ahead Of Fed Decision, Spotlight Falls On Amazon And AMD Earnings: Analyst Says Stocks Survive 'Fragility Test' As April Ends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000600", "headline": "Preparing for the Worst: 3 Resilient Stocks to Buy Before the Next Market Crash", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000600", "headline": "Options Volatility and Implied Earnings Moves Today, April 30, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430001700", "headline": "Coca-Cola smashes organic sales expectations off strong global growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430003500", "headline": "Coca-Cola in charts: Achieves comparable operating margin of 32.4% in Q1, highest in the past 3 years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430004300", "headline": "Coca-Cola Contemplates $8B IPO For African Bottling Unit: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430005704", "headline": "Coca-Cola raises annual organic sales forecast on strong global demand, higher prices", "summary": "Coca-Cola raised its annualorganic sales forecast on Tuesday, signaling strong globaldemand for its pricey sodas and juices. The soda giant expects fiscal 2024 organic sales to..."}, {"date": "20240430005849", "headline": "Coca Cola : Margin Analysis Schedule Q1 2024", "summary": "Q1 2024 MARGIN ANALYSIS April 30, 2024 RECONCILIATION TO U.S. GAAP FINANCIAL INFORMATION..."}, {"date": "20240430005935", "headline": "Coca Cola : Earnings Release Q1 2024", "summary": "Exhibit 99.1 Coca-Cola Reports First Quarter 2024 Results and Provides Updated Guidance ..."}, {"date": "20240430010418", "headline": "Coke: Q1 Earnings Snapshot", "summary": "ATLANTA — ATLANTA — Coca-Cola Co. on Tuesday reported first-quarter net income of $3.18 billion. On a per-share basis, the Atlanta-based company said it had net income of 74 cents...."}, {"date": "20240430014800", "headline": "KO Earnings: Coca-Cola’s Q1 Results Surpass Expectations", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430021000", "headline": "Coca-Cola's Bottom Line Bubbles Up, Company Raises FY24 Revenue Projections", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430021400", "headline": "TOP NEWS: Coca-Cola ups sales outlook as price hikes aid first quarter", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430022500", "headline": "Coca-Cola’s first-quarter results beat top- and bottom-line estimates, boosted by ‘dynamic backdrop’", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430022500", "headline": "5 stocks to watch on Tuesday: KO, MCD, AMZN and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430022900", "headline": "J.P. Morgan Sticks to Its Buy Rating for Coca-Cola (KO)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430023300", "headline": "Wall Street Analysts Are Bullish on Top Consumer Goods Picks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430023302", "headline": "Coca-Cola: Adjusted EPS up 7% in Q1", "summary": "Coca-Cola reports operating sales of $11.3 billion for the 1st quarter, up 3% . At the same time, operating income contracted by 36% to $2,141 million, but net income, Group share, rose by 2% to..."}, {"date": "20240430024000", "headline": "Unusually active option classes on open April 30th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430025423", "headline": "Coca Cola : Reconciliation of Non-GAAP Financial Measures for Earnings Conference Call", "summary": "THE COCA-COLA COMPANY AND SUBSIDIARIES Reconciliation of GAAP and Non-GAAP Financial Measures ..."}, {"date": "20240430032600", "headline": "Coca-Cola (KO) Receives a Buy from RBC Capital", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430033600", "headline": "Fanta reimagines nostalgic ‘Wanta Fanta’ platform to reach Gen Z", "summary": "The Coca-Cola brand is calling back to the early aughts to encourage younger consumers to indulge more often."}, {"date": "20240430034600", "headline": "UBS Reaffirms Their Buy Rating on Coca-Cola (KO)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430040250", "headline": "Trending : Coca-Cola's First-Quarter Tops Street Views", "summary": "09:46 ET -- Coca-Cola is one of the most mentioned companies in the U.S. across all news items in the past 12 hours, according to Factiva data. The soft-drinks maker posted first-quarter profit and..."}, {"date": "20240430041600", "headline": "Coca-Cola (KO) Surpasses Q1 Expectations and Raises FY24 Revenue Guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430045500", "headline": "Coca-Cola Reports First Quarter 2024 Results and Provides Updated Guidance", "summary": "ATLANTA, April 30, 2024--The Coca-Cola Company today reported first quarter 2024 results. \"We’re encouraged by our start to 2024, delivering another quarter of volume, topline and earnings growth amidst a dynamic backdrop,\" said James Quincey, Chairman and CEO of The Coca-Cola Company. \"We believe our global system is primed for sustained success, thanks to the right strategies, clear alignment, a powerful portfolio and strong execution.\""}, {"date": "20240430045900", "headline": "KO Stock Earnings: Coca-Cola Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430045937", "headline": "Coca-Cola raises annual sales forecast on global demand, higher prices", "summary": "(Reuters) -Coca-Cola raised its annual organic sales forecast on Tuesday after beating first-quarter revenue and profit expectations as customers shell out more money for its pricey sodas and juices globally.  Both Coca-Cola and PepsiCo are also enjoying buoyant demand in international markets such as Europe and Latin America where relaunches of Georgia Coffee and Sprite reformulations have helped bump up sales.  Coca-Cola's organic revenue in Europe, Middle East and Africa rose 15% in the first quarter, while in North America it increased 7%."}, {"date": "20240430050118", "headline": "UPDATE 3-Coca-Cola raises annual sales forecast on global demand, higher prices", "summary": "Coca-Cola raised its annual organic sales forecast on Tuesday after beating first-quarter revenue and profit expectations as customers shell out more money for its pricey sodas and juices globally.  Both Coca-Cola and PepsiCo are also enjoying buoyant demand in international markets such as Europe and Latin America where relaunches of Georgia Coffee and Sprite reformulations have helped bump up sales.  Coca-Cola's organic revenue in Europe, Middle East and Africa rose 15% in the first quarter, while in North America it increased 7%."}, {"date": "20240430050300", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430051116", "headline": "Coca-Cola (NYSE:KO) Surprises With Q1 Sales", "summary": "Beverage company Coca-Cola (NYSE:KO) beat analysts' expectations in Q1 CY2024, with revenue up 3.1% year on year to $11.3 billion. It made a non-GAAP profit of $0.72 per share, improving from its profit of $0.68 per share in the same quarter last year."}, {"date": "20240430051600", "headline": "Coca-Cola Raises Full-Year Revenue Expectations. The Stock Trades Lower.", "summary": "Coca-Cola  raised its full-year revenue forecast on higher prices after beating first-quarter profit and revenue expectations.  Coca-Cola  said it now expects 2024 revenue growth of between 8% to 9%, which is above the soda maker’s prior forecast of 6% to 7%.  Coca-Cola said the new forecast includes the anticipated pricing impact of a number of markets experiencing “intense inflation.”"}, {"date": "20240430053600", "headline": "Nasdaq Dips Over 100 Points; Coca-Cola Earnings Top Views", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430054736", "headline": "Dow Jones Notebook: McDonald's, Coca-Cola Trade Lower; 3M Poised For Breakout", "summary": "Dow Jones fast food giant McDonald's fell short of Q1 earnings Tuesday. Coca-Cola beat views, lifted its sales growth forecast."}, {"date": "20240430060000", "headline": "Is PepsiCo Stock Still a Buy?", "summary": "The beverage and snack food company just reaffirmed its 2024 outlook."}, {"date": "20240430060504", "headline": "Coca-Cola (KO) Surpasses Q1 Earnings and Revenue Estimates", "summary": "Coke (KO) delivered earnings and revenue surprises of 4.35% and 3.21%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240430063158", "headline": "Coca-Cola Co (KO) Q1 2024 Earnings: Surpasses Analyst Revenue Forecasts with Strong Organic Growth", "summary": "Despite Operational Challenges, Coca-Cola Reports Notable Gains in Revenue and Market Share"}, {"date": "20240430063600", "headline": "Stocks Dive On Fears Of Hawkish Fed; Treasury Yields Rise, Bitcoin Tumbles To $60,000: What's Driving Markets Tuesday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430070108", "headline": "The Coca-Cola Company (KO) Q1 2024 Earnings Call Transcript", "summary": "The Coca-Cola Company (NYSE:NYSE:KO) Q1 2024 Earnings Conference Call April 30, 2024 8:30 AM ETCompany ParticipantsJames Quincey - Chairman, Chief Executive..."}, {"date": "20240430072818", "headline": "4 Buyable Berkshire DiviDogs From April, Plus 5 To Watch", "summary": "25 of 41 current BKH owned stocks pay dividends.Â Read more to see a detailed analysis of the stocks listedÂ in this article."}, {"date": "20240430073025", "headline": "Compared to Estimates, Coke (KO) Q1 Earnings: A Look at Key Metrics", "summary": "Although the revenue and EPS for Coke (KO) give a sense of how its business performed in the quarter ended March 2024, it might be worth considering how some key metrics compare with Wall Street estimates and the year-ago numbers."}, {"date": "20240430075101", "headline": "Coca-Cola beats on Q1 revenue, raises guidance", "summary": "Coca-Cola (KO) reported first quarter results, beating analyst expectations on both the top and bottom lines — with the beverage giant's net sales rising by 3% year-over-year. The company also raised its full-year outlook for organic revenue, projecting 8 to 9% growth in 2024. Yahoo Finance's Brooke DiPalma breaks down the report and provides insight into CEO James Quincey's outlook for the company. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Angel Smith"}, {"date": "20240430080500", "headline": "5 Reasons to Buy Coca-Cola Stock Like There's No Tomorrow", "summary": "The soda maker is still a great evergreen investment."}, {"date": "20240430082000", "headline": "Wall Street Lunch: Reefer Gladness", "summary": "The reported move falls short of legalizing recreation pot use. Eli Lilly boosts outlook on weight loss drug performance. Wage inflation comes in hot for Q1."}, {"date": "20240430092414", "headline": "Coca-Cola Tops First-Quarter Expectations, Lifts 2024 Revenue Guidance", "summary": "Coca-Cola Tops First-Quarter Expectations, Lifts 2024 Revenue Guidance"}, {"date": "20240430094514", "headline": "Coca-Cola (KO) Q1 2024 Earnings Call Transcript", "summary": "KO earnings call for the period ending March 31, 2024."}, {"date": "20240430100217", "headline": "Coca-Cola, McDonald's, Walmart: State of the consumer", "summary": "Coca-Cola (KO) posted its first quarter report on Tuesday, beating expectations on both the top and bottom lines. CEO James Quincey spoke to Yahoo Finance Reporter Brooke DiPalma about the company's performance and sales and the impact of inflation. McDonald's (MCD) also posted its first quarter report, missing on expectations due to increased prices that affected lower-income customers. However, the company did still post an increase in same-store sales year-over-year. Yahoo Finance Reporter Brooke DiPalma joins Wealth! to discuss the performance of McDonald's and Coca-Cola, her conversation with Coca-Cola CEO James Quincey, as well as Walmart's new brand.  For more expert insight and the latest market action, click here to watch this full episode of Wealth! This post was written by Nicholas Jacobino"}, {"date": "20240430100800", "headline": "Coca-Cola (KO) Tops on Q1 Earnings & Revenues, Raises View", "summary": "Coca-Cola (KO) Q1 results reflect gains from strong top-line growth, aided by improvements in sparkling soft drinks and juice categories. KO's pricing actions also boost sales."}, {"date": "20240430101800", "headline": "NEW YORK MARKET CLOSE: Dow hit by new inflationary scare ahead of Fed", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430102900", "headline": "Coca-Cola Raised Its 2024 Revenue Forecast. Investors Are Shrugging It Off.", "summary": "Coca-Cola  turned in better results than expected and raised its forecast for revenue for the year.  The soda maker said it now expects 2024 revenue growth of between 8% to 9%, up from its prior forecast of 6% to 7%.  Shares of Coca-Cola were down 0.6% in Tuesday trading, compared with a 0.9% loss in the  and a 0.7% slide in the  Prior to the session, the stock had gained 5.3% this year."}, {"date": "20240430114919", "headline": "Sector Update: Consumer Stocks Retreat in Afternoon Trading", "summary": "Sector Update: Consumer Stocks Retreat in Afternoon Trading"}, {"date": "20240430122341", "headline": "Coca-Cola CEO: Inflation will normalize throughout 2024", "summary": "The beverage giant is seeing normalizing costs for sugar, aluminum cans, and more."}, {"date": "20240430153225", "headline": "Mondelez CEO keeps it real on inflation as earnings trounce estimates", "summary": "Mondelez CEO Dirk Van de Put tells Yahoo Finance inflation remains a problem."}, {"date": "20240430155100", "headline": "These 3 Companies Recently Lifted Guidance", "summary": "Guidance lifts are among the most positive announcements shareholders can hear, injecting confidence in the long-term picture."}, {"date": "20240430163526", "headline": "Coca-Cola only sold 1% more drinks last quarter, but it raised prices 13%. Its CEO said it has ‘the right strategies’ for sustained success", "summary": "The beverage goliath is among several other snack and drink companies reaping the rewards of price hikes that far exceed inflation."}, {"date": "20240430182900", "headline": "GLOBAL BRIEFING: Downturn in Japanese manufacturing stabilises", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430195300", "headline": "Coca-Cola's Refreshing Results: Analysts Bullish Despite Near-Term Concerns", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430204800", "headline": "Investor Sentiment Falls, Dow Snaps Five-Month Win Streak", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430222527", "headline": "Q1 2024 Coca-Cola Co Earnings Call", "summary": "Q1 2024 Coca-Cola Co Earnings Call"}, {"date": "20240430230400", "headline": "3 ETFs to Buy When the Market Gets Crazy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501002200", "headline": "Analysts Offer Insights on Consumer Goods Companies: Clorox (CLX) and Coca-Cola (KO)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501010503", "headline": "Coca-Cola Co (KO) Q1 2024 Earnings Call Transcript Highlights: Robust Growth Amidst Economic ...", "summary": "Discover how Coca-Cola achieved significant organic revenue growth and expanded margins in a challenging economic environment."}, {"date": "20240501011100", "headline": "Coca-Cola price target raised by $3 at Evercore ISI, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501011200", "headline": "GLOBAL BROKER RATINGS: Bernstein raises Deutsche Lufthansa", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501014500", "headline": "Largest borrow rate increases among liquid names", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501021200", "headline": "Analysts Offer Insights on Consumer Goods Companies: Coca-Cola (KO) and Clorox (CLX)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501030000", "headline": "Non-Farm Payrolls Preview For April 2024: 3 Major Considerations", "summary": "April 2024 jobs report expected to show an increase of 250,000 jobs, indicating continued tightness in the labor market. Check out 3 major things to consider."}, {"date": "20240501030600", "headline": "3 Warren Buffett Stocks That Are Screaming Buys in May (and Beyond)", "summary": "Although Berkshire Hathaway's $372 billion portfolio contains 45 stocks, three are a clear step above the rest in May."}, {"date": "20240501042600", "headline": "Wedbush Just Slashed Its Price Target on Starbucks (SBUX) Stock", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501092204", "headline": "Warren Buffett Is Now Earning A Nearly 60% Yield On Coca-Cola - 'When You Find A Truly Wonderful Business, Stick With It'", "summary": "Few names command as much respect as Warren Buffett, the legendary CEO of Berkshire Hathaway. Known for his long-term, value-oriented approach, Buffett has built a fortune by identifying high-quality companies and holding onto them for decades. One of ..."}, {"date": "20240501195300", "headline": "Coca-Cola Announces Executive Changes and Shareholder Decisions", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501220400", "headline": "Analysts Are Bullish on These Consumer Goods Stocks: Kraft Heinz (KHC), Coca-Cola (KO)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501222300", "headline": "Coca-Cola declares $0.485 dividend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501231200", "headline": "XLP ETF: Invest in Consumer Staples Stocks with Durable Demand", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501233855", "headline": "Coca Cola : Transcript Q1 2024", "summary": "Formatted Report 30-Apr-2024 The Coca-Cola Co. Q1 2024 Earnings Call ..."}, {"date": "20240501235000", "headline": "Coca-Cola price target raised by $1 at Bernstein, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502001236", "headline": "SOXX: Wonderful Market Sector Now Trading At An Excessive Price", "summary": "The semiconductor industry has strong differentiation, financial metrics, and competitive advantages. See why I rate iShares Semiconductor ETF (SOXX) as a sell."}, {"date": "20240502001800", "headline": "3 Value Stocks to Snap Up During the Q2 Market Dip", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502004628", "headline": "Coca Cola : DASANI Makes a Splash in 2024 with Refreshed Packaging, Formula and Campaign", "summary": "DASANI is springing into spring with a fresh new look, taste and marketing campaign. The beloved water brand, which has hydrated and refreshed North American consumers since..."}, {"date": "20240502005100", "headline": "Coca-Cola price target raised by $1 at Barclays, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502033000", "headline": "Coca-Cola: Earnings Not Enough To Support Uptrend (Technical Analysis)", "summary": "Coca-Cola surpasses expectations in Q1 earnings with strong demand for its soft drinks, but faces potential resistance, which may impact its stock trend."}, {"date": "20240502065100", "headline": "Warren Buffett Increases Stake in Liberty SiriusXM Group", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502110000", "headline": "The Coca-Cola Company Announces Election of Corporate Officers and Declares Regular Quarterly Dividend", "summary": "ATLANTA, May 02, 2024--The Board of Directors of The Coca-Cola Company today announced the election of corporate officers, along with declaring the company’s regular quarterly dividend."}, {"date": "20240502122225", "headline": "Monster Beverage posts higher Q1 revenue on resilient demand, easing costs", "summary": "May 2 - Monster Beverage reported a 12% jump infirst-quarter revenue on Thursday, helped by steady demand forthe energy drink maker's high-priced juices as well as easingfreight..."}, {"date": "20240502125900", "headline": "Earnings Season: 3 Companies Boosting Guidance", "summary": "Earnings season continues to chug along, with results from many companies already delivered. And concerning positivity, all three of these companies' report fit the criteria, lifting outlooks following the results."}, {"date": "20240502192000", "headline": "'Why Isn't Buffett Calling Cook Out?' Question Redditors On Apple's Largest-Ever Share Buyback", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502225800", "headline": "Berkshire’s First Annual Meeting Without Munger This Saturday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502230000", "headline": "Warren Buffett Loves Coca-Cola, but Berkshire Might Not Like the Taste of More Shares", "summary": "Coca-Cola is a top Berkshire Hathaway holding, but it’s likely too expensive for CEO Warren Buffett to buy more."}, {"date": "20240502230645", "headline": "Decoding Coca-Cola Co (KO): A Strategic SWOT Insight", "summary": "Insightful Analysis of Coca-Cola's Financial Health and Strategic Position"}, {"date": "20240503000200", "headline": "3 Ultra-Safe Stocks to Buy So You Can Rest Easy in Any Market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503020100", "headline": "The Bottom May Be in for British American Tobacco", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503032700", "headline": "Warren Buffett's Berkshire To Rake In $226M Passively In A Jiffy, Thanks To Its Core Holding Apple", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503044242", "headline": "CCEP rolls out new packaging design for Fanta flavours in UK", "summary": "The revamped design offers a clearer distinction between the regular and zero-sugar variants of the drink."}, {"date": "20240503050045", "headline": "Coca-Cola Insiders Sell US$19m Of Stock, Possibly Signalling Caution", "summary": "The fact that multiple The Coca-Cola Company ( NYSE:KO ) insiders offloaded a considerable amount of shares over the..."}, {"date": "20240503104900", "headline": "Decoding PEP & KO Post Q1 Earnings: Which Stock Stands Out?", "summary": "The earnings season is the ideal time to re-evaluate one's portfolio. Let us see to which side investors would incline when choosing between arch rivals PepsiCo and Coca-Cola."}, {"date": "20240503142224", "headline": "The Coca-Cola Company (NYSE:KO) Q1 2024 Earnings Call Transcript", "summary": "The Coca-Cola Company (NYSE:KO) Q1 2024 Earnings Call Transcript April 30, 2024 The Coca-Cola Company beats earnings expectations. Reported EPS is $0.72, expectations were $0.7. The Coca-Cola Company isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: At this time, I’d […]"}, {"date": "20240503150404", "headline": "4 Dividend Kings Poised for Growth, According to Analysts", "summary": "Dividend Kings are an elite group of companies that have consistently increased their dividends for at least 50 consecutive years. These companies have demonstrated a remarkable ability to generate steady cash flows and reward shareholders with ..."}, {"date": "20240503163000", "headline": "Most Investments Are Bad. Here's Why, And What To Do About It", "summary": ""}, {"date": "20240503213935", "headline": "SCHD: A Must-Have In Every Dividend Portfolio", "summary": "Schwab U.S. Dividend Equity ETF (SCHD) offers diversification and resilience with a focus on healthy dividend-paying companies, but lower total returns. Read more here."}, {"date": "20240503234000", "headline": "MSFT Analysis: Why Microsoft Stock Is a Must-Own for Investors in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504012000", "headline": "Berkshire says 75% of fair value concentrated in five companies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504023600", "headline": "Berkshire Hathaway's Q1 Operating Earnings Surged 39% — Here's Why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504030600", "headline": "10 out of 12 S&P 500 consumer staples stocks post earnings beat - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504031100", "headline": "Buffett's Berkshire Hathaway slashes Apple stake in Q1", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504050800", "headline": "Warren Buffett's Confidence In Apple Wanes? Berkshire Cuts Stake By 18% Amid Tech Giant's Troubles.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504050900", "headline": "Buffett says Apple likely to be largest investment at 2024-end, despite Q1 stake cut (update)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504061100", "headline": "Is This Why Berkshire Reduced Apple Stock By 18% In Q1? Buffett Gives A Convincing Reason", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504062200", "headline": "Is This Why Berkshire Reduced Apple Stake By 18% In Q1? Buffett Gives A Convincing Reason", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}]}