{"news": [{"date": "20240424033000", "headline": "3.6M Medicare patients could qualify for Wegovy coverage: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424040000", "headline": "Artisan International Fund Q1 2024 Commentary", "summary": "Artisan International Fund's portfolio meaningfully beat the benchmark MSCI EAFE Index and the MSCI All Country World ex USA Index. Click here to read more."}, {"date": "20240424040200", "headline": "Eaton Vance Worldwide Health Sciences Fund Bolsters Position in IDEXX Laboratories", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424042400", "headline": "LLY vs. JNJ: Which Big Pharma Stock Is Better?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424044000", "headline": "Meet Eli Lilly's Secret Weapon in the Billion-Dollar Weight-Loss Drug Market", "summary": "Lilly recently announced news that could solve a big problem."}, {"date": "20240424070014", "headline": "Investors Heavily Search Eli Lilly and Company (LLY): Here is What You Need to Know", "summary": "Lilly (LLY) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock."}, {"date": "20240424070230", "headline": "Madrigal: 2 Challenges To Overcome To Maintain NASH 'First Mover' Advantage", "summary": "Madrigal recently received FDA approval for its lead candidate resmetirom, targeting a liver condition called NASH. Check out my analysis of MDGL stock here."}, {"date": "20240424072500", "headline": "Should Eli Lilly (LLY) Be in Your Portfolio Ahead of Q1 Earnings?", "summary": "Eli Lilly (LLY) enjoys strong fundamentals and is expected to consistently do well, mainly supported by its new drugs and its solid pipeline."}, {"date": "20240424080154", "headline": "Analysts Estimate Pfizer (PFE) to Report a Decline in Earnings: What to Look Out for", "summary": "Pfizer (PFE) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240424080900", "headline": "4 Large Drug Stocks to Hold on to Amid Industry Challenges", "summary": "Drug and biotech companies are likely to see significant innovation. In the Large-Cap Pharmaceuticals industry, Eli Lilly (LLY), Novo Nordisk (NVO), Merck (MRK) and AbbVie (ABBV) are worth retaining in one's portfolio."}, {"date": "20240424100500", "headline": "Will Healthcare ETFs Lose Momentum as Q1 Earnings Unfold?", "summary": "While the healthcare sector is expected to benefit from cutting-edge medicines, new drug approvals, technological advancements, and deal activities, it is expected to witness a modest earnings decline of 5.6% in the first quarter."}, {"date": "20240424214000", "headline": "Eli Lilly & Co. stock outperforms competitors despite losses on the day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424231100", "headline": "Don’t Miss Out! 3 Top-Tier Blue-Chip Growth Stocks for Your Must-Buy List", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425041800", "headline": "What's Driving AstraZeneca PLC's Surprising 14% Stock Rally?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425051200", "headline": "Dividend Legends: 3 Stocks With Over 100 Years of Payouts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425063300", "headline": "Zacks Industry Outlook Highlights Eli Lilly, Novo Nordisk, Merck and AbbVie", "summary": "Eli Lilly, Novo Nordisk, Merck and AbbVie are part of the Zacks Industry Outlook article."}, {"date": "20240425071526", "headline": "Gear Up for Lilly (LLY) Q1 Earnings: Wall Street Estimates for Key Metrics", "summary": "Besides Wall Street's top -and-bottom-line estimates for Lilly (LLY), review projections for some of its key metrics to gain a deeper understanding of how the company might have fared during the quarter ended March 2024."}, {"date": "20240425093424", "headline": "20 Fastest Growing Health Tech Companies in the World", "summary": "In this article, we will be taking a look at the 20 fastest growing health tech companies in the world. If you do not want to learn about the trends in digital health market, head straight to the 5 Fastest Growing Health tech Companies in the World. Explosive Growth and Key Trends in the Digital […]"}, {"date": "20240425114916", "headline": "These Are The Biotechs Showing Up At The Biggest Cancer Meeting Of The Year (Oral Presentations)", "summary": "The Annual Meeting of ASCO is a major event for clinicians and researchers in the field of oncology. Explore more details here."}, {"date": "20240425190800", "headline": "More than half of the S&P 500 names that reported results this week beat top and bottom line - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425200600", "headline": "Catalyst Watch: Apple earnings, Viking IPO, Chinese EV deliveries and Russell indices' Rank Day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426030000", "headline": "EOI: 9% Plus Income, Paid Monthly, And Solid Past Record", "summary": "Eaton Vance Enhanced Equity Income Fund is an appealing CEF for income investors, offering a nearly 9% yield on a monthly basis. Click here for more on EOI CEF."}, {"date": "20240426033700", "headline": "Jim Cramer Weighs In Ahead Of Apple, Amazon, Eli Lilly Earnings: 'We Have To Run Such A Ridiculous Gauntlet Next Week'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426041300", "headline": "LLY June 7th Options Begin Trading", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426053356", "headline": "AstraZeneca: Strong In A Weak Market", "summary": "Shares of AstraZeneca reached new all-time highs this week despite difficult market conditions in the last two months. Learn more on AZN stock here."}, {"date": "20240426054700", "headline": "SPDR ETF Report For Friday, April 26", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426060034", "headline": "Novo Nordisk: Medicare Coverage To Unlock Another Big Market For Wegovy", "summary": "Novo Nordisk's weight loss drug, Wegovy, receives FDA approval for reducing cardiovascular risk, potentially leading to significant revenue growth. Learn more on NVO stock here."}, {"date": "20240426061500", "headline": "ClearBridge Global Growth Strategy Q1 2024 Portfolio Manager Commentary", "summary": "The Strategy outperformed, led by U.S. mega cap exposure as well as holdings in cyclical sectors and the more defensive health care sector."}, {"date": "20240426090219", "headline": "Top 20 biopharma kick off 9.6% market cap surge in Q1 2024 amid Medicare price talks", "summary": "Some companies, however, reported a market capitalisation decline, including Gilead Sciences and Roche."}, {"date": "20240426103649", "headline": "Eli Lilly and : Lilly Recommends Shareholders Reject “Mini-Tender” Offer by Tutanota LLC", "summary": "Lilly Recommends Shareholders Reject Mini-Tender Offer by Tutanota LLC April 26, 2024 INDIANAPOLIS, April 26, 2024 - Eli Lilly and Company ..."}, {"date": "20240426104900", "headline": "IN BRIEF: Eli Lilly urges shareholders to reject Tutanota's offer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426120055", "headline": "How 'Megatrends' Like Weight-Loss Drugs And Smartwatches Are Bolstering ResMed", "summary": "ResMed stock jumped Friday after crushing sales estimates and wiping out worries that weight-loss drugs would squeeze sleep apnea device sales."}, {"date": "20240426152046", "headline": "Dow Jones Futures: Nvidia Leads 7 New Buys As Market Roars; Fed, Apple, Super Micro Loom", "summary": "Nvidia and several other leaders flashed buy signals as the market roared. Investors should take advantage, but it's a jungle out there."}, {"date": "20240427051500", "headline": "3 Dividend Stocks to Buy and Hold for the Next Decade", "summary": "You'll get dividends and more with these great stocks."}, {"date": "20240427065416", "headline": "Goldman Sachs’ Top 15 Stock Picks for 2024", "summary": "In this article, we’ll take a look into Goldman Sachs’ top 15 stock picks for 2024. If you prefer to skip the introduction about the investment bank and its recent business developments, you can just dive straight into Goldman Sachs’ Top 5 Stock Picks for 2024. Established in 1869 by German immigrant Marcus Goldman, Goldman […]"}, {"date": "20240427071500", "headline": "1 Unstoppable Pharmaceutical Stock Investors Shouldn't Sleep On", "summary": "Eli Lilly may be on the verge of another breakthrough, thanks to its hit GLP-1 medications."}, {"date": "20240427091000", "headline": "Forget Nvidia, These Unstoppable Stocks Are Better Buys", "summary": "These stocks have tremendous potential, and it doesn't depend on the growth prospects for artificial intelligence."}, {"date": "20240427234458", "headline": "Roche: Value Remains Despite Covid-19 Revenue Growth Loss", "summary": "Vabysmo and Phesgo are still strong growth drivers for Roche (RHHBY) going forward. Find out why I rate the stock a strong buy."}, {"date": "20240428010300", "headline": "Earnings week ahead: Amazon, Apple, Pfizer, AMD, Coca-Cola, Starbucks and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428012226", "headline": "Wall Street Breakfast: The Week Ahead", "summary": "This article discusses the upcoming events in the financial world, including the Federal Reserve meeting, corporate earnings, IPOs, and investor events."}, {"date": "20240428033700", "headline": "What do weight-loss drugs mean for the diet industry?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428111700", "headline": "Eli Lilly Just Announced More Good News: Time to Buy?", "summary": "There's no stopping this high-flying biotech."}, {"date": "20240428182146", "headline": "Dow Jones Futures Rise: Nvidia Leads 7 New Buys As Market Roars; Fed, Apple, Super Micro Loom", "summary": "Nvidia and several other leaders flashed buy signals as the market roared. Investors should take advantage, but it's a jungle out there."}, {"date": "20240428224700", "headline": "Eli Lilly & Co (LLY) Gets a Buy from Barclays", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429000100", "headline": "Options Volatility and Implied Earnings Moves This Week, April 29 – May 02, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429020109", "headline": "Pipeline Moves: Investigator-led trial of Lilly’s merestinib in solid tumours terminated", "summary": "The Clinical Trials Arena team also evaluates assets in infectious diseases,"}, {"date": "20240429032900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429042100", "headline": "Notable earnings before Tuesday's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429061500", "headline": "Eli Lilly Q1 Earnings Preview: Weight loss therapies to drive quarterly growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429064600", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429080003", "headline": "Novo Nordisk: Growth Is Still A Better Choice", "summary": "A look at one of the leaders in the global obesity treatment market"}, {"date": "20240429081500", "headline": "Here's How Much Stock Eli Lilly Repurchased in 2023", "summary": "Hint: It probably wasn't as much as you might imagine given the company's immensity."}, {"date": "20240429083214", "headline": "How To Earn $500 A Month From Eli Lilly Stock Ahead Of Q1 Earnings Report", "summary": "Eli Lilly and Company (NYSE:LLY) is set to report first-quarter earnings on Tuesday, April 30. Analysts expect the Indianapolis, Indiana-based company’s quarterly earnings to be $2.46 per share, up from $1.62 per share in the year-ago period. Eli Lilly is projected to post revenue of $8.92 billion, compared to $6.96 billion in the year-earlier quarter, according to data from Benzinga Pro. Fresh off its acquisition of a manufacturing facility from Nexus Pharmaceuticals, some investors may be eyei"}, {"date": "20240429101222", "headline": "UPDATE 1-One dose of Novo Nordisk's Wegovy back in supply, FDA website shows", "summary": "Increasing demand for a type of highly effective diabetes and weight-loss treatment known as GLP-1 agonists has led to supply constraints for drugmakers such as Eli Lilly and Novo Nordisk.  Most doses of Lilly's diabetes drug Mounjaro and weight-loss drug Zepbound would be in limited supply through the second quarter of this year due to increased demand, according to an update on the health regulator's website earlier this month."}, {"date": "20240429133532", "headline": "How expanded use of GLP-1s could affect long-term outlooks for Eli Lilly and Novo Nordisk", "summary": "The latest GLP-1 drugs are starting to see proof of greater use beyond diabetes and obesity. How will it affect makers Novo Nordisk and Eli Lilly?"}, {"date": "20240429143500", "headline": "All Eyes Are on Zepbound Sales as Lilly Reports Earnings", "summary": "When  Eli Lilly  the world-beating behemoth of the big pharma market, reports its quarterly results on Tuesday, the question for investors will be how fast sales of its obesity drug are climbing.  Lilly shares are up 82% over the past 12 months and 26% so far this year.  Investors, and the general public, have been extraordinarily enthusiastic  about the company’s weight-loss drug Zepbound, which the company also sells as a treatment for Type 2 diabetes under the name Mounjaro."}, {"date": "20240429150453", "headline": "Why these analysts are bullish on healthcare stocks", "summary": "The healthcare sector has underperformed throughout 2024, but as the first quarter earnings season unfolds, Jefferies Healthcare Services Equity Research Analyst Brian Tanquilut and Grey Ghost Advisors Private Equity Investor Meghan Fitzgerald join Market Domination to discuss how investors should position themselves in this market. Fitzgerald remains bullish on the healthcare sector, believing it still has \"a lot of long and important tailwinds.\" She cites the sector's historical outperformance during market downturns and election years as reasons for her optimism. Fitzgerald anticipates strong earnings from companies with GLP-1 drug portfolios this week, describing it as an \"easy beat.\" Tanquilut notes a \"rise in broader healthcare utilization trends,\" which is now reflected in healthcare insurers' earnings. While there has been weakness in this area, he highlights the \"strength in volume\" from healthcare providers. However, Tanquilut acknowledges that with consumer spending slowing, consumer-focused healthcare segments, such as drugstores, have experienced pressure. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. Editor's note: This article was written by Angel Smith"}, {"date": "20240429184800", "headline": "GLOBAL BRIEFING: HSBC CEO to retire; first-quarter profit edges down", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429190600", "headline": "Markets Up On Tesla, Q1 Earnings; Q1 Beats After The Bell", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429195600", "headline": "Stock market today: An ugly April for Wall Street is closing with some more losses", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429234900", "headline": "Eli Lilly Non-GAAP EPS of $2.58 beats by $0.09, revenue of $8.77B misses by $160M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000000", "headline": "Eli Lilly reports Q1 EPS $2.58, consensus $2.46", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000200", "headline": "Eli Lilly raises FY24 adjusted EPS view to $13.50-$14.00 from $12.20-$12.70", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000200", "headline": "Wall Street On Edge Ahead Of Fed Decision, Spotlight Falls On Amazon And AMD Earnings: Analyst Says Stocks Survive 'Fragility Test' As April Ends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000600", "headline": "Eli Lilly in charts: Mounjaro, Zepbound, Verzenio, and Jardiance drive revenue growth in Q1; Trulicity declines 26%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430003300", "headline": "Eli Lilly and Co (LLY) Surpasses Q1 Earnings Estimates and Raises Full-Year Guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430003500", "headline": "Eli Lilly raises guidance on weight loss momentum", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430004400", "headline": "Eli Lilly’s stock jumps as first-quarter profit tops estimates amid strong sales of Mounjaro, Zepbound", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430004612", "headline": "Lilly Reports First-Quarter 2024 Financial Results and Raises Full-Year Revenue Guidance by $2 Billion, Highlights Pipeline Momentum", "summary": "Revenue in Q1 2024 increased 26%, driven by Mounjaro, Zepbound, Verzenio and Jardiance. Pipeline progress included positive results from two Phase 3 trials of tirzepatide for obstructive sleep..."}, {"date": "20240430004649", "headline": "Eli Lilly beats profit estimates on diabetes and weight-loss drug strength", "summary": "Eli Lilly beat Wall Streetestimates for first-quarter profit on Tuesday, helped by risingdemand for its weight-loss treatment Zepbound and type 2diabetes drug Mounjaro. The..."}, {"date": "20240430005410", "headline": "Lilly: Q1 Earnings Snapshot", "summary": "INDIANAPOLIS — INDIANAPOLIS — Eli Lilly and Co. on Tuesday reported first-quarter net income of $2.24 billion. On a per-share basis, the Indianapolis-based company said it had net income..."}, {"date": "20240430005850", "headline": "Eli Lilly and : Q1 Earnings 2024 Earnings Presentation", "summary": "Eli Lilly and Company Q1 2024 Earnings Call April 30, 2024 1 ..."}, {"date": "20240430005851", "headline": "Eli Lilly and : Q1 Earnings 2024 Press Release", "summary": "April 30, 2024 For Release: Immediately Refer to: Jordan Bishop; jordan.bishop@lilly.com; 473-5712 Joe Fletcher;..."}, {"date": "20240430013100", "headline": "Morning Brew: Tech Giants Lead Market Movements Amidst Earnings Season", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430014728", "headline": "Eli Lilly: target ranges raised for 2024", "summary": "On the occasion of its quarterly publication, Eli Lilly announced that it was raising its annual target range for adjusted EPS by $1.30, to $13.50 to $14, and for revenues by $2 billion, to between..."}, {"date": "20240430022300", "headline": "Fly Intel: Pre-market Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430022500", "headline": "5 stocks to watch on Tuesday: KO, MCD, AMZN and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430022600", "headline": "TOP NEWS: Eli Lilly lifts outlook, ramps up production to meet demand", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430023000", "headline": "Bank of America Securities Keeps Their Buy Rating on Eli Lilly & Co (LLY)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430023300", "headline": "Analysts’ Top Healthcare Picks: Qiagen (QGEN), Eli Lilly & Co (LLY)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430024000", "headline": "Unusually active option classes on open April 30th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430025500", "headline": "Early notable gainers among liquid option names on April 30th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430030000", "headline": "LLY Earnings: Eli Lilly Gains on Strong Q1 Earnings Beat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430030616", "headline": "Lilly rides Mounjaro, Zepbound to better-than-expected 1Q profit despite supply issues", "summary": "Rapidly climbing sales of the new obesity drug Zepbound and its counterpart for diabetes, Mounjaro, pushed Eli Lilly to a better-than-expected first-quarter profit. The drugmaker also hiked its..."}, {"date": "20240430031400", "headline": "FTC expands patent listing challenges for drugs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430034500", "headline": "Biggest stock movers today: LLY, NXPI, MSTR, ST, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430035500", "headline": "LLY Stock Earnings: Eli Lilly Beats EPS, Misses Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430035600", "headline": "Eli Lilly Increases FY24 Outlook, Joins Brinker International, Zebra Technologies, 3M And Other Big Stocks Moving Higher On Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430042500", "headline": "FOMC Meeting Samsung Over Takes Apple, AI Demand Indication Ahead From AMD, Amazon And Super Micro", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430050300", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430060224", "headline": "Eli Lilly and Company 2024 Q1 - Results - Earnings Call Presentation", "summary": "The following slide deck was published by Eli Lilly and Company in conjunction with their 2024 Q1 earnings call."}, {"date": "20240430062200", "headline": "Eli Lilly, 3M rise; MicroStrategy, Chegg fall, Tuesday, 4/30/2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430063000", "headline": "Why H&E Equipment Services Shares Are Trading Lower By Around 18%? Here Are Other Stocks Moving In Tuesday's Mid-Day Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430063600", "headline": "Stocks Dive On Fears Of Hawkish Fed; Treasury Yields Rise, Bitcoin Tumbles To $60,000: What's Driving Markets Tuesday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430064100", "headline": "10 Health Care Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430072709", "headline": "Eli Lilly and Company (LLY) Q1 2024 Earnings Call Transcript", "summary": "Eli Lilly and Company (NYSE:NYSE:LLY) Q1 2024 Earnings Conference Call April 30, 2024 10:00 AM ETCompany ParticipantsJoe Fletcher â\u0080\u0093 Senior Vice..."}, {"date": "20240430081700", "headline": "Pre-Markets Sell on Last Trading Day of April", "summary": "Today we close out a month that's likely to be the first negative one since October of last year."}, {"date": "20240430082000", "headline": "Wall Street Lunch: Reefer Gladness", "summary": "The reported move falls short of legalizing recreation pot use. Eli Lilly boosts outlook on weight loss drug performance. Wage inflation comes in hot for Q1."}, {"date": "20240430082129", "headline": "US STOCKS-Wall St falls in lead up to Fed verdict after hot labor costs data", "summary": "Wall Street's main indexes fell on Tuesday with caution prevailing ahead of the Federal Reserve's interest-rate decision and as stronger-than-expected labor costs hinted at persistent inflation.  U.S. labor costs increased in the first quarter amid a rise in wages and benefits, confirming the surge in inflation early in the year that will likely delay a much-anticipated interest rate cut later in 2024.  \"This pretty much tells you that the Fed is going to be very reluctant to reduce short-term interest rates in 2024 and that's had the predictable impact on the stock market,\" said Hugh Johnson, chief economist at Hugh Johnson Economics."}, {"date": "20240430083635", "headline": "Trending : Eli Lilly Reports Strong Sales of Weight-Loss, Diabetes Drugs", "summary": "14:20 -- Eli Lilly & Co. is one of the most mentioned companies in the U.S. across all news items in the past 12 hours, according to Factiva data. The company reported first-quarter financial..."}, {"date": "20240430084044", "headline": "Eli Lilly's GLP-1 demand drives up stock price post Q1 results", "summary": "Shares of Eli Lilly (LLY) are soaring in Tuesday's trading session after the company raised its full-year guidance, driven by the surging demand for its offerings. BMO Capital Markets BioPharma Equity Research Managing Director Evan Seigerman joins the Morning Brief to discuss the stock's outlook. Seigerman notes that \"demand is off the charts\" for the company, and the raised guidance supports the bullish outlook. Despite missing on revenue, the company beat profit expectations, bolstering Seigerman's optimism about the stock's future performance. Addressing the competitive landscape Seigerman says it's \"unlikely that any competitors are going to be out there in the next couple of years.\" Even if competitors enter the market, he believes Eli Lilly will continue advancing, giving them a distinct advantage. Seigerman highlights that the company is becoming \"more and more efficient,\" opening additional facilities to support the surging demand. However, he notes that demand is through the roof, making it challenging to keep up. The analyst adds that his price target for the company is $900, but the stock's performance will be \"driven by how quickly they can ramp up supply because the demand is there.\" For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Angel Smith"}, {"date": "20240430084800", "headline": "Earnings Data Deluge", "summary": "Earnings Data Deluge."}, {"date": "20240430090635", "headline": "Eli Lilly stock jumps on weight-loss drug sales forecast", "summary": "Shares of Eli Lilly (LLY) are moving higher on Tuesday morning as the company reported its first-quarter earnings results, revealing a 26% year-over-year revenue increase in a figure of $8.77 billion. Ultimately, this revenue print fell short of estimates ($8.92 billion). The pharmaceutical giant did, however, raise its annual sales forecast by $2 billion due to an insatiable demand for its GLP-1 weight-loss drugs Mounjaro and Zepbound. Yahoo Finance Health Reporter Anjalee Khemlani joins Catalysts to break down the report and what it means for the company moving forward. For more expert insight and the latest market action, click here to watch this full episode of Catalysts. This post was written by Nicholas Jacobino"}, {"date": "20240430092600", "headline": "Why Eli Lilly Stock Is Jumping Today", "summary": "Investors are cheering the big-pharma company's improved outlook."}, {"date": "20240430093820", "headline": "US STOCKS-Wall St falls on hot labor costs data, caution before Fed verdict", "summary": "Wall Street's main indexes fell on Tuesday with caution prevailing ahead of the Federal Reserve's interest-rate decision and as stronger-than-expected labor costs hinted at persistent inflation.  U.S. labor costs increased in the first quarter amid a rise in wages and benefits, confirming the surge in inflation early in the year that will likely delay a much-anticipated interest rate cut later in 2024.  The data comes ahead of the Federal Reserve Open Market Committee's (FOMC) two-day meeting during the day, with the interest rate verdict and Chair Jerome Powell's remarks at the end of the event in focus."}, {"date": "20240430094107", "headline": "Eli Lilly's Weight-Loss Drug Still Going Strong, Boosts Annual Forecast", "summary": "Tuesday, Eli Lilly And Co (NYSE:LLY) reported first-quarter revenue of $8.77 billion, up 26% year over year, marginally missing the consensus of $8.92 billion, driven by increases of 16% in volume and 10% due to higher realized prices. The volume increase was primarily driven by growth from Mounjaro, Zepbound, Verzenio, and Jardiance, partially offset by declines in Trulicity. Strong demand for the company’s incretin medicines outpaced supply increases. Also Read: Changing Frugal Eating Habits –"}, {"date": "20240430094500", "headline": "Eli Lilly (LLY) Q1 Earnings Top, Sales Miss, 2024 View Raised", "summary": "Eli Lilly (LLY) beats first-quarter estimates for earnings but misses the same for sales. It raises its guidance for 2024 on strong demand for Mounjaro and Zepbound."}, {"date": "20240430095000", "headline": "Incyte's (INCY) Q1 Earnings & Revenues Fall Shy of Estimates", "summary": "Incyte's (INCY) first-quarter 2024 earnings and revenues miss estimates. The company maintains 2024 revenue guidance for its lead drug, Jakafi."}, {"date": "20240430095940", "headline": "Top Midday Stories: Shares of Eli Lilly, HSBC Get Post-Earnings Bump; BBVA Exploring Merger With Sabadell; FTC Disputes 300 'Junk' Patent Listings", "summary": "Top Midday Stories: Shares of Eli Lilly, HSBC Get Post-Earnings Bump; BBVA Exploring Merger With Sabadell; FTC Disputes 300 'Junk' Patent Listings"}, {"date": "20240430101800", "headline": "NEW YORK MARKET CLOSE: Dow hit by new inflationary scare ahead of Fed", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430102117", "headline": "IBD Stock Of The Day Eli Lilly Surges After Weight-Loss Drug Obliterates Sales Views", "summary": "Eli Lilly stock jumped Tuesday despite a mixed first-quarter report, after sales of weight-loss drug Zepbound obliterated expectations."}, {"date": "20240430102630", "headline": "Lilly Soars as Forecast Boost Shows Weight-Loss Drugs’ Power", "summary": "(Bloomberg) -- Eli Lilly & Co.’s shares soared as its brighter outlook for 2024 raised the potential ceiling for new weight-loss drugs even further in the eyes of analysts and investors.Most Read from BloombergHSBC CEO Quinn Unexpectedly Steps Down After Almost 5 YearsTesla Soars on Tentative China Approval for Driving SystemStocks Trade for 390 Minutes a Day. Increasingly, Only 10 MatterBinance and CZ’s Fortunes Are Set to Grow, Jail or no JailCocoa Prices Swing Wildly as Liquidity Overshadows"}, {"date": "20240430110420", "headline": "Potential for Weight-Loss Drugs Boosts Eli Lilly", "summary": "Eli Lilly & Co.'s shares soared as its brighter outlook for 2024 raised the potential ceiling for new weight-loss drugs even further in the eyes of analysts and investors. Lilly says supply and pricing for Zepbound and the diabetes treatment Mounjaro will improve later this year. Bloomberg's Madison Muller reports. Follow Bloomberg for business news & analysis, up-to-the-minute market data, features, profiles and more: http://www.bloomberg.com Connect with us on... Twitter: https://twitter.com/business Facebook: https://www.facebook.com/bloombergbusiness/ Instagram: https://www.instagram.com/quicktake/?hl=en"}, {"date": "20240430112330", "headline": "Eli Lilly reports $2 billion from Mounjaro, Zepbound in Q1 2024", "summary": "Eli Lilly missed on total sales in the first quarter, but its GLP-1 drugs helped boost sales by 26% over those in Q1 2023."}, {"date": "20240430115921", "headline": "Taxpayer to fork out £85bn to cover Bank of England losses", "summary": "Taxpayers will cover £85bn of losses made by the Bank of England on its quantitative easing programme which began during the global financial crisis, according to the latest estimates."}, {"date": "20240430120009", "headline": "Stocks Keep Sinking, With Dow Losing 300 Points; IBD 50 Stock Hubbell Plunges", "summary": "The Dow Jones lost more than 400 points at one point in the stock market today. Electronic products maker Hubbell's stock plunged below a key level after its earnings report."}, {"date": "20240430123016", "headline": "Eli Lilly (LLY) Q1 2024 Earnings Call Transcript", "summary": "LLY earnings call for the period ending March 31, 2024."}, {"date": "20240430132209", "headline": "Stocks At Day's Lows As Dow Loses 400 Points; These Stocks Flash Sell Signals", "summary": "The Dow Jones lost more than 400 points on the stock market today. This Warren Buffett stock pulled back after the earnings report."}, {"date": "20240430135825", "headline": "Sector Update: Health Care Stocks Mixed Late Afternoon", "summary": "Sector Update: Health Care Stocks Mixed Late Afternoon"}, {"date": "20240430140043", "headline": "US STOCKS-Wall Street stocks fall as markets weigh strong wage data, Fed meeting", "summary": "U.S. stocks ended lower on Tuesday as markets weighed economic data showing rising labor costs and deteriorating consumer confidence on the eve of a key Federal Reserve policy meeting to decide the direction of interest rates.  Data showed on Tuesday that U.S. labor costs rose by a more-than-expected 1.2% last quarter, indicating an uptick in wage pressures.  A survey also found that U.S. consumer confidence worsened in April, dropping to its lowest level in more than 1-1/2 years."}, {"date": "20240430140543", "headline": "US Equity Markets Close Down Tuesday After Higher Wage Data", "summary": "US Equity Markets Close Down Tuesday After Higher Wage Data"}, {"date": "20240430143809", "headline": "Stocks End April On Sour Note, Dow Loses 570 Points", "summary": "The Dow Jones shed 570 points on the stock market today. 3M was one of only two rising stocks on the Dow. Eli Lilly was a bright spot."}, {"date": "20240430143956", "headline": "US STOCKS-Wall Street ends lower as markets weigh strong wage data, Fed meeting", "summary": "U.S. stocks ended lower on Tuesday as markets weighed economic data showing rising labor costs and deteriorating consumer confidence on the eve of a key Federal Reserve policy meeting to decide the direction of interest rates.  Data showed on Tuesday that U.S. labor costs rose by a more-than-expected 1.2% last quarter, indicating an uptick in wage pressures.  A survey also found that U.S. consumer confidence worsened in April, dropping to its lowest level in more than 1-1/2 years."}, {"date": "20240430151421", "headline": "REFILE-CORRECTED-US STOCKS-Wall Street stocks fall as markets weigh strong wage data, Fed meeting", "summary": "U.S. stocks ended lower on Tuesday as markets weighed economic data showing rising labor costs and deteriorating consumer confidence on the day of a key Federal Reserve policy meeting to decide the direction of interest rates.  Data showed on Tuesday that U.S. labor costs rose by a more-than-expected 1.2% last quarter, indicating an uptick in wage pressures."}, {"date": "20240430155100", "headline": "These 3 Companies Recently Lifted Guidance", "summary": "Guidance lifts are among the most positive announcements shareholders can hear, injecting confidence in the long-term picture."}, {"date": "20240430161633", "headline": "Dow Jones Futures: Stock Market Skids Into Fed; Amazon Rises Late As AMD, Super Micro Plunge", "summary": "The market rally stumbled ahead of the Fed meeting. Amazon and AI plays Super Micro and AMD reported earnings late."}, {"date": "20240430202800", "headline": "Eli Lilly 'On Its Way' To $1 Trillion Market Cap, Analysts Say: It's A 'Have' In A Sea Of 'Have Nots'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430204000", "headline": "Q1 Earnings Seasons Picks & Pans: The 4 Biggest Stock Winners (and 3 Losers)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430221300", "headline": "Eli Lilly price target raised by $103 at Barclays, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430230141", "headline": "Decoding Eli Lilly and Co (LLY): A Strategic SWOT Insight", "summary": "Unveiling the Financial and Strategic Position of Eli Lilly and Co in 2024"}, {"date": "20240430230300", "headline": "Pfizer plans direct-to-consumer platform to sell Covid, migraine drugs - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430231500", "headline": "Wall Street Analysts Are Bullish on Top Healthcare Picks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430233700", "headline": "Eli Lilly price target raised by $50 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430234300", "headline": "Analysts Offer Insights on Healthcare Companies: Eli Lilly & Co (LLY), Exelixis (EXEL) and Zynex (ZYXI)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430235100", "headline": "Analysts Offer Insights on Healthcare Companies: 10x Genomics (TXG), Axonics Modulation Technologies (AXNX) and Eli Lilly & Co (LLY)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430235200", "headline": "Galderma Seizes Ozempic Face Opportunity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501000000", "headline": "This Options-Backed Strategy Can Help You Dodge the Stock Market’s Hazards", "summary": "Harness some of the world’s most powerful financial forces by combining compounding and dividends with conservative options strategies."}, {"date": "20240501001600", "headline": "Truist Financial Keeps Their Buy Rating on Eli Lilly & Co (LLY)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501002800", "headline": "LLY Crosses Above Average Analyst Target", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501002900", "headline": "Eli Lilly price target raised by $70 at Cantor Fitzgerald, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501011200", "headline": "GLOBAL BROKER RATINGS: Bernstein raises Deutsche Lufthansa", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501011740", "headline": "Eli Lilly and Co (LLY) Q1 2024 Earnings Call Transcript Highlights: Stellar Growth and ...", "summary": "Discover how Eli Lilly and Co (LLY) achieved impressive Q1 results and raised its 2024 outlook, driven by strong product performance and strategic expansions."}, {"date": "20240501012544", "headline": "Q1 2024 Eli Lilly and Co Earnings Call", "summary": "Q1 2024 Eli Lilly and Co Earnings Call"}, {"date": "20240501015600", "headline": "Eli Lilly price target raised by $101 at BMO Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501030200", "headline": "What 23 Analyst Ratings Have To Say About Eli Lilly and Co", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501030400", "headline": "Eli Lilly price target raised by $42 at Truist, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501032100", "headline": "Company News for May 1, 2024", "summary": "Companies In The News Are: PYPL, LLY, MMM, GLW."}, {"date": "20240501035200", "headline": "3 Healthcare Stocks With the Potential to Triple Your Investment by 2026", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501040011", "headline": "3 stocks with the biggest gains took April's biggest losses", "summary": "The stock market's very rough April saw some of the biggest gainers of the first three months take some of the biggest dings to their market caps. And at the same time, some of the sectors that struggled in Q1 saw a similar reversal of fortune in April."}, {"date": "20240501050012", "headline": "Eli Lilly: Bloated Stock", "summary": "Eli Lilly and Company missed sales targets by $160 million in Q1 despite strong growth in diabetes and weight loss drugs. Read why LLY stock is a hold."}, {"date": "20240501050300", "headline": "Stock Market Crash Alert: 3 Must-Buy Biotech Stocks When Prices Plunge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501050600", "headline": "Amazon, AMD, Super Micro Earnings Tell Investors the Same Thing, It’s Bad News. And 5 Other Things to Know Before Markets Open.", "summary": "Tesla takes action amid slowing growth at fast-charging stations, Walmart unveils premium private-label foods and closes health clinics, and other news to start your day."}, {"date": "20240501053133", "headline": "Dow Jones Futures Fall As Fed Looms; Amazon Rises As AMD, Super Micro Plunge", "summary": "The market rally stumbled ahead of the Fed meeting. Amazon rose on earnings while AI plays Super Micro and AMD plunged."}, {"date": "20240501054100", "headline": "Stock Market Crash Warning: Don’t Get Caught Holding These 3 Consumer Stocks.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501064446", "headline": "Eli Lilly: Management Raises 2024 Guidance, Driven By GLP-1 Franchise", "summary": "Eli Lilly's strong Q1 results show increased revenues and non-GAAP EPS while their impressive pipeline offers potential treatments. Learn more about LLY stock here."}, {"date": "20240501064500", "headline": "Profit from the Panic: 3 Stocks to Pounce on When They Become Steals", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501070930", "headline": "Eli Lilly: The GLP-1 Wonder Continues, A Bullish Beat And Raise", "summary": "Eli Lilly's growth trajectory, strong new-product cycle, and pipeline make it a buy, with a potential fair value of $1,000 per share. Read more on LLY stock here."}, {"date": "20240501083200", "headline": "Amazon, AMD, and Super Micro Sing the Same Sad Song, and 5 Other Things to Know Before Markets Open.", "summary": "Tesla takes action amid slowing growth at fast-charging stations, Walmart unveils premium private-label foods and closes health clinics, and other news to start your day."}, {"date": "20240501084105", "headline": "Eli Lilly Shoots Higher: It's Time To Be Cautious", "summary": "If we see shares continue to climb like this, a downgrade for Eli Lilly and Company stock could be on the horizon. Learn why we rate LLY stock a hold."}, {"date": "20240501090000", "headline": "ETFs to Buy as Eli Lilly Beats Q1 Earnings, Lifts Outlook", "summary": "Eli Lilly and Company (LLY) raised its outlook for 2024 on rapidly climbing sales of the new obesity drug Zepbound and its counterpart for diabetes, Mounjaro."}, {"date": "20240501093600", "headline": "Danish Medicines Agency Says Type 2 Diabetes Patients Should Start Treatment With 'Cheaper' Drugs", "summary": "Danish Medicines Agency Says Type 2 Diabetes Patients Should Start Treatment With 'Cheaper' Drugs"}, {"date": "20240501110744", "headline": "Amgen Stock: Recent Weakness Is Not A Buying Opportunity Yet", "summary": "Amgen Inc. shares dropped 20% due to a below-consensus outlook. Their obesity candidate MariTide may be their biggest revenue producer. Click for my AMGN update."}, {"date": "20240501190308", "headline": "British pharmacies vie for weight-loss patients with drug price cuts", "summary": "Online pharmacies and slimming clinics are cutting prices for Wegovy and Mounjaro in Britain just months after the weight-loss drugs were launched there, as initial supply shortages ease. ..."}, {"date": "20240501193200", "headline": "Analysts Offer Insights on Healthcare Companies: Tandem Diabetes Care (TNDM) and Eli Lilly & Co (LLY)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501193700", "headline": "Radiopharma stocks higher as sector welcomes the latest M&A deal", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501201000", "headline": "Palatin spikes as FDA clears mid-stage trial for weight loss therapy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501201600", "headline": "Palatin gets FDA OK to test weight loss therapy with Eli Lilly’s tirzepatide", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501210600", "headline": "Weigh Loss Competition Heats Up In Britain, Online Pharmacies Slash Prices for Wegovy and Mounjaro", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501211500", "headline": "Novo Nordisk lifts guidance as Ozempic, Wegovy sales surge; but stock falls 3%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501224500", "headline": "Amgen stock rallies 13% on weight-loss drug updates, tweaked guidanace", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501225100", "headline": "Amgen stock rallies 13% amid weight-loss drug updates, tweaked guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501225500", "headline": "Demand Soars For Novo Nordisk's Weight-Loss Drug Wegovy Despite Supply Constraints And Eli Lilly Competition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501230000", "headline": "FOCUS-British pharmacies vie for weight-loss patients with drug price cuts", "summary": "Online pharmacies and slimming clinics are cutting prices for Wegovy and Mounjaro in Britain just months after the weight-loss drugs were launched there, as initial supply shortages ease.  But growing competition between retailers has raised fears that some patients who buy the drugs themselves, rather than relying on the National Health Service (NHS), will miss out on long-term aftercare if they keep switching providers."}, {"date": "20240501233403", "headline": "Obesity drugmaker Novo Nordisk raises outlook, Q1 profit beats forecast", "summary": "LONDON (Reuters) -Novo Nordisk raised its 2024 outlook on Thursday as it posted first-quarter operating profit above analyst forecasts.  Novo said it now expects sales growth this year of between 19% and 27% in local currencies, compared to the previously guided range for 18% to 26% growth."}, {"date": "20240501234203", "headline": "UPDATE 5-Novo Nordisk raises outlook fuelled by obesity drug demand", "summary": "Novo Nordisk raised its 2024 outlook on Thursday and delivered better-than-expected first-quarter profits as the Danish drugmaker races to boost output of its Wegovy weight-loss drug and fend off competition from rival Eli Lilly.  Novo is currently the most valuable company in Europe by market capitalisation, worth some 540.4 billion euro ($576.44 billion) before earnings on Thursday, on the back of Wegovy's popularity.  Sales growth in the U.S. was positively impacted by a one-off sales adjustment, the company said."}, {"date": "20240502022100", "headline": "Novo Nordisk says prices dropping for Wegovy, Ozempic: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502030300", "headline": "3 Stocks Gunning for Trillion-Dollar Status: The Players to Own Now", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502030400", "headline": "GLP-1 drug prices falling at UK pharmacies, clinics: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502034500", "headline": "Here's Why Eli Lilly Stock Remains a Screaming Buy", "summary": "The biggest healthcare company in the world could grow much larger over the next decade."}, {"date": "20240502042600", "headline": "Unpacking the Latest Options Trading Trends in Eli Lilly and Co", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502054848", "headline": "Eli Lilly and Company (NYSE:LLY) Just Released Its First-Quarter Earnings: Here's What Analysts Think", "summary": "It's been a good week for Eli Lilly and Company ( NYSE:LLY ) shareholders, because the company has just released its..."}, {"date": "20240502063900", "headline": "Novo sees Wegovy sales dip on lower price, tight supply", "summary": "First quarter sales of the in-demand obesity drug were down slightly compared to the fourth quarter last year, as the company tries to meet demand."}, {"date": "20240502084154", "headline": "Eli Lilly and Company (NYSE:LLY) Q1 2024 Earnings Call Transcript", "summary": "Eli Lilly and Company (NYSE:LLY) Q1 2024 Earnings Call Transcript April 30, 2024 Eli Lilly and Company beats earnings expectations. Reported EPS is $2.58, expectations were $2.47. Operator: Ladies and gentlemen, thank you for standing by, and welcome to the Lilly Q1 2024 Earnings Call. At this time all participants are in a listen-only mode. […]"}, {"date": "20240502105556", "headline": "Novo Nordisk sales up 26% driven by GLP-1s, misses 11% on Wegovy", "summary": "Novo Nordisk CEO Lars Jørgensen tells Yahoo Finance the company is confident about a robust GLP-1 sales year despite missing Wall Street estimates."}, {"date": "20240502110800", "headline": "Novo Nordisk’s Wegovy Sales More Than Doubled. Why the Stock Is Falling.", "summary": "The Danish pharmaceutical firm, Europe’s most valuable company, said sales of the weight-loss drug jumped 106% in the first quarter."}, {"date": "20240502125900", "headline": "Earnings Season: 3 Companies Boosting Guidance", "summary": "Earnings season continues to chug along, with results from many companies already delivered. And concerning positivity, all three of these companies' report fit the criteria, lifting outlooks following the results."}, {"date": "20240502140808", "headline": "Market Chatter: Novo Nordisk, Eli Lilly's Weight-Loss Drugs Get Price Cuts in UK", "summary": "Market Chatter: Novo Nordisk, Eli Lilly's Weight-Loss Drugs Get Price Cuts in UK"}, {"date": "20240502152926", "headline": "Amgen Soars After CEO Gives Update on Experimental Obesity Drug", "summary": "(Bloomberg) -- Amgen Inc.’s shares soared in late trading after its chief executive officer said he was “very encouraged” by early results from a study of the company’s experimental obesity drug, MariTide. Most Read from BloombergSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineTurkey Confirms All Trade Halt With Israel Over War in GazaHuawei Secretly Backs US Research, Awarding Millions in PrizesBiden Calls Ally Japan ‘Xenophobic’ Along With China, RussiaIn Jamie Dimon's America, t"}, {"date": "20240502160146", "headline": "Weight Loss Competition Heats Up In Britain, Online Pharmacies Slash Prices for Wegovy and Mounjaro", "summary": "Online pharmacies and slimming clinics in Britain are reducing prices for Novo Nordisk A/S’s (NYSE:NVO) Wegovy and Eli Lilly And Co (NYSE:LLY) Mounjaro as initial supply shortages ease, a move driven by growing competition among retailers. The reduced prices at retailers like Simple Online Pharmacy, Mayfair Weight Loss Clinic, and London Slimming Clinic reflect the increasing demand for these weight-loss drugs. Simple Online Pharmacy, for instance, slashed the price of Mounjaro starter doses fro"}, {"date": "20240502170300", "headline": "Analysts reveal Eli Lilly stock price targets after earnings", "summary": "Here's what could happen next to Eli Lilly shares."}, {"date": "20240502172300", "headline": "1 Wall Street Analyst Thinks Eli Lilly Stock Is Going to $892. Is It a Buy?", "summary": "The company seems to be going from strength to strength lately."}, {"date": "20240502194400", "headline": "3 Under-The-Radar Stocks That Could Be Worth Over $1 Trillion by 2030", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502204800", "headline": "Noteworthy Friday Option Activity: LLY, FLR, SBUX", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503001244", "headline": "Eli Lilly: Don't Overpay For Miracle Drugs", "summary": "Eli Lilly is appreciated for a growing portfolio of weight loss drugs, yet these don't represent income streams of infinite money. Learn why I rate LLY a hold."}, {"date": "20240503012200", "headline": "GLOBAL BROKER RATINGS: DZ Bank cuts Starbucks, CFRA raises Qualcomm", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503022100", "headline": "Amgen ‘very encouraged’ by data from weight-loss-drug trial, as stock jumps", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503033300", "headline": "Unveiling Eli Lilly and Co (LLY)'s Value: Is It Really Priced Right? A Comprehensive Guide", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503033700", "headline": "Amgen stock rallies 13% on GLP-1 weight-loss drug update", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503041400", "headline": "Amgen price target raised by $10 at BofA, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503050200", "headline": "Vanguard Health Care Fund's Strategic Moves in Q1 2024: A Focus on Pfizer Inc", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503050458", "headline": "How the CFOs of Eli Lilly and Novo Nordisk are coping with ‘unprecedented demand’ for weight-loss drugs", "summary": "And the demand isn't slowing down."}, {"date": "20240503051340", "headline": "US STOCKS-Futures rise on Apple, Amgen boost; jobs data awaited", "summary": "Futures tied to Wall Street's main indexes gained on Friday, lifted by upbeat corporate updates from Apple and Amgen, while traders braced for a key jobs report for a clearer outlook on the labor market and the interest rate path.  Apple jumped 6.1%, outpacing other megacap stocks in premarket trading after the iPhone maker unveiled a record $110 billion share buyback program and beat modest expectations for quarterly results and forecast."}, {"date": "20240503062400", "headline": "Amgen shares soar as executives outline obesity drug push", "summary": "The company said data for its Wegovy competitor was promising enough to move the drug into late-stage testing, triggering a stock jump that added billions to Amgen’s market value."}, {"date": "20240503064000", "headline": "10 Health Care Stocks Whale Activity In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503065825", "headline": "US STOCKS-Wall St set to open sharply higher on soft jobs data", "summary": "Wall Street's main indexes were set to open higher on Friday after a softer-than-expected jobs report revived hopes of the Federal Reserve cutting interest rates this year, while gains in Apple and Amgen on upbeat corporate updates added support.  The Labor Department report showed U.S. nonfarm payrolls increased by 175,000 jobs in April, compared with expectations for an increase of 243,000, according to economists polled by Reuters."}, {"date": "20240503085100", "headline": "Amgen Knocks Novo Nordisk's Ozempic Stock Rally. Its Stock Is Flying.", "summary": "Amgen’s progress on its experimental weight-loss drug offered investors a reminder that Novo Nordisk isn’t the only game in town.  Amgen’s jumped some 13%.  Amgen late Thursday gave some brief but bullish commentary on its drug candidate, MariTide."}, {"date": "20240503092900", "headline": "Pharma Stock Roundup: LLY, NVO, PFE Q1 Results, JNJ's New Plan to Resolve Talc Claims", "summary": "Eli Lilly (LLY), Novo Nordisk (NVO), Pfizer (PFE) and AbbVie (ABBV) announce their first-quarter results."}, {"date": "20240503093526", "headline": "Weight-loss drug competition heats up. Is Wegovy in trouble?", "summary": "The competition among weight-loss drugs is heating up as Amgen (AMGN) reports positive early results from the development of its GLP-1 weight-loss drug, MariTide. The pharmaceutical company also topped first-quarter revenue estimates despite reporting a loss of $113 million. Yahoo Finance Senior Health Reporter Anjalee Khemlani breaks down how competition in the obesity drug market is ramping up as drug manufacturers find new medical use cases for this class of drugs. She refers back to comments made by Novo Nordisk (NVO) CEO Lars Fruergaard Jørgensen — Novo Nordisk makes Wegovy and Ozempic — and Eli Lilly (LLY) CEO Dave Ricks — Eli Lilly makes Zepbound and Mounjaro — to Yahoo Finance over the past several months. For more expert insight and the latest market action, click here to watch this full episode of Catalysts. This post was written by Melanie Riehl"}, {"date": "20240503094800", "headline": "Amgen (AMGN) Q1 Earnings Top, Stock Up on Obesity Drug Update", "summary": "Amgen (AMGN) beats first-quarter 2024 estimates for earnings and sales. Amgen is \"very encouraged\" by interim data from the phase II study on obesity candidate MariTide."}, {"date": "20240503100000", "headline": "Eli Lilly Remains Expensive Here - Minimal Margin Of Safety", "summary": "Eli Lilly continues to demonstrate promising long-term prospects. But read why it may be more prudent to maintain our previous Hold rating for LLY stock."}, {"date": "20240503125308", "headline": "Analyst unveils Amgen stock price target after weight-loss drug data", "summary": "Here's what could happen next to Amgen shares."}, {"date": "20240503150725", "headline": "Amgen's peek at its GLP-1 drug trial results heightens competition in obesity market", "summary": "Competition is heating up in the GLP-1 space as Amgen gets closer to the finish line with its candidate."}, {"date": "20240503153300", "headline": "Amazon Stock Is on a Roll. Here’s Why It’s on This Firm’s ‘Best Ideas List.’", "summary": "Amazon reported strong first-quarter results, with revenue and operating income ahead of expectations.  The company delivered operating income of $15.3 billion, above consensus of $11.3 billion, while reporting better-than-expected growth in both Amazon Web Services (+17.2% year over year versus Street +15%) and advertising (+24.3% Y/Y versus Street +23.5%).  Amazon has now reported operating income above the high end of its guidance range for five consecutive quarters, and the company has a number of drivers for further margin expansion in place, including continued cost efficiencies within its fulfillment network as well as the ongoing mix shift toward higher-margin AWS and advertising revenue."}, {"date": "20240503223412", "headline": "SPMO: Heavy Into TMT Stocks After The March Reconstitution", "summary": "Invesco S&P 500 Momentum ETF's recent slowdown despite AI and semiconductor stocks' strong performance. Learn more on SPMO ETF here."}, {"date": "20240504031302", "headline": "Amgen Could Become A Real Contender In The Obesity Market", "summary": "Amgen's shares surge on positive phase 2 trial results for obesity candidate MariTide, increasing its potential as a strong player in the market."}, {"date": "20240504032600", "headline": "Eli Lilly Raised Its Outlook. Is the Stock a Buy Now?", "summary": "The anti-obesity medication stock is way up, and there could be more fuel in the tank."}, {"date": "20240504044500", "headline": "Can Pfizer Challenge Lilly and Novo Nordisk in the Obesity Market?", "summary": "Where there's a will, there's a way. And Pfizer appears to have the will to stake a claim in the massive obesity drug market."}, {"date": "20240504053000", "headline": "Eli Lilly: Great Time To Divest Before It Potentially Crashes", "summary": "Eli Lilly's strong Q1 earnings initially boosted LLY stock, but losing buying momentum and questionable valuation make it a risky investment."}, {"date": "20240504063000", "headline": "Move Over, Mounjaro. Eli Lilly Has Another Blockbuster in the Making", "summary": "Eli Lilly has made inroads in the red-hot weight-loss market thanks to its diabetes blockbuster, Mounjaro."}]}