{"news": [{"date": "20240411024100", "headline": "DoorDash upgraded, Airbnb downgraded: Wall Street's top analyst calls", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411033300", "headline": "Visa, Mastercard score bull ratings in new coverage at TD Cowen", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411102223", "headline": "TD Cowen Initiates Coverage of Mastercard (MA) with Buy Recommendation", "summary": ""}, {"date": "20240411231700", "headline": "MA, MCO, AMT: These Stocks Are Leading Hedge Fund Expert’s Top 3 Picks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412000500", "headline": "Wall Street Favorites: 3 Warren Buffett Stocks With Strong Buy Ratings for April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412024000", "headline": "Akre Focus Fund Q1 2024 Commentary", "summary": "The Akre Focus Fundâ\u0080\u0099s first quarter 2024 performance for the Institutional share class was 8.15% compared with S&P 500 Total Return at 10.56%."}, {"date": "20240412030000", "headline": "Al Gore's Hedge Fund Loves This $445 Billion Stock", "summary": "Mastercard is a stock that can continue to beat the market for decades."}, {"date": "20240412031400", "headline": "Banking giants amongst least shorted financial stocks in March", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412032000", "headline": "Banking giants amongst least shorted financial stocks ahead of Q1 earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412040000", "headline": "Wall Street Favorites: 3 Financial Services Stocks With Strong Buy Ratings for April 2024", "summary": "The financial sector has long been the backbone of the stock market. Financials hold the second-largest weight by sector in the S&P 500 with a 13.12%. Five of the thirty components of the Dow Jones Industrial Average are financial stocks. These companies provide products and services for everything from banking and investing to payments and insurance. But financial stocks also have a reputation for being boring and conservative. While they might lack the growth potential of tech stocks, there ar"}, {"date": "20240412062400", "headline": "3 Tech Stocks to Buy to Triple Your Investment by 2025", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412064600", "headline": "3 Warren Buffett Stocks Worth a Top Spot on Your April Buy List", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412103800", "headline": "Mastercard (MA), Equity Bank Partner to Ease Cross-Border Transfers", "summary": "Mastercard (MA) and Equity Bank join forces to make way for safe cross-border remittances in Kenya by the bank's client base with the availability of MA's Cross-Border Services platform."}, {"date": "20240413023600", "headline": "3 Stocks to Supercharge Your Wealth for 2030 and Beyond", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240413045105", "headline": "Terna: Dividend Growth Energizes Investor Portfolios", "summary": "Discover Terna Spa, an energy company driving the sustainable energy transition by ensuring grid stability and offering consistent returns to investors. Read more here."}, {"date": "20240414233700", "headline": "MasterCard price target raised by $16 at JPMorgan, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415000100", "headline": "Navigating Market Uncertainty: Intrinsic Value of Mastercard Inc", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415020000", "headline": "Mastercard and Leading Canadian Fintech VoPay Enter Strategic Partnership to Empower Canadians to Move Money Quickly and Securely with Mastercard Move", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415022500", "headline": "Mastercard teams up with Canadian fintech VoPay to simplify payouts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415062500", "headline": "Mastercard: The Promise and Possibilities of Inclusive Growth", "summary": "NORTHAMPTON, MA / ACCESSWIRE / April 15, 2024 / Mastercard: Hosted by the Mastercard Center for Inclusive Growth, the Global Inclusive Growth Summit returns on April 18, 2024 and will feature Gina Raimondo, U.S. Secretary of Commerce; Amina J. Mohammed, ..."}, {"date": "20240415082900", "headline": "5 Financial Transaction Stocks to Watch Amid a Growing Digital Era", "summary": "An advanced digital solutions portfolio, strong wage gains and pursuit of the M&A strategy may drive the Financial Transaction Services space. Stocks like V, MA, FI, FIS and GPN are poised to benefit from the favorable industry trends."}, {"date": "20240415230612", "headline": "Equity Bank Expands Money Transfer Services to 30 Countries", "summary": "Equity Bank has expanded its money transfer services to over 30 countries through a new deal with Mastercard, a global payment platform.Remittances are vital in sub-Saharan Africa, with a reported..."}, {"date": "20240416011200", "headline": "Wall Street Analysts Are Bullish on Top Financial Picks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416025900", "headline": "Zacks Industry Outlook Highlights Visa, Mastercard, Fiserv, Fidelity National Information Services and Global Payments", "summary": "Visa, Mastercard, Fiserv, Fidelity National Information Services and Global Payments have been highlighted in this Industry Outlook article."}, {"date": "20240416050030", "headline": "Institutional investors in Mastercard Incorporated (NYSE:MA) see US$18b decrease in market cap last week, although long-term gains have benefitted them.", "summary": "Key Insights Institutions' substantial holdings in Mastercard implies that they have significant influence over the..."}, {"date": "20240416060910", "headline": "‘Don’t Overthink It,’ Says Cowen About These 2 ‘Strong Buy’ Credit Card Stocks", "summary": "According to Federal Reserve data, total credit card balances rose by $50 billion in 4Q23, and finished the year at $1.13 trillion. It marked a record high for consumer credit card debt, and brings with it both positives and negatives. On the negative side, it’s record-level consumer debt at a time of elevated interest rates, while on the positive side, it can be taken as an indicator of strong consumer spending. On the investment side, this opens up a range of opportunities, one of them being i"}, {"date": "20240416093000", "headline": "Mastercard: Turning Aspiration Into Impact", "summary": "PURCHASE, NY / ACCESSWIRE / April 16, 2024 / Mastercard Mastercard details how it's activating its network, services, products and partnerships to drive the company's commitment to doing well by doing good in its 2023 Environmental, Social and Governance ..."}, {"date": "20240416103658", "headline": "Plan For A Secure Retirement With A $100,000 Aggressive, 15-Stock Dividend Growth Portfolio", "summary": ""}, {"date": "20240416124300", "headline": "Q1 Earnings Scorecard and Analyst Reports for Mastercard, Netflix & Coca-Cola", "summary": "Today's Research Daily features a real-time update on the Q1 earnings season and new research reports Mastercard (MA), Netflix (NFLX) and Coke (KO) and others."}, {"date": "20240416153000", "headline": "3 Blue-Chip Behemoths to Buy as Market Volatility Persists", "summary": "You don’t always have to find small hidden gems to outperform the stock market. Buying shares of reliable corporations can help you outpace the stock market. Blue-chip stocks tend to be more persistent during market volatility and can limit your losses. These same stocks have great potential during bullish economic cycles. Investors should look at a company’s profit margins, financial growth and business opportunities before investing in a stock. Those factors can set some corporations apart and"}, {"date": "20240416155019", "headline": "MasterCard (MA) Laps the Stock Market: Here's Why", "summary": "MasterCard (MA) concluded the recent trading session at $460.94, signifying a +0.25% move from its prior day's close."}, {"date": "20240417010000", "headline": "Low Risk, High Return? The Power Of The 15-Stock Dividend Growth Portfolio", "summary": "Dividends have contributed significantly to the total return of the S&P 500 since 1960, making dividend investing important. Read here for a portfolio approach."}, {"date": "20240417033600", "headline": "Bank of America Securities Sticks to Their Buy Rating for Mastercard (MA)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417040000", "headline": "The Zacks Analyst Blog Highlights Mastercard, Netflix, Coca-Cola, Berkshire Hathaway and Medtronic", "summary": "Mastercard, Netflix, Coca-Cola, Berkshire Hathaway and Medtronic are included in this Analyst Blog."}, {"date": "20240417064840", "headline": "20 Most Diverse Countries in Asia", "summary": "In this article, we will list the 20 most diverse countries in Asia. If you want to skip our discussion about diversity in the United States and its benefits, go to the 5 Most Diverse Countries in Asia. The United States is one of the most diverse countries, as there is a 52% (as of […]"}, {"date": "20240417074011", "headline": "Is Viant Technology (DSP) Stock Outpacing Its Business Services Peers This Year?", "summary": "Here is how Viant Technology (DSP) and MasterCard (MA) have performed compared to their sector so far this year."}, {"date": "20240417100010", "headline": "MasterCard (MA) Upgraded to Buy: What Does It Mean for the Stock?", "summary": "MasterCard (MA) might move higher on growing optimism about its earnings prospects, which is reflected by its upgrade to a Zacks Rank #2 (Buy)."}, {"date": "20240417122900", "headline": "Mastercard (MA) Ties Up to Boost Money Transfers for Canadians", "summary": "Mastercard (MA) teams up with VoPay to ease money transfers in Canada and across the border through the utilization of Mastercard Move."}, {"date": "20240417192114", "headline": "Rest in peace: How the much loved jingle became the 'sogo'", "summary": "IN 2003, the Economist pronounced the jingle dead. Corny, dated and no longer considered effective, p-p-p-ppick up a penguin, just one cornetto, and the crumbliest, flakiest milk chocolate were packed..."}, {"date": "20240417201500", "headline": "Discover Financial Services (DFS) Sees Share Rise Despite Q1 Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417234800", "headline": "MasterCard price target raised by $20 at Baird, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418020409", "headline": "Mastercard : launches mobile virtual card app to simplify travel and business expenses", "summary": "Mastercard launches mobile virtual card app to simplify travel and business expenses April 18, 2024 | Purchase, NY HSBC and..."}, {"date": "20240418021800", "headline": "Stagflation Concerns Highlighted Amid Varied Stock Performance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418030607", "headline": "MasterCard : Nubank and Mastercard exclusive study reveals path to advancing beyond access toward financial health", "summary": "Nubank and Mastercard exclusive study reveals path to advancing beyond access toward financial health April 18, 2024 | São Paulo, BR & Purchase ..."}, {"date": "20240418031800", "headline": "Mastercard's Options Frenzy: What You Need to Know", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418060000", "headline": "The Xbox Mastercard, Issued by Barclays, Now Available in the U.S. with More Value", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418065800", "headline": "Bernstein Sticks to Its Buy Rating for Mastercard (MA)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418070016", "headline": "Mastercard Incorporated (MA) Is a Trending Stock: Facts to Know Before Betting on It", "summary": "MasterCard (MA) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock."}, {"date": "20240418100000", "headline": "World Bank's Banga wants to make gains in tackling the effects of climate change, poverty and war", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418101013", "headline": "Will MasterCard (MA) Beat Estimates Again in Its Next Earnings Report?", "summary": "MasterCard (MA) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report."}, {"date": "20240418111500", "headline": "Nubank and Mastercard Exclusive Study Reveals Path to Advancing Beyond Access Toward Financial Health", "summary": "Analysis of pseudonymized and aggregated data from 3.6 million Nubank customers illustrates drivers and barriers along the journey to long-term financial health Mastercard NORTHAMPTON, MA / ACCESSWIRE / April 18, 2024 / Today, Nubank and Mastercard ..."}, {"date": "20240418190200", "headline": "See Which Of The Latest 13F Filers Holds Mastercard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419043800", "headline": "Mastercard's Latest Virtual Card App Move to Boost Contactless Payments; Analyst Eyes Substantial Growth Citing Advanced Security and Digital Innovations", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419054000", "headline": "Mayar Capital Q1 2024 Letter To Partners", "summary": "For the three months ending March 31, 2024, the Mayar Responsible Global Equity Fund (Class A) was up 4.31% net. Click here to read the full letter. "}, {"date": "20240419154520", "headline": "MasterCard (MA) Ascends While Market Falls: Some Facts to Note", "summary": "MasterCard (MA) closed the most recent trading day at $455.39, moving +0.15% from the previous trading session."}, {"date": "20240421193800", "headline": "Visa, Mastercard earnings expected to rise in seasonally weakest volume quarter", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421234300", "headline": "Put $5,000 in These 7 Blue-Chip Stocks Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422013800", "headline": "Progressive, Q2 Holdings And 2 Other Stocks Insiders Are Selling", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422024400", "headline": "Visa Stock Chart Suggests Bearish Momentum Ahead Of Q2 Earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422040000", "headline": "Prediction: 2 Magnificent Stocks That Will Reach a $1 Trillion Valuation Before 2030", "summary": "These two great businesses are set to join an exclusive club."}, {"date": "20240422042109", "headline": "Fifth Third Joins Mastercard's Priceless Planet Coalition", "summary": "Effort Promotes Tree Restoration and ReforestationCINCINNATI - As part of its commitment to combat climate change and in celebration of Earth Day 2024, Fifth Third Bank today announced it has joined..."}, {"date": "20240422064100", "headline": "10 Financials Stocks Whale Activity In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422070011", "headline": "How to Find Strong Business Services Stocks Slated for Positive Earnings Surprises", "summary": "The Zacks Earnings ESP is a great way to find potential earnings surprises. Why investors should take advantage now."}, {"date": "20240422070015", "headline": "Mastercard (NYSE:MA) shareholders have earned a 14% CAGR over the last five years", "summary": "When we invest, we're generally looking for stocks that outperform the market average. And while active stock picking..."}, {"date": "20240422092638", "headline": "Visa, Mastercard Benefiting From Strong International Travel Trends, Morgan Stanley Says", "summary": "Visa, Mastercard Benefiting From Strong International Travel Trends, Morgan Stanley Says"}, {"date": "20240422100415", "headline": "3 Blockchain Stocks to Buy Now: Q2 Edition", "summary": "Blockchain stocks may be a better way to play the cryptocurrency market than directly engaging. These stocks are of companies that effectively integrate blockchain technology across multiple industries, offering a more diversified exposure to investors. Moreover, you can also sidestep all the regulatory roadblocks, liquidity troubles, and tax implications that aren’t as clear with cryptocurrencies. Also, the growing excitement around Bitcoin’s (BTC-USD) upcoming halving event makes it an excelle"}, {"date": "20240423000428", "headline": "UniCredit switches to Mastercard Touch Card with accessibility features for blind and partially sighted people", "summary": "Pan-European bank is the first banking group to launch the card at scale in 12 markets and across all products.As part of its partnership with Mastercard, UniCredit is upgrading all its debit,..."}, {"date": "20240423051111", "headline": "Lama AI joins Mastercard Engage Partner Platform", "summary": "Lama AI, a commercial lending technology provider, plans to join the Mastercard Engage Partner Platform to deliver better payments solutions. In particular, Lama will use Mastercard installments to..."}, {"date": "20240423210411", "headline": "Mastercard : transforms the fight against scams with latest AI tech", "summary": "Mastercard transforms the fight against scams with latest AI tech April 24, 2024 | Purchase, NY Verizon, NatWest and Global..."}, {"date": "20240423230927", "headline": "JGRO: Promising ETF In The Growth Category", "summary": "JPMorgan Active Growth ETF focuses on high-growth companies within the tech, consumer discretionary, and communication sectors."}, {"date": "20240423235000", "headline": "Cashing In on Earnings: 3 Financial Stocks Set to Surge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424020124", "headline": "13 Best Ethical Companies to Invest in 2024", "summary": "In this piece, we will take a look at the 13 best ethical companies to invest in 2024. If you want to skip our overview of ESG stocks, then you can take a look at 5 Best Ethical Companies to Invest in 2024. The relationship of the corporate sector with the well-being of the general […]"}, {"date": "20240424043441", "headline": "Why Mastercard Could Be 20% Undervalued", "summary": "Mastercard has achieved impressive revenue and earnings growth rates, surpassing its closest rivals. Find out why I rate MA stock as a buy."}, {"date": "20240424074500", "headline": "Mastercard: When It Comes to Reforestation, One Tree Does Not Fit All", "summary": "By Maggie Sieger NORTHAMPTON, MA / ACCESSWIRE / April 24, 2024 / Mastercard Don't let the old Johnny Appleseed legend fool you. Planting trees is not simply a matter of haphazardly scattering seeds on the ground. Reforesting on a global scale takes ..."}, {"date": "20240424080151", "headline": "MasterCard (MA) Reports Next Week: Wall Street Expects Earnings Growth", "summary": "MasterCard (MA) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240424101638", "headline": "12 Best Growth Stocks to Buy and Hold in 2024", "summary": "In this piece, we will take a look at the 12 best growth stocks to buy and hold in 2024. If you want to skip our overview of growth stocks and how they relate to the current stock market environment, then you can take a look at the 5 Best Growth Stocks to Buy and […]"}, {"date": "20240424214000", "headline": "Mastercard Inc. stock underperforms Thursday when compared to competitors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425021000", "headline": "March's Dividend Portfolio Update Sets New All-Time Record - 100 Holdings, 21 Buys", "summary": "Portfolio changes in March focus on BDCs, aiming to increase dividend income by at least $100 each month. Click here for a detailed analysis."}, {"date": "20240425030423", "headline": "MasterCard : Enhancing fintech programs, empowering innovation", "summary": "Enhancing fintech programs, empowering innovation April 25, 2024 Mastercard introduces new capabilities and benefits for..."}, {"date": "20240425114610", "headline": "PayPal: Why I Sold All My Shares (Rating Downgrade)", "summary": "PayPal stock cratered more than 80% since its peak in 2021 amidst a declining user base and slowing revenue growth. Read my earnings analysis of PYPL stock here."}, {"date": "20240425155019", "headline": "MasterCard (MA) Stock Moves -0.08%: What You Should Know", "summary": "MasterCard (MA) reachead $462.11 at the closing of the latest trading day, reflecting a -0.08% change compared to its last close."}, {"date": "20240425190800", "headline": "More than half of the S&P 500 names that reported results this week beat top and bottom line - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425193600", "headline": "15 out of 23  financial stocks deliver EPS wins, amid stable consumer demand - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425200600", "headline": "Catalyst Watch: Apple earnings, Viking IPO, Chinese EV deliveries and Russell indices' Rank Day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425233000", "headline": "Weitz Large Cap Equity Fund Q1 2024 Commentary", "summary": "The Large Cap Equity Fund's Institutional Class returned +7.79% for the first quarter compared to +10.30% for the Russell 1000 Index."}, {"date": "20240426022500", "headline": "3 Stocks That Will Surge Once Interest Rate Cuts Kick In", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426050100", "headline": "Interesting MA Put And Call Options For June 7th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426053559", "headline": "10 Best Technology Dividend Aristocrats to Buy", "summary": "In this article, we discuss 10 best technology dividend aristocrats to buy. You can skip our detailed analysis of tech dividend stocks and their previous performance, and go directly to read 5 Best Technology Dividend Aristocrats to Buy. Meta’s announcement of its first-ever dividend earlier this year took the tech world by storm. However, this […]"}, {"date": "20240426054700", "headline": "SPDR ETF Report For Friday, April 26", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426064500", "headline": "Mastercard: How To Spark a Revolution in Inclusion", "summary": "NORTHAMPTON, MA / ACCESSWIRE / April 26, 2024 / Mastercard By Vicki Hyman Philanthropist Melinda French Gates, right, spoke with Rosario Dawson, an actor and activist for gender equality, left, and Fatoumata Bâ, center, the founder and executive ..."}, {"date": "20240426071523", "headline": "Unlocking Q1 Potential of MasterCard (MA): Exploring Wall Street Estimates for Key Metrics", "summary": "Looking beyond Wall Street's top -and-bottom-line estimate forecasts for MasterCard (MA), delve into some of its key metrics to gain a deeper insight into the company's potential performance for the quarter ended March 2024."}, {"date": "20240426102600", "headline": "How You Should Play Mastercard (MA) Ahead of Q1 Earnings", "summary": "Mastercard's (MA) first-quarter results are likely to reflect increased GDV and processed transactions."}, {"date": "20240426110400", "headline": "Bread Financial (BFH) Q1 Earnings Lag, Credit Sales Fall Y/Y", "summary": "Bread Financial's (BFH) first-quarter results reflect a drop in credit sales and, subsequently, average loans."}, {"date": "20240426154520", "headline": "Here's Why MasterCard (MA) Gained But Lagged the Market Today", "summary": "The latest trading day saw MasterCard (MA) settling at $462.42, representing a +0.07% change from its previous close."}, {"date": "20240427000014", "headline": "Mastercard Q1: Competition Makes This A Big Quarter", "summary": "Mastercard's earnings outlook is cautiously optimistic, whilst benefiting from robust consumer spending. See why we rate MA stock a hold currently."}, {"date": "20240427030818", "headline": "10 Dividend Growth Stocks: April 2024", "summary": "Discover the top ten dividend growth stocks, ranked by quality assessment and risk-adjusted prices, for potential investment opportunities."}, {"date": "20240427040000", "headline": "3 No-Brainer Warren Buffett Stocks to Buy Right Now", "summary": "These Berkshire Hathaway holdings are primed to deliver results for years to come."}, {"date": "20240427074458", "headline": "30 Most Miserable Countries in the World", "summary": "In this article, we shall discuss the 30 most miserable countries in the world. To skip our detailed analysis of the current macroeconomic outlook in 2024, the intricate link between poverty alleviation and sustainability, and corporate efforts underway to alleviate poverty rates and address climate challenges, go directly and see 10 Most Miserable Countries in […]"}, {"date": "20240428010300", "headline": "Earnings week ahead: Amazon, Apple, Pfizer, AMD, Coca-Cola, Starbucks and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428012226", "headline": "Wall Street Breakfast: The Week Ahead", "summary": "This article discusses the upcoming events in the financial world, including the Federal Reserve meeting, corporate earnings, IPOs, and investor events."}, {"date": "20240428043000", "headline": "2 Supercharged Dividend Growth Stocks to Buy if There's a Stock Market Sell-Off", "summary": "How does a decade of mid-teen percentage dividend increases sound as a starting point? Here are two stocks that have done just that."}, {"date": "20240428060145", "headline": "Here's Why We Think Mastercard (NYSE:MA) Is Well Worth Watching", "summary": "Investors are often guided by the idea of discovering 'the next big thing', even if that means buying 'story stocks..."}, {"date": "20240429000100", "headline": "Invest with Confidence: Intrinsic Value Unveiled of Mastercard Inc", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429000100", "headline": "Options Volatility and Implied Earnings Moves This Week, April 29 – May 02, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429030846", "headline": "Mastercard: deployment of the Scam Protect suite", "summary": "Mastercard announces the deployment of Scam Protect, a suite of specialized solutions powered by cutting-edge artificial intelligence technologies, which help identify and prevent all types of fraud..."}, {"date": "20240429032900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429040300", "headline": "Investigating Mastercard's Standing In Financial Services Industry Compared To Competitors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429054000", "headline": "SPDR ETF Report For Monday, April 29", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429055310", "headline": "NRF: Retailers Ask Judge to Reject 'Drop in the Bucket' Settlement Over Visa and Mastercard 'Swipe' Fees", "summary": "WASHINGTON - The National Retail Federation today asked a federal judge to reject the proposed settlement of a class-action antitrust lawsuit over 'swipe' fees charged to merchants to process Visa..."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429080002", "headline": "American Express Can Sustain Its Rally", "summary": "The stock has significantly outperformed the broader market, but further upside could be more challenging"}, {"date": "20240429094015", "headline": "FI vs. MA: Which Stock Is the Better Value Option?", "summary": "FI vs. MA: Which Stock Is the Better Value Option?"}, {"date": "20240429215000", "headline": "Mastercard Should Continue Rally In A Bullish Sequence", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000153", "headline": "Mastercard and PrestaShop join forces to revolutionize online payments with Click to Pay", "summary": "Click to Pay is an innovative payment solution that eliminates the need for passwords and card details, ensuring secure and streamlined transactions.In an era of rapid digitalization of financial..."}, {"date": "20240430023300", "headline": "Mastercard Tends To Exceed Wall Street Expectations, But Signals Are Bearish Ahead Of Q1 Earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430062000", "headline": "Mastercard Celebrates the 10th Anniversary of Girls4Tech", "summary": "NORTHAMPTON, MA / ACCESSWIRE / April 30, 2024 /Mastercard Yesterday marked a monumental milestone as we celebrated the 10th anniversary of Girls4Tech at the NYSE. With over 7 million girls empowered across 65 countries to date, Girls4Tech continues ..."}, {"date": "20240430064000", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430085200", "headline": "This Week's Must-See Big Cap Earnings Charts", "summary": "3 of these companies are among the top 10 largest companies in the S&P 500."}, {"date": "20240430153850", "headline": "Fed rate decision, Qualcomm earnings: What to Watch", "summary": "Market Domination Overtime anchors Julie Hyman and Josh Lipton preview the top headlines for investors for tomorrow, Wednesday, May 1, 2024. Federal Reserve officials will issue their latest interest rate policy decision coming out of their FOMC meeting tomorrow afternoon, followed by a press conference by Fed Chair Jerome Powell. On the earnings front, a slew of companies are set to release quarterly reports, including names like DoorDash (DASH), Mastercard (MA), and Qualcomm (QCOM). For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Angel Smith"}, {"date": "20240430182900", "headline": "GLOBAL BRIEFING: Downturn in Japanese manufacturing stabilises", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430204800", "headline": "Amazon, Pfizer And 3 Stocks To Watch Heading Into Wednesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430204800", "headline": "Investor Sentiment Falls, Dow Snaps Five-Month Win Streak", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430234500", "headline": "Wall Street Set To Open Lower After AMD Earnings Disappoint As Traders Look To Fed's Powell For Relief: Why This Analyst Sees Incoming Summer Rally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501000600", "headline": "Options Volatility and Implied Earnings Moves Today, May 01, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501010700", "headline": "Mastercard Non-GAAP EPS of $3.31 beats by $0.07, revenue of $6.3B misses by $40M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501011200", "headline": "MasterCard reports Q1 adjusted EPS $3.31, consensus $3.24", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501011900", "headline": "Earnings Summary: Mastercard delivers mixed Q1 results with Payment Network revenue up 7%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501014100", "headline": "Mastercard in charts: Worldwide GDV and Purchase Transactions fall 3% Q/Q in Q1", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501015600", "headline": "Mastercard’s stock falls after earnings as company cuts full-year growth outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501015600", "headline": "Fly Intel: Pre-market Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501020400", "headline": "MasterCard sees Q2 GAAP revenue growth high end of high single digits", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501020500", "headline": "Mastercard Q1 earnings beat, but gross dollar volume underwhelms", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501020500", "headline": "MasterCard sees FY24 GAAP revenue growth low end of low double digits", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501020506", "headline": "MasterCard : 2024 Q1 Supplemental Materials", "summary": "Supplemental Operational Performance Data Set forth below are tables that provide supplemental information regarding the operational performance results for the..."}, {"date": "20240501021208", "headline": "MasterCard: Q1 Earnings Snapshot", "summary": "PURCHASE, N.Y. — PURCHASE, N.Y. — MasterCard Inc. on Wednesday reported first-quarter net income of $3.01 billion. On a per-share basis, the Purchase, New York-based company said it had..."}, {"date": "20240501021600", "headline": "4 stocks to watch on Wednesday: PFE, QCOM and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501022600", "headline": "MasterCard says 'still room' to penetrate services", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501023325", "headline": "Mastercard 1Q Revenue Climbs, Boosted by Favorable Consumer Backdrop", "summary": "By Sabela Ojea Mastercard said rose in the latest quarter, citing healthy consumer spending and strong cross-borer volume growth. The credit card giant on Wednesday posted a net profit of..."}, {"date": "20240501025402", "headline": "Stocks to Watch Wednesday: Amazon, Starbucks, Pinterest, AMD", "summary": "**↗️** **Amazon.com (AMZN)**: The company reported a surge in first-quarter sales as the AI boom powered growth in its cloud-computing unit. Amazon.com stock was higher in premarket trading. **↘️** **Starbucks (SBUX)**: The coffee chain's stock slid more than 12% in premarket."}, {"date": "20240501025800", "headline": "TOP NEWS: MasterCard touts \"momentum\" as income rises in first quarter", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501030000", "headline": "PayPal Delivered In Q1 And Market Sentiment May Finally Be Changing", "summary": "PayPal delivered strong Q1 results, and its leadership and growth potential are promising. Click here to read why PYPL stock is a Strong Buy."}, {"date": "20240501030249", "headline": "Mastercard Incorporated 2024 Q1 - Results - Earnings Call Presentation", "summary": "The following slide deck was published by Mastercard Incorporated in conjunction with their 2024 Q1 earnings call."}, {"date": "20240501050300", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501053011", "headline": "Amazon jumps on earnings, Fed decision nears: Yahoo Finance", "summary": "Amazon (AMZN) shares are higher this morning after the company's first quarter earnings topped expectations. The company reported net sales rose 13% year-over-year. On the earnings front, we hear from several other big names today, including Pfizer (PFE), CVS (CVS), Mastercard (MA), Qualcomm (QCOM), Etsy (ETSY), and MGM Resorts (MGM). It will all be overshadowed by the Federal Reserve decision at 2 p.m. ET. The central bank is expected to hold rates steady at a range of 5.25% to 5.5%. Yahoo Finance trending tickers include bitcoin (BTC-USD), Starbucks (SBUX), and Advanced Micro Devices (AMD). Key guests include:9:15 a.m. ET - Willem Sels, Global CIO, HSBC Global Private Banking9:30 a.m. ET - Brent Thill, Jefferies Tech Research Analyst9:40 a.m. ET - Rachel Ruggeri, Starbucks CFO9:50 a.m. ET - Kevin O'Leary, O’Leary Ventures Chairman10 a.m. ET - Vincent Reinhart,  Dreyfus and Mellon Chief Economist & Fmr Fed Economist10:45 a.m. ET - Matt Darin, Curaleaf CEO11:15 a.m. ET - Alex Timm, Root Insurance CEO"}, {"date": "20240501053522", "headline": "Mastercard, Inc. (MA) Q1 2024 Earnings Call Transcript", "summary": "Mastercard, Inc. (NYSE:NYSE:MA) Q1 2024 Earnings Conference Call May 1, 2024 9:00 AM ETCompany ParticipantsDevin Corr - Head of Investor RelationsMichael..."}, {"date": "20240501055600", "headline": "MA Stock Earnings: Mastercard Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501060000", "headline": "Mastercard cuts its revenue outlook — but that has nothing to do with spending", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501060000", "headline": "Mastercard Incorporated First Quarter 2024 Financial Results Available on Company’s Website", "summary": "PURCHASE, N.Y., May 01, 2024--Mastercard (NYSE: MA) announced its first quarter 2024 financial results through an earnings release available at investor.mastercard.com."}, {"date": "20240501060822", "headline": "Mastercard's profit beats as consumer spending defies inflation worries", "summary": "(Reuters) -Mastercard reported first-quarter profit that exceeded Wall Street expectations on Wednesday, on higher card spending by consumers despite rising borrowing costs and persistent inflation.  Wage growth and a tight labor market have ensured job security for card users, allowing them to spend without restraint even as the Federal Reserve keeps monetary policy tight.  \"These appear to be solid, though unspectacular, results,\" HSBC analyst Saul Martinez wrote in a note."}, {"date": "20240501061200", "headline": "US Stocks Mixed Ahead Of Fed Meeting, Chipmakers Tumble After AMD Earnings, Bitcoin Sinks: What's Driving Markets Wednesday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501062000", "headline": "SPDR ETF Report For Tuesday, April 30", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501064200", "headline": "Notable Wednesday Option Activity: MA, QCOM, OXY", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501064500", "headline": "Profit from the Panic: 3 Stocks to Pounce on When They Become Steals", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501071004", "headline": "MasterCard (MA) Tops Q1 Earnings and Revenue Estimates", "summary": "MasterCard (MA) delivered earnings and revenue surprises of 2.80% and 0.35%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240501073204", "headline": "Mastercard Inc (MA) Q1 2024 Earnings: Navigating Analyst Expectations with Strong Revenue and ...", "summary": "Mastercard's First Quarter Performance Demonstrates Continued Growth Amidst Global Payments Expansion"}, {"date": "20240501080004", "headline": "MasterCard (MA) Reports Q1 Earnings: What Key Metrics Have to Say", "summary": "While the top- and bottom-line numbers for MasterCard (MA) give a sense of how the business performed in the quarter ended March 2024, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values."}, {"date": "20240501080619", "headline": "Mastercard Cuts Forecast, Network Spending Misses Estimates", "summary": "(Bloomberg) -- Mastercard Inc. cut a forecast for full-year revenue growth citing foreign exchange headwinds, as first-quarter spending on the payments giant’s network fell short of estimates. Most Read from BloombergTesla Axes Supercharger Team in Blow to Broader EV MarketNYPD Arrests Over 300 Protesters in Crackdown on College CampusesFed to Signal Delay of Interest-Rate CutsThe Ozempic Effect: How a Weight Loss Wonder Drug Gobbled Up an Entire EconomyLilly Soars as Forecast Boost Shows Weight"}, {"date": "20240501081200", "headline": "Mastercard Stock Is Falling After Earnings Beat. Guidance Came Down.", "summary": "The card firm reported first-quarter adjusted earnings of $3.31, beating Wall Street’s call for $3.25."}, {"date": "20240501081524", "headline": "Mastercard Stock Pullback Deepens On 2024 Forecast Cut", "summary": "Mastercard stock fell early Wednesday after the payments giant cleared first-quarter views but lowered its 2024 outlook."}, {"date": "20240501083314", "headline": "Mastercard First-Quarter Results Beat Views Despite Gross Dollar Volume Slowdown", "summary": "Mastercard First-Quarter Results Beat Views Despite Gross Dollar Volume Slowdown"}, {"date": "20240501091635", "headline": "News Highlights : Top Company News of the Day - Wednesday at 3 PM ET", "summary": "Tesla's Downsizing Worries Supercharger Industry Widespread layoffs within the Tesla unit are a blow to efforts to build out a national charging network. Teamsters Canada Says Strikes at CN..."}, {"date": "20240501101516", "headline": "Mastercard (MA) Q1 2024 Earnings Call Transcript", "summary": "MA earnings call for the period ending March 31, 2024."}, {"date": "20240501102234", "headline": "News Highlights : Top Financial Services News of the Day - Wednesday at 4 PM ET", "summary": "Fed Says Inflation Progress Has Stalled and Extends Wait-and-See Rate Stance Officials also approved a plan to slow the ongoing reduction of their $7.4 trillion asset portfolio. Sell in May..."}, {"date": "20240501111614", "headline": "Mastercard Says Consumer Spending Is Healthy, Clocks 10% Revenue Growth In Q1", "summary": "Mastercard Inc. (NYSE: MA) reported fiscal first-quarter net revenues of $6.35 billion, up 10% year over year and 11% year over year on a neutral currency basis, beating the consensus of $6.34 billion. Adjusted EPS rose 18% year over year to $3.31, exceeding the consensus of $3.24. Payment network net revenue rose 7% Y/Y (+8% Y/Y on a currency-neutral basis), led by growth in gross dollar volume (+10% Y/Y), cross-border volume (+18% Y/Y) and switched transactions (+13% Y/Y). Also Read: Mastercar"}, {"date": "20240501112200", "headline": "Mastercard (MA) Q1 Earnings Beat on Steady Spending, '24 View Cut", "summary": "Mastercard (MA) repurchases 4.4 million shares for $2 billion in the first quarter."}, {"date": "20240501114417", "headline": "Financials Gain as NY Community Bank Rallies -- Financials Roundup", "summary": "Shares of banks and other financial institutions rose as regional-bank fears eased and Federal Reserve Chairman Jerome Powell expressed confidence in the downward trajectory of inflation. The..."}, {"date": "20240501130534", "headline": "Mastercard poised to start processing payments locally in China", "summary": "Bolstered by healthy first-quarter global card-spending trends, Mastercard is focusing on opportunities outside the U.S., including a unique card-processing arrangement beginning this month in China."}, {"date": "20240501143802", "headline": "Mastercard cuts 2024 outlook citing foreign exchange concerns", "summary": "Despite surpassing expectations with its first-quarter earnings report, Mastercard Inc. (MA) has revised its full-year forecast downward, citing unfavorable foreign exchange rates as headwinds. Yahoo Finance's Josh Lipton and Akiko Fujita break down the details. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Angel Smith"}, {"date": "20240501164505", "headline": "Why Mastercard Stock Sank on Wednesday", "summary": "Investors were clearly expecting better performance from MasterCard in its latest quarter."}, {"date": "20240501204100", "headline": "Shhh! 3 Secret Blockchain Stocks Flying Below Wall Street’s Radar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501205300", "headline": "Analysts Are Bullish on Top Financial Stocks: Mastercard (MA), Interactive Brokers (IBKR)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501213300", "headline": "7 Stock Picks That S&P 500 Bulls Can’t Afford to Ignore", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501222100", "headline": "Mastercard’s Resilient Growth and Positive Financial Outlook Justify Buy Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501230323", "headline": "Decoding Mastercard Inc (MA): A Strategic SWOT Insight", "summary": "Unveiling the Financial Fortitude and Market Dynamics of Mastercard Inc"}, {"date": "20240501231500", "headline": "Analysts Offer Insights on Financial Companies: TriplePoint Venture Growth (TPVG), Allstate (ALL) and Mastercard (MA)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501232300", "headline": "Analysts Offer Insights on Financial Companies: Standard Chartered (OtherSCBFF), Mastercard (MA) and Metlife (MET)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501233400", "headline": "Analysts’ Opinions Are Mixed on These Financial Stocks: BIGG Digital Assets (OtherBBKCF), Mastercard (MA) and NY Community (NYCB)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501235600", "headline": "MasterCard price target lowered by $10 at JPMorgan, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502000300", "headline": "Analysts Are Bullish on These Financial Stocks: Riot Platforms (RIOT), Mastercard (MA)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502001708", "headline": "Q1 2024 Mastercard Inc Earnings Call", "summary": "Q1 2024 Mastercard Inc Earnings Call"}, {"date": "20240502002600", "headline": "MasterCard price target lowered by $2 at Mizuho, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502002800", "headline": "Mastercard’s Strong Growth and Resilience Justify Outperform Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502003400", "headline": "MasterCard price target lowered by $13 at TD Cowen, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502011549", "headline": "Mastercard Inc (MA) (Q1 2024) Earnings Call Transcript Highlights: Robust Growth and Strategic ...", "summary": "Mastercard reports significant gains in revenue and earnings, underpinned by strong consumer spending and strategic global partnerships."}, {"date": "20240502013000", "headline": "MasterCard price target lowered to $524 from $536 at Morgan Stanley", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502014400", "headline": "QUALCOMM To Rally Around 22%? Here Are 10 Top Analyst Forecasts For Thursday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502014600", "headline": "Maintaining Buy Rating: Mastercard’s Resilient Growth and Favorable Long-Term Prospects", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502015400", "headline": "Analysts Offer Insights on Financial Companies: Berkshire Hills (BHLB), Mastercard (MA) and LendingClub (LC)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502020800", "headline": "MasterCard price target lowered by $7 at Raymond James, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502022200", "headline": "Analysts Are Bullish on These Financial Stocks: Mastercard (MA), Metlife (MET)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502023400", "headline": "MasterCard price target lowered by $7 at Seaport Research, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502051700", "headline": "Mastercard's Slight Financial Forecast Adjustment Amidst A Decade Of Astounding 472% Growth And Surprising First-Quarter Earnings Results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502061100", "headline": "How Mastercard's Q1 Results Compare With Rival Visa: 3 Analysts Provide Their Takes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502063000", "headline": "Mastercard (MA) Receives a Buy from KBW", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502102034", "headline": "25 Most Profitable Companies in the US", "summary": "In this piece, we will take a look at the 25 most profitable companies in the US. If you want to skip our overview of the US economy and the current business climate, you can jump ahead to the 5 Most Profitable Companies in the US. With the second quarter of 2024 with us, Wall Street […]"}, {"date": "20240502194100", "headline": "SPDR ETF Report For Thursday, May 2", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502210000", "headline": "On This Day: 1999 tornado outbreak kills dozens in Plains states", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502212400", "headline": "3 Cheap Tech Stocks You’ll Regret Not Buying in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502230300", "headline": "The 7 Best Long-Term Stocks to Buy for Exponential Gains: Q2 Edition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503030000", "headline": "SoFi Technologies: Sell-Off After Double Beat, Guidance Hike, Another Opportunity", "summary": "There is so much potential for SoFi Technologies in the future, and it feels like they are just getting started. Find out why I am bullish on SOFI stock."}, {"date": "20240503041320", "headline": "Analysts Are Updating Their Mastercard Incorporated (NYSE:MA) Estimates After Its First-Quarter Results", "summary": "Last week, you might have seen that Mastercard Incorporated ( NYSE:MA ) released its first-quarter result to the..."}, {"date": "20240503060611", "headline": "Mastercard Foundation Introduces MFAM, a New Separate Asset Management Company, to Support Its Philanthropic Mission", "summary": "The Mastercard Foundation today introduced the Mastercard Foundation Asset Management Corporation, a new, separate asset management company with a mandate to build and manage a diversified portfolio..."}, {"date": "20240503071711", "headline": "Checkout.com and Mastercard partner to bring virtual cards to online travel agents", "summary": "Collaboration enables Checkout.com’s customers to access the Mastercard Wholesale Program, unlocking reduced costs and higher conversion rates"}, {"date": "20240503074933", "headline": "My Top 15 High Growth Dividend Stocks For May 2024", "summary": "Since its inception in September 2020, the watchlist has achieved a 10.91% annualized return Check out the top 15 dividend growth stocks for May 2024."}, {"date": "20240503124133", "headline": "30 Most Profitable Companies with Highest Margins in the World", "summary": "In this article, we will be taking a look at the 30 Most Profitable Companies with Highest Margins in the World. To learn about other Most Profitable Companies with Highest Margins in the World, you can go directly to the 5 Most Profitable Companies with Highest Margins in the World. In today’s competitive global marketplace, […]"}, {"date": "20240503153713", "headline": "Mastercard collaborates with SingleView to usher in new era of commercial efficiency", "summary": "Collaboration promotes commercial efficiency with SingleView’s corporates able to leverage Mastercard commercial and corporate solutions to optimise businesses’ financial operations"}, {"date": "20240503155713", "headline": "Network International rolls out Mastercard Instalments across the UAE", "summary": "Shoppers can use Mastercard’s innovative instalments solution to convert purchases into instalments at participating merchants across the UAE market"}, {"date": "20240503234149", "headline": "The 4 Factor Dividend Growth Strategy - Minor Turbulence In April", "summary": "Learn about the performance of the 4-factor dividend growth portfolio and how it compares to the S&P 500 and SCHD ETF, showcasing its alpha generation."}, {"date": "20240504041123", "headline": "Dividend Champion, Contender, And Challenger Highlights: Week Of May 5", "summary": "Stay updated on dividend activity with this weekly summary."}]}