{"news": [{"date": "20240417110621", "headline": "McDonald's history: Beyond the Ticker", "summary": "With over 38,000 locations in more than 100 countries, McDonald's (MCD) is a global icon in the fast food industry. In 2023, McDonald's generated over $25 billion dollars in revenue, up nearly 10% compared to the year before. Let's dive into the company's biggest moments with Beyond the Ticker. 1940 The McDonald's brothers, Dick and Maurice, opened the first McDonald's restaurant on May 15, 1940, in San Bernardino, California. 1954-1955 Ray Kroc purchased the rights to franchise McDonald’s and opened the first franchised restaurant in Des Plaines, Illinois. 1955-1965 Kroc bought the brothers out, then developed its current model of owning the real estate that McDonald’s franchise locations are on. 1965 In April 1965, McDonald's went public via an initial public offering at $22.50 per share. 1972 McDonald's hit a milestone – generating $1 billion in sales. 1990 The first McDonald's restaurant opened in the Soviet Union in Pushkin Square, Moscow, marking a symbolic moment of the Cold War, serving thousands of customers. 2003 In the early 2000s, the thriving food chain was met with competition and tragedy. Former executive James Cantalupo came out of retirement to lead the company, but in 2004 he suddenly passed away after 16 months at the helm. 2004 Life-long McDonald’s employee Charlie Bell was named CEO but tragically passed away from cancer shortly after. Amid the two tragedies, the movie Super Size Me took off - resulting in McDonald’s getting rid of the Super Size option. 2005-2012 Jim Skinner served as CEO, taking the company through the Great Financial Recession. 2012-2015 Don Thompson served as CEO, then retired as he faced pressure over declining sales. 2015 Steve Easterbrook then took the top seat, and in an attempt to reinvigorate its brand, McDonald's launched its all-day breakfast menu. Soon after, Easterbrook was fired for having an “inappropriate personal relationship” with an employee, according to the SEC. 2019 US president Chris Kempcinski was promoted to CEO, taking the company through the Covid-19 pandemic. 2023 McDonald's continues to expand and evolve, with its latest concept, CosMc's, a drive-thru-only restaurant featuring McCafe products, beverages, and treats. From a single restaurant to billions and billions served, McDonald's aims to hold its top spot as the quintessential American fast food chain. From tech giants to retail titans, Beyond the Ticker is a historical series that takes a deep dive into some of Wall Street's trending companies and how they transformed into the financial icons they are today. Check out more of our Beyond the Ticker series, and be sure to tune in to Yahoo Finance. Editor's note: This video was produced by Zach Faulds."}, {"date": "20240417234500", "headline": "7 Dividend Growth Stocks to Buy Now: Q2 Edition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418024700", "headline": "Thoughts For Thursday: Earnings In Earnest", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418040300", "headline": "Booming cold drink sales mean more plastic waste. So Starbucks redesigned its cups", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418154522", "headline": "Why the Market Dipped But McDonald's (MCD) Gained Today", "summary": "McDonald's (MCD) closed at $270.98 in the latest trading session, marking a +0.38% move from the prior day."}, {"date": "20240418205800", "headline": "McDonald’s (MCD) Gets a Buy from Barclays", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418233500", "headline": "Only Have $100? 3 No-Brainer Stocks to Buy in April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418234041", "headline": "Market Correction Expected: 20 Stocks To Buy If It Worsens", "summary": "A market correction of 10% or more occurs every 1.2 years, re-adjusting valuations and setting the stage for the next leg up. Click here for a detailed review."}, {"date": "20240419050000", "headline": "Tim Horton’s (TSE:QSR) Pizza Play Makes a Small Win", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419050519", "headline": "McDonald's: Peak Performance Thesis Sustained", "summary": "McDonald's stock has underperformed the S&P 500, with high leverage and inflation impacting cash flow. Click here to read my analysis of MCD stock now."}, {"date": "20240419051400", "headline": "Tim Horton’s (TSE:QSR) Pizza Play Sees Small Win", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419054500", "headline": "Load Up ASAP: 3 Dow Stocks to Buy Before They Rocket in 2024", "summary": "The Dow Jones Industrial Average continues to underperform the S&P 500 in 2024. This gives investors a great opportunity for cheap dow stocks to buy. The market index tracks 30 blue-chip American companies, offering exposure to some of the most impactful businesses across various sectors. While the index might not be synonymous with rapid, explosive growth, many dow stocks present compelling long term investment opportunities. As investors navigate the challenges of the U.S. stock market in 2024"}, {"date": "20240419060024", "headline": "McDonald's (NYSE:MCD) Knows How To Allocate Capital", "summary": "If you're looking for a multi-bagger, there's a few things to keep an eye out for. Typically, we'll want to notice a..."}, {"date": "20240420010000", "headline": "10 High-Yield Dividend Aristocrats Perfect For An Uncertain Market", "summary": "Volatility in the stock market is normal and healthy. Click here to read more about the ten lowest-volatility dividend aristocrats."}, {"date": "20240420013100", "headline": "This trader’s ‘core’ bullish position washes out as major S&P 500 supports break down", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420214100", "headline": "Dividend Income Summary: March 2024 Summary", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421010500", "headline": "‘Punishing myself would not help’: My credit card was stolen — the theft revealed lots of nasty surprises about my finances", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421064809", "headline": "7 Budget-Friendly Retail Plays Due for a Tax Refund Spending Boost", "summary": "At the beginning of 2024, retail stocks has a bright outlook. Consumer spending was holding up, the rate of inflation was easing, and there were expectations of an interest-rate cut. That three-legged stool looks more unstable. The latest reading on inflation showed an uptick that is likely to follow oil prices higher, and Federal Reserve chair Jerome Powell is making it clear that investors should not count on rate cuts anytime soon. Still, it’s not altogether crazy to invest in retail stocks."}, {"date": "20240421190200", "headline": "3 Defensive Investments to Make as the VIX Surges to 6-Month Highs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421230200", "headline": "McDonald’s Under Fire At Regulator Again For Use Of Antibiotics", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421233300", "headline": "Chipotle (NYSE:CMG): Price Hikes Could Hurt the Stock", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422020000", "headline": "Dividend Income Summary: Lanny's March 2024 Summary", "summary": "Retirement accounts brought in a total dividend income amount of $2,367.19 or 40% of the dividend income total. Read what investors need to know."}, {"date": "20240422031700", "headline": "Bank of America Securities Sticks to Their Hold Rating for McDonald’s (MCD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422033000", "headline": "McDonald's Dips: Earnings May Present A Golden Opportunity", "summary": "McDonald's dipped, and it trades at a historical low multiple compared to its recent history. Read what to expect from MCD stock's Q1 earnings."}, {"date": "20240422041000", "headline": "Dividend yield and growth stock list by Goldman", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422043000", "headline": "Forget the Noise: Buy These 3 Unfairly Punished Stocks Before Earnings Euphoria Hits", "summary": "Earnings season is a time when many companies redeem themselves. It doesn’t take much for a beaten down stock to turnaround. A strong quarterly print and upbeat guidance can lead to a big reversal higher in a share price. The stock of United Airlines (NYSE:UAL) just rose 17% in a single day after the carrier issued better-than-expected financial results and offered a bullish outlook to Wall Street. The post-earnings bump pushed UAL stock into positive territory for the year. So, whose next? Whic"}, {"date": "20240422043008", "headline": "Composting & Community: How Arcos Dorados is Embracing More Sustainable Practices in Brazil", "summary": "McDonald's newest 24-hour restaurant in São Paolo was built with more sustainable design top of mind - and this thoughtfulness expands beyond the restaurant's doors, drawing in the..."}, {"date": "20240422101013", "headline": "Why McDonald's (MCD) is Poised to Beat Earnings Estimates Again", "summary": "McDonald's (MCD) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report."}, {"date": "20240422113049", "headline": "7 Rock-Solid Dividend Stocks to Shower You With Reliable Income", "summary": "In a market cycle where the spotlight shines on artificial intelligence and cryptocurrencies among other growth-centric concepts, targeting dividend stocks is inherently a conservative venture. Turns out, that might be the most prudent plan given the circumstances. Fundamentally, geopolitical concerns have unsettled Wall Street. Tensions in the Middle East have resulted in two nations attacking each other. Fears now focus on global oil supplies and potential disruptions. That’s not including wha"}, {"date": "20240422235600", "headline": "Wells Fargo Reaffirms Their Buy Rating on McDonald’s (MCD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423060144", "headline": "McDonald's' (NYSE:MCD) five-year earnings growth trails the 9.4% YoY shareholder returns", "summary": "When you buy and hold a stock for the long term, you definitely want it to provide a positive return. Furthermore..."}, {"date": "20240423070000", "headline": "Should You Buy McDonald's Stock While It's Below $280?", "summary": "This dominant restaurant chain has been at the top of the industry for a long time."}, {"date": "20240423070012", "headline": "How to Find Strong Retail-Wholesale Stocks Slated for Positive Earnings Surprises", "summary": "The Zacks Earnings ESP is a great way to find potential earnings surprises. Why investors should take advantage now."}, {"date": "20240423075907", "headline": "The 7 Best Positioned Dow Stocks for April 2024", "summary": "I’d argue that investing in the Dow in April is a particularly smart move. Dow Jones stocks represent 30 of the most prominent U.S. firms. Stocks listed in the Dow tend to be more defensive than the Nasdaq and other indices. The reason that matters is that investors are currently seeking safety. Rate cut expectations are softening and treasury yields rising. That combination of factors is strongly suggestive of softness for more tech-oriented shares and other growth stocks. Conversely, it is a b"}, {"date": "20240423080113", "headline": "McDonald's (MCD) Reports Next Week: Wall Street Expects Earnings Growth", "summary": "McDonald's (MCD) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240423170039", "headline": "McDonald's Corp (MCD) President of McDonald's USA, Joseph Erlinger, Sells Company Shares", "summary": "McDonald's Corp (NYSE:MCD), the renowned global fast-food chain, operates and franchises McDonald's restaurants worldwide."}, {"date": "20240423210000", "headline": "Main Street’s Next Winners? 3 Stocks I’m Bullish on Using the Peter Lynch Approach.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423235500", "headline": "3 Dependable Dow Stocks to Own for a Worry-Free Portfolio", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424010700", "headline": "A Repeat of 2022? 7 Defensive Stocks to Buy Before the Correction.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424011300", "headline": "Delta Air Lines, McDonald's And 2 Other Stocks Insiders Are Selling", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424080139", "headline": "Yum Brands (YUM) Reports Next Week: Wall Street Expects Earnings Growth", "summary": "Yum (YUM) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240424154132", "headline": "Chipotle blows by earnings estimates as resilient foot traffic, margin expansion boost Q1 results", "summary": "Chipotle posted another strong quarter against a difficult macro backdrop."}, {"date": "20240424155018", "headline": "McDonald's (MCD) Stock Dips While Market Gains: Key Facts", "summary": "McDonald's (MCD) closed the most recent trading day at $276.75, moving -0.05% from the previous trading session."}, {"date": "20240424192100", "headline": "CMG Earnings: Solid Q1 Beat and Strong Outlook Lift Stock", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424214000", "headline": "McDonald's Corp. stock outperforms competitors despite losses on the day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424235300", "headline": "7 blue chip stocks to Buy on the Dip: April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424235300", "headline": "The Top 3 Dividend Stocks to Buy in April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425021000", "headline": "March's Dividend Portfolio Update Sets New All-Time Record - 100 Holdings, 21 Buys", "summary": "Portfolio changes in March focus on BDCs, aiming to increase dividend income by at least $100 each month. Click here for a detailed analysis."}, {"date": "20240425071523", "headline": "Countdown to McDonald's (MCD) Q1 Earnings: A Look at Estimates Beyond Revenue and EPS", "summary": "Evaluate the expected performance of McDonald's (MCD) for the quarter ended March 2024, looking beyond the conventional Wall Street top-and-bottom-line estimates and examining some of its key metrics for better insight."}, {"date": "20240425081500", "headline": "Have $500? 4 Absurdly Cheap Stocks Long-Term Investors Should Buy Right Now", "summary": "These stocks are great buys after underperforming the broader indexes in recent months."}, {"date": "20240425154520", "headline": "McDonald's (MCD) Stock Moves -0.42%: What You Should Know", "summary": "In the most recent trading session, McDonald's (MCD) closed at $275.60, indicating a -0.42% shift from the previous trading day."}, {"date": "20240425200600", "headline": "Catalyst Watch: Apple earnings, Viking IPO, Chinese EV deliveries and Russell indices' Rank Day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425204800", "headline": "Looking At McDonald's's Recent Unusual Options Activity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425230200", "headline": "Steady Eddies: 7 Rock-Solid Stocks to Anchor Your Portfolio in April", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426020900", "headline": "McDonald’s (NYSE:MCD) Earnings Preview: Assessing Potential Risks Ahead of Q1 Results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426062900", "headline": "10 out of 14 S&P 500 consumer discretionary stocks post earnings beat - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426065700", "headline": "Google, How Does One Get A Stock Higher? And What’s Stagflation?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426080925", "headline": "Stocks to watch next week: Amazon, Apple, Anglo American and Novo Nordisk", "summary": "Earnings preview of key companies reporting next week and what to look out for."}, {"date": "20240426092000", "headline": "McDonald's (MCD) Gears Up for Q1 Earnings: What's in the Cards?", "summary": "McDonald's (MCD) first-quarter top line is likely to have benefited from solid digital adoption, menu innovation and unit-expansion efforts"}, {"date": "20240426230700", "headline": "7 Dividend Stocks to Buy Now for Steady Returns in Any Market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427220100", "headline": "California Fast-Food Chains Are Now Serving Sticker Shock", "summary": "A month after a higher state minimum wage for fast-food workers went into effect, consumers picking up burgers and burritos at chains in the Golden State grapple with prices rising at a faster clip than in other states."}, {"date": "20240428010300", "headline": "Earnings week ahead: Amazon, Apple, Pfizer, AMD, Coca-Cola, Starbucks and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428011500", "headline": "Is It Too Late to Buy McDonald's Stock Now?", "summary": "It's not too late to make money but it might be too late for a high upside."}, {"date": "20240428012000", "headline": "Greenhaven Road Capital Main Fund Q1 2024 Investor Letter", "summary": "Greenhaven Road Capital Main Fund returned approximately 2% in the first quarter of 2024. Click here to read the full fund letter."}, {"date": "20240428012226", "headline": "Wall Street Breakfast: The Week Ahead", "summary": "This article discusses the upcoming events in the financial world, including the Federal Reserve meeting, corporate earnings, IPOs, and investor events."}, {"date": "20240428040100", "headline": "The Need to Feed: 3 Fast Food Stocks With the Strongest Upside Potential in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428180000", "headline": "The Ultimate Dividend Stock to Buy With $1,000 Today", "summary": "One of McDonald's iconic burgers has been selling for over five decades."}, {"date": "20240429000100", "headline": "Options Volatility and Implied Earnings Moves This Week, April 29 – May 02, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429010127", "headline": "McDonald's (MCD) Reports Earnings Tomorrow: What To Expect", "summary": "Fast-food chain McDonald’s (NYSE:MCD) will be announcing earnings results tomorrow before the bell. Here's what investors should know."}, {"date": "20240429024604", "headline": "Starbucks: McDonald's Store Growth Plans Are Bullish For Starbucks (Rating Upgrade)", "summary": "It took me some time to decide on a rating for Starbucks, as I am torn between 'hold' and 'buy'. Read more to see my analysis on SBUX stock."}, {"date": "20240429032900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429042800", "headline": "McDonald Q1 Earnings Preview: Near-term headwinds could weigh on results and outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429042800", "headline": "Starbucks Q2 earnings: Focus on margins and potential rebound in China sales", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429053600", "headline": "California Restaurants Dish Out Price Hikes: Menu Costs Reportedly Surge Amid Minimum Wage Increase", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429060935", "headline": "3 Reliable Dividend Stocks And 1 Alternative Investment To Make You Money While You Sleep", "summary": "As concerns regarding delayed rate cuts amid looming geopolitical threats pile on, investing in dividend stocks might be the best move for investors seeking passive income. These investments not only provide a steady stream of income but also offer a ..."}, {"date": "20240429064007", "headline": "McDonald's set for weak sales growth as US fast-food chains grapple with muted traffic", "summary": "The burger giant will report first-quarter results on Tuesday, kicking off earnings for U.S. restaurant chains, with top players such as Starbucks and KFC-parent Yum Brands set to report results later in the week.  \"We expect traffic to continue to be negative and believe the average check will remain under pressure from the heavy discounting to recover lower-income consumer traffic,\" BTIG analyst Peter Saleh said.  McDonald's has leaned on its Dollar Menu, offering items in the $1, $2, $3 price points to lure in diners on a budget, while Wendy's this month offered some items for just a dollar on orders placed via apps."}, {"date": "20240429064600", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429152408", "headline": "McDonald's faces weaker foot traffic, value proposition as it sets to report Q1 earnings", "summary": "Wall Street is waiting to hear more about how McDonald's consumers are faring."}, {"date": "20240429184800", "headline": "GLOBAL BRIEFING: HSBC CEO to retire; first-quarter profit edges down", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429190000", "headline": "McDonald’s Supersizes China Bet as Corporate America Pulls Back", "summary": "The fast-food chain aims to nearly double restaurants in the country after spending $1.8 billion to buy back a bigger stake in the company’s business there."}, {"date": "20240429190600", "headline": "Markets Up On Tesla, Q1 Earnings; Q1 Beats After The Bell", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429190600", "headline": "DZ BANK AG Sticks to Its Buy Rating for McDonald’s (MCD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429191900", "headline": "Investor Sentiment Improves Further, Dow Jumps Over 100 Points", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429191900", "headline": "Coca-Cola, Amazon And 3 Stocks To Watch Heading Into Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429192700", "headline": "McDonald’s stock bounces as revenue beat, new ‘larger’ burger offset profit miss", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429200300", "headline": "Analysts Offer Insights on Consumer Cyclical Companies: Mobileye Global, Inc. Class A (MBLY), McDonald’s (MCD) and Mohawk (MHK)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429202500", "headline": "Americans Swap $5 Burgers For $1,000 Weight Loss Drugs — Is Soda Getting Left Behind Too?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429212200", "headline": "What You Missed On Wall Street On Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429223100", "headline": "Barclays Remains a Buy on McDonald’s (MCD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429233300", "headline": "McDonald’s (NYSE:MCD) Eyes Major Footprint Expansion in China", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000200", "headline": "McDonald's reports Q1 EPS $2.66, consensus $2.54", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000200", "headline": "Wall Street On Edge Ahead Of Fed Decision, Spotlight Falls On Amazon And AMD Earnings: Analyst Says Stocks Survive 'Fragility Test' As April Ends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000300", "headline": "McDonald's reports Q1 U.S. SSS up 2.5%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000600", "headline": "Options Volatility and Implied Earnings Moves Today, April 30, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430001100", "headline": "McDonald's reports Q1 adjusted EPS $2.70, consensus $2.54", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430001200", "headline": "McDonald misses Q1 topline estimates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430002400", "headline": "McDonald misses Q1 earnings estimates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430003200", "headline": "McDonald's Corp (MCD) Q1 2024 Earnings: Aligns with EPS Projections Amidst Global Sales Growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430004100", "headline": "McDonald's dips after the Middle East war impacts sales", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430004400", "headline": "McDonald’s stock drops as profit comes up short", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430005800", "headline": "McDonald’s earnings: Revenues hit, while EPS misses the mark in Q1 financial results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430010200", "headline": "McDonald's plans to step up deals and marketing to combat slower fast food traffic", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430010800", "headline": "McDonald's in charts: Pace of growth rate slows across key metrics in Q1", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430010913", "headline": "McDonald's: Q1 Earnings Snapshot", "summary": "CHICAGO — CHICAGO — McDonald's Corp. on Tuesday reported first-quarter net income of $1.93 billion. On a per-share basis, the Chicago-based company said it had net income of $2.66...."}, {"date": "20240430011736", "headline": "McDonald's Quarterly Profit Falls Short of Street Views", "summary": "By Colin Kellaher McDonald's posted first-quarter earnings that missed Wall Street's expectations, as consumers rein in their spending. The Chicago fast-food giant on Tuesday reported..."}, {"date": "20240430013918", "headline": "Malaysian fast food operator QSR shelves IPO plans amid boycott campaign, sources say", "summary": "Malaysian's QSR Brands, the operator of fast food chains KFC and Pizza Hut in Southeast Asia, has indefinitely shelved plans to list on the local stock exchange as its businesses have been..."}, {"date": "20240430014300", "headline": "MCD Earnings: McDonald’s Drops on Q1 Bottom Line Miss", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430014400", "headline": "McDonald's expects 'moderating' topline growth in FY24", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430015200", "headline": "McDonald's expects to test larger burger this year", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430022200", "headline": "TOP NEWS: McDonald's touts strength of strategy as quarter earnings up", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430022300", "headline": "Fly Intel: Pre-market Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430022500", "headline": "McDonald’s stock drops premarket after first profit miss in more than 2 years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430022500", "headline": "5 stocks to watch on Tuesday: KO, MCD, AMZN and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430023100", "headline": "McDonald's says FY24 won't be a 'typical year' for the broader industry", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430023245", "headline": "McDonald's: first-quarter consensus beaten", "summary": "McDonald's sales and earnings exceeded Wall Street expectations in the first quarter, thanks in particular to the undeniable dynamism of the US market.The fast-food chain reported this morning net..."}, {"date": "20240430023600", "headline": "Assessing McDonald’s Financial Performance and Outlook: A Hold Rating Amidst Mixed Results and Market Uncertainties", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430024000", "headline": "Unusually active option classes on open April 30th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430031414", "headline": "Stocks to Watch Tuesday: Stellantis, HSBC, Coca-Cola", "summary": "? Results from **Coca-Cola (KO)**, **Eli Lilly (LLY)**, **McDonald’s (MCD)** and **PayPal (PYPL)** are due this morning. ? **Amazon.com (AMZN)**, **Starbucks (SBUX)** and **Advanced Micro Devices (AMD)** are scheduled to report this afternoon."}, {"date": "20240430031800", "headline": "Video: Dow Movers: MCD, MMM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430032000", "headline": "Dow Tumbles 200 Points; McDonald's Posts Downbeat Earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430033434", "headline": "McDonald : Strategy Sustains Growth", "summary": "McDonald's Strategy Sustains Growth April 30, 2024 ..."}, {"date": "20240430033600", "headline": "UBS Sticks to Their Buy Rating for McDonald’s (MCD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430035100", "headline": "McDonald's swings to a gain after talking up larger burger test, value pricing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430041600", "headline": "McDonald's (MCD) Faces a Challenging Q1: A Comprehensive Overview", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430045900", "headline": "MCD Stock Earnings: McDonald’s Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430050000", "headline": "McDonald’s Pushes Value as Consumers Grow Skittish on Spending", "summary": "McDonald’s  said that consumers are tightening their spending as the burger chain reported lower-than-expected quarterly sales growth.  The company on Tuesday reported global same-store sales growth of 1.9% in its first quarter, slightly below analysts’ expectations.  Conflict in the Middle East continued to drag on McDonald’s international licensed business, the company said, and executives have said that lower-income consumers generally are struggling to manage higher costs."}, {"date": "20240430050000", "headline": "REFILE-McDonald's sales miss estimates as customers cut back spending", "summary": "McDonald's fell short of Wall Street estimates for first-quarter sales on Tuesday as budget-conscious consumers cut back on restaurant meals and the Middle East conflict weighed on the burger chain's international sales.  Global comparable sales growth slid for the fourth straight quarter to 1.9%, with the company saying consumers turned \"more discriminating with every dollar they spend\".  Analysts had estimated a 2.35% rise, according to LSEG data."}, {"date": "20240430050000", "headline": "McDONALD'S REPORTS FIRST QUARTER 2024 RESULTS", "summary": "McDonald's Corporation today announced results for the first quarter ended March 31, 2024."}, {"date": "20240430050144", "headline": "McDonald's higher US sales in Q1 help overcome weakness from boycotts overseas", "summary": "McDonald’s said higher U.S. sales in the first quarter helped it overcome weakness in the Middle East and other markets where consumers have been boycotting the brand.  Customers across the Middle East and in Muslim-majority markets like Indonesia and Malaysia have been boycotting McDonald’s for months over its perceived support for Israel.  The boycotts began in October, after McDonald’s local Israeli franchisee announced it was providing free meals for Israeli troops involved in the war in Gaza."}, {"date": "20240430050207", "headline": "McDonald's sales miss estimates as customers cut back spending", "summary": "McDonald's fell short of Wall Street estimates for first-quarter sales on Tuesday as budget-conscious consumers cut back on restaurant meals and the Middle East conflict weighed on the burger chain's international sales.  Global comparable sales growth slid for the fourth straight quarter to 1.9%, with the company saying consumers turned \"more discriminating with every dollar they spend\".  Analysts had estimated a 2.35% rise, according to LSEG data."}, {"date": "20240430050212", "headline": "McDonald's Q1 earnings miss sales expectations, as consumers tighten their wallets", "summary": "McDonald's hefty expansion plans helped to boost sales in Q1."}, {"date": "20240430050300", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430050607", "headline": "UPDATE 1-McDonald's sales miss estimates as customers cut back spending", "summary": "McDonald's fell short of Wall Street estimates for first-quarter sales on Tuesday as budget-conscious consumers cut back on restaurant meals and the Middle East conflict weighed on the burger chain's international sales.  Global comparable sales growth slid for the fourth straight quarter to 1.9%, with the company saying consumers turned \"more discriminating with every dollar they spend\".  Analysts had estimated a 2.35% rise, according to LSEG data."}, {"date": "20240430051407", "headline": "McDonald's Corporation (MCD) Q1 2024 Earnings Call Transcript", "summary": "McDonald's Corporation (NYSE:NYSE:MCD) Q1 2024 Earnings Conference Call April 30, 2024 8:30 AM ETCompany ParticipantsMike Cieplak - IRChris Kempczinski -..."}, {"date": "20240430052939", "headline": "US STOCKS-Futures drift lower as focus turns to upcoming Fed meet", "summary": "Futures tracking Wall Street's main indexes were subdued on Tuesday as investors refrained from placing big bets ahead of the Federal Reserve's interest rate decision and kept a close eye on a stream of earnings updates.  The Federal Reserve Open Market Committee (FOMC) will commence its two-day meeting later in the day, with markets focused on the interest rate verdict and Chair Jerome Powell's remarks.  Money markets are largely expecting the central bank to stand pat on interest rates this meeting, while pricing in just about 35 basis points (bps) of rate cuts this year, down from about 150 bps estimated at the start of 2024, according to LSEG data."}, {"date": "20240430054736", "headline": "Dow Jones Notebook: McDonald's, Coca-Cola Trade Lower; 3M Poised For Breakout", "summary": "Dow Jones fast food giant McDonald's fell short of Q1 earnings Tuesday. Coca-Cola beat views, lifted its sales growth forecast."}, {"date": "20240430063600", "headline": "Stocks Dive On Fears Of Hawkish Fed; Treasury Yields Rise, Bitcoin Tumbles To $60,000: What's Driving Markets Tuesday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430071341", "headline": "Fed decision, Amazon earnings, McDonald's prices: 3 Things", "summary": "US equity markets (^DJI, ^IXIC, ^GSPC) face pressures ahead of the Federal Reserve's interest rate decision on Wednesday. Wall Street experts are expecting Fed officials to hold rates where they are coming out of their May FOMC meeting this week. Amazon (AMZN) will report its first-quarter earnings after Tuesday's market close, with many analysts eyeing the Magnificent Seven member's AI and cloud business segments. Lastly, McDonald's (MCD) shares fall in today's pre-market trading as higher menu prices drag down the fast-food chain's sales and revenue growth estimates. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Luke Carberry Mogan."}, {"date": "20240430073024", "headline": "McDonald's (MCD) Q1 Earnings: Taking a Look at Key Metrics Versus Estimates", "summary": "While the top- and bottom-line numbers for McDonald's (MCD) give a sense of how the business performed in the quarter ended March 2024, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values."}, {"date": "20240430074509", "headline": "McDonald’s Results Hurt by Mideast War, Slowing US Growth", "summary": "(Bloomberg) -- McDonald’s Corp. results fell short of expectations in the first quarter, hampered by slowing growth in the US and the reverberations of the Israel-Hamas war.Most Read from BloombergHSBC CEO Quinn Unexpectedly Steps Down After Almost 5 YearsBinance and CZ’s Fortunes Are Set to Grow, Even in JailTesla Soars on Tentative China Approval for Driving SystemS&P 500 Falls 1% at End of Worst Month in 2024: Markets WrapStocks Trade for 390 Minutes a Day. Increasingly, Only 10 MatterGrowth"}, {"date": "20240430080004", "headline": "McDonald's and Starbucks Offer Good Value", "summary": "Both stocks are trading at a fair price"}, {"date": "20240430081800", "headline": "McDonald (MCD) Q1 Earnings Miss, Revenues Top Estimates", "summary": "McDonald's (MCD) first-quarter U.S. comps benefit from menu price increases, effective marketing campaigns, and continued digital and delivery growth."}, {"date": "20240430082000", "headline": "Wall Street Lunch: Reefer Gladness", "summary": "The reported move falls short of legalizing recreation pot use. Eli Lilly boosts outlook on weight loss drug performance. Wage inflation comes in hot for Q1."}, {"date": "20240430082129", "headline": "US STOCKS-Wall St falls in lead up to Fed verdict after hot labor costs data", "summary": "Wall Street's main indexes fell on Tuesday with caution prevailing ahead of the Federal Reserve's interest-rate decision and as stronger-than-expected labor costs hinted at persistent inflation.  U.S. labor costs increased in the first quarter amid a rise in wages and benefits, confirming the surge in inflation early in the year that will likely delay a much-anticipated interest rate cut later in 2024.  \"This pretty much tells you that the Fed is going to be very reluctant to reduce short-term interest rates in 2024 and that's had the predictable impact on the stock market,\" said Hugh Johnson, chief economist at Hugh Johnson Economics."}, {"date": "20240430083921", "headline": "McDonald's First-Quarter Earnings Miss Views Amid Cautious Consumer Spending, Middle East Conflict", "summary": "McDonald's First-Quarter Earnings Miss Views Amid Cautious Consumer Spending, Middle East Conflict"}, {"date": "20240430093124", "headline": "McDonald's sales growth setback from Middle East conflict", "summary": "Are McNuggets no longer selling like hotcakes? McDonald's (MCD) stock slipped Tuesday morning after a mixed earnings report — $6.17 billion in revenue against estimates of $6.15 billion, adjusted earnings per share of $2.70 below estimates of $2.72. Much of McDonald's first-quarter performance has to do with its same-store sale figures — falling below global growth figures from this time last year — heavily attributed to international pressures from geopolitical events and overall rising menu prices. Catalysts Anchor Madison Mills breaks down how boycotts tied to Middle Eastern conflicts have put a damper on McDonald's sales performance. For more expert insight and the latest market action, click here to watch this full episode of Catalysts. This post was written by Luke Carberry Mogan."}, {"date": "20240430094500", "headline": "McDonald’s and Domino’s Serve Food for Thought on Consumer Spending", "summary": "Investors are getting some hard truths from fast food this week.  Whether quick-serve chains beat or lagged expectations, it is clear that their core lower-income customer isn’t nearly as flush as he or she was a year ago amid rising prices for essentials.  Anecdotal evidence indicates some are shifting spending to food at home."}, {"date": "20240430100217", "headline": "Coca-Cola, McDonald's, Walmart: State of the consumer", "summary": "Coca-Cola (KO) posted its first quarter report on Tuesday, beating expectations on both the top and bottom lines. CEO James Quincey spoke to Yahoo Finance Reporter Brooke DiPalma about the company's performance and sales and the impact of inflation. McDonald's (MCD) also posted its first quarter report, missing on expectations due to increased prices that affected lower-income customers. However, the company did still post an increase in same-store sales year-over-year. Yahoo Finance Reporter Brooke DiPalma joins Wealth! to discuss the performance of McDonald's and Coca-Cola, her conversation with Coca-Cola CEO James Quincey, as well as Walmart's new brand.  For more expert insight and the latest market action, click here to watch this full episode of Wealth! This post was written by Nicholas Jacobino"}, {"date": "20240430101649", "headline": "McDonald's has 'outpriced' customers amid menu hikes: Analyst", "summary": "McDonald's (MCD) first-quarter earnings report showcased a combo meal of international headwinds, including global sales growth slowing behind figures from this time last year and boycotts related to the ongoing Israel-Palestine conflict. Additionally, inflation and rising menu prices are taking a toll on lower-income consumers. On the fast-food chain's earnings call, McDonald's CEO Chris Kempczinski stated that \"consumers continue to be even more discriminating with every dollar that they spend as they face elevated prices in their day-to-day spending.\" Placer.ai Head of Analytical Research R.J. Hottovy sits down with Catalysts to discuss whether McDonald's item prices are beginning to price out certain consumer demographics. Placer.ai data found McDonald's to maintain higher monthly foot traffic growth over the past year than its competition. \"Right now consumers are really focused on value, and not just discounts. I think that low price point is something that they're certainly focused in on,\" Hottovy says. \"We've seen groups that really market around a low price point, generally a higher visitation trade. And so I think that's what McDonald's may be pivoting to in the future. There's a lot of discussion about future value plans in the US and abroad in the earnings call today. I think that's really going to be a key message...\" For more expert insight and the latest market action, click here to watch this full episode of Catalysts. This post was written by Luke Carberry Mogan."}, {"date": "20240430101800", "headline": "NEW YORK MARKET CLOSE: Dow hit by new inflationary scare ahead of Fed", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430103000", "headline": "Starbucks lowers guidance, promises new drinks and deals after customer traffic fell in weak Q2", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430105357", "headline": "11 Best Fast Food Stocks To Buy According to Analysts", "summary": "In this article, we will be taking a look at the 11 best fast food stocks to buy according to analysts. To see more of these stocks, you can go directly to see the 5 Best Fast Food Stocks To Buy According to Analysts. The fast food industry is synonymous with quick service, affordability, and […]"}, {"date": "20240430112300", "headline": "McDonald’s Seeks to Make Menu More Affordable for Inflation-Weary Consumers", "summary": "McDonald  said consumers across the globe are tightening their spending as the burger chain reported lower-than-expected quarterly sales growth.  McDonald’s for months has warned of a weakening economy, but executives said the headwinds so far this year are steeper than previously anticipated.  McDonald’s Chief Executive  Chris Kempczinski  said the company is focused on ensuring its food remains a good value for consumers’ dollars."}, {"date": "20240430114919", "headline": "Sector Update: Consumer Stocks Retreat in Afternoon Trading", "summary": "Sector Update: Consumer Stocks Retreat in Afternoon Trading"}, {"date": "20240430115921", "headline": "Taxpayer to fork out £85bn to cover Bank of England losses", "summary": "Taxpayers will cover £85bn of losses made by the Bank of England on its quantitative easing programme which began during the global financial crisis, according to the latest estimates."}, {"date": "20240430123518", "headline": "McDonald's may finally be feeling cost of higher prices", "summary": "The latest earnings from McDonald's left much to be desired as prices at checkout continue to grow."}, {"date": "20240430124930", "headline": "US STOCKS-Wall Street stocks fall as markets weigh strong wage data, Fed meeting", "summary": "U.S. stocks traded lower on Tuesday as markets weighed economic data showing rising labor costs and deteriorating consumer confidence on the eve of a key Federal Reserve policy meeting to decide the direction of interest rates.  Data showed on Tuesday that U.S. labor costs rose by a more-than-expected 1.2% last quarter, indicating an uptick in wage pressures."}, {"date": "20240430144400", "headline": "Starbucks Shares Plunge After Sales, Earnings Miss", "summary": "Speeding up service and introducing new beverages are part of efforts to win back customers, executives say."}, {"date": "20240430195100", "headline": "Analysts’ Opinions Are Mixed on These Consumer Cyclical Stocks: Trimas (TRS), McDonald’s (MCD) and Travel + Leisure Co (TNL)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430204000", "headline": "Q1 Earnings Seasons Picks & Pans: The 4 Biggest Stock Winners (and 3 Losers)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430204800", "headline": "Investor Sentiment Falls, Dow Snaps Five-Month Win Streak", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430212533", "headline": "Q1 2024 McDonald's Corp Earnings Call", "summary": "Q1 2024 McDonald's Corp Earnings Call"}, {"date": "20240430221900", "headline": "McDonald's price target lowered by $20 at Barclays, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430230000", "headline": "McDonald’s (MCD) Receives a Buy from Wells Fargo", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430230400", "headline": "The 3 Best Restaurant Stocks to Buy for Their Incredible Pricing Power", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430232500", "headline": "Analysts Are Bullish on These Consumer Cyclical Stocks: Starbucks (SBUX), McDonald’s (MCD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430234200", "headline": "Analysts Have Conflicting Sentiments on These Consumer Cyclical Companies: McDonald’s (MCD), Lear (LEA) and Amazon (AMZN)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430234500", "headline": "McDonald's price target raised by $20 at HSBC, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430234900", "headline": "McDonald's price target lowered by $5 at KeyBanc, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430235100", "headline": "McDonald's price target lowered by $10 at JPMorgan, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430235200", "headline": "McDonald's price target lowered by $5 at Baird, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501001400", "headline": "McDonald's price target lowered by $5 at BMO Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501004600", "headline": "Loop Capital Markets Reaffirms Their Buy Rating on McDonald’s (MCD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501005700", "headline": "Oppenheimer Keeps Their Hold Rating on McDonald’s (MCD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501010542", "headline": "McDonald's Corp (MCD) Q1 2024 Earnings Call Transcript Highlights: Strategic Adjustments and ...", "summary": "Explore key insights on McDonald's performance, strategic initiatives, and future plans from the Q1 2024 earnings call."}, {"date": "20240501011200", "headline": "GLOBAL BROKER RATINGS: Bernstein raises Deutsche Lufthansa", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501011700", "headline": "Amazon To Rally Over 37%? Here Are 10 Top Analyst Forecasts For Wednesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501011800", "headline": "McDonald's price target lowered by $5 at Wedbush, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501013100", "headline": "Wall Street Analysts Are Bullish on Top Consumer Cyclical Picks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501013500", "headline": "Wingstop is a breakout star amid the sluggish restaurant earnings season", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501014500", "headline": "Greenhaven Road Capital - PAR Technology: Compelling Transformation In Next Five Years", "summary": "PAR has several â\u0080\u009cways to winâ\u0080\u009d and I think the next five years will see a compelling transformation. Click here for our thesis on PAR stock. "}, {"date": "20240501014600", "headline": "Krispy Kreme plans to expand into Germany", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501015300", "headline": "Yum China Revs Up Restaurant Expansion, Share Repurchases", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501015800", "headline": "McDonald's Analysts Slash Their Forecasts Following Q1 Results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501020500", "headline": "Bank of America Securities Reaffirms Their Hold Rating on McDonald’s (MCD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501035709", "headline": "Three-quarter pounder? McDonald’s plotting bigger burgers to boost flagging sales", "summary": "McDonald’s is preparing to roll out a bigger burger to help boost the fast-food giant’s flagging sales."}, {"date": "20240501040600", "headline": "Hold Rating on McDonald’s Amid Market Challenges and Growth Initiatives", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501051200", "headline": "Starbucks's Financials Are In Needs Of A Pick Me Up Coffee", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501060000", "headline": "How McDonald’s and Burger King diverge on value-driven messaging", "summary": "Price-conscious consumers are forcing the QSR giants down different paths around how to advertise value and invest in their marketing."}, {"date": "20240501060014", "headline": "Here's Why McDonald's (NYSE:MCD) Has Caught The Eye Of Investors", "summary": "The excitement of investing in a company that can reverse its fortunes is a big draw for some speculators, so even..."}, {"date": "20240501070012", "headline": "Why Investors Need to Take Advantage of These 2 Retail-Wholesale Stocks Now", "summary": "The Zacks Earnings ESP is a great way to find potential earnings surprises. Why investors should take advantage now."}, {"date": "20240501091800", "headline": "Restaurant Brands (QSR) Q1 Earnings & Revenues Top Estimates", "summary": "Restaurant Brands' (QSR) first-quarter top line benefits from strong system-wide sales growth across its segments."}, {"date": "20240501092200", "headline": "Brinker (EAT) Q3 Earnings & Revenues Top Estimates, Stock up", "summary": "Brinker's (EAT) fiscal third-quarter performance benefits from advancements in enhancing the guest experience, effective marketing strategies and traffic-driving initiatives."}, {"date": "20240501093041", "headline": "Starbucks: The Coffee Giant Gets Crippled On Horrible Earnings", "summary": "Starbucks Q2 earnings show sales decline and significant revenue miss, indicating consumers are cutting back on spending. Read my earnings analysis of SBUX stock here."}, {"date": "20240501093550", "headline": "McDonald’s Corporation (NYSE:MCD) Q1 2024 Earnings Call Transcript", "summary": "McDonald’s Corporation (NYSE:MCD) Q1 2024 Earnings Call Transcript April 30, 2024 McDonald’s Corporation isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Hello, and welcome to McDonald’s First Quarter 2024 Investor Conference Call. At the request of McDonald’s Corporation, this conference […]"}, {"date": "20240501095822", "headline": "McDonald's Q1 Results Show Battle for Value Amid Consumer Pressure, Deutsche Bank Says", "summary": "McDonald's Q1 Results Show Battle for Value Amid Consumer Pressure, Deutsche Bank Says"}, {"date": "20240501100500", "headline": "DoorDash posts better-than-expected Q1 sales but shares fall on cost concerns", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501100500", "headline": "DoorDash posts better-than-expected Q1 sales as US grocery demand grows", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501112904", "headline": "CORRECTED-US fast-food chains may have to amp up promotions as more people eat at home", "summary": "Global fast food giants may have to dole out steeper promotions to lure inflation-hit customers who are increasingly opting to eat at home, following weak sales from the likes of McDonald's and Starbucks this week.  Disposable income in the United States is declining, particularly in the lower-income cohort, while the slow economic recovery in China has increased industry-wide pressures for quick-service chains including KFC owner Yum Brands that has extended across several quarters.  Packaged food companies are also feeling the pinch of weak consumer spending, especially from low-income households, as their cookies and baked snacks see a slowdown in sales."}, {"date": "20240501113258", "headline": "US fast-food chains may have to amp up promotions as more people eat at home", "summary": "Global fast food giants may have to dole out steeper promotions to lure inflation-hit customers who are increasingly opting to eat at home, following weak sales from the likes of McDonald's and Starbucks this week.  Disposable income in the United States is declining, particularly in the lower-income cohort, while the slow economic recovery in China has increased industry-wide pressures for quick-service chains including KFC owner Yum Brands that has extended across several quarters.  \"The lack of value offers has opened up consumers to shop for different options whether it be other (chains) or the grocery stores,\" Razmig Poundardjian, portfolio manager for Carnegie Investment Counsel said."}, {"date": "20240501194000", "headline": "The Great Unwind Accelerates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501203600", "headline": "Check Out What Whales Are Doing With MCD", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501211800", "headline": "Buy Rating Affirmed for McDonald’s Corporation on Strong Sales Growth and Strategic Initiatives", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501234800", "headline": "McDonald's price target lowered by $10 at Guggenheim, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501235600", "headline": "People are spending less on fast food. That makes sense for consumers, even if it’s a red flag for companies — and the economy.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502005800", "headline": "McDonald’s (MCD) Receives a Rating Update from a Top Analyst", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502013300", "headline": "GLOBAL BROKER RATINGS: Deutsche Bank cuts Starbucks, CFRA ups Logitech", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502014800", "headline": "McDonald's price target lowered by $17 at Truist, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502030600", "headline": "McDonald’s (MCD) Receives a Hold from Stifel Nicolaus", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502035600", "headline": "Shake Shack beats profit expectations as sales trends improve each month", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502041500", "headline": "DoorDash Faces Q1 Earnings Challenges Despite Revenue Growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502072353", "headline": "Tyson Foods: Staying The Course As Earnings Near", "summary": "Tyson Foods could slash prices and experience a margin contraction. See whyÂ analysts are slightly bullish on TSN stock, expecting a slight uptick in Q2 24."}, {"date": "20240502192400", "headline": "Financial experts told consumers to stop ‘wasting’ money eating out. They’re finally listening — and companies are rattled.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502230300", "headline": "The 7 Best Long-Term Stocks to Buy for Exponential Gains: Q2 Edition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503023000", "headline": "Dow Jones Industrial Average Gains 450 Points As Investors Up Rate Cut Bets After Softer NFP", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503040200", "headline": "Financial experts told consumers to stop ‘wasting’ money eating out. They’re finally listening— and companies are rattled.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503042200", "headline": "Looking Into McDonald's's Recent Short Interest", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503061900", "headline": "Notable Friday Option Activity: MCD, EOG, XOM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503102200", "headline": "Shake Shack (SHAK) Q1 Earnings Beat Estimates, Revenues Lag", "summary": "Shake Shack's (SHAK) fiscal first-quarter performance reflects benefits from sequential improvements in traffic, marketing initiatives and strong new store performances."}, {"date": "20240503102300", "headline": "Wendy's (WEN) Q1 Earnings Beat Estimates, Revenues Lag", "summary": "Wendy's (WEN) first-quarter fiscal 2024 results benefit from solid same-restaurant sales, strength in U.S. breakfast sales and digital sales momentum."}, {"date": "20240503154038", "headline": "Why value needs to be the main focus for fast food restaurants", "summary": "As inflationary pressures mount, consumer spending has shown signs of slowing, with fast-food and fast-casual dining chains feeling the pinch. Joining Market Domination to discuss the importance of value within the restaurant industry are Bernstein Senior Analyst for U.S. Restaurants Danilo Gargiulo and UBS Executive Director of Equity Research Dennis Geiger. Gargiulo acknowledges that attracting customers has become \"incrementally harder,\" with \"traffic slowing down across the entire industry.\" He emphasizes that chains need to \"be mindful\" of ensuring value is a core component of their offerings. However, for giants like McDonald's (MCD), which operate under a franchise model, the question of profitability for individual franchisees and aligning their interests arises. Geiger echoes the sentiment, noting \"an industry slowdown\" within the quick-service restaurant and fast-food sectors. He attributes this trend to a variety of factors, including price increases, the broader inflationary environment, and even tightening consumer budgets. Regardless of the root causes, Geiger asserts that \"there's softness\" in consumer demand, particularly among lower-income consumers. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. Editor's note: This article was written by Angel Smith"}]}