{"news": [{"date": "20240415101700", "headline": "NEW YORK MARKET CLOSE: Dow hit by hot retail sales, Middle East nerves", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415144621", "headline": "Big Bank earnings, March housing data: What to Watch", "summary": "The first-quarter earnings season is in full swing, with major companies reporting their results throughout the day on Tuesday, April 16. Among them include Big Bank stocks Bank of America (BAC), Morgan Stanley (MS), and PNC Financial Services Group (PNC). Market Domination Overtime's Julie Hyman and Josh Lipton highlight the other companies also set to report earnings and the US housing starts print expected out tomorrow. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Luke Carberry Mogan."}, {"date": "20240415183400", "headline": "GLOBAL BRIEFING: China's economy expands by 5.3% in first quarter", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415191100", "headline": "Fear & Greed Index Moves To 'Fear' Zone; S&P 500 Down Over 1%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415191700", "headline": "Bank of America, Morgan Stanley And 3 Stocks To Watch Heading Into Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415200652", "headline": "India rate cuts 'off the table' in 2024/25, Morgan Stanley says", "summary": "Interest rate cuts in India are off the table in fiscal year 2024/25 given the change in the Federal Reserve's policy path and strong growth in the South Asian nation, analysts at Morgan Stanley..."}, {"date": "20240415222600", "headline": "Stock market today: Wall Street drifts in mixed trading as Treasury yields rise more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415231800", "headline": "US Stock Futures Dip Amid High Treasury Yields and Middle East Tensions", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415235900", "headline": "Earnings Scheduled For April 16, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416000600", "headline": "Options Volatility and Implied Earnings Moves Today, April 16, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416002700", "headline": "Wall Street Braces For Mixed Open As Middle-East Tensions Offset Earnings Optimism: Analyst Points To Silver Lining In Rally Break", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416003300", "headline": "Morgan Stanley GAAP EPS of $2.02 beats by $0.36, revenue of $15.1B beats by $710M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416003600", "headline": "Morgan Stanley reports Q1 EPS $2.02, consensus $1.66", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416003900", "headline": "Morgan Stanley declares $0.85 dividend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416005700", "headline": "Morgan Stanley Q1 earnings beat, helped by investment banking, credit benefit", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416010600", "headline": "Morgan Stanley: A Strong Buy Based on Q1 2024 Outperformance and Positive Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416013403", "headline": "Morgan Stanley's profit rises as investment banking recovers", "summary": "Morgan Stanley's profit rose in the first quarter, lifted by a resurgence in investment banking...."}, {"date": "20240416014000", "headline": "Morgan Stanley: Q1 Earnings Snapshot", "summary": "NEW YORK — NEW YORK — Morgan Stanley on Tuesday reported first-quarter profit of $3.41 billion. The New York-based company said it had earnings of $2.02 per share. The results beat Wall..."}, {"date": "20240416015300", "headline": "Fly Intel: Pre-market Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416021600", "headline": "TOP NEWS: Morgan Stanley sees investment banking boost as profit jumps", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416022000", "headline": "4 stocks to watch on Tuesday: JNJ, BAC and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416023900", "headline": "MS Earnings: Morgan Stanley Delivers Better-than-Expected Q1 Results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416024100", "headline": "Unusually active option classes on open April 16th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416024511", "headline": "Morgan Stanley: consensus beaten, thanks in particular to IPOs", "summary": "Morgan Stanley reported better-than-expected first-quarter earnings on Tuesday, with its investment banking division benefiting in particular from the upturn in the IPO market.This morning, the US..."}, {"date": "20240416024700", "headline": "Morgan Stanley sees Q2 NII roughly in line with Q1", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416025000", "headline": "Morgan Stanley sees 2024 tax rate about 23%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416025100", "headline": "More Bank Earnings, Housing Starts, Waiting On Israel And Powell", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416025600", "headline": "Early notable gainers among liquid option names on April 16th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416025814", "headline": "Makhlouf Says June ECB Cut Possible If Inflation Trend Persists", "summary": "(Bloomberg) -- The European Central Bank should be able to cut interest rates at its next meeting if the trend in inflation persists, Governing Council member Gabriel Makhlouf told the Irish Daily Mail.Most Read from BloombergBeyond the Ivies: Surprise Winners in the List of Colleges With the Highest ROIChina Tells Iran Cooperation Will Last After Attack on IsraelIran’s Attack on Israel Sparks Race to Avert a Full-Blown WarApple Faces Worst iPhone Slump Since Covid as Rivals RiseTesla Executive"}, {"date": "20240416033100", "headline": "Morgan Stanley Jumps On Earnings Beat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416042000", "headline": "Morgan Stanley Files SEC Form 8-K Update", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416045007", "headline": "Morgan Stanley: Serial Dividend Raiser Winning With Investment Banking", "summary": "Morgan Stanley beat Q1 expectations driven by investment banking and trading, improved efficiency ratio, and dividend payout. Click for our MS earnings update."}, {"date": "20240416045600", "headline": "MS Stock Earnings: Morgan Stanley Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416051600", "headline": "Gold Moves Higher; Morgan Stanley Earnings Top Views", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416051800", "headline": "Wall Street Sees Uplift in Investment Banking Sector", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416051910", "headline": "Bank of America profits drop as key lending revenue weakens", "summary": "The results from the nation's second-largest lender offer the latest example of how even the biggest banks are increasingly challenged by high interest rates."}, {"date": "20240416053000", "headline": "Morgan Stanley First Quarter 2024 Earnings Results", "summary": "NEW YORK, April 16, 2024--Morgan Stanley (NYSE: MS) today reported net revenues of $15.1 billion for the first quarter ended March 31, 2024 compared with $14.5 billion a year ago. Net income applicable to Morgan Stanley was $3.4 billion, or $2.02 per diluted share,1 compared with net income of $3.0 billion, or $1.70 per diluted share,1 for the same period a year ago."}, {"date": "20240416053403", "headline": "Morgan Stanley's profit rises as investment banking rebounds", "summary": "\"As a result of strong net new asset growth, the firm has reached $7 trillion of client assets across wealth and investment management,\" said CEO Ted Pick in a statement.  \"Institutional Securities also saw strength across the markets and underwriting businesses.\"  Shares of the investment bank rose 2.6% before the bell."}, {"date": "20240416053433", "headline": "UPDATE 5-Morgan Stanley profit beats estimates as investment banking rebounds, wealth grows", "summary": "Morgan Stanley's first-quarter profit beat estimates on Tuesday, fueled by a resurgence in investment banking and growth in wealth management, sending shares up 1.8%.  Investment banking revenue climbed 16% from a year earlier.  The Wall Street giant's wealth and investment management divisions also benefited from surging client assets."}, {"date": "20240416060543", "headline": "Stocks to Watch Tuesday: UnitedHealth, Tesla, J&J, Live Nation", "summary": "**↘️** **Live Nation Entertainment (LYV)**: Shares of the Ticketmaster parent company slid more than 9% in premarket trading after the Journal reported that the Justice Department is preparing to sue it as soon as next month."}, {"date": "20240416060724", "headline": "Wall Street surge lifts Morgan Stanley and new CEO Ted Pick", "summary": "A Wall Street revival helped Morgan Stanley beat analyst expectations in the first quarter, giving a lift to new CEO Ted Pick."}, {"date": "20240416061800", "headline": "Market Sentiment Wavers Amid Middle East Tensions and US Rate Speculations", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416061900", "headline": "UnitedHealth Group, Morgan Stanley rise; PNC Financial, Live Nation fall, Tuesday, 4/16/2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416063000", "headline": "Stocks Grapple With Geopolitical Pressures, Gold Eyes $2,400, Bitcoin Falls Below $62,000: What's Driving Markets Tuesday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416063519", "headline": "Bank Of America Rebound Hinges On Today's Action; Morgan Stanley Surges On Earnings", "summary": "Bank of America could be a buy or a sell on post-earnings action. Morgan Stanley reports first EPS gain in eight quarters."}, {"date": "20240416063709", "headline": "Morgan Stanley (MS) Q1 2024 Earnings Call Transcript", "summary": "Morgan Stanley (NYSE:NYSE:MS) Q1 2024 Results Conference Call April 16, 2024 9:30 AM ETCompany ParticipantsTed Pick - Chief Executive OfficerSharon Yeshaya..."}, {"date": "20240416064003", "headline": "Morgan Stanley (MS) Q1 Earnings and Revenues Top Estimates", "summary": "Morgan Stanley (MS) delivered earnings and revenue surprises of 19.53% and 4.60%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240416065100", "headline": "Morgan Stanley (MS) Q1 Earnings Beat as IB Business Rebounds", "summary": "Solid IB performance on the back of robust underwriting business drives Morgan Stanley's (MS) Q1 earnings with support from equity trading business. Lower NII and a rise in expenses act as undermining factors."}, {"date": "20240416065144", "headline": "Morgan Stanley (MS) Exceeds Analyst Expectations with Strong Q1 2024 Earnings", "summary": "Robust Revenue Growth and Earnings Per Share Highlight Morgan Stanley's Financial Performance"}, {"date": "20240416072010", "headline": "Bank earnings, stock futures, oil prices: 3 Things", "summary": "Bank of America (BAC) and Morgan Stanley (MS) both topped their first-quarter earnings estimates with the major bank stocks rising ahead of Tuesday's market open. US equity futures (^DJI, ^IXIC, ^GSPC) are ticking up in pre-market trading after all three of the market indices closed Monday lower. Oil prices (CL=F, BZ=F) slip as investors wait to see if Israel will retaliate against Iran after the latter coordinated an air assault against Israeli military bases on April 13. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Luke Carberry Mogan."}, {"date": "20240416072425", "headline": "Morgan Stanley Traders Rally Past Estimates as Profits Jump", "summary": "(Bloomberg) -- Morgan Stanley’s traders delivered first-quarter revenue that exceeded expectations as its wealth management juggernaut also got back on track — both handing a key win for its new leader Ted Pick.Most Read from BloombergBeyond the Ivies: Surprise Winners in the List of Colleges With the Highest ROIChina Tells Iran Cooperation Will Last After Attack on IsraelUS Two-Year Yield Eyes 5% Before Powell’s Remarks: Markets WrapMicrosoft Invests $1.5 Billion in UAE’s G42 in Pivot From Chin"}, {"date": "20240416073010", "headline": "Morgan Stanley (MS) Reports Q1 Earnings: What Key Metrics Have to Say", "summary": "Although the revenue and EPS for Morgan Stanley (MS) give a sense of how its business performed in the quarter ended March 2024, it might be worth considering how some key metrics compare with Wall Street estimates and the year-ago numbers."}, {"date": "20240416074310", "headline": "Morgan Stanley Earnings Rise on Higher Investment-Banking Revenue", "summary": "Morgan Stanley's first-quarter earnings showed a pickup in investment banking.  Investment banking revenue was up 16% from a year earlier at $1.45 billion, boosted by stronger equity and debt underwriting.  **More from Morgan Stanley's results**:  + Quarterly revenue was $15.14 billion, up 4% from a year earlier, and better than the $14.42 billion analysts expected."}, {"date": "20240416080000", "headline": "Hollywood Still Banks On the Familiar for Box Office", "summary": "Sequels from lesser-tapped franchises are expected to dominate this year’s film releases, but Wall Street anticipates weak overall results."}, {"date": "20240416080808", "headline": "Morgan Stanley Downplays Queries Into Wealth Management Clients", "summary": "(Bloomberg) -- Morgan Stanley said federal inquiries about its efforts to monitor the background of its wealth management clients aren’t new, and that the bank has already accounted for the costs of fixing its related processes.Most Read from BloombergBeyond the Ivies: Surprise Winners in the List of Colleges With the Highest ROIChina Tells Iran Cooperation Will Last After Attack on IsraelUS Two-Year Yield Eyes 5% Before Powell’s Remarks: Markets WrapMicrosoft Invests $1.5 Billion in UAE’s G42 i"}, {"date": "20240416085300", "headline": "Investment Banking Bounceback Powers Big U.S. Lenders", "summary": "Top U.S. banks, including Bank of America, JPMorgan and Goldman, posted better-than-expected earnings thanks to strong consumer spending and a flurry of Wall Street activity."}, {"date": "20240416090632", "headline": "Big bank earnings show consumers may be losing spending steam", "summary": "In the wake of earnings reports from major banks like Bank of America (BAC) and Morgan Stanley (MS), a mixed picture is emerging about the state of consumer spending. While the banks have stressed that consumers are continuing to spend despite uncertainty around inflation, there are also signs of rising consumer credit stress. Bank of America, for instance, reported that its net charge-offs — debts unlikely to be recovered — rose to $1.5 billion year over year, up from $807 million in the prior-year period. At the same time, banks have noted a decline in net interest income, which is the difference between what banks earn on loans and what they pay on deposits. These figures raise concerns about whether consumers can sustain their current spending habits in an inflationary environment. For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance. This post was written by Angel Smith"}, {"date": "20240416095230", "headline": "Bank earnings reveal capital markets' 'resurgence': Analyst", "summary": "Morgan Stanley (MS) and Bank of America (BAC) have reported their first quarter earnings, beating expectations on the top and bottom lines. Bank of America posted revenue of $25.82 billion, surpassing estimates of $25.61 billion, alongside an adjusted EPS of $0.83, beating the $0.77 estimate. Similarly, Morgan Stanley reported revenue of $15.14 billion, outperforming the $14.46 billion estimate, with adjusted EPS of $2.02, exceeding the $1.66 estimate. To provide insights on these results, Argus Research Director of Financial Services Research Stephen Biggar joins Yahoo Finance. According to Biggar, the overarching theme is \"a resurgence in capital markets\" — a \"durable upturn in investment banking.\" Biggar notes that the banks' capital markets-related businesses, such as wealth management, investment banking, and trading, are \"doing much better.\" However, he acknowledges that the lending business and net interest income have \"faced some struggles.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance. This post was written by Angel Smith"}, {"date": "20240416100000", "headline": "Morgan Stanley Sticking to Wealth Management Strategy, Top Execs Say", "summary": "Morgan Stanley is committed to its wealth management strategy, top executives said Tuesday, days after The Wall Street Journal reported that the unit is facing several regulatory probes.  CEO Ted Pick said in his opening remarks on a conference call that the bank has been focused on \"client onboarding and monitoring processes for a good while\" and has been having \"ongoing communications\" with regulators \"as all large banks do.\"  The Journal reported last week that the division is being probed by multiple federal regulators, including the Securities and Exchange Commission, the Office of the Comptroller of the Currency and other Treasury Department offices, over how well it vets clients who are at risk of laundering money through this unit."}, {"date": "20240416100527", "headline": "Wall Street bosses cheer investment banking gains but stay cautious", "summary": "Wall Street's bosses are finally seeing signs of a broader pickup in investment banking, but they are not cheering too loudly just yet.  Investment banking divisions showed robust growth in the first quarter for the largest U.S. banks, which reported surging revenues and fees.  Capital markets led the comeback, executives said."}, {"date": "20240416102100", "headline": "NEW YORK MARKET CLOSE: Dollar up as Powell sees no rush to lower rates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416104800", "headline": "Wall Street Lunch: Bond Bulls In Hibernation", "summary": "10-year Treasury yield nearing a full point rise for 2024. UnitedHealth rallies on solid results. Fund managers are so bullish it might be time to sell."}, {"date": "20240416114502", "headline": "Morgan Stanley Stock Rises After CEO's Upbeat Comments", "summary": "Morgan Stanley's CEO Ted Pick said that future investment banking volume is growing, laying out a case for why activity is likely to rise this year.  \"The pipeline is clearly growing...across sectors,\" Pick said on the bank's earnings call on Tuesday.  “My bullishness is…a view that corporate boardrooms have been quiet for three, four years, and that is not sustainable,\" he said."}, {"date": "20240416143111", "headline": "Morgan Stanley rates STO as Equal-weight", "summary": "Morgan Stanley updates energy price forecasts for its research coverage of Australian Energy and reviews upcoming quarterly results.For Santos, the broker is looking for management commentary on..."}, {"date": "20240416143111", "headline": "Morgan Stanley rates VEA as Equal-weight", "summary": "Morgan Stanley updates energy price forecasts for its research coverage of Australian Energy and reviews upcoming quarterly results.For Viva Energy, the broker is anticipating a 1Q Geelong refining..."}, {"date": "20240416145643", "headline": "Deposits are banking industry's 'boogeyman': Money manager", "summary": "Bank of America (BAC) and Morgan Stanley (MS) were the latest Big Bank stocks to report first-quarter earnings on Tuesday. Both topped earnings and revenue estimates, a trend consistent for major financial players who have reported earnings so far. Hennessy Funds Portfolio Manager David Ellison joins Market Domination to discuss the biggest boons and challenges for the banking sector. \"I think the boogeyman or the real new issue is what's going to happen to the deposit side,\" Ellison explains. \"Since the Silicon Valley-First Republic issues of a year or so ago, the deposit side has really been exposed as a risk factor for the industry that we've never had. So you see most of these large banks losing non-interest bearing deposits to the market...\" For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Luke Carberry Mogan."}, {"date": "20240416163102", "headline": "Morgan Stanley to cut about 50 investment-banking jobs in APAC, Bloomberg News reports", "summary": "Morgan Stanley plans tostart cutting about 50 investment-banking jobs in theAsia-Pacific region this week, Bloomberg News reported onTuesday. The planned job cuts affect about 13% of..."}, {"date": "20240416164100", "headline": "Morgan Stanley to cut around 50 investment banking jobs in Asia-Pacific, sources say", "summary": "Morgan Stanley iscutting around 50 investment banking jobs in the Asia-Pacificregion due to a deals slump, sources with knowledge of thematter said. Investment bankers based in Hong..."}, {"date": "20240416180527", "headline": "Morgan Stanley Plans to Cut Around 50 Jobs in Asia-Pacific, Bloomberg Reports", "summary": "--Morgan Stanley plans to cut around 50 Asia-Pacific investment-banking positions starting this week, with at least 80% of the cuts in Hong Kong and mainland China, in its biggest round of job cuts..."}, {"date": "20240416190200", "headline": "Morgan Stanley (MS) Q1 2024 Earnings Call Transcript Highlights: A Mixed Bag Amidst Economic ...", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416191300", "headline": "Investor Optimism Decreases; Dow Ends 6-Session Losing Streak", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416193117", "headline": "Bank of America posts fall in profit as Morgan Stanley sees 14 per cent rise", "summary": "BANK of America has reported a fall in profit during the first quarter as its income from interest payments fell, although the blow was cushioned by improved trading from its dealmaking and wealth..."}, {"date": "20240416194636", "headline": "Morgan Stanley cuts dozens of investment banking jobs in Asia-Pacific, sources say", "summary": "Morgan Stanley iscutting at least 50 investment banking jobs in Asia Pacific,three sources said, becoming the latest among global banks toscale back operations in the region mainly due to a slump..."}, {"date": "20240416202800", "headline": "M&A News: Envestnet Stock (NYSE:ENV) Spikes on Buyout Rumors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416205801", "headline": "Morgan Stanley, HSBC cutting Asia investment banking jobs on China deals slowdown", "summary": "HONG KONG (Reuters) -Morgan Stanley and HSBC are cutting dozens of investment banking jobs in the Asia Pacific region this week, sources said, as they ramp up cost-cutting, with weaker dealmaking and sluggish markets in China and Hong Kong weighing on business prospects.  Morgan Stanley is cutting at least 50 investment banking jobs in the region starting this week, three sources with knowledge of the matter said, affecting around 13% of the Wall Street bank's Asia investment banking workforce of 400."}, {"date": "20240416205801", "headline": "Morgan Stanley, HSBC cutting dozens of Asia investment banking jobs on deal slowdown", "summary": "HONG KONG (Reuters) -Morgan Stanley and HSBC are cutting dozens of investment banking jobs in the Asia Pacific this week, sources with knowledge of the matter said, as weaker deal activities and sluggish markets in China and Hong Kong weigh on their business prospects.  Morgan Stanley is cutting at least 50 investment banking jobs in the region starting this week, three sources with knowledge of the matter said, affecting around 13% of the Wall Street bank's Asia investment banking workforce of 400.  Layoffs at the investment banking business unit of HSBC, which makes the bulk of its revenues and profits in Asia, started on Tuesday and is expected to see the departure of around 30 dealmakers in the region this week, three separate sources said."}, {"date": "20240416220900", "headline": "Morgan Stanley: A Balanced View on Performance and Market Positioning Warrants Hold Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416232600", "headline": "Morgan Stanley (MS) Receives a Hold from RBC Capital", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416234636", "headline": "UPDATE 2-Morgan Stanley cuts dozens of investment banking jobs in Asia-Pacific, sources say", "summary": "Morgan Stanley is cutting at least 50 investment banking jobs in Asia Pacific, three sources said, becoming the latest among global banks to scale back operations in the region mainly due to a slump in China markets.  The layoffs affect around 13% of the Wall Street bank's Asia investment banking workforce of 400 in the region, according to one of the sources.  Bankers based in Hong Kong and mainland China are going to be affected the most, they said."}, {"date": "20240416235900", "headline": "Morgan Stanley To Slash Jobs In Asia-Pacific Region: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417004041", "headline": "Morgan Stanley Is Planning Biggest China Job Cuts in Years", "summary": "(Bloomberg) -- Morgan Stanley plans to start cutting about 50 investment-banking jobs in the Asia-Pacific region this week, with at least 80% of the reductions in Hong Kong and China, people familiar with the matter said.Most Read from BloombergDubai Grinds to Standstill as Cloud Seeding Worsens FloodingChina Tells Iran Cooperation Will Last After Attack on IsraelWhat If Fed Rate Hikes Are Actually Sparking US Economic Boom?Powell Signals Rate-Cut Delay After Run of Inflation SurprisesRed Lobste"}, {"date": "20240417004500", "headline": "Morgan Stanley price target raised by $4 at Oppenheimer, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417004600", "headline": "Morgan Stanley (MS) Receives a Rating Update from a Top Analyst", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417011900", "headline": "Morgan Stanley and HSBC Cut Asia-Pacific Jobs Amid Slowing Deals.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417013000", "headline": "Wall Street Banks Goldman and Morgan Stanley Prosper as Tables Turn", "summary": "Welcome news for investment bankers at firms like  Morgan Stanley  and  Goldman Sachs  then, that they look poised to win again after a muted period of stock market debuts and issuance.  Look no further than first-quarter earnings the four largest U.S. banks—  JPMorgan Bank of America Citi  and  Wells Fargo  —and the two most prominent investment banks—  Goldman Sachs  and  Morgan Stanley  —have reported in the past week."}, {"date": "20240417015300", "headline": "Jim Cramer Says He Likes Earnings From These Big Banks 'So Much' — Here's Why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417015600", "headline": "Jefferies Sticks to Its Buy Rating for Morgan Stanley (MS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417020059", "headline": "Wall Street says a Wall Street revival is finally here", "summary": "Big bank bosses are not hiding their enthusiasm about Wall Street as first-quarter jumps in investment banking spur new hopes for a sustained dealmaking revival."}, {"date": "20240417021237", "headline": "WRAPUP 1-Morgan Stanley, HSBC cutting dozens of Asia investment banking jobs as deals slump", "summary": "Morgan Stanley and HSBC are cutting dozens of investment banking jobs in the Asia Pacific this week, sources with knowledge of the matter said, as weaker deal activities and sluggish markets in China and Hong Kong weigh on their business prospects.  Morgan Stanley is cutting at least 50 investment banking jobs in the region starting this week, three sources with knowledge of the matter said, affecting around 13% of the Wall Street bank's Asia investment banking workforce of 400."}, {"date": "20240417030100", "headline": "Morgan Stanley, HSBC said to cut Asia investment-banking jobs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417034100", "headline": "Analysts Offer Insights on Financial Companies: Barclays (BCS), Prudential (PUK) and Morgan Stanley (MS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417044500", "headline": "Morgan Stanley reportedly planning four-part bond deal a day after blowout earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417051800", "headline": "Wall Street Bank Chiefs Anticipate IPO Market Revival Following Recent Successful Listings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417054223", "headline": "WRAPUP 3-Morgan Stanley, HSBC cutting Asia investment banking jobs on China deals slowdown", "summary": "Morgan Stanley and HSBC are cutting dozens of investment banking jobs in the Asia Pacific region this week, sources said, as they ramp up cost-cutting, with weaker dealmaking and sluggish markets in China and Hong Kong weighing on business prospects.  Morgan Stanley is cutting at least 50 investment banking jobs in the region starting this week, three sources with knowledge of the matter said, affecting around 13% of the Wall Street bank's Asia investment banking workforce of 400."}, {"date": "20240417055100", "headline": "Analysts Offer Insights on Financial Companies: Morgan Stanley (MS) and Travelers Companies (TRV)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417061150", "headline": "Morgan Stanley (NYSE:MS) Q1 2024 Earnings Call Transcript", "summary": "Morgan Stanley (NYSE:MS) Q1 2024 Earnings Call Transcript April 16, 2024 Morgan Stanley isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning. Welcome to Morgan Stanley’s First Quarter 2024 Earnings Call. On behalf of Morgan Stanley, I will begin […]"}, {"date": "20240417062600", "headline": "KBW Remains a Hold on Morgan Stanley (MS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417065000", "headline": "A Big Takeaway From Bank Earnings? Wall Street Is Winning Again.", "summary": "Banks heavily exposed to Main Street have reaped higher rates’ rewards. Those fortunes are shifting while dealmaking picks up."}, {"date": "20240417065900", "headline": "Morgan Stanley, HSBC laying off APAC investment bank staff, Reuters says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417075600", "headline": "Morgan Stanley (MS) Q1 Earnings Top on Revival of IB Business", "summary": "Morgan Stanley (MS) beat Q1 earnings estimates as IB business posts a comeback driven by solid underwriting business performance, with advisory fees still subdued. This supports the company's fee income."}, {"date": "20240417080600", "headline": "IN BRIEF: MFE-MediaForEurope sees net profit grow, advertising improve", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417131304", "headline": "Morgan Stanley Sells $8 Billion in Big Banks’ Bond Bonanza", "summary": "(Bloomberg) -- Morgan Stanley sold $8 billion of bonds Wednesday, following its release of higher-than-expected quarterly revenue, as it joined rivals JPMorgan Chase & Co. and Wells Fargo & Co. in tapping the US investment-grade market this week.Most Read from BloombergDubai Grinds to Standstill as Cloud Seeding Worsens FloodingTesla Asks Investors to Approve Musk’s $56 Billion Pay AgainRed Lobster Considers Bankruptcy to Deal With Leases and Labor CostsBankers Hit With Millions in Breakup Fees"}, {"date": "20240417143353", "headline": "Bank of America CEO: The Federal Reserve is winning the war on inflation", "summary": "Bank of America CEO Brian Moynihan weighs in on the fight against inflation and another solid quarter of consumer spending."}, {"date": "20240417201800", "headline": "Impact of Federal Reserve's Interest Rate Strategy on Global Markets Featuring Brazil's ...", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417230600", "headline": "Why Microsoft Stock Is Still a No-Brainer AI and Tech Stock to Buy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418001700", "headline": "Morgan Stanley: Strong Q1 Earnings and Robust Growth Prospects Fuel Bullish Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418012200", "headline": "Morgan Stanley price target raised by $3 at BMO Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418020300", "headline": "IN THE KNOW: Danone on track after Water arm drives first quarter beat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418020500", "headline": "MediaForEurope 2023 performance hit by ProSieben stake as profit dips", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418022700", "headline": "Morgan Stanley (MS) Receives a Hold from Seaport Global", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418023500", "headline": "CEO Uncertainty Spikes After Improving Last Quarter", "summary": "Banks kicked off Q1 earnings season with mixed results, proving that sizeable economic headwinds still persist. Read what investors need to know."}, {"date": "20240418032800", "headline": "Want to Double Your Tax Refund in 2024? 7 Stocks to Buy Now.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418043500", "headline": "The Latest AI Hype Stock is eBay? Morgan Stanley Upgrades Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418043700", "headline": "The Latest AI Hype Stock Is eBay, Morgan Stanley Upgrades Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418054902", "headline": "Results: Morgan Stanley Exceeded Expectations And The Consensus Has Updated Its Estimates", "summary": "Morgan Stanley ( NYSE:MS ) just released its latest first-quarter results and things are looking bullish. It was..."}, {"date": "20240418063247", "headline": "Morgan Stanley: Outstanding Earnings And Positioned To Win From Improving Outlook", "summary": "Morgan Stanley's asset management fees and equity underwritings were the main drivers of revenue growth. Check out whyÂ aÂ buyÂ rating is justified for MS stock."}, {"date": "20240418095034", "headline": "Goldman Markets New Bonds After Perpetual Notes Deal This Week", "summary": "(Bloomberg) -- Goldman Sachs Group Inc. is marketing investment-grade bonds, just two days after issuing perpetual notes, as the bank taps investors following its surprisingly strong first-quarter results.Most Read from BloombergDubai Grinds to Standstill as Flooding Hits CityElon Wants His Money BackSingapore Loses ‘World’s Best Airport’ Crown to QatarRecord Rainfall in Dubai? Blame Climate Change, Not Cloud SeedingRed Lobster Considers Bankruptcy to Deal With Leases and Labor CostsThe bank on"}, {"date": "20240418140500", "headline": "Morgan Stanley Wealth Management Pulse Survey Reveals Bullish Sentiment Despite Drop in Optimism", "summary": "NEW YORK, April 18, 2024--Morgan Stanley Wealth Management today announced results from its quarterly individual investor pulse survey:"}, {"date": "20240418143110", "headline": "Morgan Stanley rates TCL as Equal-weight", "summary": "Morgan Stanley expects a muted reaction by the market to Transurban Group's March quarter traffic update and looks forwards to the Investor Day on May 6 for additional company information.The..."}, {"date": "20240418143110", "headline": "Morgan Stanley rates BHP as Equal-weight", "summary": "Morgan Stanley assesses a weak 3Q operationally for BHP Group. Management lowered met coal production guidance by -8%, while cost guidance increased by 8% to US$122/t due to higher rainfall and..."}, {"date": "20240418190800", "headline": "Decoding Morgan Stanley's Options Activity: What's the Big Picture?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418191500", "headline": "Big banks have been a bright spot in tough week for markets", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418201900", "headline": "Regulators said to revive bid to rein in Wall Street bonus payouts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418202500", "headline": "At least 70% of the S&P 500 names that reported results this week topped estimates - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418235800", "headline": "Morgan Stanley price target raised by $2 at HSBC, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419000200", "headline": "Put $5,000 in These 3 Growth Stocks by 2025", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419020000", "headline": "Morgan Stanley Preferred A: Too Much Rate Cut Risk (Rating Downgrade)", "summary": "Morgan Stanley's preferred stock, the PFD A 1/1000, has a floating coupon with a floor rate to prevent it from floating to zero. Read why MS.PR.A stock is a Hold."}, {"date": "20240419032100", "headline": "15 out of 20 S&P 500 financial stocks deliver EPS wins, rebound in investment banking aids major U.S. banks - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419042800", "headline": "Deutsche Bank said to have culled dozens of private banking roles in Asia", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419085525", "headline": "Morgan Stanley consumer IPO banker Passi leaving the bank, sources say", "summary": "Morgan Stanley's North America head of consumer and retail equity capital markets (ECM) Tilli Dias Passi will leave the bank, according to people familiar with the matter.  Passi is taking an indefinite break and is not immediately joining a rival bank, the sources said, requesting anonymity as the matter is confidential.  New York-based Passi has been with Morgan Stanley for 18 years, according to her LinkedIn profile."}, {"date": "20240420020310", "headline": "IGA: This 12% Yielding Global Equity CEF Now Pays Monthly", "summary": "Read about the recent market correction as S&P 500 falls below 5000, Voya funds' distribution changes, and the attractive 12% annual yield of IGA fund. Explore more here."}, {"date": "20240420023107", "headline": "ROSEN, SKILLED INVESTOR COUNSEL, Encourages Morgan Stanley Investors to Inquire About Securities Class Action Investigation - MS", "summary": "NEW YORK, April 20, 2024 /PRNewswire/ -- WHY: Rosen Law Firm, a global investor..."}, {"date": "20240420035305", "headline": "Dividend Champion, Contender, And Challenger Highlights: Week Of April 21", "summary": "Stay informed about the latest dividend activity with this weekly summary, including updates on dividend changes, ex-dividend dates, and pay dates of top..."}, {"date": "20240420232000", "headline": "Tracking Last Week's Top Performers: Are These 7 Large-Cap Stocks In Your Portfolio?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421213948", "headline": "Souring China dreams force Western financial firms to cut costs", "summary": "Just a few years ago,lucrative business prospects in China on the back of a boomingeconomy led to a scramble among Western financial firms, frominvestment banking to asset management, to expand..."}, {"date": "20240421225738", "headline": "Permira initiates sale of its 50% stake in Taiwan's Grobest, sources say", "summary": "Europeaninvestment company Permira has begun the process for the sale ofits 50% stake in Asian aquatic food provider Grobest, targetinga valuation of about $1 billion for the Taiwan-based..."}, {"date": "20240422000100", "headline": "Beyond Market Price: Uncovering Morgan Stanley's Intrinsic Value", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422010028", "headline": "Travel firm Viking Holdings aims for up to $10.8 bln valuation in US IPO", "summary": "Travel firm Viking Holdings said onMonday it is seeking a valuation of up to $10.8 billion in itsinitial public offering in the United States, as it joins a slewof companies looking to take..."}, {"date": "20240422020000", "headline": "S&P 500 Tanks, Earnings Soar: 2 Buy-The-Dip Dividend Growth Stocks", "summary": "S&P 500 experienced a chaotic week, eroding progress made in January 2022. Check out the two top stock picks for the rest of the year."}, {"date": "20240422021500", "headline": "Why Morgan Stanley is a Top 25 Dividend Giant (MS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422023901", "headline": "Buyout Firm CVC Sets Price Range for €1.6 Billion Dutch IPO", "summary": "(Bloomberg) -- CVC Capital Partners and some of its investors are seeking to raise €1.6 billion ($1.7 billion) in an initial public offering in Amsterdam, as the buyout firm moves ahead with its long-delayed listing plans.Most Read from BloombergTrump Has Only $6.8 Million for Legal Fees With Trial UnderwayTikTok to Remove Executive Tasked With Fending Off US ClaimsChina Is Front and Center of Gold’s Record-Breaking RallyTesla Spends Weekend Cutting Prices of Cars and FSD SoftwareThe Fed’s Forec"}, {"date": "20240422050900", "headline": "Here's How Much $100 Invested In Morgan Stanley 10 Years Ago Would Be Worth Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422085748", "headline": "Forget Big Tech Earnings, Buy Income Instead", "summary": "Big tech earnings are approaching, but I'm not betting on them. Click here for the 2 high income stocks and one asset category that offers high yield."}, {"date": "20240422094507", "headline": "Are You Looking for a High-Growth Dividend Stock?", "summary": "Dividends are one of the best benefits to being a shareholder, but finding a great dividend stock is no easy task. Does Morgan Stanley (MS) have what it takes? Let's find out."}, {"date": "20240422143110", "headline": "Morgan Stanley rates BOE as Equal-weight", "summary": "Morgan Stanley highlights the importance of first production at Boss Energy's Honeymoon mine , but will wait to see whether higher grade concentrate than feasibilty study estimates can be..."}, {"date": "20240422150300", "headline": "Resilient Waters Fund Wins the 2024 Kellogg-Morgan Stanley Sustainable Investing Challenge", "summary": "NEW YORK, April 22, 2024--The Morgan Stanley Institute for Sustainable Investing and Kellogg School of Management at Northwestern University today announced that the Resilient Waters Fund team was named the winner of the 14th annual Kellogg-Morgan Stanley Sustainable Investing Challenge. The global competition inspires graduate students to address critical social and environmental issues through innovative financial vehicles. The winning team was one of 12 finalists selected from a competitive f"}, {"date": "20240422185500", "headline": "The Magnificent 7 Get Set To Report Amidst An S&P 500 Losing Streak", "summary": "Markets continue their downward momentum despite a positive start to the Q1 earnings season"}, {"date": "20240422192500", "headline": "Morgan Stanley on track to post 7th straight session of gain after strong results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422202400", "headline": "5 Investors Betting Big on Spotify (SPOT) Stock", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422225400", "headline": "UBS Group Eyeing West? Plans New Office In Menlo Park, Hires Barclay's Lynch, Silicon Valley Expansion In Sight: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423052100", "headline": "Smart Money Is Betting Big In Morgan Stanley Options", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423080000", "headline": "Graystone Consulting Named a Quality Leader for Third Straight Year by Coalition Greenwich", "summary": "NEW YORK, April 23, 2024--Graystone Consulting, a business of Morgan Stanley (NYSE: MS), announced today that it was named by Coalition Greenwich, a leading global provider of strategic benchmarking, analytics, and insights to the financial services industry, as one of three consulting firms to receive the 2023 Greenwich Quality Leader* designation in Overall U.S. Investment Consulting among large consultants. This is Graystone’s third consecutive year as a recipient of this distinction."}, {"date": "20240423143111", "headline": "Morgan Stanley rates BXB as Equal-weight", "summary": "Brambles has continued to navigate a challenging operating environment well, suggests Morgan Stanley, with price realisation the key driver of top line growth in the 3Q. All FY24 guidance was..."}, {"date": "20240423150407", "headline": "Morgan Stanley : Supplement - C-030021", "summary": "Supplement - C-030021 Supplement - C-030021 Below you will find information from the register notified prospectuses. The information has been provided..."}, {"date": "20240423195400", "headline": "Which Companies Will Join the Trillion-Dollar Team in 2024? Our 3 Best Guesses", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424024600", "headline": "EARNINGS PREVIEW: Little \"new news\" expected from Sainsbury's", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424080000", "headline": "Morgan Stanley Names 10 Women and an Ally as their MAKERS Class of 2024", "summary": "NEW YORK, April 24, 2024--Morgan Stanley Wealth Management today named 11 outstanding professionals as part of its partnership with MAKERS – an initiative dedicated to celebrating the stories of leaders who are drivers and champions of women’s achievements."}, {"date": "20240424101916", "headline": "Goldman's David Solomon defeats vote on CEO-chair split even as support for it increases", "summary": "David Solomon defeated a proposal seeking to separate his roles as CEO and chairman of Goldman Sachs, but the measure received double the support it did in 2023."}, {"date": "20240424153458", "headline": "Morgan Stanley Asia private equity unit to reorganize as CEO retires", "summary": "Morgan StanleyPrivate Equity Asia is reorganizing its teams in theregion as its current chief executive of Asia Chin Chou isretiring, according to an internal memo reviewed by Reuters. ..."}, {"date": "20240424155716", "headline": "GlobalData reveals top M&A financial and legal advisers in financial services sector during Q1 2024", "summary": "Morgan Stanley and Piper Sandler top M&A financial advisers in financial services sector in the first quarter"}, {"date": "20240424184437", "headline": "Morgan Stanley PE Asia to reorganise regional teams as CEO steps down", "summary": "Morgan Stanley Private Equity Asia is reorganising its teams in the region as its current chief executive of Asia Chin Chou is leaving the firm, according to an internal memo seen by Reuters.  Morgan Stanley will carve out a China-focused team from the rest of the region that focuses on investments in onshore and offshore China, according to the memo."}, {"date": "20240424190115", "headline": "Morgan Stanley Asia private equity unit to reorganise as CEO retires", "summary": "HONG KONG (Reuters) -Morgan Stanley Private Equity Asia (PEA) is reorganising its teams in the region as its current chief executive of Asia Chin Chou is retiring, according to an internal memo reviewed by Reuters.  Morgan Stanley will carve out a China-focused team from the rest of the region that focuses on investments in onshore and offshore China, according to the memo.  The firm has appointed Jun Xu, who is currently head of its yuan-denominated investment funds, to lead all private equity investing in China, the memo said."}, {"date": "20240424193458", "headline": "UPDATE 2-Morgan Stanley Asia private equity unit to reorganise as CEO retires", "summary": "Morgan Stanley Private Equity Asia (PEA) is reorganising its teams in the region as its current chief executive of Asia Chin Chou is retiring, according to an internal memo reviewed by Reuters.  Morgan Stanley will carve out a China-focused team from the rest of the region that focuses on investments in onshore and offshore China, according to the memo."}, {"date": "20240424201200", "headline": "Crude Awakening: 3 Energy Plays Set to Strike Liquid Gold for Investors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424214000", "headline": "Morgan Stanley stock underperforms Thursday when compared to competitors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424231700", "headline": "Wall Street Winners: The 3 Biggest Analyst Upgrades From Last Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424235200", "headline": "What do weight loss drugs mean for a diet industry built on eating less and exercising more?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425021000", "headline": "March's Dividend Portfolio Update Sets New All-Time Record - 100 Holdings, 21 Buys", "summary": "Portfolio changes in March focus on BDCs, aiming to increase dividend income by at least $100 each month. Click here for a detailed analysis."}, {"date": "20240425022800", "headline": "Morgan Stanley Considers Broader Bitcoin ETF Sales Through Broker Network", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425180500", "headline": "Rooting for Trump to fail has made his stock shorters millions", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425220400", "headline": "The Thrill Factor Is Back for Retail Investors", "summary": "Trading activity Charles Schwab, Morgan Stanley and Robinhood reaches the highest levels since early 2022."}, {"date": "20240426010700", "headline": "Dividend Roundup: MetLife, General Motors, Pfizer, Citigroup, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426020129", "headline": "Stephan Micklos Receives Global Sports and Entertainment Director Designation", "summary": "Morgan Stanley announced today that Stephan Micklos, a Financial Advisor, Senior Vice President, in the Firm’s Wealth Management office in Holladay, Utah has been named a Global Sports and..."}, {"date": "20240426023145", "headline": "Goldman, Morgan Stanley Prep €1 Billion for CVC’s Multiversity", "summary": "(Bloomberg) -- Banks including Morgan Stanley and Goldman Sachs Group Inc. are lining up nearly €1 billion ($1.1 billion) of debt financing that will allow buyout shop CVC Capital Partners to hold on to Multiversity, one of its university investments, according to people familiar with the matter.Most Read from BloombergJavier Milei Fuels Wild Rally That Makes Peso No. 1 in WorldUS Economy Slows and Inflation Jumps, Damping Soft-Landing HopesPlunging Home Prices, Fleeing Companies: Austin’s Glow"}, {"date": "20240426030100", "headline": "Goldman, Morgan Stanley picked for Solera IPO, Bloomberg reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426050400", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426051100", "headline": "Morgan Stanley Is Doubling Down on Nvidia (NVDA) Stock", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426060600", "headline": "How Is The Market Feeling About Morgan Stanley?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426063541", "headline": "Morgan Stanley : Finance II Limited – Annual Report - 31 December 2023", "summary": "DocuSign Envelope ID: 5E31A31C-A718-4563-8764-F3E1DD7B2ED0 Registered number: 35857 Registered office: 47 Esplanade..."}, {"date": "20240426063900", "headline": "10 Financials Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427231700", "headline": "Opening Day: Rubrik jumps 20% in market debut", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428064500", "headline": "U.S. CFOs’ top priority is cost-cutting amid economic uncertainty, survey finds", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428073506", "headline": "ROSEN, GLOBAL INVESTOR COUNSEL, Encourages Morgan Stanley Investors to Inquire About Securities Class Action Investigation - MS", "summary": "WHY: Rosen Law Firm, a global investor rights law firm, continues to investigate potential securities claims on behalf of shareholders of Morgan Stanley resulting from allegations that Morgan Stanley..."}, {"date": "20240428171406", "headline": "Top 12 Alternatives to Edward Jones", "summary": "In this article, we will take a look at the top 12 alternatives to Edward Jones. If you want to skip our detailed analysis, you can go directly to Top 5 Alternatives to Edward Jones. Why are People Choosing Edward Jones Edward Jones is a broker-dealer and investment advisor. Edward Jones focuses on serving individual […]"}, {"date": "20240428212200", "headline": "Scotiabank names Travis Machen to head Global Banking and Markets", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429035222", "headline": "Japan Opts to Keep Traders in Dark on Whether It Intervened", "summary": "(Bloomberg) -- Japan’s top currency official opted to keep market players in the dark over whether Tokyo had intervened in the currency market Monday following a sharp move in the market that sliced 2% off the dollar-yen exchange rate.Most Read from BloombergMusk Leaves China With Tesla Driving Software Hurdles ClearedMusk Makes Surprise China Visit in Search of Tesla Revenue BoostElliott Built ‘Large’ Stake in Buffett-Favored Sumitomo, Source SaysYen Watchers Ask When Japan Will Step In as Slid"}, {"date": "20240429045648", "headline": "Morgan Stanley shareholders urged to vote against pay proposal by proxy adviser", "summary": "Morgan Stanley shareholders should vote against its proposal for executive pay at the bank's annual meeting on May 23, according to a recommendation by influential proxy adviser Glass Lewis. ..."}, {"date": "20240429050214", "headline": "Morgan Stanley's Dividend Analysis", "summary": "Morgan Stanley (NYSE:MS) recently announced a dividend of $0.85 per share, payable on 2024-05-15, with the ex-dividend date set for 2024-04-29.  As investors look forward to this upcoming payment, the spotlight also shines on the company's dividend history, yield, and growth rates.  Using the data from GuruFocus, let's look into Morgan Stanley's dividend performance and assess its sustainability."}, {"date": "20240429074509", "headline": "Wolf Haldenstein Adler Freeman & Herz LLP announces that it is investigating Morgan Stanley for potential violations of federal securities laws", "summary": "NEW YORK , April 29, 2024 /PRNewswire/ -- Wolf Haldenstein Adler Freeman & Herz LLP , a preeminent national shareholder rights litigation firm, announces that it is investigating claims on behalf..."}, {"date": "20240429105832", "headline": "Scotiabank names former Morgan Stanley exec as head of global banking, markets unit", "summary": "Canada's Scotiabank on Monday appointed banking veteran Travis Machen as the CEO and Group head of its global banking and markets unit, starting May 6. Machen, who will be based in..."}, {"date": "20240429152536", "headline": "Carlyle Picks JPMorgan, Morgan Stanley for IPO or Sale of StandardAero", "summary": "(Bloomberg) -- Carlyle Group Inc. is working with JPMorgan Chase & Co. and Morgan Stanley on options for aircraft maintenance services provider StandardAero, according to people familiar with the matter.Most Read from BloombergTesla Soars on Tentative China Approval for Driving SystemStocks Trade for 390 Minutes a Day. Increasingly, Only 10 MatterYen Sparks Intervention Suspicion After U-Turn From 1990 LowsWhat 60,000 Headlines Say About the Fed’s Next MoveUS Warns ICC Action on Israel Would Hur"}, {"date": "20240429201629", "headline": "Supreme Court Resolves Circuit Split And Holds 'Pure Omissions' Outside Reach Of Section 10(b) Liability", "summary": "On April 12, a unanimous Supreme Court held in Macquarie Infrastructure Corp. v. Moab Partners, L.P. that material omissions are actionable under Section 10 of the Exchange Act and its enabling SEC..."}, {"date": "20240429213300", "headline": "Upward Pressure on Interest Rates as the U.S. Makes Plans to Borrow More Money", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429213700", "headline": "U.S. Plans to Borrow More Money May Drive Interest Rates Up", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429213900", "headline": "U.S. Plans to Borrow Even More Money…", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429223500", "headline": "Here's How Much You Would Have Made Owning Morgan Stanley Stock In The Last 10 Years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430043002", "headline": "Citi and Morgan Stanley among leaders of open-source initiative to tackle ‘common challenges’ in AI", "summary": "The initiative aims to build a framework for generative AI use in financial services."}, {"date": "20240430065342", "headline": "Morgan Stanley’s $20M bonuses draw proxy adviser’s fire", "summary": "Glass Lewis recommended shareholders reject a pay package that gave one-time $20 million awards to the bank's newly minted CEO and his two fellow candidates to succeed James Gorman."}, {"date": "20240430143119", "headline": "Morgan Stanley rates AMC as Equal-weight", "summary": "Morgan Stanley, upon first assessment, spotted a solid result with improved margins from Amcor today, despite further top-line declines.The company's expectation of abating de-stocking and a..."}, {"date": "20240430143119", "headline": "Morgan Stanley rates BPT as Equal-weight", "summary": "Morgan Stanley's update suggests investors might have to wait until Waitsia starts producing in early 2025 to see Beach Energy shares perform better.In the short term, the broker suspects there's..."}, {"date": "20240430143120", "headline": "Morgan Stanley rates ALD as Equal-weight", "summary": "Judging from Morgan Stanley's commentary, Ampol's market update disappointed through a lower-than-anticipated Lytton Refiner Margin. The broker's indication is a miss in the order of -8%.Not helping..."}, {"date": "20240430163109", "headline": "Morgan Stanley rates SFR as Equal-weight", "summary": ". If SFR meets the ..."}, {"date": "20240430235600", "headline": "Stock Market Crash Alert: 3 Must-Buy Financial Stocks When Prices Plunge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501020123", "headline": "Whether Wall Street garden leaves survive non-compete ban is an 'open question'", "summary": "Some 'garden leave' agreements that Wall Street uses to protect secrets are expected to survive the FTC's new non-compete ban, but some probably won't."}, {"date": "20240501052700", "headline": "Federal Reserve moving forward with bank capital rules, Bloomberg says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501064500", "headline": "U.S. banking regulators push to rework Basel III endgame rule - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501065506", "headline": "ROSEN, A HIGHLY RECOGNIZED LAW FIRM, Encourages Morgan Stanley Investors to Inquire About Securities Class Action Investigation - MS", "summary": "WHY: Rosen Law Firm, a global investor rights law firm, continues to investigate potential securities claims on behalf of shareholders of Morgan Stanley resulting from allegations that Morgan Stanley..."}, {"date": "20240501143110", "headline": "Morgan Stanley rates MGR as Equal-weight", "summary": "Morgan Stanley believes there's reason for caution post Mirvac Group releasing its March quarter update, reaffirming FY24 guidance with the explicit mentioning that guidance is subject to..."}, {"date": "20240501210900", "headline": "Stock market today: Wall Street climbs to trim its loss for the week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502020016", "headline": "Whether Wall Street garden leaves survive noncompete ban is an 'open question'", "summary": "Some 'garden leave' agreements that Wall Street uses to protect secrets are expected to survive the FTC's new noncompete ban, but some probably won't."}, {"date": "20240502025300", "headline": "See Which Of The Latest 13F Filers Holds Morgan Stanley", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502143109", "headline": "Morgan Stanley rates BAP as Equal-weight", "summary": "Morgan Stanley remains Equal-weight on Bapcor noting intrinsic value is greater than the current share price and the broker's new target of $4.00, down from $5.75. Industry view is In-Line.The lower..."}, {"date": "20240503021259", "headline": "Mike Ashley seals peace deal with Morgan Stanley over ‘snobbery’ claims", "summary": "The Frasers billionaire Mike Ashley has ended his legal attack on Morgan Stanley over claims “snobbery” was behind a $1bn cash demand that threatened to destabilise his empire."}, {"date": "20240503042600", "headline": "June 14th Options Now Available For Morgan Stanley (MS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503044937", "headline": "Morgan Stanley, Frasers settle UK lawsuit over $1 bln margin call", "summary": "British retail tycoon Mike Ashley's Frasers Group has withdrawn its London lawsuit against Morgan Stanley over a nearly $1 billion margin call, a spokesperson for the Wall Street bank said on Friday.  Frasers had sued Morgan Stanley for about 47 million euros ($50.5 million) after the bank imposed the margin call – security to cover possible losses – on the retailer's trading position in German fashion group Hugo Boss in May 2021.  Ashley, whose fortune is estimated by Forbes to be worth $5.1 billion, gave evidence at the trial at London's High Court in February that the demand for collateral left him in \"total shock\"."}, {"date": "20240503064500", "headline": "From Speculation To Revelation: JPMorgan Reportedly Unveils IndexGPT AI Tool", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503074005", "headline": "This Top Finance Stock is a #1 (Strong Buy): Why It Should Be on Your Radar", "summary": "Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Rank."}]}