{"news": [{"date": "20230802190753", "headline": "MUFG to Buy $936 Million Stake in U.S. Bancorp After Unit Sale", "summary": "(Bloomberg) -- Mitsubishi UFJ Financial Group Inc. will buy a stake in U.S. Bancorp for $936 million, deepening an alliance after selling its regional banking business to the US lender last year. Most Read from BloombergFitch’s US Credit Downgrade Sparks Criticism Along With UneaseMissing Goldman Sachs Analyst Confirmed Dead by New York PoliceS&P 500 Has Worst Day Since April After Big Rally: Markets WrapCanada PM Justin Trudeau Splits With Wife Sophie GregoireHere Are the 78 Charges Trump Now F"}, {"date": "20230803040800", "headline": "U.S. Bancorp (USB) Strengthens Strategic Ties With MUFG", "summary": "U.S. Bancorp's (USB) initiative to further bolster its strategic alliance with Mitsubishi UFJ (MUFG) will boost capital and unlock growth opportunities."}, {"date": "20230813222900", "headline": "MUFG Bank, Ltd. announces Risk-Adjusted Capital Ratio Based on the Basel 3 Standards for the First Quarter Ended June 30, 2023", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20230814060700", "headline": "Mitsubishi UFJ Financial reports Q1 results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20230815072000", "headline": "Morgan Stanley's (MS) Inorganic Expansion Aids Amid High Costs", "summary": "Morgan Stanley's (MS) strategic expansion efforts to focus less on capital markets-driven revenue sources will support profitability. However, rising expenses remain worrisome."}, {"date": "20230816125400", "headline": "U.S. Stocks Turn Lower in Afternoon Trading", "summary": "Stocks dipped after minutes from the most recent Federal Reserve policy meeting showed central bankers are worried about a possible inflation resurgence."}, {"date": "20230816191903", "headline": "Japan Exports Shrink First Time in More Than Two Years", "summary": "(Bloomberg) -- Japan’s exports dropped for the first time in more than two years as patchy overseas demand weakened, signaling headwinds for an economic recovery that has relied increasingly on external markets as domestic spending sputters.Most Read from BloombergFed Saw ‘Significant’ Inflation Risk That May Merit More HikesGoldman CEO’s Most Loyal Deputy Is Tested by Mutinous PartnersStocks, Bonds Fall as Rate Hikes Left on the Table: Markets WrapChina Shadow Bank Misses Dozens of Payments as"}, {"date": "20230819223400", "headline": "As Rates Rise, Japan Is Wary About Silicon Valley Bank Sequel", "summary": "Unrealized losses on bonds could hit regional Japanese banks, though they are less worried about depositor flight."}, {"date": "20230821103300", "headline": "Citigroup (C) Mulls Corporate Overhaul, to Split ICG Division", "summary": "In a major corporate business restructuring, Citigroup (C) considers breaking up its ICG division into three separate segments."}, {"date": "20230822091800", "headline": "Goldman (GS) Considers Selling PFM, To Focus on Ultra-Rich", "summary": "Goldman (GS) is considering the sale of PFM, part of its wealth management business, to focus on its ultra-high-net-worth clients. It plans to scale back its ambitions to serve mass consumers."}, {"date": "20230823051400", "headline": "Goldman (GS) Considers Selling PFM, Will Focus on Ultra-Rich (Revised)", "summary": "Goldman (GS) is considering the sale of PFM, a part of its wealth management business, to focus on its ultra-high-net-worth clients. It plans to scale back its ambitions to serve the mass consumers."}, {"date": "20230830092500", "headline": "JPMorgan (JPM) to Increase Stake in Brazil's C6 Bank to 46%", "summary": "With an aim to further expand its presence in the lucrative Brazil market, JPMorgan (JPM) intends to raise its stake in C6 Bank to 46%, subject to regulatory approvals."}, {"date": "20230830201519", "headline": "Japan’s Output Drop Misses Consensus as China Woes Reverberate", "summary": "(Bloomberg) -- Japan’s industrial production fell more than expected in July as slowing economic activity in China continues to cloud growth prospects for the global economy.Most Read from BloombergUS Health Officials Urge Moving Pot to Lower-Risk CategoryStocks Up Again in ‘Bad News Is Good News’ World: Markets WrapSingapore S$1 Billion Laundering Scandal Embroils Its Banking GiantsFed Ramps Up Demands for Corrective Actions by Regional BanksApple Tests Using 3D Printers to Make Devices in Majo"}, {"date": "20230831024955", "headline": "MUFG Brokerage JV Sued in Japan Over Credit Suisse AT1 Sales", "summary": "(Bloomberg) -- Japanese investors sued Mitsubishi UFJ Financial Group Inc.’s joint venture brokerage with Morgan Stanley, showing that the fallout from losses on Credit Suisse’s riskiest debt continue to reverberate around the world. Most Read from BloombergUS Health Officials Urge Moving Pot to Lower-Risk CategoryUBS Smashes Banking Record as It Absorbs Credit SuisseHong Kong to Shut Down City Before Super Typhoon Saola HitsSingapore S$1 Billion Laundering Scandal Embroils Its Banking GiantsSto"}, {"date": "20230901075900", "headline": "Mitsubishi's (MUFG) Brokerage JV Faces Lawsuit Over Bond Sale", "summary": "Mitsubishi's (MUFG) brokerage joint venture, Mitsubishi UFJ Morgan Stanley Securities, faces a lawsuit by investors in Japan over the sale of AT1 bonds issued by Credit Suisse."}, {"date": "20230904044900", "headline": "How Is The Market Feeling About Mitsubishi UFJ Finl Gr?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20230905024700", "headline": "A Look Into Mitsubishi UFJ Finl Gr Inc's Price Over Earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20230905125800", "headline": "Top Research Reports for Berkshire Hathaway, Adobe & Alibaba", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Berkshire Hathaway Inc. (BRK.B), Adobe Inc. (ADBE) and Alibaba Group Holding Limited (BABA)."}, {"date": "20230906055400", "headline": "The Zacks Analyst Blog Highlights Berkshire Hathaway, Adobe, Alibaba Group Holding, Blackstone and Mitsubishi UFJ Financial Group", "summary": "Berkshire Hathaway, Adobe, Alibaba Group Holding, Blackstone and Mitsubishi UFJ Financial Group are part of the Zacks top Analyst Blog."}, {"date": "20230907035500", "headline": "5 Value Stocks In The Financial Services Sector", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20230907110600", "headline": "MHFG to Join Mitsubishi's (MUFG) Stablecoin Issuance Platform", "summary": "Mitsubishi's (MUFG) stablecoin issuance platform, that still remains under development, will be joined by MHFG. The platform is expected to be established in early 2024."}, {"date": "20230907230600", "headline": "September Rally? 3 Stocks to Buy Before Liftoff", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20230910223700", "headline": "Tesla, Crinetics Pharmaceuticals And Other Big Stocks Moving Higher In Monday's Pre-Market Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20230913030000", "headline": "Japan’s MUFG Battles Private Equity, Startups to Hire US Bankers", "summary": "(Bloomberg) -- Hiring for bankers in the US is getting harder for Japan’s largest lender, according to a top executive who sees more competition to recruit top talent from a wider slate of companies. Most Read from BloombergChina Sows Fresh Confusion About Apple With Security RemarksCiti Plans Job Cuts as It Revamps Top Management StructureLuxury Cruise Ship Full of Australians Stuck in Greenland ArcticiPhone Pro’s Titanium Finish Stands Out in First Look at DeviceApple’s iPhone 15 Debut Include"}, {"date": "20230913030643", "headline": "US factory booms strengthen MUFG's dominance in project finance - senior exec", "summary": "A U.S. factory construction boom driven by tax credits in the Inflation Reduction Act (IRA) is helping Mitsubishi UFJ Financial Group (MUFG) to shore up its dominance in project finance, a senior executive at the top Japanese lender said.  MUFG ranked No. 1 in U.S. project finance loans for 13 straight years, as it took advantage to bridge the gap created by the 2008 global financial crisis that forced U.S. and European rivals to cut risk-weighted assets on their balance sheets.  The bank's experience through tough times and retained capabilities have put it in a strong position to benefit from a recent surge in project finance deals, Fumitaka Nakahama, the chief of MUFG's global corporate and investment banking, told Reuters."}, {"date": "20230913040600", "headline": "Interesting MUFG Put And Call Options For December 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20230914035537", "headline": "Sumitomo Mitsui Financial: Taking Profits, Risk Reward Profile Less Attractive", "summary": "Learn about the challenges facing Sumitomo Mitsui Financial Group, including low dividend yield, slowing earnings growth, and potential impacts of Japan's exit from low interest rates."}, {"date": "20230919003900", "headline": "Kingfisher’s Comments on Regional Performance Will Be Keenly Watched", "summary": "Kingfisher could see consensus estimates lowered 5%-6% on the back of its guidance cut, Citi said, keeping a neutral rating on the stock and a 256p price target."}, {"date": "20230919075800", "headline": "Morgan Stanley (MS) Faces $750M Lawsuit by Private Equity Firms", "summary": "Private equity firms Certares and Knighthead sue Morgan Stanley (MS) for defrauding them in relation to a credit agreement investment for a luxury high-speed rail line."}, {"date": "20230919125400", "headline": "Stock Market Today: Dow Leads Indexes Lower", "summary": "Stocks retreated while bond yields rose ahead of the Federal Reserve’s interest-rate decision Wednesday."}, {"date": "20230920022000", "headline": "Kioxia's banks plan $14B loan for Western Digital merger - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20230921063400", "headline": "Moody's (MCO) Unveils a Partnership in Vietnam VIS Rating", "summary": "With an aim to expand further globally, Moody's (MCO) announces the formation of VIS Rating, a partnership with leading financial institutions in Vietnam."}, {"date": "20230921213901", "headline": "BOJ Stands Pat on Stimulus, Fueling Pressure on Weak Yen", "summary": "(Bloomberg) -- The Bank of Japan left its monetary settings unchanged and offered no clear sign of a shift in its policy stance, putting a damper on market speculation over the prospects for a near-term interest rate hike and adding some pressure to the yen. Most Read from BloombergEx-Goldman Bankers Make a Fortune With Controversial Bet on CoalIndia Suspends Visas, Canada Pulls Diplomats Amid TensionsMcCarthy Ambushed as Republican Hardliners Change Course on Spending PlanWall Street Trading Ro"}, {"date": "20230922032400", "headline": "Higher Rates Are Supercharging Japan’s Banks", "summary": "Stodgy Japanese banks have morphed into some of the globe’s best investments in 2023, and a shifting monetary regime will keep them raking in the cash.  Since December the  Bank of Japan  has made a couple of important tweaks to its yield-curve-control policy—effectively allowing long-term bond yields to rise—and an end to the negative-rate policy implemented in 2016 could be on the horizon.  Higher interest rates would benefit banks in several ways."}, {"date": "20230925100127", "headline": "Binance and Mitsubishi UFJ Trust Bank partner to launch new stablecoin in Japan", "summary": "Binance, in partnership with Mitsubishi UFJ (NYSE:MUFG) Trust Bank, is preparing to introduce a novel stablecoin to the Japanese market and the wider global cryptocurrency ecosystem. The forthcoming digital currency will be built on the Progmat Coin platform, a Mitsubishi-owned technology that adheres to Japan's stringent regulations on stablecoin issuance and management."}, {"date": "20230926000857", "headline": "Japan's MUFG Bank, two others lead $290 mln Sierra Space fundraising -Nikkei", "summary": "MUFG Bank is among three Japanese firms leading a $290-million fundraising round for U.S. spaceship company Sierra Space, spearheading a commercial \"spaceport\" project in the southwestern region of Oita, the Nikkei daily said on Tuesday.  Despite recent setbacks for national space missions, Japanese companies aiming to foray into space are increasingly deepening ties with private companies, from American giants such as SpaceX to home-grown startups.  MUFG Bank, insurer Tokio Marine & Nichido Fire and trading house Kanematsu together invested several tens of billions of yen in Sierra, gaining a stake in the unlisted company that was now probably valued in excess of $5 billion, the paper said."}, {"date": "20230926001348", "headline": "Japan's MUFG Bank, two others lead $290 million Sierra Space fundraising -Nikkei", "summary": "MUFG Bank is among three Japanese firms leading a $290-million fundraising round for U.S. spaceship company Sierra Space, spearheading a commercial \"spaceport\" project in the southwestern region of Oita, the Nikkei daily said on Tuesday.  Despite recent setbacks for national space missions, Japanese companies aiming to foray into space are increasingly deepening ties with private companies, from American giants such as SpaceX to home-grown startups.  MUFG Bank, insurer Tokio Marine & Nichido Fire and trading house Kanematsu together invested several tens of billions of yen in Sierra, gaining a stake in the unlisted company that was now probably valued in excess of $5 billion, the paper said."}, {"date": "20230926013948", "headline": "Mitsubishi UFJ Financial Group: Bullish On Valuation Re-Rating Potential", "summary": "Mitsubishi UFJ Financial Group, the bank holding company for MUFG Bank, provides various financial services. Find out why I assign a buy rating to MUFG stock."}, {"date": "20230926095836", "headline": "Why Binance and Banking Giant MUFG Want to Issue Stablecoins in Japan", "summary": "Binance Japan and Mitsubishi UFJ bank want to help with the country's Web3 ambitions by issuing stablecoins."}, {"date": "20230926101900", "headline": "Mitsubishi UFJ (MUFG), Binance to Launch Stablecoin in Japan", "summary": "Mitsubishi UFJ (MUFG), through Mitsubishi Trust Bank, collaborates with Binance to offer a stablecoin that will be tied to the Japanese yen and incorporate foreign currencies."}, {"date": "20230926104700", "headline": "First Sentier MUFG Sustainable Investment Institute research uncovers keys to successful shareholder engagements", "summary": "According to a new report on company engagement1 commissioned by the First Sentier MUFG Sustainable Investment Institute (the Institute), relevance to the company, face-to-face meetings, and a strong shareholder consensus are among the most important elements."}, {"date": "20230929004800", "headline": "Nikkei Ends Flat as Auto, Financial Stocks Weigh", "summary": "The Nikkei Stock Average closed flat at 31857.62 as losses in auto and financial stocks offset gains in chip stocks."}, {"date": "20230929073900", "headline": "U.S. Stocks Open Higher After Inflation Data As S&P 500 Heads For September Loss", "summary": "U.S. stocks opened higher as investors digested fresh data showing core inflation rose less than expected in August."}, {"date": "20231002023315", "headline": "BOJ to Buy Additional Bonds to Curb Rise in Sovereign Yields", "summary": "(Bloomberg) -- The Bank of Japan announced an extra bond-buying plan for this week as a global debt selloff forces policymakers into the market to curb sharp increases in yields.Most Read from BloombergWhy a US Recession Is Still Likely — and Coming SoonOnce Unthinkable Bond Yields Now the New Normal For MarketsCongress Averts US Government Shutdown Hours Before DeadlineAging Trees Show a Crisis Looms for the World’s Everything OilMcCarthy to Face Far-Right Attempt to Oust Him as House SpeakerTh"}, {"date": "20231002030200", "headline": "Can Japan's Economy Continue To Blossom If Bank of Japan Raises Rates? Apparently So.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231004104500", "headline": "MUFG further expands Growth & Middle Market Tech Banking team", "summary": "Mitsubishi UFJ Financial Group (NYSE: MUFG) announced today the hiring of three seasoned relationship professionals within its Growth & Middle Market Technology team, aimed at bolstering the bank's continued expansion into the pre-IPO growth and middle-market public companies space in the Innovation Ecosystem."}, {"date": "20231004222700", "headline": "Why did Nomura stock go up today? Japanese banks rally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231005002600", "headline": "Nikkei Rises 1.8%, Led by real estate, Auto Stocks", "summary": "Japanese shares ended higher, led by gains in real estate, auto and bank stocks, as the U.S. bond-market rout eased, alleviating concerns about higher borrowing costs."}, {"date": "20231005023228", "headline": "Mitsubishi UFJ Financial Group, Inc. - ADR (MUFG) Price Target Increased by 10.23% to 9.21", "summary": ""}, {"date": "20231005142400", "headline": "Stock Market Today: Indexes Finish Lower, Oil Prices Decline Again", "summary": "Stocks pulled back , while Treasury yields steadied after a volatile stretch. Investors are watching for data Friday on the jobs market and next week on inflation."}, {"date": "20231005213909", "headline": "Top bank MUFG's market chief flags concerns on Japan's lax fiscal discipline", "summary": "Japan's financial indiscipline amid rising inflation may disrupt its bond market, a senior executive of top lender Mitsubishi UFJ Financial Group said, in the wake of market expectations of an eventual end to ultra-low interest rates.  The benchmark 10-year Japanese government bond (JGB) yield hit a decade-high of 0.805% this week, approaching the Bank of Japan's hard cap of 1.0% partly on simmering speculation the bank will soon phase out its massive stimulus programme.  Globally bonds have been heavily sold for weeks - prompting the Bank of Japan to step in to steady the JGB market - as investors reckon on interest rates around the world staying elevated."}, {"date": "20231009052500", "headline": "Q4 2023 Strategy: The 7 Best Stocks to Stabilize Your Portfolio in Market Turmoil", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231009210143", "headline": "UPDATE 1-Glitch at Japan's clearing system preventing transfers at 11 banks", "summary": "The Japanese Bankers Association said on Tuesday a glitch at its online payment clearing network system is preventing some domestic transfers at 11 banks including MUFG Bank and Resona Bank.  There was an issue with the system's relaying computer and the association is investigating the cause, the banking industry group said.  The glitch is also affecting a wide range of banks as it's blocking fund transfers to and from those 11 banks directly impacted."}, {"date": "20231010044500", "headline": "Property Giant Hysan's Borrowing Surges With Fresh $4 Billion Bond Issuance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231010113301", "headline": "Mitsubishi UFJ Financial Group Continues To Deliver", "summary": "Mitsubishi UFJ Financial Group's focus on improving returns for shareholders is paying off, with a 13% return in the past 3 months. Find out if MUFG is a buy."}, {"date": "20231011235658", "headline": "25 Biggest Publicly Traded Asset Managers", "summary": "In this article, we will take a look at 25 of the biggest publicly traded asset managers in the world. If you want to see some more of the world’s biggest asset managers, go directly to the 5 Biggest Publicly Traded Asset Managers. An asset manager handles combined funds for their clients, investing them accordingly. […]"}, {"date": "20231015220510", "headline": "MUFG Plans to Sell First Dollar AT1 Bonds in First for Japanese Banks", "summary": "(Bloomberg) -- Mitsubishi UFJ Financial Group Inc. has mandated banks to sell dollar-denominated Additional Tier 1 bonds, in what looks set to be the first such offering in the US currency by any Japanese lender. Most Read from BloombergIsrael Latest: Army Says Hamas Officials Dead; Over 600,000 in Gaza Flee SouthUS Pushes to Contain Israel-Hamas War, Warns Iran About EscalationUS to Tighten Curbs on China’s Access to Advanced Chip TechIsrael Latest: Biden and Abbas Talk as Gaza Invasion NearsGl"}, {"date": "20231015230000", "headline": "ClearBridge International Value Strategy Q3 2023 Portfolio Manager Commentary", "summary": "The ClearBridge International Value Strategy outperformed its MSCI EAFE benchmark during Q3 2023. Click here to read the full fund letter."}, {"date": "20231017202604", "headline": "Bank of Japan Steps Into Debt Market to Slow Rising Bond Yields", "summary": "(Bloomberg) -- The Bank of Japan announced an unscheduled bond-purchase operation on Wednesday, reminding the market of its determination to slow the pace of increases in sovereign yields. Most Read from BloombergHundreds Dead at Gaza Hospital as Israel, Hamas Trade BlameIsrael Latest: Biden to Visit as Oil Climbs After Hospital BlastTreasury Yields Climb as Hot Data Fuel Fed Wagers: Markets WrapWill Xi Jinping’s Gamble on Vladimir Putin Pay Off?UPenn Donors Pile Pressure on School as David Mage"}, {"date": "20231019020600", "headline": "Western Digital gains amid report banks commit $12.7B to Kioxia deal", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231019065800", "headline": "First Sentier Investors Expands Americas Team, Hires Elizabeth Altman, Chase Mazzariello as Sales Executives", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231026034200", "headline": "Morgan Stanley’s new CEO Ted Pick has ‘big shoes to fill’ as he faces challenging markets, analyst says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231031234535", "headline": "BOJ Buys More Bonds to Slow Rising Yields a Day After Tweak", "summary": "(Bloomberg) -- The Bank of Japan stepped into the bond market unexpectedly Wednesday to curb the pace of gains in sovereign yields, just a day after announcing it was loosening its grip on debt prices.Most Read from BloombergImmigrants Are Leaving Canada at Faster Pace, Study ShowsIsrael Latest: Blinken Returning to Israel; Refugee Camp HitZillow Plunges After Verdict on Real Estate Brokerage CommissionsSaudi Forces on Alert After Clash With Iran-Backed HouthisSony’s Bungie Game Unit Cut 8% of S"}, {"date": "20231102022600", "headline": "First Sentier Investors appoints new Chief Operating Officer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231102062700", "headline": "3 Foreign Bank Stocks on the Radar Despite Industry Challenges", "summary": "Despite concerns related to higher restructuring costs, Zacks Foreign Bank industry stocks like Mitsubishi (MUFG), ICICI Bank (IBN) and UBS will benefit from higher rates."}, {"date": "20231102065004", "headline": "MUFG (MUFG) Is a Great Choice for 'Trend' Investors, Here's Why", "summary": "MUFG (MUFG) made it through our \"Recent Price Strength\" screen and could be a great choice for investors looking to make a profit from stocks that are currently on the move."}, {"date": "20231103071300", "headline": "Zacks Industry Outlook Highlights Mitsubishi UFJ Financial, ICICI Bank and UBS Group", "summary": "Mitsubishi UFJ Financial, ICICI Bank and UBS Group are part of the Zacks Industry Outlook article."}, {"date": "20231104053500", "headline": "Baron International Growth Fund Q3 2023 Shareholder Letter", "summary": "Baron International Growth FundÂ® (the Fund) declined 6.98% (Institutional Shares) during Q3 2023. Click here to read the full fund letter."}, {"date": "20231106213442", "headline": "Morgan Stanley CEO Sees Next Chapter for ‘Best’ Banking JV", "summary": "(Bloomberg) -- Morgan Stanley’s alliance with Mitsubishi UFJ Financial Group Inc. will last for at least another decade, the US bank’s outgoing chief executive officer said, hailing recent steps by their two joint ventures in Japan to deepen ties.Most Read from BloombergTrump Testimony Called a ‘Broken Record’ by Judge: Trial UpdateIsrael Latest: Netanyahu Sees a Role in Gaza Security After WarWeWork Goes Bankrupt, Signs Pact With Creditors to Cut DebtWall Street Faces ‘Reality Check’ After Big"}, {"date": "20231107033902", "headline": "20 Most Valuable Financial Companies in the World", "summary": "In this article, we will look into the 20 most valuable financial companies in the world. If you want to skip our detailed analysis, you can go directly to the 5 Most Valuable Financial Companies in the World. Financial Services Industry: A Market Analysis According to a report by The Business Research Company, the global […]"}, {"date": "20231107092813", "headline": "Mitsubishi UFJ launches joint stablecoin study with Ginco, Progmat", "summary": "The joint study aims to create the infrastructure for issuing regulatory-compliant stablecoins for improved cross-border settlement."}, {"date": "20231108080500", "headline": "Navigating Global Equity Markets", "summary": "Global investing is easily accessible through financial markets. Many investors prefer to stick to companies and industries they are familiar with. Read more here."}, {"date": "20231112184400", "headline": "Mitsubishi UFJ's Second-Quarter Net Profit Likely More Than Doubled -- Earnings Preview", "summary": "By Kosaku Narioka Mitsubishi UFJ Financial Group is scheduled to report second-quarter results on Tuesday. Here is what you need to know: NET PROFIT..."}, {"date": "20231113212500", "headline": "Mitsubishi UFJ's Profit Surges on Trading Gains, Higher Fees, Commissions", "summary": "By Kosaku Narioka Mitsubishi UFJ Financial Group's first-half net profit quadrupled from a year earlier thanks partly to gains from trading and fees and..."}, {"date": "20231113224100", "headline": "MUFG Bank, Ltd. announces Consolidated Summary Report  [under Japanese GAAP] for the six months ended September 30, 2023", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231113225000", "headline": "Mitsubishi UFJ's First-Half Net Profit Exceeds Analysts' Estimates -- Earnings Review", "summary": "By Kosaku Narioka Mitsubishi UFJ Financial Group reported its first-half results on Tuesday. Here is what you need to know. NET PROFIT: Mitsubishi UFJ's..."}, {"date": "20231113232000", "headline": "Mitsubishi UFJ Financial interim profit jumps; eyes full-year growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231114003600", "headline": "Mitsubishi UFJ Financial to buy back up to $2.6B stock after profit surges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231114023100", "headline": "Mitsubishi UFJ’s Profit Surges on Trading Gains, Higher Fees, Commissions", "summary": "Mitsubishi UFJ  Financial Group’s first-half net profit quadrupled from a year earlier thanks partly to gains from trading and fees and commissions, as well as the absence of special losses booked last year.  The Japanese financial company said Tuesday that net profit increased to 927.28 billion yen ($6.11 billion) for the six months ended Sept. 30 from Y231.09 billion in the year-earlier period.  Mitsubishi UFJ Financial maintained its net profit guidance of Y1.300 trillion for the fiscal year ending March 2024."}, {"date": "20231114034053", "headline": "Japan’s Largest Banks to Buy Back Shares After Profit Soars", "summary": "(Bloomberg) -- Japan’s biggest banks unveiled plans to boost shareholder returns after posting record first-half profits, thanks in part to a cheaper yen. Most Read from BloombergBiden, Xi to Announce China’s Crackdown on Fentanyl TradeWall Street Divided Over Just How Aggressive Fed Cutting Will BeUBS Strategists See Far Deeper Fed Rate Cuts Than What Markets Are PricingThailand Takes $28 Billion Malacca Strait Bypass Plan to USIsrael Latest: Biden Urges ‘Less Intrusive Action’ as Troops Close"}, {"date": "20231115035000", "headline": "Monetary Authority Of Singapore And Industry Giants Forge Ahead With Tokenization Pilots", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231115050900", "headline": "Bitfarms among financials gainers, Nu Holdings in losers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231115103200", "headline": "Mitsubishi UFJ (MUFG) Earnings Rise in 1H24, NII Declines", "summary": "Increased gross profits, a strong balance sheet and decreased credit costs support Mitsubishi UFJ's (MUFG) results in the first half of fiscal 2024."}, {"date": "20231116152700", "headline": "These Small-Cap Stocks are a Highlight of This Week's Earnings Lineup", "summary": "This week's earnings lineup has been highlighted by quite a few small-cap stocks that have strengthening prospects after posting impressive quarterly results on Tuesday."}, {"date": "20231120060957", "headline": "20 Most Valuable Asian Companies Heading into 2024", "summary": "In this article, we will look into the 20 most valuable Asian companies heading into 2024. If you want to skip our detailed analysis, you can go directly to the 5 Most Valuable Asian Companies Heading into 2024. Asia is the world’s largest and most populous continent, with a rich culture and heritage. The region […]"}, {"date": "20231120075005", "headline": "Recent Price Trend in MUFG (MUFG) is Your Friend, Here's Why", "summary": "MUFG (MUFG) could be a great choice for investors looking to make a profit from fundamentally strong stocks that are currently on the move. It is one of the several stocks that made it through our \"Recent Price Strength\" screen."}, {"date": "20231122015500", "headline": "GE, Boeing, Mitsubishi UFJ Financial And A Big US Bank On CNBC's 'Final Trades'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231129033600", "headline": "(MUFG) - Analyzing Mitsubishi UFJ Finl Gr's Short Interest", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231129104011", "headline": "MUFG vs. BSAC: Which Stock Is the Better Value Option?", "summary": "MUFG vs. BSAC: Which Stock Is the Better Value Option?"}, {"date": "20231204005700", "headline": "Mitsubishi UFJ upgraded to Conviction Buy from Buy at Goldman Sachs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231204113000", "headline": "MUFG expands Capital Markets Group with equity private placements hire", "summary": "Mitsubishi UFJ Financial Group (MUFG) announced today that Geoff Paul has joined the bank as Managing Director and Head of Equity Capital."}, {"date": "20231204120900", "headline": "Amazon's (AMZN) Cloud Clientele Expands as Trip.com Picks AWS", "summary": "Amazon's (AMZN) AWS gets selected by Trip.com to support its global expansion."}, {"date": "20231205074000", "headline": "Mitsubishi UFJ (MUFG) Repurchases 40.2M Shares Under 400M Plan", "summary": "Mitsubishi UFJ (MUFG) announces the repurchase of 40.2 million shares under its share buyback plan. The plan authorizes the company to repurchase up to 400 million shares."}, {"date": "20231208113600", "headline": "Here Are 5 Reasons to Bet on Mitsubishi UFJ (MUFG) Right Now", "summary": "Mitsubishi UFJ (MUFG) looks promising on inorganic expansions, a strong deposit balance and capital distributions amid uncertain economic conditions."}, {"date": "20231211104502", "headline": "Why Mitsubishi UFJ (MUFG) is a Great Dividend Stock Right Now", "summary": "Dividends are one of the best benefits to being a shareholder, but finding a great dividend stock is no easy task. Does Mitsubishi UFJ (MUFG) have what it takes? Let's find out."}, {"date": "20231212075007", "headline": "MUFG (MUFG) is on the Move, Here's Why the Trend Could be Sustainable", "summary": "MUFG (MUFG) could be a solid choice for shorter-term investors looking to capitalize on the recent price trend in fundamentally sound stocks. It is one of the many stocks that passed through our shorter-term trading strategy-based screen."}, {"date": "20231216033544", "headline": "Mitsubishi UFJ Financial Group, Inc. - ADR (MUFG) Price Target Increased by 10.39% to 10.57", "summary": ""}, {"date": "20231217105800", "headline": "Mitsubishi UFJ Agrees A$1.2B Deal for Australia's Link Administration", "summary": "By Alice Uribe SYDNEY--Mitsubishi UFJ Financial Group agreed to buy Link Administration in a deal valuing the Australian financial technology company's..."}, {"date": "20231217132700", "headline": "Mitsubishi UFJ to buy Australian fintech company Link", "summary": "Link Administration shares jumped after the company announced a 1.2 billion Australian-dollar (US$804.7 million) buyout by a unit of Japanese banking firm..."}, {"date": "20231217154341", "headline": "Mitsubishi UFJ to buy Australia's Link Administration for $800 million", "summary": "It represents Mitsubishi UFJ's seventh acquisition in the fund administration industry in the decade, with past deals including UBS Asset Management's alternative fund services business in 2015.  \"This acquisition of global pension and stock administration functions will enable MUFG to further accelerate its global business expansion via access to Australian funds and global corporate clients,\" Mitsubishi said in a statement.  Link is the largest Australian pension administration company, providing services to 10 million accounts, or approximately 41% of Australian private pension members."}, {"date": "20231217174951", "headline": "Japan’s MUFG to Buy Australia’s Link in $744 Million Deal", "summary": "(Bloomberg) -- Mitsubishi UFJ Trust and Banking Corp. said it will buy Australian data manager Link Administration Holdings Ltd. in a deal valued at about A$1.11 billion ($744 million), as Japanese lenders build on a slew of commitments to acquire higher returning assets abroad.Most Read from BloombergUS Frackers Return to Haunt OPEC’s Pricing StrategyA-Rod’s Slam SPAC Is Said to Plan Merger With Lynk GlobalDimon’s Heir at JPMorgan Still Hazy as ‘Five More Years’ Tick ByCanada to Announce 2035 A"}, {"date": "20231217181357", "headline": "Three Australian buyouts worth $2.35 billion emerge in end-of-year deal rush", "summary": "Australian building products group Adbri Ltd and pension firm Link Group were among three takeover targets facing bids worth A$3.5 billion ($2.34 billion) made on Monday in a year-end rush of deals involving listed companies.  Adbri shares jumped 31% after it said it was in exclusive talks with international building materials group CRH  and major shareholder Barro Group for a A$2.1 billion takeover offer.  Barro, a family-owned private Australian group, owns 43% of Adbri, and CRH, which is London and U.S. listed, has a 4.6% interest in the takeover target through a cash-settled derivative, they said in a statement."}, {"date": "20231217181400", "headline": "Mitsubishi UFJ Agrees to Buy Australia’s Link Administration", "summary": "Mitsubishi UFJ Financial Group agreed to buy Link Administration in a deal valuing the Australian financial technology company’s equity at $800 million."}, {"date": "20231217205600", "headline": "Mitsubishi UFJ to acquire \"leading\" Australian pensions administrator", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231217232636", "headline": "UPDATE 1-Three Australian buyouts worth $2.35 billion emerge in end-of-year deal rush", "summary": "Australian building products group Adbri Ltd and pension firm Link Group were among three takeover targets facing bids worth A$3.5 billion ($2.34 billion) made on Monday in a year-end rush of deals involving listed companies.  Adbri shares jumped 31% after it said it was in exclusive talks with international building materials group CRH and major shareholder Barro Group for a A$2.1 billion takeover offer.  Barro, a family-owned private Australian group, owns 43% of Adbri, and CRH, which is London and U.S. listed, has a 4.6% interest in the takeover target through a cash-settled derivative, they said in a statement."}, {"date": "20231218014400", "headline": "Tokyo-Based Mitsubishi UFJ Taps This Australian Pension Administration Company For A$1.11B - What's On The Cards?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231218104012", "headline": "MUFG or BSAC: Which Is the Better Value Stock Right Now?", "summary": "MUFG vs. BSAC: Which Stock Is the Better Value Option?"}, {"date": "20231218201800", "headline": "Looking Into Mitsubishi UFJ Finl Gr's Recent Short Interest", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20231221092129", "headline": "Japan banks scramble to beef up asset management business amid govt reform push", "summary": "TOKYO (Reuters) -The Japanese government's reform push for the country's $5 trillion asset management industry has sparked a series of action plans from top Japanese banking groups to beef up their long overlooked asset management business.  Asset management has emerged as an area of focus for the banks this year as the financial regulator sought their help to shake up the industry in line with Japan's policy pledge to turn dormant household savings into investments.  \"We aim to build up the asset management business as the group's fourth pillar after banking, trust banking and brokerages,\" Mitsubishi UFJ Financial Group's chief executive Hironori Kamezawa told Reuters in an interview."}, {"date": "20231221094013", "headline": "Mitsubishi UFJ Financial: Good Progress On ROE Improvement Initiatives", "summary": "Mitsubishi UFJ initiated a substantial JPY 400 billion ($2.8 billion) share buyback plan in the middle of last month. Read more about MUFG stock here."}, {"date": "20231224090000", "headline": "Morgan Stanley Expects Record Japan Revenue as BOJ Fuels Trading", "summary": "(Bloomberg) -- Morgan Stanley said it expects to record its highest-ever income from Japan as bets on a shift in the nation’s monetary policy fuel a trading revival.Most Read from BloombergTrump Tells Appeals Panel He Should Have ‘Absolute Immunity’Wall Street Learns That This Year, Nothing Beat Owning the S&P 500Manchester United Saga Ends With $1.3 Billion Ratcliffe DealHyperloop One to Shut Down After Failing to Reinvent TransitNigeria Seeks Control of Banks Linked to Ex Central BankerThe Ban"}, {"date": "20231225224907", "headline": "MUFG Brokerage JV Sued Again Over Credit Suisse AT1 Losses", "summary": "(Bloomberg) -- Another group of Japanese investors sued Mitsubishi UFJ Financial Group Inc.’s joint brokerage venture with Morgan Stanley, the latest litigation over losses on Credit Suisse’s riskiest debt that became worthless. Most Read from BloombergS&P 500 Trades Within a Whisker of All-Time High: Markets WrapApple to Fight Watch Ban in Court After White House Declines to ActGoldman’s Painful 2023 Lesson on China Forces Rethink of Emerging MarketsHow Were So Many Economists So Wrong About th"}, {"date": "20231226090100", "headline": "Morgan Stanley (MS) to See Record Japan Income as Trading Revives", "summary": "Morgan Stanley (MS) expects record revenues from Japan on the back of the country's debt and rates market trading resurgence."}, {"date": "20231228104503", "headline": "Are You Looking for a High-Growth Dividend Stock?", "summary": "Dividends are one of the best benefits to being a shareholder, but finding a great dividend stock is no easy task. Does Mitsubishi UFJ (MUFG) have what it takes? Let's find out."}, {"date": "20240102030000", "headline": "One Fund Manager Called Meta Stock’s 2023 Rally. He Sees More Gains Ahead.", "summary": "Dan Niles, who runs the tech-focused Satori Fund, picked Instagram parent Meta a year ago for a 2023 pick. He’s still bullish on the name, along with Amazon..."}, {"date": "20240102093000", "headline": "MUFG issues U.S. macro strategy 2024 outlook report - 'Getting Back in Sync?'", "summary": "Mitsubishi UFJ Financial Group's (MUFG's) U.S. Macro Strategy team released its 2024 outlook report titled \"Getting Back in Sync?\" providing a forward-looking perspective on the U.S. fixed income markets and the macroeconomic factors impacting the U.S. economy in the next 12 months."}, {"date": "20240103063700", "headline": "HSBC Holdings (HSBC) Plans to Launch Global Payments App Zing", "summary": "In sync with its plan to become a leading financial institution for internationally mobile customers, HSBC Holdings (HSBC) will launch a global money-transfer app, Zing, in the coming days."}, {"date": "20240104065200", "headline": "Here's Why ICICI Bank (IBN) Stock is Worth Buying Right Now", "summary": "Efforts to bolster fee income, dependence on domestic loans and digitization of banking services will keep supporting ICICI Bank's (IBN) financials."}, {"date": "20240105103000", "headline": "New York Community (NYCB) Hurt by Weak Asset Quality, High Costs", "summary": "An increase in expenses and deteriorated asset quality are major near-term headwinds for New York Community (NYCB)."}, {"date": "20240108063000", "headline": "Peering Into Mitsubishi UFJ Finl Gr's Recent Short Interest", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240108215909", "headline": "Yen Rises After BOJ Indicates Cut in Super-Long Bond Buying", "summary": "(Bloomberg) -- The yen extended gains after Bank of Japan indicated it will reduce monthly buying of super-long government bonds, in a reminder that it may still move to cut stimulus this year.Most Read from BloombergBoeing Slumps After Panel Blowout Leads to Partial 737 GroundingMusk’s Drug Use Concerns Tesla, SpaceX Leaders, WSJ SaysIPhone Survives 16,000-Foot Fall, Helps Steer Jet-Panel HuntEmirates’ Clark Says Blowout Illustrates Boeing’s Quality LapsesThe BOJ bought ¥150 billion ($1.04 bill"}, {"date": "20240109021800", "headline": "P/E Ratio Insights for Mitsubishi UFJ Finl Gr", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240109055802", "headline": "U.S. Bancorp Remains A Good Income Play", "summary": "U.S. Bancorp offers a dividend yield of 4.5% that is sustainable over the long term. Read more to see an overview and analysis of USB stock."}, {"date": "20240109171911", "headline": "What Makes MUFG (MUFG) a Good Fit for 'Trend Investing'", "summary": "MUFG (MUFG) could be a great choice for investors looking to make a profit from fundamentally strong stocks that are currently on the move. It is one of the several stocks that made it through our \"Recent Price Strength\" screen."}, {"date": "20240110034500", "headline": "Interesting MUFG Put And Call Options For August 16th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240118111500", "headline": "MUFG Economic Research Office releases 2024 outlook report; considers five key questions for the year ahead", "summary": "Mitsubishi UFJ Financial Group (NYSE: MUFG) Economic Research Office issued its 2024 outlook report titled \"Five Key Questions for 2024,\" in which contributors Henry Cook, Senior Economist, London; Agron Nicaj, U.S. Economist, New York; and Sai Yabuki, Japan Economist, Tokyo, explore major global macro themes for the next 12 months."}, {"date": "20240122202144", "headline": "A Top-Rated Brokerages Analyst in Japan Leaves Her Company", "summary": "(Bloomberg) -- Natsumu Tsujino, a highly-ranked senior analyst at Mitsubishi UFJ Financial Group Inc.’s securities subsidiary, has left the unit, according to people familiar with the matter, amid an overhaul in the firm’s research team.Most Read from BloombergChina Weighs Stock Market Rescue Package Backed by $278 BillionFlorida Governor DeSantis Drops Out of 2024 Race, Endorses TrumpHong Kong Stocks at 36% Discount Show True Depth of China GloomIndia Tops Hong Kong as World’s Fourth-Largest St"}, {"date": "20240125075003", "headline": "Here's What Could Help MUFG (MUFG) Maintain Its Recent Price Strength", "summary": "If you are looking for stocks that are well positioned to maintain their recent uptrend, MUFG (MUFG) could be a great choice. It is one of the several stocks that passed through our \"Recent Price Strength\" screen."}, {"date": "20240129052611", "headline": "30 Countries with Highest Debt-to-GDP: 2024 Rankings", "summary": "In this article, we will take a look at the 30 countries with highest debt-to-GDP ratio. You can skip our detailed analysis and go directly to the 10 Countries with Highest Debt-to-GDP: 2024 Rankings. Global Debt Distress The global debt distress is a complicated thing for policymakers as they continue to work on preserving debt […]"}, {"date": "20240129182743", "headline": "Japan Job Market Remains Tight, Keeping Hopes for Wage Hikes", "summary": "(Bloomberg) -- Japan’s labor market showed further signs of tightness in December, driven by a manpower shortage across a swath of sectors in a closely-watched development as companies engage in annual wage negotiations with unions.Most Read from BloombergTraders Line Up for ‘Once-in-a-Generation’ Emerging Markets BetBlackstone Is Building a $25 Billion Empire of Power-Hungry Data CentersTrump Cash Stockpile at Risk From $450 Million Dual VerdictsMusk Says First Neuralink Patient Received Implan"}, {"date": "20240130040409", "headline": "UPDATE 2-Nippon Steel says Japan's 3 megabanks plan $16 bln loan for U.S. Steel acquisition", "summary": "Sumitomo Mitsui Financial Group, Mitsubishi UFJ Financial Group and Mizuho Financial Group  plan to lend Nippon Steel a combined $16 billion for its planned acquisition of U.S. Steel, the Japanese steelmaker said on Tuesday.  \"We have received a commitment letter for a combined $16 billion in loans from the three Japanese megabanks on condition that the acquisition goes through,\" a Nippon Steel spokesperson said.  The White House has also promised \"serious scrutiny\" of the deal given the company's role in U.S. steel production, which the government regards as critical to national security."}, {"date": "20240130040845", "headline": "Nippon Steel says Japan's 3 megabanks plan $16 billion loan for U.S. Steel acquisition", "summary": "TOKYO (Reuters) -Sumitomo Mitsui Financial Group, Mitsubishi UFJ Financial Group and Mizuho Financial Group  plan to lend Nippon Steel a combined $16 billion for its planned acquisition of U.S. Steel, the Japanese steelmaker said on Tuesday.  \"We have received a commitment letter for a combined $16 billion in loans from the three Japanese megabanks on condition that the acquisition goes through,\" a Nippon Steel spokesperson said.  The White House has also promised \"serious scrutiny\" of the deal given the company's role in U.S. steel production, which the government regards as critical to national security."}, {"date": "20240202020200", "headline": "Earnings Outlook For Mitsubishi UFJ Finl Gr", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240202042100", "headline": "Jefferies’ Japan long equity list", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240202050900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240204181400", "headline": "Nikkei Up 0.5%, Led by Auto, Financial Stocks", "summary": "Japanese stocks were higher, led by gains in auto and financial stocks, after U.S. stocks hit record highs and the yen weakened sharply Friday following strong U.S. jobs data."}, {"date": "20240204183500", "headline": "GLOBAL BRIEFING: US on path of \"unsustainable\" debt — Jerome Powell", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240204205300", "headline": "Mitsubishi UFJ 9-Mos Net Interest Income Y1.800T Vs Y2.314T", "summary": "By Kosaku Narioka Mitsubishi UFJ Financial Group's nine-month net profit more than tripled thanks partly to smaller losses on debt securities and the absence..."}, {"date": "20240204222500", "headline": "Earnings Scheduled For February 5, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240204224400", "headline": "TOP NEWS: Mitsubishi UFJ Financial profit rises amid higher income", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240204235600", "headline": "MUFG Bank, Ltd. announces Consolidated Summary Report [under Japanese GAAP] for the nine months ended December 31, 2023", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240205014119", "headline": "UPDATE 2-Japan's top bank MUFG reports third-quarter profit tripled", "summary": "Mitsubishi UFJ Financial Group (MUFG), Japan's largest lender by assets, on Monday reported third-quarter net profit tripled from the same period a year prior, when earnings were pulled down by an asset sale.  MUFG posted profit of 370.64 billion yen ($2.50 billion) for October-December, against 112.08 billion yen a year earlier, according to Reuters' calculations based on nine-month cumulative figures disclosed in a stock exchange filing.  The jump in profit partly reflected an accounting loss a year earlier related to the $8 billion sale of U.S. unit MUFG Union Bank that was mostly offset by an accounting gain in the following quarter."}, {"date": "20240205210400", "headline": "Ken Fisher's Bold Move: A 566.18% Increase in Exxon Mobil Corp", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240206122400", "headline": "Mitsubishi UFJ's (MUFG) Nine Months Earnings Increase Y/Y", "summary": "Mitsubishi UFJ (MUFG) records a rise in gross profits, net fees and commissions as well as net trading profits in the first nine months of fiscal 2024."}, {"date": "20240209224600", "headline": "Q2 2023 Mitsubishi UFJ Financial Group Inc Earnings Presentation Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Full Year 2023 Mitsubishi UFJ Financial Group Inc Earnings Net Conference Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Full Year 2022 Mitsubishi UFJ Financial Group Inc Earnings Presentation Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Full Year 2022 Mitsubishi UFJ Financial Group Inc Earnings Net Conference  Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Q2 2022 Mitsubishi UFJ Financial Group Inc Earnings Presentation Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Q2 2022 Mitsubishi UFJ Financial Group Inc Earnings Net Conference Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "US Bancorp to Acquire MUFG Union Bank Call Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Mitsubishi UFJ Financial Group Inc Investors Day 2021 Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Full Year 2021 Mitsubishi UFJ Financial Group Inc Earnings Presentation Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Full Year 2021 Mitsubishi UFJ Financial Group Inc Earnings Net Conference Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Q2 2021 Mitsubishi UFJ Financial Group Inc Earnings Presentation Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Q2 2021 Mitsubishi UFJ Financial Group Inc Earnings Net Conference Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Full Year 2020 Mitsubishi UFJ Financial Group Inc Earnings Presentation Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Full Year 2020 Mitsubishi UFJ Financial Group Inc Earnings Net Conference Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Q2 2020 Mitsubishi UFJ Financial Group Inc Earnings Presentation Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Q2 2020 Mitsubishi UFJ Financial Group Inc Earnings Net Conference Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Full Year 2019 Mitsubishi UFJ Financial Group Inc Earnings Presentation Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Full Year 2019 Mitsubishi UFJ Financial Group Inc Earnings Net Conference Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224600", "headline": "Q2 2023 Mitsubishi UFJ Financial Group Inc Earnings Net Conference Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224700", "headline": "Q2 2024 Mitsubishi UFJ Financial Group Inc Earnings Net Conference Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224700", "headline": "Mitsubishi UFJ Financial Group Inc Climate Change Seminar  Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224700", "headline": "Full Year 2023 Mitsubishi UFJ Financial Group Inc Earnings Presentation Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240209224700", "headline": "Q2 2024 Mitsubishi UFJ Financial Group Inc Earnings Presentation Transcript", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240210155758", "headline": "12 Best-Performing Bank Stocks In 2024", "summary": "In this article, we discuss the 12 best-performing bank stocks in 2024. If you want to skip our detailed discussion on the banking industry, head directly to 5 Best-Performing Bank Stocks In 2024. The banking industry faces challenges in 2024 due to a slowing global economy, diverse economic conditions, and risks such as supply chain […]"}, {"date": "20240213215200", "headline": "MUFG Bank, Ltd. announces Risk-Adjusted Capital Ratio Based on the Basel 3 Standards for the Third Quarter Ended December 31, 2023", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240214075005", "headline": "Here's Why Momentum in MUFG (MUFG) Should Keep going", "summary": "If you are looking for stocks that are well positioned to maintain their recent uptrend, MUFG (MUFG) could be a great choice. It is one of the several stocks that passed through our \"Recent Price Strength\" screen."}, {"date": "20240216044949", "headline": "Japan Banks to Provide Loans For Renesas Purchase of Altium, Sources Say", "summary": "(Bloomberg) -- Mitsubishi UFJ Bank and other major Japanese banks are planning to finance Renesas Electronics Corp.’s acquisition of software company Altium Ltd., according to people familiar with the matter.Most Read from BloombergHawaii Rightly Rejects Supreme Court’s Gun NonsensePutin Steps Into US Race to Back ‘Old-Style’ Biden Over TrumpJapan Loses Its Spot as World's Third-Largest Economy as It Slips Into RecessionApple Readies AI Tool to Rival Microsoft’s GitHub CopilotDozens of Banks Rap"}, {"date": "20240217143209", "headline": "66 Countries with a Double Tax Treaty with the USA", "summary": "In this article, we will look at the 66 countries with a double tax treaty with the USA. If you wish to skip our detailed analysis, go to 10 Countries with a Double Tax Treaty with the USA. Role of Double Tax We are living in an interconnected world and people migrate from one country […]"}, {"date": "20240219074300", "headline": "Mitsubishi UFJ (MUFG) Enters Into an Alliance With WealthNavi", "summary": "Mitsubishi UFJ (MUFG) and WealthNavi enter into a capital and business alliance to strengthen their existing collaboration in the robo-advisor business as well as develop a Money Advisory Platform."}, {"date": "20240223065700", "headline": "Three Stocks That Can Soar with Japan’s Historic Policy Shift", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240226165700", "headline": "Aristotle Capital Value Equity Q4 2023 Commentary", "summary": "For Q4 2023, Aristotle Capitalâ\u0080\u0099s Value Equity Composite posted a total return of 14.43% gross of fees (14.36% net of fees), outperforming the 9.50% return of the Russell 1000 Value Index."}, {"date": "20240226234737", "headline": "Mizuho Courting India Elite Shows Japan Banks’ Global Ambition", "summary": "(Bloomberg) -- As India heads into an election, follow Bloomberg India's channel on WhatsApp for how money and business intersect with politics and power. Sign up here. Most Read from BloombergBYD’s New $233,450 EV Supercar to Rival Ferrari, LamborghiniStock Rally Stalls at Start of Data-Packed Week: Markets WrapFreddie Mercury’s London Residence Lists at £30 MillionJacob Rothschild, Financier and Philanthropist, Dies at 87A Spike in Heart Disease Deaths Since Covid Is Puzzling ScientistsMizuho"}, {"date": "20240227103000", "headline": "MUFG continues to strategically invest in Leveraged Credit business with key new hire", "summary": "Mitsubishi UFJ Financial Group (MUFG) announced today that Jordan Hollander has joined the bank as a Director on the High Yield Credit Research team, jointly reporting to Tim Fischer and Todd Bondy, Co-Heads of Leveraged Credit Sales & Trading."}, {"date": "20240229021206", "headline": "Further Improvements At Mitsubishi UFJ Financial Group Could Prove Challenging (Rating Downgrade)", "summary": "Mitsubishi UFJ Financial's net profit for first 9 months of 2023 improved, but NII was down 22% YoY. See why I downgrade MUFG stock from buy to hold."}, {"date": "20240302044500", "headline": "Aristotle Capital - U.S. Bancorp: An Attractive Return Profile At Discount To Intrinsic Value", "summary": "We believe U.S. Bancorp is well positioned to improve its market position while maintaining an attractive return profile. Click here for our thesis on USB stock."}, {"date": "20240303202900", "headline": "Banks holding X debt discussed refi options with Elon Musk - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240304005400", "headline": "Japan’s Nikkei Tops 40000 for First Time, Driven by AI Optimism", "summary": "The climb was driven by greater corporate earnings and a surge in chip-related stocks, thanks to enthusiasm for beneficiaries of artificial intelligence."}, {"date": "20240304070845", "headline": "20 Largest Banks in The World by Market Cap", "summary": "In this piece, we are going to shed light on the 20 Largest Banks in The World by Market Cap. If you want to skip our detailed analysis of the banking sector, you can go directly to 5 Largest Banks in The World by Market Cap. The global banking industry is on the rise, with […]"}, {"date": "20240305160000", "headline": "Japan’s Biggest Bank Positions for BOJ Rate Liftoff This Month", "summary": "(Bloomberg) -- One question is obsessing Tokyo’s financial markets — when will the Bank of Japan exit negative interest rates? The country’s biggest bank expects the move to come in two weeks and is positioning itself accordingly. Most Read from BloombergOlivia Rodrigo Is Not Kid-Friendly? Don't Act Surprised.Tech Giants Drag Down US Stocks After Torrid Rally: Markets WrapGold Climbs to Record on Mix of Fed Pivot and Geopolitical RisksApple’s iPhone Woes in China Deepen With a 24% Sales PlungeBi"}, {"date": "20240306213900", "headline": "MUFG Bank announces Notice Regarding Changes of Representatives of the Board of Directors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313011800", "headline": "Mitsubishi UFJ Announces Upcoming Dividend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314063000", "headline": "'Seven Samurai' Stocks: Goldman Sachs Picks Leading Japanese Equities — How Do They Compare To The Magnificent Seven?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240318032100", "headline": "New Clues Strongly Suggest This Is the \"Confidential Stock\" Warren Buffett Has Been Buying", "summary": "Berkshire Hathaway is secretly building up its stake in one or more companies. New clues and details point to one very specific stock."}, {"date": "20240318225700", "headline": "Japan Hikes Rates for First Time Since 2007", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322133300", "headline": "Top Analyst Reports for Booking Holdings, Mitsubishi UFJ & Micron Technology", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Booking Holdings Inc. (BKNG), Mitsubishi UFJ Financial Group, Inc. (MUFG) and Micron Technology, Inc. (MU)."}, {"date": "20240325052300", "headline": "The BoJ’s receding uncertainty around policy could cause Japan stocks to catch up to U.S. stocks - Citi", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240325083900", "headline": "The Zacks Analyst Blog Highlights Booking Holdings, Mitsubishi UFJ Financial, Micron Technology, American Electric Power and Alcon", "summary": "Booking Holdings, Mitsubishi UFJ Financial, Micron Technology, American Electric Power and Alcon are part of the Zacks Analyst Blog."}, {"date": "20240327000300", "headline": "MUFG Completes Major Stock Buyback Initiative", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328000100", "headline": "MUFG Launches New ESOP for Management Staff", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328092800", "headline": "Mitsubishi UFJ (MUFG) Repurchases 44.9M Shares Under 400M Plan", "summary": "Mitsubishi UFJ (MUFG) announces the repurchase of 44.9 million shares under its share buyback plan. The plan authorizes the company to repurchase up to 400 million shares."}, {"date": "20240331233100", "headline": "MUFG Bank Announces, MUFG Announces New Medium-term Business Plan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240331235900", "headline": "MUFG Unveils Growth-Oriented Business Plan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402092100", "headline": "Mitsubishi UFJ (MUFG) Unveils Medium-Term Business Plan", "summary": "Mitsubishi UFJ (MUFG) targets a ROE of 9% in fiscal 2026 by improving business and strengthening its customer base."}, {"date": "20240403064300", "headline": "AllianceBernstein (AB) and Societe Generale (SCGLY) Form a JV", "summary": "AllianceBernstein (AB) and Societe Generale (SCGLY) form Bernstein, which combines their cash equities and equity research businesses."}, {"date": "20240404102100", "headline": "S&P 500 Rises Ahead of Jobs Report", "summary": "NEWSPLUS  Stocks were shaking off their recent blues Thursday. Major indexes climbed ahead of the monthly jobs report due Friday. Economists project 200,000 jobs were added in March, down from 275,000 in February."}, {"date": "20240404141700", "headline": "U.S. Stocks Fall Ahead of Employment Report", "summary": "All three major U.S. stock indexes fell as Fed officials indicated the economy may not be ready for interest rate cuts so soon."}, {"date": "20240406224500", "headline": "Warning: MUFG is at high risk of cutting its dividend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412004446", "headline": "Japan's MUFG to buy stake in India's HDFC Bank unit HDB Financial, Economic Times reports", "summary": "BENGALURU (Reuters) -Japan's Mitsubishi UFJ Financial Group (MUFG) is buying a 20% stake in HDFC Bank's non-banking unit HDB Financial Services, valuing the IPO-bound subsidiary between $9 billion and $10 billion, the Economic Times reported on Friday.  The final decision is likely to take place next week at the HDFC Bank board meeting, according to the report, which cited people familiar with the matter.  MUFG is set to pick up the stake in the unit for $2 billion, and the deal is being done at five times the book value, the Economic Times reported."}, {"date": "20240412023555", "headline": "MUFG Said to Discuss Buying $1.7 Billion Stake in HDFC Unit", "summary": "(Bloomberg) -- Sign up for the India Edition newsletter by Menaka Doshi – an insider's guide to the emerging economic powerhouse, and the billionaires and businesses behind its rise, delivered weekly.Most Read from BloombergUS Sees Imminent Missile Strike on Israel by Iran, ProxiesApple Plans to Overhaul Entire Mac Line With AI-Focused M4 ChipsRussian Attacks on Ukraine Stoke Fears Army Near Breaking PointVietnam Tycoon Lan Sentenced to Death Over $12 Billion FraudUS Slams Strikes on Russia Oil"}, {"date": "20240412084700", "headline": "PRESS: Mitsubishi UFJ in talks for stake in HDFC Bank's HDB Financial", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416012700", "headline": "Buyback Bonanza: The Top 7 ETFs to Profit From Corporate Cash Splurges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417045800", "headline": "Mitsubishi UFJ Issues Multi-Billion Dollar Notes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418040600", "headline": "June 21st Options Now Available For Mitsubishi UFJ Financial Group (MUFG)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418061000", "headline": "ClearBridge International Value Strategy Q1 2024 Portfolio Manager Commentary", "summary": "The ClearBridge International Value Strategy performed in-line with its MSCI EAFE benchmark during Q1 2024. Click here to read the full letter."}, {"date": "20240419013000", "headline": "Curreen Capital Q1 2024 Investor Letter", "summary": "We bought shares in Siemens Energy, sold our shares in Link Administration and Computacenter, and added to VF Corp."}, {"date": "20240421184000", "headline": "Hong Kong Shares Rise 1.7% in Morning Trade", "summary": "Hong Kong’s Hang Seng Index rose 1.7% to 16492.80 in possible position adjustment. Focus was on the city’s CPI data due Tuesday."}, {"date": "20240422055531", "headline": "MUFG Said to Weigh Sweeter HDBF Offer as It Eyes Say in Strategy", "summary": "(Bloomberg) -- Mitsubishi UFJ Financial Group Inc. is considering sweetening its $1.7 billion offer for a minority stake in HDFC Bank Ltd.’s consumer lending unit in India, with a deal potentially hinging on valuation and the Japanese bank having a say in strategy, according to people familiar with the matter. Most Read from BloombergTrump Has Only $6.8 Million for Legal Fees With Trial UnderwayTikTok to Remove Executive Tasked With Fending Off US ClaimsChina Is Front and Center of Gold’s Record"}, {"date": "20240422072515", "headline": "Japan's MUFG mulls sweeter offer for India's HDB Financial, Bloomberg News reports", "summary": "Japan's Mitsubishi UFJ Financial Group (MUFG) is considering sweetening its $1.7 billion offer for a minority stake in Indian lender HDFC Bank's non-banking unit, Bloomberg News reported on Monday.  Both sides are looking to reach an agreement for a 20% stake in HDB Financial Services in about a month, the report said, citing people familiar with the matter.  HDFC Bank, which had a 94.84% stake in HDB Financial as of March 2023, and MUFG both did not respond to a Reuters request for comment."}, {"date": "20240422075800", "headline": "S&P 500 Rises to Kick Off Busy Earnings Week", "summary": "More than 30% of S&P 500 companies are due to release quarterly updates this week, according to FactSet.  Investors will also get the first look at first-quarter economic growth on Thursday, and the latest reading on the Fed’s preferred inflation gauge on Friday.  The S&P 500 is down 5.5% in April, on track for its worst month since December 2022."}, {"date": "20240422140600", "headline": "U.S. Stocks Rise As Tech Leads Rebound", "summary": "NEWSPLUS  1604 ET – Technology shares drive broad gains to kick off a busy week of earnings and economic data. Nvidia gains 4.4% following its worst week since September 2022, leading the charge among large tech companies."}, {"date": "20240422220058", "headline": "Australia's First Sentier Shuts $9 Billion of Funds After Growth Disappoints", "summary": "(Bloomberg) -- Australian asset manager First Sentier Investors plans to shutter investment funds with a total of A$14 billion ($9 billion) in assets under management and return the money to investors, in a retreat from low-margin business lines.Most Read from BloombergTrump Has Only $6.8 Million for Legal Fees With Trial UnderwayRay Dalio’s Famous Trade Is Sputtering, Investors BailingStocks Climb as US Earnings Kick Into High Gear: Markets WrapRussians Transform Dubai as They Flee Putin’s War:"}, {"date": "20240424042859", "headline": "Bank of England Turns Dovish Though Policymakers Are \"Divided,\" MUFG Says", "summary": "Bank of England Turns Dovish Though Policymakers Are \"Divided,\" MUFG Says"}, {"date": "20240425060500", "headline": "Baron International Growth Fund Q1 2024 Shareholder Letter", "summary": "Baron International Growth Fund gained 1.35% during the first quarter of 2024, while its primary benchmark index, the MSCI ACWI ex USA Index, was up 4.69%."}]}