{"news": [{"date": "20240408003100", "headline": "Analysts Offer Insights on Consumer Cyclical Companies: Tesla (TSLA) and Nike (NKE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408033400", "headline": "3M, Nike share gains lead Dow's 100-point jump", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409030200", "headline": "Celsius, Starbucks, McDonald's and e.l.f Beauty stand out in survey of teenagers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409030800", "headline": "Celsius, Starbucks, McDonald's and e.l.f. Beauty stand out in a survey of teenagers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409101556", "headline": "Lululemon: Teen shoppers prove 'fickle' about brand loyalty", "summary": "According to a recent survey from Piper Sandler, Nike (NKE) remains the number one brand for teenage consumers across footwear and apparel. In addition, luxury athleisure brand Lululemon (LULU), which gained popularity among younger shoppers in the past, now has seen a bit of a decline in teen interest. Piper Sandler cited this trend in its decision to cut its price target on Lululemon stock from $525 to $470. Piper Sandler VP and Senior Research Analyst Abbie Zvejnieks joins Yahoo Finance to break down some of the highlights of the survey with athletic wear and the investment bank's outlook for Lululemon's North American growth outlook. On the challenges Lululemon is facing, Zvejnieks states: \"The last two years we've seen 11% of upper-income female teens saying this was a new brand that they were wearing. That number has now dropped to around 8.5%. So, I think that new customer acquisition gets more difficult. What I think Lululemon is doing well, they are keeping up with product innovation... We think Lulu is staying very relevant within performance. But, these teen consumers tend to be fickle.\" For more expert insight and the latest market action, click here to watch this full episode of Yahoo Finance Live. Editor's note: This article was written by Nicholas Jacobino"}, {"date": "20240409214500", "headline": "Masters 2024 Preview: How To Watch, Betting Odds, Tiger Woods Props And Potential Impact Of 2 Pregnant Spouses On Tournament", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409220658", "headline": "Puma hones focus on speed in Olympic battle with Adidas and Nike", "summary": "PARIS (Reuters) -German sportswear brand Puma is using this year's Olympic Games and its partnership with sprint champions Jamaica to focus on speed as it jostles with Adidas and Nike to carve out space in an increasingly competitive running and lifestyle market.  Puma CEO Arne Freundt aims to boost sales of \"performance\" products like running shoes and soccer cleats, and has revamped Puma's \"Forever Faster\" message in its first brand campaign in a decade on Wednesday in Paris, host of this year's games."}, {"date": "20240410004700", "headline": "GLOBAL BROKER RATINGS: UBS cuts Hugo Boss, Exane BNP raises Shell", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410013000", "headline": "Teens Are Spending Less This Year. Where Their Allowances Are Going.", "summary": "According to  Piper Sandler  latest semiannual survey of teens, only 11% believe the economy is getting better, while 65% think conditions are getting worse.  In Piper Sandler’s fall 2023 survey, self-reported spending was down 1% from a year earlier.  With just 38% of survey respondents saying they held a part-time job—and the national teen labor participation rate coming in at 38.2%, well below the average of 62.7%—most teens are getting their pocket money from mom and dad."}, {"date": "20240410061200", "headline": "Nike remains a top brand for teens, but shows signs of wavering interest: survey", "summary": "The brand is still leading the way in footwear and clothing, but is beginning to lose share to On and Hoka."}, {"date": "20240410064038", "headline": "Ugly shoes are here to stay: Ugg, Crocs thriving as consumers turn to comfort", "summary": "The pandemic provided a catalyst for consumers to increasingly don casual wear to all occasions."}, {"date": "20240410080000", "headline": "Biggest Gains in Employee Engagement in the Management Top 250", "summary": "The Management Top 250 ranking, compiled by researchers at the Drucker Institute, part of Claremont Graduate University, compares companies using the late management guru  Peter Drucker’s  principles to identify the most effectively managed businesses.  The five main components of the ranking are customer satisfaction, employee engagement and development, innovation, social responsibility and financial strength.  ON’s score for employee engagement and development rose 20.5 points from a year earlier to 45.3, S&P Global’s score for the component climbed 16.8 points to 64.2, and KBR’s employee score jumped 13.9 points to 62.2."}, {"date": "20240410082948", "headline": "UPDATE 1-Puma hones focus on speed in Olympic battle with Adidas and Nike", "summary": "German sportswear brand Puma is using this year's Olympic Games and its partnership with sprint champions Jamaica to focus on speed as it jostles with Adidas and Nike to carve out space in an increasingly competitive running and lifestyle market.  Puma CEO Arne Freundt aims to boost sales of \"performance\" products like running shoes and soccer cleats, and has revamped Puma's \"Forever Faster\" message in its first brand campaign in a decade on Wednesday in Paris, host of this year's games."}, {"date": "20240410090000", "headline": "$125 Million ‘Made in Old Town’ Project Aims to Transform Portland Into Footwear Manufacturing Mecca", "summary": "A new footwear project in one of Portland's abandoned neighborhoods aims to bring new opportunities to the city."}, {"date": "20240410091337", "headline": "How New Balance tests or ‘smashes’ their latest sneaker", "summary": "From athleisure enthusiasts to sneakerheads, the footwear industry has grown into a multi-billion dollar business. Top players like Nike (NKE) and Adidas (ADDYY) have turned to design innovations and athlete partnerships to keep up with the ever-evolving zeitgeist that is sneaker culture. New Balance plans to stay ahead of their competitors through a combination of science, nostalgia, and community feedback. Yahoo Finance’s Brad Smith gets an exclusive tour of the New Balance Sports Research Lab where CEO Joe Preston demonstrates how researchers smash-test sneakers. The process involves a machine literally smashing the midsole of the shoe, simulating the impact of a runner. Watch the video above to hear what Preston says the next big revolution in sneakers is going to be. Be sure to tune into the latest episode of Lead This Way on Thursday, April 11 Editor's note: This article was written by Cindy Mizaku and Shelby Boamah."}, {"date": "20240410190314", "headline": "Nike pins hopes on Olympics in race to take back market share", "summary": "Nike is set to unveil new kits for the Olympic national teams it sponsors including the U.S. and Kenya, seeking to bolster its credentials as a performance gear brand for top athletes as well as..."}, {"date": "20240410191600", "headline": "Nike announces new line-up of footwear and apparel products", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410191700", "headline": "Stocks Bounce Back With Tech, Gold Gaining After Modest Producer Inflation Data: What's Driving Markets Thursday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410191800", "headline": "Nike Aims for Olympic Glory to Revive Sales with New Athletic Gear", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410192800", "headline": "The bar is finally low enough for Nike, analyst says. These big events could help the stock this year.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410192800", "headline": "Dow's 117-point rally highlighted by gains in shares of Nike, Apple", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410210600", "headline": "J.P. Morgan Sticks to Their Buy Rating for Nike (NKE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410210900", "headline": "The bar is finally low enough for Nike, one analyst says. These big events could help the stock this year.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410212400", "headline": "What You Missed On Wall Street On Thursday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410230314", "headline": "Nike pins hopes on Olympics to win back market share", "summary": "PARIS (Reuters) -Nike unveiled Olympic kits for the teams it sponsors on Thursday alongside athletes including Kenyan marathon star Eliud Kipchoge and British sprinter Dina Asher-Smith, betting that top athletes can help it win more everyday consumers.  After a long stretch of lacklustre sales, this summer's Olympic Games in Paris offer a fresh chance for Nike, to direct the world's attention to its performance products like the Alphafly 3 marathon shoe which retails at $285.  As well as outfitting U.S. athletes across all sports, Nike will provide kit for the athletics teams of Canada, China, Kenya, Germany, and Uganda at the Olympics, basketball for China, France, Japan, and Spain, and athletes in breaking - a new breakdancing event at the Paris Games - for Korea."}, {"date": "20240410230400", "headline": "BofA gets more bullish on Nike, upgrades shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410231000", "headline": "Nike upgraded to Buy at BofA with expectations rebased", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411010000", "headline": "The Masters tees off, putting spotlight on golf, sports and gaming stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411013300", "headline": "Apple To $210? Here Are 10 Top Analyst Forecasts For Thursday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411024100", "headline": "Unusually active option classes on open April 11th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411024100", "headline": "DoorDash upgraded, Airbnb downgraded: Wall Street's top analyst calls", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411025000", "headline": "Nike Bets On Olympics to Boost Performance Sales: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411025600", "headline": "Early notable gainers among liquid option names on April 11th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411030800", "headline": "Nike rallies after BofA says product innovation will boost shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411033300", "headline": "Unveiling Nike (NKE)'s Value: Is It Really Priced Right? A Comprehensive Guide", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411035528", "headline": "New Balance CEO Joe Preston’s strategy for the next ‘it’ shoe", "summary": "Joe Preston, CEO and President of New Balance, isn't resting on the brand's laurels and the success from the multi-year highs of demand for retro kicks. To take New Balance to the next level and compete with Nike (NKE) and Adidas (ADDYY), Preston is betting it all on innovative materials. Under Preston's leadership, New Balance has already outpaced Nike, Adidas, and Puma (PUM.DE) when it comes to revenue growth, with a 23% increase from 2022 to 2023. Preston, a New Balance veteran, began his career at the brand in 1995 and took the helm in 2018. For nearly thirty years, he's seen the company evolve from the maker of the “dad shoe” to everyone’s shoe. It has put him in a unique position to both understand the consumer’s wants and lead the brand's next evolution. \"They're looking for new. They're looking for fresh. They're looking for authenticity. Those are all elements that we're trying to deliver and present to them,\" says Preston. Yahoo Finance got a rare look at New Balance's operation, from research all the way through to manufacturing, to see how Preston’s strategy of combining innovative technology, materials, and design are all part of his bid to create the next big \"it\" performance shoe. Lead This Way is an interview series that features frank conversations with today’s leaders. The series gives consumers and investors an inside look into the innovative thinking and diverse life experiences of some of the biggest players in business to find out how they lead through change and how they define success for themselves and their organizations. For more on our Lead This Way series, click here, and tune in to Yahoo Finance Live for more expert insight and the latest market action, Monday through Friday. Editor's Note: This article was written by Shelby Boamah."}, {"date": "20240411040054", "headline": "New Balance CEO details the 'next big revolution' in sneakers", "summary": "New Balance CEO Preston may not be a molecular biophysicist, but he knows that footwear innovation is the product of scientific research."}, {"date": "20240411041340", "headline": "Nike: Dow's biggest gainer, BofA upgrades to buy", "summary": "On Thursday, Nike shares posted the strongest rise in the Dow Jones index, benefiting from a change in recommendation by BofA, which this morning upgraded to buy on the American sporting goods..."}, {"date": "20240411042001", "headline": "UPDATE 1-Nike pins hopes on Olympics to win back market share", "summary": "Nike unveiled Olympic kits for the teams it sponsors on Thursday alongside athletes including Kenyan marathon star Eliud Kipchoge and British sprinter Dina Asher-Smith, betting that top athletes can help it win more everyday consumers.  After a long stretch of lacklustre sales, this summer's Olympic Games in Paris offer a fresh chance for Nike, to direct the world's attention to its performance products like the Alphafly 3 marathon shoe which retails at $285.  As well as outfitting U.S. athletes across all sports, Nike will provide kit for the athletics teams of Canada, China, Kenya, Germany, and Uganda at the Olympics, basketball for China, France, Japan, and Spain, and athletes in breaking - a new breakdancing event at the Paris Games - for Korea."}, {"date": "20240411042900", "headline": "Top Seeking Alpha Quant picks in S&P 500 Consumer Discretionary sector ahead of earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411044100", "headline": "The consumer boycott of Planet Fitness is seen fading like other well-known examples", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411050936", "headline": "B of A Securities Upgrades NIKE (NKE)", "summary": ""}, {"date": "20240411052200", "headline": "Wall Street Lunch: Stocks For Amen Corner", "summary": "Pure golf stocks, apparel makers and gaming names could see a Masters bump. Whole sales inflation runs a little cooler in March. Amazon CEO says AI will be built on the cloud."}, {"date": "20240411053800", "headline": "IN THE KNOW: Nike back in the game now rebased forecasts look doable", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411061550", "headline": "Analyst unveils new Nike price target ahead of big summer for sports", "summary": "Nike, one of the worst-performing stocks in the Dow over the past five years, is keying on a summer of major sporting events."}, {"date": "20240411064200", "headline": "10 Consumer Discretionary Stocks Whale Activity In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411065300", "headline": "Attractive call buying opportunities for Russell 1000 stocks - JPM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411074304", "headline": "Paralympian criticizes Nike and Decathlon for refusing to sell single shoes after displaying amputee mannequins", "summary": "Stef Reid was offered a 15% discount by Nike, but couldn't purchase a single shoe from the retailer."}, {"date": "20240411075426", "headline": "Nike Stock Jumps On Upgrade As Estimates 'Finally Look Achievable' Ahead Of Paris Olympics", "summary": "BofA upgraded Dow Jones giant Nike to a buy Thursday. Estimates \"finally look achievable\" and the Paris Olympics should provide a boon."}, {"date": "20240411080100", "headline": "NIKE, Inc. Debuts New Line-Up of Products that Signals Multi-Year Innovation Cycle", "summary": "NIKE, Inc. extended its position as the undisputed leader of footwear and apparel innovation by debuting a new line-up of products that signaled a multi-year innovation cycle. Brought to life by the..."}, {"date": "20240411101800", "headline": "NEW YORK MARKET CLOSE: Soft PPI spurs tech stocks ahead of earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411104300", "headline": "Nike Stock Looks Compelling, BofA Says. It’s Had a Rough Run.", "summary": "Shares of the athletic apparel maker look relatively cheap, and Wall Street’s expectations appear to be achievable, the analyst said."}, {"date": "20240411113238", "headline": "Why Nike Stock Is Sprinting Higher Today", "summary": "One analyst is warming to this long-term winner."}, {"date": "20240411120100", "headline": "Nike Kicks Off Multi-Year Innovation Cycle", "summary": "PARIS, April 11, 2024--Today, NIKE, Inc. (NYSE: NKE) extended its position as the undisputed leader of footwear and apparel innovation by debuting a new line-up of products that signaled a multi-year innovation cycle. Brought to life by the full power of digital capabilities and cutting-edge technology, the company is delivering better, faster, more efficient solutions for athletes this summer and opening a world of creative possibilities — including Nike's first sculpted, visible Air Zoom unit"}, {"date": "20240411135948", "headline": "Nike's one biggest catalyst for 2024: Analyst explains", "summary": "Bank of America upgrades Nike (NKE) shares to a Buy rating from a Neutral rating. Bank of America Securities Analyst Lorraine Hutchinson — who was behind the stock call — wrote that \"estimates finally look achievable\" and that the brand's valuation is \"finally looking compelling\" in her note to investors. Hutchinson sits down with Market Domination to discuss Nike's revised growth narrative as it makes some of its more sought-after Jordan shoes accessible and prepares for the tidal wave of exposure expected from the 2024 Summer Olympic Games. \"What we expect is that newness and innovation to hit. We then anticipate a lot of marketing and demand creation spending in their first quarter ahead of the Olympics,\" Hutchinson states. \"When we look back, Olympic quarters have grown about 500 basis points above a regular 1Q, because of all this effort, all this product. I think it's a really exciting time for Nike, and I think they will try to capitalize on that moment by really bring the innovation.\" For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Luke Carberry Mogan."}, {"date": "20240411164445", "headline": "Nike Brings Brand Power to Paris Ahead of Olympics; Medalists Dawn Staley and Jordan Chiles Meet", "summary": "The athleticwear brand aimed to quiet critics with a three-day \"innovation summit,\" while athletes were on hand to model. Basketball coach Dawn Staley and gymnast Jordan Chiles met for the first time at WWD's shoot."}, {"date": "20240411174132", "headline": "10 Best High Volume Stocks To Buy According to Hedge Funds", "summary": "In this piece, we will take a look at the ten best high volume stocks to buy according to hedge funds. If you want to skip our coverage of the latest stock market news, then you can take a look at the 5 Best High Volume Stocks To Buy According to Hedge Funds. With the […]"}, {"date": "20240411223126", "headline": "Nike: China Growth Engine Does Not Exist Anymore", "summary": "Nike's stock price decline by 17% is attributed to sluggish growth in China and market share loss to local players, impacted by weak consumer confidence. See more."}, {"date": "20240411231148", "headline": "U.S. Wide-Moat Stocks On Sale - The April 2024 Heat Map", "summary": "Our 3-step process focuses on wide-moat stocks (as per Morningstarâ\u0080\u0099s rating). Read more to see the April 2024 heat map."}, {"date": "20240411234320", "headline": "Nike: Gearing Up For The Olympics Through Innovation", "summary": "The upcoming Paris Summer Olympics could provide a catalyst for Nike's latest innovations. Find out if NKE stock is a buy."}, {"date": "20240412012900", "headline": "GLOBAL BROKER RATINGS: JPMorgan raises Persimmon, BoA raises Nike", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412023040", "headline": "Q4 Earnings Recap: Deckers (NYSE:DECK) Tops Footwear Stocks", "summary": "As the Q4 earnings season comes to a close, it’s time to take stock of this quarter's best and worst performers in the footwear industry, including Deckers (NYSE:DECK) and its peers."}, {"date": "20240412025700", "headline": "Energy, tech, comms among top-rated S&P 500 sectors as Q1 earnings kicks off", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412031500", "headline": "Tiger Woods Masters Record: Will Legendary Golfer Make The Cut? Here's What Benzinga Users Say", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412063800", "headline": "Buy/Sell: Wall Street's top 10 stock calls this week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412071831", "headline": "Nike bosses plan 'biggest' Olympics spend as marketing ramps up", "summary": "Nike is spending more on this Olympics than any previous Games, top executives said on Friday, as the U.S. sportswear brand embarks on a marketing push it hopes will revive flagging sales and help compete with upstart rivals.  Sponsored athletes including U.S. sprinter Sha'Carri Richardson and Kenyan marathoner Eliud Kipchoge modeled Nike's Olympics kits at a show in Paris on Thursday, where the brand also unveiled 13 futuristic shoe prototypes developed with athletes.  \"This Olympics will be our biggest ... it will be our largest media spend,\" Heidi O'Neill, president of consumer, product and brand at Nike said in an interview."}, {"date": "20240412084800", "headline": "Skimpy Women’s Olympics Uniforms Cause Uproar", "summary": "The “Baywatch”-style Nike Olympics track-and-field kit revealed this week in Paris drew criticism from runners. “It’s honestly disrespectful.”"}, {"date": "20240413001000", "headline": "Ensemble Capital Management Q1 2024 Letter", "summary": "After outperforming the market handily in the previous quarter, our strategy produced returns in line with the S&P 500 this quarter. Click here to read more."}, {"date": "20240413054000", "headline": "Wall Street's Top 10 Stock Calls This Week - Saturday, April 13", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240413090100", "headline": "3 Dow Jones Dividend Stocks That Are Within 6% of Their 52-Week Lows to Buy Now", "summary": "Some well-known stocks have been noticeably absent from the market rally."}, {"date": "20240413114138", "headline": "Athletics-Olympians criticise Nike for skimpy women's kit", "summary": "Nike's Team USA track and field kit for women is needlessly revealing and sexist, women athletes have said after the U.S. sportswear brand unveiled its outfits for this summer's Olympic Games.  \"They are absolutely not made for performance,\" U.S. steeplechaser Colleen Quigley said in a message to Reuters.  Debate has raged for years over more revealing outfits for women Olympians in disciplines from beach volleyball to gymnastics, and some rules on competition wear are changing."}, {"date": "20240413182750", "headline": "Olympic track uniforms spark online debate about who designed them and why they're so skimpy", "summary": "U.S. track and field athletes have around four dozen pieces to choose from when assembling their uniforms at the Olympics.  USA Track and Field said uniform maker Nike consulted with several athletes while designing the uniforms, which were unveiled in Paris earlier this week.  Among those taking part in the rollout were world champion sprinter Sha'Carri Richardson and Olympic gold medalist Athing Mu, who wore versions of the uniform that covered more than the kit that grabbed so much attention."}, {"date": "20240414021700", "headline": "1 Stock That Turned $1,000 Into More Than $800,000", "summary": "Investors can learn a lot by looking at this company's monumental rise."}, {"date": "20240414140339", "headline": "Nike’s boss says remote work was hurting innovation, so the company realigned and is ‘ruthlessly’ focused on building a disruptive pipeline", "summary": "\"And in hindsight, it turns out, it’s really hard to do bold, disruptive innovation, to develop a boldly disruptive shoe on Zoom.\""}, {"date": "20240414210000", "headline": "Nike (NYSE:NKE) Gains With New Products, Olympic Fervor", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414213200", "headline": "Dollar Reaching Key Break Point: Brace for Stock Market Impact?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414214500", "headline": "Nike (NYSE:NKE) Gains on New Products, Olympic Fervor", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414230000", "headline": "Nike Stock Has 22% Upside, According to 1 Wall Street Analyst", "summary": "Bank of America thinks Nike is ready for a rebound."}, {"date": "20240415020100", "headline": "Skechers: A Runaway Growth Story That Won't Give You Blisters", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415020137", "headline": "Footwear Stocks Q4 Highlights: Steven Madden (NASDAQ:SHOO)", "summary": "Wrapping up Q4 earnings, we look at the numbers and key takeaways for the footwear stocks, including Steven Madden (NASDAQ:SHOO) and its peers."}, {"date": "20240415022925", "headline": "Betting On The Swoosh: Why Nike Deserves A Spot In Your Portfolio", "summary": "Nike has implemented a successful restructuring plan and is well-positioned for long-term growth. Check out why I rate NKE stock a buy."}, {"date": "20240415040300", "headline": "Nike Inc (NKE)'s Winning Formula: Financial Metrics and Competitive Strengths", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415061500", "headline": "Nike leans on Air for multiyear innovation cycle", "summary": "After acknowledging the need for more innovation, the sports brand is rolling out a new product lineup and an athlete co-creation process."}, {"date": "20240415064700", "headline": "Nike momentum picks up ahead of high-profile product launches", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415074418", "headline": "Nike Starts Speeding Out Sneakers That Will Shape Its Future", "summary": "(Bloomberg) -- Nike Inc. picked the Palais Brongniart, the former home of the Paris stock exchange, as the venue for its most high-stakes product launch in years.Most Read from BloombergIsrael Versus Iran — What All-Out War Could Look LikeApple Faces Worst iPhone Slump Since Covid as Rivals RiseIran’s Attack on Israel Sparks Race to Avert a Full-Blown WarSingapore PM Lee to Hand Reins to Wong After Two DecadesTexas Warns of Possible Power Emergency Next WeekOn display behind the Corinthian colon"}, {"date": "20240415093316", "headline": "Adidas Could Benefit From Nike’s Innovation Struggles, Morgan Stanley Says", "summary": "(Bloomberg) -- Sports footwear fashion trends are swinging to Adidas AG’s favor amid product innovation struggles by rival Nike Inc., according to Morgan Stanley analysts.Most Read from BloombergIsrael Versus Iran — What All-Out War Could Look LikeApple Faces Worst iPhone Slump Since Covid as Rivals RiseIran’s Attack on Israel Sparks Race to Avert a Full-Blown WarSingapore PM Lee to Hand Reins to Wong After Two DecadesGoldman Traders Deliver Surprise Profit SurgeEvolving trends are seeing people"}, {"date": "20240415105149", "headline": "Nike on the back foot as shoppers flock to Adidas for Sunak’s favourite trainers", "summary": "When Rishi Sunak was spotted wearing a pair of Adidas Sambas, the backlash from fashionistas was so severe he was forced to say sorry."}, {"date": "20240415113153", "headline": "3 Must-Own Retail Stocks Primed for a Tax Refund Rally", "summary": "Tax refunds from the Internal Revenue Service (IRS) are up this year. The tax agency reports the average refund issued so far in 2024 is worth $3,182, up 5.1% from $3,028 last year. This is good news for tax filers who likely already have in mind what they will do with their refund. And it’s a safe bet that a lot of people will spend at least a portion of their tax refund at retail outlets. After all, spending by consumers accounts for nearly 70% of the American economy. The retail sector in the"}, {"date": "20240415122014", "headline": "3 Activewear Stocks I’d Rather Buy Than Lululemon or Nike", "summary": "Popular activewear stocks have really taken a beating over the past several months, led lower by such names as yoga top dog Lululemon (NASDAQ:LULU), which is now down a whopping 34% from its late-2023 high, and sneaker behemoth Nike (NYSE:NKE), down 48% from its late-2021 peak. Undoubtedly, the period of weakness has caused some to draw comparisons to perpetual apparel underperformer Under Armor (NYSE:UA), which is off more than 85% from its 2016 all-time high. Such comparisons may be unwarrante"}, {"date": "20240415130000", "headline": "3 Brands That Should Sign Caitlin Clark After Her Viral March Madness Run", "summary": "The most obvious Caitlin Clark stocks are Nike (NYSE:NKE) and PepsiCo (NASDAQ:PEP). The NCAA basketball phenom already has deals with the two public companies. Although the soon-to-be WNBA star failed to win the NCAA Tournament for the second year in a row, she’s a marketer’s dream, so there will be no shortage of powerful companies looking to sign her to long-term sponsorships. She’ll undoubtedly make millions in the next few years. However, as she said at the Iowa Hawkeye’s celebration at thei"}, {"date": "20240415202600", "headline": "Bernstein Reaffirms Their Buy Rating on Nike (NKE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416022100", "headline": "How Is The Market Feeling About Nike?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416031924", "headline": "Nike (NKE) Declined as it Warned Shareholders Of a Potential Lower-Than-Expected Growth", "summary": "Ensemble Capital Management, an investment management company, released its first quarter 2024 investor letter. A copy of the same can be downloaded here. During the quarter, the strategy gained 10.48% compared to the S&P 500’s 10.56% return. The stock market rallied by 10.56% in Q1 2024, adding to the 11.69% rally in Q4 2023. The strategy […]"}, {"date": "20240416045800", "headline": "Sephora taps Nike vet to lead Greater China", "summary": "Xia Ding spent five years at the activewear giant and also brings experience from HanesBrands and JD.com."}, {"date": "20240416063900", "headline": "10 Consumer Discretionary Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416070014", "headline": "Is Trending Stock NIKE, Inc. (NKE) a Buy Now?", "summary": "Nike (NKE) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects."}, {"date": "20240416103658", "headline": "Plan For A Secure Retirement With A $100,000 Aggressive, 15-Stock Dividend Growth Portfolio", "summary": ""}, {"date": "20240416141100", "headline": "Brian's Big Idea On Shoes", "summary": "A look at three stocks and the Insider Trader Service at Zacks."}, {"date": "20240416205400", "headline": "3 Blue-Chip Stocks to Buy Now: Q2 Edition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416211000", "headline": "Earnings Season Heats Up, Spotting 2 Unusual Reporting Dates In The Consumer Space", "summary": "March CPI data was not what the bulls wanted to see, just as concerns about household spending emerge."}, {"date": "20240416215100", "headline": "Caitlin Clark Will Make $76,000 A Year At The WNBA: Journalist Asks 'Is This Even A Living Wage?'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416220100", "headline": "Summer’s Coming: 3 Exciting Stocks to Buy That Aren’t Disney", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416235600", "headline": "History of Nike: Company timeline and facts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417010000", "headline": "ClearBridge Sustainability Leaders Strategy Q1 2024 Portfolio Manager Commentary", "summary": "U.S. equities continued their upward march in the first quarter as the momentum rally, begun following Novemberâ\u0080\u0099s inflation print, showed few signs of flagging."}, {"date": "20240417014600", "headline": "Telsey Advisory Reaffirms Their Buy Rating on Nike (NKE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417041900", "headline": "Nike Options Trading: A Deep Dive into Market Sentiment", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417045003", "headline": "Adidas Beat Nike in the First Quarter, Warburg Says", "summary": "Adidas's strong first-quarter figures suggest sales at the German sneaker and sports-apparel maker grew faster than at rival Nike, Warburg Research analyst Joerg Philipp Frey says in a research note.  The company raised its guidance for the full year after first-quarter sales grew 8% excluding currency movements, outgrowing Nike by about eight percentage points, Warburg said.  The first-quarter performance and expectations that currency headwinds will abate somewhat and that its product mix will have positive effects in the second half give Warburg confidence that Adidas's gross margin will substantially beat expectations, the analyst says."}, {"date": "20240417120913", "headline": "Nike’s Women’s Olympic Uniform for USA Track and Field Criticized for Being Too Revealing: The Controversy Explained", "summary": "All about the controversy and how athletes are responding."}, {"date": "20240417133120", "headline": "Still-In-The-Woods Adidas Provides Glimpse Of Recovery With A Lifted Guidance", "summary": "In an unscheduled announcement, Adidas AG (OTC: ADDYY) (OTC: ADDDF) raised its 2024 profit outlook after a better than expected first quarter. The good news come a month after the German sportswear giant posted its first annual loss in more than three decades and warned sales in North America will fall again due to the struggle of U.S. retailers with high inventory levels. Adidas has also been battling to restore its vitality after a costly split from Kanye West in October 2022 and suspending sa"}, {"date": "20240417143000", "headline": "Women’s Sports Boom: Don’t Miss These 7 Stocks Cashing In on Caitlin Clark Mania", "summary": "Caitlin Clark is a highly celebrated former NCAA basketball star who was selected as the first pick in the 2024 WNBA draft by the Indiana Fever. She is famous for her record-breaking college basketball career, where she established herself as one of the greatest players in NCAA history, holding the all-time scoring and assist records for both men and women. This Caitlin Clark Mania could be having a bleed-over effect to women’s sports stocks. Apparel and equipment companies that cater to the wom"}, {"date": "20240418010100", "headline": "Nike is close to inking a huge endorsement deal with Caitlin Clark", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418031500", "headline": "Ensemble Fund Q1 2024 Investment Update", "summary": "Ensemble Fund's quarterly letter reviews the fundâ\u0080\u0099s first quarter 2024 performance and highlight a couple portfolio companies. Click here to read more."}, {"date": "20240418053800", "headline": "Nike nearing endorsement deal with Caitlin Clark, The Athletic reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418062600", "headline": "Wall Street Lunch: A Nike-Caitlin Clark Collab?", "summary": "Nike is reportedly close to signing an eight-figure endorsement deal with college basketball star Caitlin Clark, which would include a signature shoe. April Philly Fed index rose to 15.5."}, {"date": "20240418063800", "headline": "$100 Invested In Nike 20 Years Ago Would Be Worth This Much Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418195700", "headline": "Nike details some of its jobs cuts tipped off late last year", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419002100", "headline": "Nike's Sneaker Coup: Reportedly Nears Lucrative Deal With Basketball Sensation Caitlin Clark", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419003900", "headline": "Nike's Germany kit deal \"inexplicable\", says Adidas CEO Gulden", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419025000", "headline": "Down 32%, Is Lululemon Stock (NASDAQ:LULU) a Buy Now?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419042500", "headline": "Seaport Research footwear/apparel analyst holds analyst/industry conference call", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419044100", "headline": "Athleisure is top dog in the teen closet: Here’s what the numbers say", "summary": "While the cohort’s spending is down, clothing remains a popular purchase."}, {"date": "20240419053700", "headline": "Here’s Why Nike (NKE) Fell in Q1", "summary": "Polen Capital, an investment management company, released its “Polen Focus Growth Strategy” first quarter 2024 investor letter. A copy of the same can be downloaded here. The US stock market started 2024 optimistically. In the first quarter, the fund returned 8.29% (gross) and 8.09% (net) compared to 11.41% for the Russell 1000 Growth Index and […]"}, {"date": "20240419064600", "headline": "Skechers USA Unlikely To Raise Outlook Due To Eurozone Hurdles, Says Analyst", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419072241", "headline": "Higher oil prices, shipping disruptions create a double-edged sword for retailers", "summary": "Higher freight costs and lower consumer buying power could hit retailers in the coming months."}, {"date": "20240419081500", "headline": "Are These Beaten-Down S&P 500 Members Worth a Buy?", "summary": "The performance of a few S&P 500 members in 2024 has left a sour taste in investors' mouths, with several beloved stocks unable to gain any meaningful traction. But is it a buying opportunity?"}, {"date": "20240419094115", "headline": "Approximately 740 Nike Employees Being Laid Off In Oregon Layoff Will Take Effect By June 28, 2024 - WARN Notice", "summary": "April 19 - * APPROXIMATELY 740 NIKE EMPLOYEES BEING LAID OFF IN OREGON;LAYOFF WILL TAKE EFFECT BY JUNE 28, 2024 - WARN NOTICEFurther company coverage: ..."}, {"date": "20240419095821", "headline": "Nike Layoffs at World Headquarters to Reach 740", "summary": "By Stephen Nakrosis Nike said on Friday it would lay off a total of about 740 employees at its world headquarters in Beaverton, Ore. The sports footwear and apparel company said in..."}, {"date": "20240419110706", "headline": "GB News to axe 40 jobs weeks after revealing heavy losses", "summary": "GB News is to cut 40 jobs as the opinionated broadcaster battles to stem losses."}, {"date": "20240419141000", "headline": "Top Analyst Reports for Costco, NIKE & Fiserv", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Costco Wholesale Corporation (COST), NIKE, Inc. (NKE) and Fiserv, Inc. (FI)."}, {"date": "20240419145743", "headline": "Nike to lay off 740 employees at Oregon headquarters", "summary": "The \"second phase of impacts\" would begin by June 28 at its headquarters, Michele Adams, Nike's vice president for people solutions, said in a legally mandated notice to state authorities.  Nike had in December announced a cost savings plan for $2 billion over the next three years, and in February said it would cut about 2% of its total workforce, or more than 1,600 roles.  It had about 83,700 employees as of May 31, 2023."}, {"date": "20240419153500", "headline": "Nike and Lululemon Athletica Are Cutting Staff in a Tough Year for Sports Gear", "summary": "Nike is laying off approximately 740 employees, while Lululemon is trimming a little over 128 jobs as it shutters a distribution center."}, {"date": "20240419190000", "headline": "How Nike Won the Battle for Caitlin Clark", "summary": "Some of the world’s biggest shoe brands made a run at the Iowa superstar. The swoosh prevailed by offering an Olympic-sized deal."}, {"date": "20240419205100", "headline": "Nike Plans Oregon Headquarters Job Cuts Amid Revenue Decline Predictions: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420223700", "headline": "Puma eyes taking on Adidas and Nike in US sports goods market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421015100", "headline": "7 Budget-Friendly Retail Plays Due for a Tax Refund Spending Boost", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421020400", "headline": "Sneakerheads losing interest and spending less", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421033607", "headline": "High-Quality Dividend Growth Near 52-Week Lows: Apple Is Attractive", "summary": "The current risks facing Apple appear to be well managed, and the fundamental business is well positioned. Read why I'm bullish on AAPL stock."}, {"date": "20240421050600", "headline": "Nike Stock (NYSE:NKE): Will the Footwear Giant Regain its Mojo?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421190000", "headline": "Nike Reverses Course as Innovation Stalls and Rivals Gain Ground", "summary": "Shoe giant stumbled as CEO John Donahoe pulled away from retailers and relied on old hits. Now it says it’s refocusing on cutting-edge footwear for athletes."}, {"date": "20240422030800", "headline": "Nike Layoffs 2024: What to Know About the Latest Nike Job Cuts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422032300", "headline": "Adient Layoffs 2024: What to Know About the Latest Adient Job Cuts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422035500", "headline": "LI Stock Alert: Li Auto Crumbles as Competition Forces Price Cuts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422043000", "headline": "Forget the Noise: Buy These 3 Unfairly Punished Stocks Before Earnings Euphoria Hits", "summary": "Earnings season is a time when many companies redeem themselves. It doesn’t take much for a beaten down stock to turnaround. A strong quarterly print and upbeat guidance can lead to a big reversal higher in a share price. The stock of United Airlines (NYSE:UAL) just rose 17% in a single day after the carrier issued better-than-expected financial results and offered a bullish outlook to Wall Street. The post-earnings bump pushed UAL stock into positive territory for the year. So, whose next? Whic"}, {"date": "20240422044000", "headline": "Put $5,000 in These 7 Blue-Chip Stocks Today", "summary": "If you’re looking for reliability in a crazed market, jump into safer blue-chip stocks. While they’re not all the most exciting stocks on the market, they have proven themselves to be ultra-reliable in any economic environment. They all have proven business models, strong track records, sales, reputations and oftentimes, dividends to boot. That’s because most offer products and services that millions of us use every day. Even better, after a recent pullback in the broader markets, some of the to"}, {"date": "20240422060900", "headline": "Second phase of Nike layoffs to hit Oregon headquarters this summer", "summary": "After the job cuts, effective June 28, about 740 employees will have been impacted in the retailer’s home state."}, {"date": "20240422070443", "headline": "Be Greedy When Others Are Fearful, Even If They Are Fearful For A Good Reason", "summary": "Investors caught off guard by increased geopolitical risk may face short-term selling pressure, potentially worsening the S&P 500's drawdown. Read here for details."}, {"date": "20240422074700", "headline": "The Zacks Analyst Blog Highlights Costco Wholesale, NIKE, Fiserv, UnitedHealth and America Movil", "summary": "The Zacks Analyst Blog Highlights Costco Wholesale, NIKE, Fiserv, UnitedHealth and America Movil"}, {"date": "20240422075006", "headline": "Nike (NKE) is a Top-Ranked Momentum Stock: Should You Buy?", "summary": "Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores."}, {"date": "20240422093427", "headline": "Caitlin Clark will reportedly sign a sneaker deal with Nike", "summary": "Caitlin Clark is reportedly set to wear her own signature Nike sneaker in the WNBA."}, {"date": "20240422152155", "headline": "Caitlin Clark to sign $28 million deal with Nike to get her own sneaker", "summary": "Caitlin Clark is set to cash in on her popularity with a historic Nike endorsement deal that would make her one of only three WNBA players with their own shoe line."}, {"date": "20240422155647", "headline": "30 Countries That Receive the Most Aid From ILO", "summary": "In this article, we take a look at 30 countries that receive the most aid from ILO. If you would like to skip our detailed analysis of ILO funding, you can directly go to 5 Countries That Receive the Most Aid From ILO. The International Labor Organization exists to promote decent work opportunities and labor […]"}, {"date": "20240422230400", "headline": "3 Blue-Chip Stocks to Buy at a 52-Week Low in April", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423010127", "headline": "Churchill Downs (CHDN) Q1 Earnings Report Preview: What To Look For", "summary": "Racing, gaming, and entertainment company Churchill Downs (NASDAQ:CHDN) will be reporting earnings tomorrow after market close. Here's what you need to know."}, {"date": "20240423031211", "headline": "Trending tickers: Tesla, ABF, Novartis, Taylor Wimpey, JD Sports", "summary": "The latest investor updates on stocks that are trending on Tuesday."}, {"date": "20240423045000", "headline": "Madison Covered Call And Equity Income Fund Q1 2024 Investment Strategy Letter", "summary": "Early in the first quarter, the S&P 500 blasted through the previous all-time high set at the end of 2021 and momentum carried the market steadily higher with very little resistance."}, {"date": "20240423105054", "headline": "Caitlin Clark is set to sign a new Nike deal valued at $28 million over 8 years, reports say", "summary": "Caitlin Clark appears to be on the cusp of setting another record.  The most prolific scorer in NCAA Division I history and the No. 1 overall pick in the WNBA draft will continue her association with Nike by signing a $28 million contract that spans eight years and includes a signature shoe.  The Wall Street Journal and The Athletic reported the pending deal, citing unnamed people familiar with the negotiations between the sportswear giant and Clark's agents."}, {"date": "20240423223000", "headline": "Madison Sustainable Equity Fund Q1 2024 Investment Strategy Letter", "summary": "Equity markets had a solid start to the year, with the S&P 500 up 10.6%. The Madison Sustainable Equity Fund lagged the S&P 500 for the first quarter."}, {"date": "20240424010348", "headline": "Strategic Education (STRA) To Report Earnings Tomorrow: Here Is What To Expect", "summary": "Higher education company Strategic Education (NASDAQ:STRA) will be reporting results tomorrow before market hours. Here's what you need to know."}, {"date": "20240424010441", "headline": "Skechers (SKX) Q1 Earnings: What To Expect", "summary": "Footwear company Skechers (NYSE:SKX) will be announcing earnings results tomorrow after market hours. Here's what investors should know."}, {"date": "20240424010738", "headline": "What To Expect From Mohawk Industries’s (MHK) Q1 Earnings", "summary": "Flooring manufacturer Mohawk Industries (NYSE:MHK) will be announcing earnings results tomorrow after the bell. Here's what you need to know."}, {"date": "20240424074500", "headline": "Forget Nike: Buy This Magnificent Growth Stock Instead", "summary": "This smaller business is reporting much better revenue and earnings growth."}, {"date": "20240424214000", "headline": "Nike Inc. Cl B stock falls Thursday, underperforms market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425002900", "headline": "Wells Fargo Keeps Their Buy Rating on Nike (NKE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425010103", "headline": "What To Expect From Charter's (CHTR) Q1 Earnings", "summary": "Cable, internet, and telephone services provider Charter (NASDAQ:CHTR) will be reporting results tomorrow morning. Here's what to expect."}, {"date": "20240425033000", "headline": "The Tricky Logistics Behind Direct-to-Consumer Sales Strategies", "summary": "Suppliers stepping up efforts to reach shoppers are having to mount costly new supply chains built to the task."}, {"date": "20240425040000", "headline": "3 Dow Stocks to Buy on the Dip: April 2024", "summary": "The Dow Jones Industrial Average is America’s longest-running major stock index. Founded in 1896, the Dow Jones serves as a trusted gauge of America’s leading companies. Many investors and analysts have switched to other preferred indexes, such as the S&P 500 or Nasdaq 100. However, the Dow’s tradition, long price and chart history, and different mix of constituent components make it a worthwhile metric in the 21st century. While the Dow Jones only has 30 holdings, it manages to have a great mix"}, {"date": "20240425093739", "headline": "10 Best Consumer Discretionary Dividend Stocks To Buy According to Analysts", "summary": "In this article, we discuss 10 best consumer discretionary dividend stocks to buy according to analysts. You can skip our detailed analysis of the consumer discretionary sector and its performance in the past, and go directly to read 5 Best Consumer Discretionary Dividend Stocks To Buy According to Analysts. Consumer discretionary stocks are highly influenced […]"}, {"date": "20240426030500", "headline": "$1000 Invested In Nike 15 Years Ago Would Be Worth This Much Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426055647", "headline": "The 25 Best Sportswear Brands in the World", "summary": "In this article, we shall discuss the 25 best sportswear brands in the world. To skip our detailed analysis of the global sports apparel industry in 2024, go directly and see The 10 Best Sportswear Brands in the World. The Global Sports Apparel Industry: An Overview Sports apparel refers to the clothes that one wears […]"}, {"date": "20240426233200", "headline": "3 Fashion Stocks to Buy Before Summer 2024 Heats Up", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428011000", "headline": "3 Growth Stocks to Buy and Hold Forever", "summary": "The \"forever\" part of the requirement narrows the list of prospects quite a bit."}, {"date": "20240428020500", "headline": "Retail facing challenges this year, but a few names stand out above the rest - analyst", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428220000", "headline": "What You Missed On Wall Street On Monday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428225900", "headline": "IN THE KNOW: JD Sports buy of Hibbett has \"execution risks\" - Barclays", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429023300", "headline": "5 Dividend Growth Stocks With Upside To Analyst Targets", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429030500", "headline": "7 Retirement Stocks to Buy at a 52-Week Low in April", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429032700", "headline": "Nike to alter MLB uniforms by 2025 after complaints, The Athletic reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429053600", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429101741", "headline": "Correction: Nike Expected to Change Parts of Major League Baseball Uniforms by 2025, The Athletic Reports", "summary": "Correction: Nike Expected to Change Parts of Major League Baseball Uniforms by 2025, The Athletic Reports"}, {"date": "20240429114729", "headline": "After MLB player grievances over see-through, sweat-drenched uniforms, Nike concedes to 2025 upgrades", "summary": "In 2019, Nike and Fanatics struck a 10-year, $1 billion deal with MLB to produce the league’s uniforms."}, {"date": "20240429220600", "headline": "Adidas Puts Yeezy History Behind, Rides Fashion High With Samba And Gazelle Shoes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429222117", "headline": "NIKE: Still Overvalued After Poor Stock Performance", "summary": "The fundamentals suggest that NIKE (NKE) is still overvalued and should continue to underperform. See why we are bearish on NKE stock."}, {"date": "20240429235327", "headline": "UPDATE 3-Samba, Gazelle shoes help drive Adidas sales while North America lags", "summary": "Sales growth in Europe and China helped drive Adidas' strong first-quarter results, while North America was a weak spot as retailers remain overstocked, the German sportswear brand said on Tuesday.  Adidas has been on a turnaround journey since a damaging breakup with rapper Ye ended its highly profitable Yeezy shoe line and it reported a loss for 2023, but the company's sales have recently been boosted by the popularity of its \"terrace\" shoes such as the Samba and Gazelle.  Adidas CEO Bjorn Gulden said the lifestyle business drove sales in the first quarter, and that demand for terrace shoes was still growing."}, {"date": "20240429235507", "headline": "Nike: Trust The Brand Equity", "summary": "Nike boasts robust brand equity and holds a dominant position in an industry that is poised for sustained growth. See why I think NKE stock is a buy."}, {"date": "20240430010238", "headline": "Life Time (LTH) Reports Q1: Everything You Need To Know Ahead Of Earnings", "summary": "Premium fitness club Life Time (NYSE:LTH) will be announcing earnings results tomorrow before market hours. Here's what investors should know."}, {"date": "20240430010625", "headline": "What To Expect From Steven Madden's (SHOO) Q1 Earnings", "summary": "Shoe and apparel company Steven Madden (NASDAQ:SHOO) will be announcing earnings results tomorrow before market open. Here's what investors should know."}, {"date": "20240430011100", "headline": "Analysts Conflicted on These Consumer Cyclical Names: Nike (NKE), Boyd Gaming (BYD) and Taylor Morrison (TMHC)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430024704", "headline": "Adidas could not match Nike's offer for Germany soccer federation, CEO says", "summary": "Adidas CEO Bjorn Gulden said the German brand could not match Nike's offer for Germany's national soccer federation sponsorship, after the U.S. company beat Adidas on its home turf last month to end its 70-year partnership with the federation.  Nike outbid Adidas to become the official supplier for the German Football Association (DFB) and will supply all national teams from 2027 to 2034."}, {"date": "20240430025833", "headline": "Olympics-No joke as Kid Karam eyes breaking new ground in Paris", "summary": "Weeks before his eighth birthday, Karam Singh joked about becoming a break dancer while watching a Justin Timberlake video and, 16 years on, Kid Karam is preparing for the Paris 2024 Olympics.  The 26-year-old from Derby, England, the first breaker to land a sponsorship deal with Nike and a Samsung Galaxy ambassador, is using his breaking community's \"superpower\" to climb the rankings as he prepares for the Olympic Qualifying Series (OQS).  Breaking, an acrobatic style of street dancing, is making its Olympic debut in Paris and Singh will have the perfect opportunity to make his mark on the Place de la Concorde if he claims one of the 10 qualifying spots available at events in Shanghai and Budapest starting in May."}, {"date": "20240430043735", "headline": "Soccer-FIFPRO, Nike and others team up to study ACL injuries in women's game", "summary": "A growing chorus of women's soccer players have called for research into anterior cruciate ligament (ACL) tears, one of sport's most debilitating injuries and one that women are between two and six times more likely to suffer than men.  Project ACL, which was launched on Tuesday by several collaborating partners with hopes of reducing ACL injuries in the women's game, is a response to that call, said Alex Culvin of global players' union FIFPRO.  FIFPRO, the Professional Footballers' Association, Nike and Leeds Beckett University have teamed up for the three-year project which will focus on England's 12-team Women's Super League (WSL)."}, {"date": "20240430044302", "headline": "UPDATE 1-Adidas decided not to match Nike's offer for German soccer federation, CEO says", "summary": "Adidas CEO Bjorn Gulden said the German brand decided not to match Nike's offer for Germany's national soccer federation sponsorship after the U.S. company beat Adidas on its home turf last month to end its 70-year partnership with the federation.  Nike outbid Adidas to become the official supplier for the German Football Association (DFB) and will supply all national teams from 2027 to 2034."}, {"date": "20240430050100", "headline": "A Glimpse Into The Expert Outlook On Nike Through 29 Analysts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430063600", "headline": "Discount Alert! 7 Hot Stocks Heading for the Clearance Rack.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430084920", "headline": "25 Richest Billionaires in Sports Industry", "summary": "In this article, we discuss the 25 richest billionaires in sports industry. To skip our detailed analysis of the sports industry, go directly to the 5 Richest Billionaires in Sports Industry. Sports Industry Outlook Sports is one of the most diversified industries in the world with sectors including esports, gambling, fitness, sporting clubs, media rights, […]"}, {"date": "20240430085444", "headline": "Top 11 Luxury Clothing Stocks to Invest in Now", "summary": "In this article, we discuss the top 11 luxury clothing stocks to invest in now. To skip the detailed analysis of the luxury goods industry, go directly to the Top 5 Luxury Clothing Stocks to Invest in Now. Brand Affinity Guides Spending Behavior In an interview with CNBC on March 7, the CEO of luxury […]"}, {"date": "20240430104611", "headline": "Nike Faces Talent Loss, Lacks Innovation Spark Amid Aggressive Competition, Wedbush Says", "summary": "Nike Faces Talent Loss, Lacks Innovation Spark Amid Aggressive Competition, Wedbush Says"}, {"date": "20240430191300", "headline": "Dow Jones Industrial Average Struggles To Recover From Recent Backslide As Fed Rounds Corner", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430201900", "headline": "Stock Market Crash Warning: Don’t Get Caught Holding These 3 Blue-Chip Stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501010246", "headline": "Xponential Fitness (XPOF) To Report Earnings Tomorrow: Here Is What To Expect", "summary": "Boutique fitness studio franchisor Xponential Fitness (NYSE:XPOF) will be reporting earnings tomorrow after the bell. Here's what to look for."}, {"date": "20240501010947", "headline": "Earnings To Watch: Live Nation (LYV) Reports Q1 Results Tomorrow", "summary": "Live events and entertainment company Live Nation (NYSE:LYV) will be reporting earnings tomorrow afternoon. Here's what to look for."}, {"date": "20240501034800", "headline": "A Closer Look at Nike's Options Market Dynamics", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501041800", "headline": "Video: Dow Movers: NKE, AMZN", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501063900", "headline": "7 Stocks That Will Continue to Climb Even When the Market Crashes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501073400", "headline": "Cord-Cutting 2.0: Cause for Worry?", "summary": "We also take a look at On Holding's appeal for shoe lovers and stockholders."}, {"date": "20240502034146", "headline": "In data: Nike, Uniqlo, Adidas among China consumer favourites", "summary": "International sportswear brands are winning over consumers in China, according to new research from GlobalData."}, {"date": "20240502070015", "headline": "Here is What to Know Beyond Why NIKE, Inc. (NKE) is a Trending Stock", "summary": "Nike (NKE) has been one of the stocks most watched by Zacks.com users lately. So, it is worth exploring what lies ahead for the stock."}, {"date": "20240502121548", "headline": "12 Best Alternatives to Adidas Samba", "summary": "In this piece, we are about to shed light on 12 Best Alternatives to Adidas Samba. If you wish to skip our detailed discussion on the footwear market, you can skip and go directly to 5 Best Alternatives to Adidas Samba. In the realm of footwear, the market size of the industry struck a whopping […]"}, {"date": "20240502141500", "headline": "NIKE, Inc. Declares $0.370 Quarterly Dividend", "summary": "BEAVERTON, Ore., May 02, 2024--NIKE, Inc. (NYSE: NKE) announced today that its Board of Directors has declared a quarterly cash dividend of $0.370 per share on the Company’s outstanding Class A and Class B Common Stock payable on July 1, 2024, to shareholders of record at the close of business June 3, 2024."}, {"date": "20240502213800", "headline": "Why Nike Stock (NYSE:NKE) Can Sprint Past $110", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503074933", "headline": "My Top 15 High Growth Dividend Stocks For May 2024", "summary": "Since its inception in September 2020, the watchlist has achieved a 10.91% annualized return Check out the top 15 dividend growth stocks for May 2024."}, {"date": "20240503142148", "headline": "MLB and Nike announce 2025 uniforms will have larger jersey lettering and custom-fit pants", "summary": "Major League Baseball uniforms will have larger lettering on the back of jerseys and individual pant customization will be available to all players beginning in 2025, MLB and Nike announced Friday.  MLB and Nike said the uniform adjustments will be made following conversations with players, clubs and equipment managers.  “Player and club feedback is extremely important to us,” Commissioner Rob Manfred said in a statement."}]}