{"news": [{"date": "20240412140651", "headline": "Eli Lilly, Novo Euphoria Risks Disappointing Investors, Goldman Says", "summary": "(Bloomberg) -- The weight loss drug frenzy that’s driven Eli Lilly & Co. and Novo Nordisk A/S to record peaks is raising the stakes for investors, according to Goldman Sachs Group Inc. analysts.Most Read from BloombergIsrael Bracing for Unprecedented Direct Iran Attack in DaysApple Plans to Overhaul Entire Mac Line With AI-Focused M4 ChipsRussian Attacks on Ukraine Stoke Fears Army Near Breaking PointStocks Get Hit as War Jitters Fuel Rush to Bonds: Markets WrapUS Sees Imminent Missile Strike on"}, {"date": "20240412220000", "headline": "Viking Therapeutics: Strong Results In Obesity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240413091625", "headline": "Nvidia Leads 5 Stocks Near Buy Points As S&P 500 Tests Key Level", "summary": "Nvidia, which bucked the S&P 500 downdraft last week, leads this weekend's watch list of five stocks near buy points."}, {"date": "20240415034600", "headline": "Healthcare Stocks Are Lagging With Big Earnings Weeks Ahead", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415063500", "headline": "Novo Nordisk price target raised by DKK 60 at Morgan Stanley", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415064300", "headline": "Beat the Market the Zacks Way: MediaAlpha, NVIDIA, Walmart in Focus", "summary": "Last week, our time-tested methodologies served investors well in navigating the market. Check out some of our achievements from the past three months."}, {"date": "20240415080000", "headline": "Novo Nordisk and Ginkgo Bioworks Are Teaming Up. Here's Why That's Bullish for Both Stocks.", "summary": "The collaboration could help solve challenges for both businesses."}, {"date": "20240415092200", "headline": "Top Analyst Reports for Microsoft, Novo Nordisk & United Parcel", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Microsoft Corporation (MSFT), Novo Nordisk A/S (NVO) and United Parcel Service, Inc. (UPS)."}, {"date": "20240415100810", "headline": "Pfizer Eyeing Viking Therapeutics? A Scenario Among All The M&A Talk", "summary": "Given its success with weight loss drug efforts so far, Viking Therapeutics could be a potential acquisition target. Read why Pfizer could be interested in this up-and-coming biotech."}, {"date": "20240415155131", "headline": "3 Pharma Stocks That Are Money-Printing Machines in 2024", "summary": "The future of the U.S. economy appears promising, with robust growth and strong corporate performance. This economic strength has propelled the stock market to record highs, signaling confidence in the economy’s resilience. The well established pharmaceutical industry continues to assert its economic dominance through resolute financials. In 2022, pharma stocks brought in $510.5 billion, with forecasts for the sector to reach $863.6 billion in revenue by 2030. Between 2023 and 2030, the industry"}, {"date": "20240416005500", "headline": "Powell And The Great Indecision", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416012700", "headline": "Buyback Bonanza: The Top 7 ETFs to Profit From Corporate Cash Splurges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416030700", "headline": "The Zacks Analyst Blog Highlights Microsoft, Novo Nordisk, United Parcel Service, Booking and Elevance Health", "summary": "Microsoft, Novo Nordisk, United Parcel Service, Booking and Elevance Health are included in this Analyst Blog."}, {"date": "20240416041100", "headline": "LLY, VKTX, or NOVO: Which Weight-Loss Drugmaker Could Gain the Best Returns?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416041300", "headline": "LLY, VKTX, or NVO: Which Weight-Loss Drugmaker Could Gain the Best Returns?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416053900", "headline": "Lexaria gets ethics board okay for oral GLP-1 study", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416062100", "headline": "These 3 Biotech Stocks Are Up 269% in 2024. Is There More to Come?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416081655", "headline": "VGK Vs. QQQ: How Europe's 'GRANOLAS' Could Outperform The US 'Magnificent 7'", "summary": ""}, {"date": "20240416154517", "headline": "Novo Nordisk (NVO) Stock Falls Amid Market Uptick: What Investors Need to Know", "summary": "In the latest trading session, Novo Nordisk (NVO) closed at $123.46, marking a -0.36% move from the previous day."}, {"date": "20240416192600", "headline": "Eli Lilly Stock (NYSE:LLY): Hold Off Until the End of the Month", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416211000", "headline": "Earnings Season Heats Up, Spotting 2 Unusual Reporting Dates In The Consumer Space", "summary": "March CPI data was not what the bulls wanted to see, just as concerns about household spending emerge."}, {"date": "20240416235900", "headline": "Novo Nordisk Launches Major Share Buyback", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416235900", "headline": "Novo Nordisk Executives Trade Company Shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417000600", "headline": "Eli Lilly obesity therapy succeeds in late-stage trials for sleep disorder", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417023036", "headline": "3 Weight-Loss ETFs to Profit From the Obesity Drug Boom", "summary": "People are interested in ETFs for weight loss because of Oprah’s TV show “Shame, Blame, and the Weight Loss Revolution,” which was about weight loss drugs. A lot of people are upset that she’s talking to patients and doctors about using prescription drugs to lose weight, but it’s still causing a stir. It’s also big news that Oprah is leaving the Weight Watchers board. The fact that she backs drugs like Mounjaro, Wegovy and Ozempic shows how times are changing for everyone. It’s always been hard"}, {"date": "20240417050900", "headline": "Eli Lilly's Mounjaro, Zepbound to remain in shortage through end of Q2", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418010000", "headline": "Metsera, a well-funded obesity drug startup, sees chance to challenge Lilly, Novo", "summary": "It’s “early innings” in the obesity drug race, said Metsera CEO Clive Meanwell, whose company has acquired a portfolio of medicines it aims to test in combination."}, {"date": "20240418033800", "headline": "December 20th Options Now Available For Novo-Nordisk (NVO)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418041900", "headline": "Eight stock picks in AI, obesity drugs, e-commerce and other growth areas beyond the S&P 500", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418055300", "headline": "Patients Find Weight Loss Drug Zepbound A Game Changer, But Makers See Production Delay Until 2025", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418064000", "headline": "Laughing Water Capital Q1 2024 Letter", "summary": "Laughing Water Capital returned approximately 8.4% in the first quarter of 2023 after all fees and expenses. Click here to read the full letter."}, {"date": "20240418065100", "headline": "Eli Lilly's (LLY) Tirzepatide Meets Goals in Sleep Apnea Studies", "summary": "Data from Eli Lilly's (LLY) SURMOUNT-OSA studies show that treatment with tirzepatide results in a mean AHI reduction of up to 63% in adults with obstructive sleep apnea and obesity."}, {"date": "20240418065800", "headline": "German Authority Gives Go Ahead To Novo Nordisk's Small Bolt On Acquisition As Danish Firm Seeks To Build Heart Drugs Pipeline", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418083307", "headline": "How The Weight-Loss Bonanza Prompted A ResMed Sell-Off — But Could Soon Drive Shares Higher", "summary": "ResMed stock jumped Thursday after an analyst suggested the growing popularity of weight-loss drugs could drive use of its medical devices."}, {"date": "20240418102341", "headline": "India's Biocon developing its own version of Wegovy, clinical trial likely next year", "summary": "Indian drugmaker Biocon, looking to grab a piece of the exploding weight-loss drug market as early as possible, is developing its own version of Novo Nordisk's wildly popular Wegovy and is prepared to conduct a clinical trial next year if needed, the CEO told Reuters.  Wall Street has forecast the market for this new generation of obesity treatments reaching at least $100 billion by the end of the decade, and Biocon is taking steps to be a part of that windfall.  \"We're going to develop semaglutide for India even if it requires a clinical trial,\" Chief Executive Officer Siddharth Mittal said in an interview of the active ingredient in Wegovy and Ozempic."}, {"date": "20240418195100", "headline": "Tech advances are catalyzing the Health Care sector with improved investor sentiment - SSGA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418201500", "headline": "Intuitive Surgical (ISRG) Surpasses Q1 Earnings, Faces Supply Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418221300", "headline": "Hepion ends Phase 2 study for NASH drug due to cash restraints", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418231800", "headline": "Influencers are talking up weight loss drugs, but omit side effects, WSJ says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419004500", "headline": "ClearBridge International Growth ACWI Ex-US Strategy Q1 2024 Commentary", "summary": "The Strategy outperformed, led by holdings in cyclical sectors including materials, information technology and industrials as well as the more defensive health care sector."}, {"date": "20240419050100", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419061500", "headline": "Got $500? 3 Healthcare Stocks to Buy and Hold Forever", "summary": "Make the most of a modest investment by putting it into Intuitive Surgical, Bristol Myers Squibb, and Novo Nordisk."}, {"date": "20240419153257", "headline": "Weight loss drugs and the many use cases in medical treatments", "summary": "Novo Nordisk's (NVO) Ozempic and Wegouvy and Eli Lilly's (LLY) Zepbound are the leading names in the latest GLP-1 weight loss drug cycle, a trend that has seen a variety of use cases sprout up since these brand names' inceptions late last year. Yahoo Finance Health Reporter Anjalee Khemlani explains the new use cases being found for this class of drugs, including infertility treatments and even benefits for Alzheimer's patients. For more expert insight and the latest market action, click here to watch this full episode. This post was written by Luke Carberry Mogan."}, {"date": "20240420013100", "headline": "Big pharma is looking to fatten profits with buyouts of weight-loss drug companies. Here are 4 candidates.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420041500", "headline": "3 Biotech Stocks Set to Double by 2028", "summary": "Biotech stocks offer the possibility of groundbreaking medical advancements alongside the potential for explosive growth. While the sector carries inherent risks, a select group of biotech companies possesses the potential to deliver substantial returns in the coming years. It is no surprise that investors continue to turn to this sector as advancements in technology strengthen its growth prospects. From revolutionary gene therapies to cancer research, the possibilities are endless. Furthermore,"}, {"date": "20240420044800", "headline": "3 Relatively Safe Growth Stocks You Can Buy and Hold", "summary": "Low risk and high-reward potential? These stocks could offer both."}, {"date": "20240420063000", "headline": "Missed Out on Eli Lilly and Novo Nordisk? This Small Biotech Has a Promising GLP-1 Drug With Significant Potential", "summary": "Altimmune has a modest market cap but an incredibly promising GLP-1 drug."}, {"date": "20240420074500", "headline": "2 Everlasting Big Pharma Stocks to Buy Today and Hold Forever", "summary": "These stocks probably won't be getting much cheaper."}, {"date": "20240421010700", "headline": "13 new obesity drugs could hit the market by 2029 amid surging demand", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421014100", "headline": "Biden sees a $35 price cap for insulin as a pivotal campaign issue. It’s not that clear-cut", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422022600", "headline": "Changing Frugal Eating Habits - How Novo Nordisk/Eli Lilly's Weight Loss Drugs Reshaping Food Spending", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422030000", "headline": "Novo Nordisk Remains The Better Buy After A Moderate Pullback", "summary": "Novo Nordisk (NVO) continues to be rated as a Buy, with the stock already charting an impressive +16.1% rally over the past 3 months. Read more here."}, {"date": "20240422035900", "headline": "Novo Nordisk Launches Massive Share Buyback", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422072500", "headline": "Wall Street Lunch: Big Tech Bearishness?", "summary": "da-kukListen below or on the go on Apple Podcasts and SpotifyThis is an abridged transcript of the podcast.Our top story so farUBS sounded a warning on its..."}, {"date": "20240422115000", "headline": "Lilly to buy injectable drug plant in manufacturing ramp-up", "summary": "The acquisition of a Nexus Pharmaceuticals facility in Wisconsin could help Lilly better meet demand for injectable medicines, like those it makes for diabetes and obesity."}, {"date": "20240422160853", "headline": "Why Novo Nordisk Topped the Market Today", "summary": "It's not only spending its capital on developing new drugs."}, {"date": "20240422202700", "headline": "TikTok to restrict weight loss drug promotion (updated)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422223438", "headline": "PPH: Buy The Pullback In This Big Pharma ETF For Long-Term Total Returns", "summary": "PPH is a popular option for exposure to leading pharmaceutical companies. Check out the technical analysis of PPH ETF and why it presents a buying opportunity."}, {"date": "20240423000200", "headline": "3 Stocks With the Potential to Surpass Analyst Expectations for 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423043700", "headline": "TikTok to restrict weight loss drug promotion", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423071248", "headline": "3 Potential Biopharma Buyout Targets", "summary": "Drug blockbusters facing key patent expirations and Big Pharma's surplus of cash suggest increased M&A volume in the coming year. Click here to read our picks."}, {"date": "20240423073003", "headline": "Novo Nordisk (NVO) Boasts Earnings & Price Momentum: Should You Buy?", "summary": "Finding strong, market-beating stocks with a positive earnings outlook becomes easier with the Focus List, a top feature of the Zacks Premium portfolio service."}, {"date": "20240423204500", "headline": "Novo Nordisk comes under Senate probe over pricing for weight loss drugs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423205700", "headline": "Novo Nordisk comes under Senate probe over pricing of weight loss drugs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423210000", "headline": "Senate to probe Ozempic's 'outrageously' high prices, FT reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423233900", "headline": "3 Speculative Weight Loss Drug Stocks to Bet On for Big Gains", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424030133", "headline": "About 3.6 mln Medicare beneficiaries could be eligible for Wegovy coverage, study shows", "summary": "About 3.6 million overweight or obese patients with heart conditions insured under the U.S. Medicare program could be eligible for coverage of Novo Nordisk's weight-loss drug Wegovy, a study published by Kaiser Family Foundation (KFF) showed on Wednesday.  Wegovy was approved by the U.S. health regulator last month for lowering the risk of stroke and heart attack in overweight or obese adults who do not have diabetes."}, {"date": "20240424033000", "headline": "3.6M Medicare patients could qualify for Wegovy coverage: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424033000", "headline": "Artisan Global Equity Fund Q1 2024 Commentary", "summary": "Artisan Global Equity Fund's portfolio solidly outperformed the MSCI AC World Index. Click here to read the full fund letter."}, {"date": "20240424034209", "headline": "VIGI: Blue Chip International Growth", "summary": "Vanguard International Dividend Appreciation Index Fund is a blue-chip portfolio on non-US stocks. See why VIGI is a Buy."}, {"date": "20240424035000", "headline": "Missed Out on Novo Nordisk? 2 Healthcare Stocks With Big Catalysts on the Horizon.", "summary": "Good news could be just around the corner for two drugmakers not named Novo Nordisk."}, {"date": "20240424040000", "headline": "Artisan International Fund Q1 2024 Commentary", "summary": "Artisan International Fund's portfolio meaningfully beat the benchmark MSCI EAFE Index and the MSCI All Country World ex USA Index. Click here to read more."}, {"date": "20240424044100", "headline": "3 Biotech Stocks With Skyrocketing Potential: April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424064800", "headline": "Novo Nordisk A/S – Reduction of the share capital", "summary": "Bagsværd, Denmark, 24 April 2024 – At Novo Nordisk’s Annual General Meeting on 21 March 2024, it was decided to reduce the company’s B share capital from DKK 343,512,800 to DKK 339,012,800 by cancellation of part of the company’s portfolio of own B shares equal to a nominal value of DKK 4,500,000 divided into 45,000,000 B shares of DKK 0.10 each. Today, Novo Nordisk has registered the implementation of the reduction of the share capital with the Danish Business Authority and cancelled B shares a"}, {"date": "20240424070230", "headline": "Madrigal: 2 Challenges To Overcome To Maintain NASH 'First Mover' Advantage", "summary": "Madrigal recently received FDA approval for its lead candidate resmetirom, targeting a liver condition called NASH. Check out my analysis of MDGL stock here."}, {"date": "20240424080900", "headline": "4 Large Drug Stocks to Hold on to Amid Industry Challenges", "summary": "Drug and biotech companies are likely to see significant innovation. In the Large-Cap Pharmaceuticals industry, Eli Lilly (LLY), Novo Nordisk (NVO), Merck (MRK) and AbbVie (ABBV) are worth retaining in one's portfolio."}, {"date": "20240424115843", "headline": "Weight Loss Leader Novo Nordisk Hits Buy Trigger In Stock Market Rebound", "summary": "Novo Nordisk stock: The weight-loss drug leader hit a buy point in the recent stock market rebound and is one of the best stocks to watch."}, {"date": "20240424122740", "headline": "US Senate committee investigates pricing of Novo's Ozempic and Wegovy", "summary": "A U.S. Senate committee said on Wednesday it had launched an investigation into the prices of Novo Nordisk's diabetes and weight loss drugs Ozempic and Wegovy in the United States.  Senator Bernie Sanders, chair of the Senate Committee on Health, Education, Labor and Pensions, sent a letter to Novo's CEO seeking more information on U.S. prices for the two drugs, which are higher than the prices in other countries.  The committee also asked Novo if it will substantially reduce both the list price and the net price of both the drugs, and why the company was charging a higher price for the weight loss drug Wegovy than Ozempic, which contains the same compound."}, {"date": "20240424135846", "headline": "Sector Update: Health Care Stocks Slipping Late Afternoon", "summary": "Sector Update: Health Care Stocks Slipping Late Afternoon"}, {"date": "20240424154516", "headline": "Novo Nordisk (NVO) Stock Sinks As Market Gains: Here's Why", "summary": "In the latest trading session, Novo Nordisk (NVO) closed at $126.16, marking a -1.93% move from the previous day."}, {"date": "20240424232900", "headline": "Novo Nordisk Executes Share Capital Reduction", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424233300", "headline": "Novo Nordisk Updates Corporate Governance Structure", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425063300", "headline": "Zacks Industry Outlook Highlights Eli Lilly, Novo Nordisk, Merck and AbbVie", "summary": "Eli Lilly, Novo Nordisk, Merck and AbbVie are part of the Zacks Industry Outlook article."}, {"date": "20240425140230", "headline": "Sanders takes aim at US drug prices of Novo’s Ozempic and Wegovy", "summary": "A Senate Committee is investigating the “outrageously high” US price tags of the blockbuster diabetes and obesity drugs."}, {"date": "20240426015700", "headline": "Novo Nordisk Shares Capital and Voting Rights Update", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426033300", "headline": "Here's How Much You Would Have Made Owning Novo Nordisk Stock In The Last 10 Years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426041400", "headline": "Interesting NVO Put And Call Options For June 7th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426041600", "headline": "Novo Nordisk A/S – Total number of voting rights and share capital in Novo Nordisk A/S as of 26 April 2024", "summary": "Bagsværd, Denmark, 26 April 2024 – In accordance with Section 32 of the Danish Capital Markets Act, Novo Nordisk A/S is required to publish the total number of voting rights and the size of the share capital in Novo Nordisk A/S as per the end of a month where changes therein have occurred. Referring to Company Announcement no 32/2024 dated 24 April 2024, please find below a statement regarding the total number of voting rights and share capital in Novo Nordisk A/S as per 26 April 2024. Number of"}, {"date": "20240426053356", "headline": "AstraZeneca: Strong In A Weak Market", "summary": "Shares of AstraZeneca reached new all-time highs this week despite difficult market conditions in the last two months. Learn more on AZN stock here."}, {"date": "20240426060034", "headline": "Novo Nordisk: Medicare Coverage To Unlock Another Big Market For Wegovy", "summary": "Novo Nordisk's weight loss drug, Wegovy, receives FDA approval for reducing cardiovascular risk, potentially leading to significant revenue growth. Learn more on NVO stock here."}, {"date": "20240426061500", "headline": "ClearBridge Global Growth Strategy Q1 2024 Portfolio Manager Commentary", "summary": "The Strategy outperformed, led by U.S. mega cap exposure as well as holdings in cyclical sectors and the more defensive health care sector."}, {"date": "20240426080925", "headline": "Stocks to watch next week: Amazon, Apple, Anglo American and Novo Nordisk", "summary": "Earnings preview of key companies reporting next week and what to look out for."}, {"date": "20240426152046", "headline": "Dow Jones Futures: Nvidia Leads 7 New Buys As Market Roars; Fed, Apple, Super Micro Loom", "summary": "Nvidia and several other leaders flashed buy signals as the market roared. Investors should take advantage, but it's a jungle out there."}, {"date": "20240427071500", "headline": "1 Unstoppable Pharmaceutical Stock Investors Shouldn't Sleep On", "summary": "Eli Lilly may be on the verge of another breakthrough, thanks to its hit GLP-1 medications."}, {"date": "20240427091000", "headline": "Forget Nvidia, These Unstoppable Stocks Are Better Buys", "summary": "These stocks have tremendous potential, and it doesn't depend on the growth prospects for artificial intelligence."}, {"date": "20240428033700", "headline": "What do weight-loss drugs mean for the diet industry?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428063500", "headline": "Artisan International Explorer Fund Q1 2024 Commentary", "summary": "Artisan International Explorer Fund outperformed its benchmark by about 225bps in Q1 of 2024. Click here to read the full fund letter."}, {"date": "20240428083000", "headline": "Is Viking Therapeutics Incredibly Undervalued?", "summary": "The biotech's weight loss drug candidate could fuel a premium-laden buyout, but risks abound."}, {"date": "20240428182146", "headline": "Dow Jones Futures Rise: Nvidia Leads 7 New Buys As Market Roars; Fed, Apple, Super Micro Loom", "summary": "Nvidia and several other leaders flashed buy signals as the market roared. Investors should take advantage, but it's a jungle out there."}, {"date": "20240428200600", "headline": "Decoding Novo Nordisk's Options Activity: What's the Big Picture?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429023500", "headline": "Uranium, Battery, and Precious Metals Virtual Investor Conference Agenda Announced for April 30th - May 2nd", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429060000", "headline": "Billionaire Investor Jim Simons Just Bought These 3 \"Magnificent Seven\" Stocks", "summary": "The \"Magnificent Seven\" stocks dominate the artificial intelligence (AI) arena. One notable hedge fund manager has three in his top 10 holdings."}, {"date": "20240429080003", "headline": "Novo Nordisk: Growth Is Still A Better Choice", "summary": "A look at one of the leaders in the global obesity treatment market"}, {"date": "20240429101222", "headline": "UPDATE 1-One dose of Novo Nordisk's Wegovy back in supply, FDA website shows", "summary": "Increasing demand for a type of highly effective diabetes and weight-loss treatment known as GLP-1 agonists has led to supply constraints for drugmakers such as Eli Lilly and Novo Nordisk.  Most doses of Lilly's diabetes drug Mounjaro and weight-loss drug Zepbound would be in limited supply through the second quarter of this year due to increased demand, according to an update on the health regulator's website earlier this month."}, {"date": "20240429113300", "headline": "Should You Invest in Novo Nordisk (NVO) Ahead of Q1 Earnings?", "summary": "Novo Nordisk's (NVO) revenues in the first quarter of 2024 are expected to have been driven by its diabetes and obesity care product sales, especially Ozempic, Rybelsus and Wegovy."}, {"date": "20240429133532", "headline": "How expanded use of GLP-1s could affect long-term outlooks for Eli Lilly and Novo Nordisk", "summary": "The latest GLP-1 drugs are starting to see proof of greater use beyond diabetes and obesity. How will it affect makers Novo Nordisk and Eli Lilly?"}, {"date": "20240429150453", "headline": "Why these analysts are bullish on healthcare stocks", "summary": "The healthcare sector has underperformed throughout 2024, but as the first quarter earnings season unfolds, Jefferies Healthcare Services Equity Research Analyst Brian Tanquilut and Grey Ghost Advisors Private Equity Investor Meghan Fitzgerald join Market Domination to discuss how investors should position themselves in this market. Fitzgerald remains bullish on the healthcare sector, believing it still has \"a lot of long and important tailwinds.\" She cites the sector's historical outperformance during market downturns and election years as reasons for her optimism. Fitzgerald anticipates strong earnings from companies with GLP-1 drug portfolios this week, describing it as an \"easy beat.\" Tanquilut notes a \"rise in broader healthcare utilization trends,\" which is now reflected in healthcare insurers' earnings. While there has been weakness in this area, he highlights the \"strength in volume\" from healthcare providers. However, Tanquilut acknowledges that with consumer spending slowing, consumer-focused healthcare segments, such as drugstores, have experienced pressure. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. Editor's note: This article was written by Angel Smith"}, {"date": "20240429192700", "headline": "FTC challenges ‘bogus’ patents on Ozempic, other drugs that ‘block competition’", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429213300", "headline": "3 of Europe’s ‘Magnificent 18’ Stocks That You Can Buy in the U.S.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000000", "headline": "Chasing Novo and Lilly: The obesity drugs that could challenge Wegovy and Zepbound", "summary": "Large and small drugmakers are vying for a piece of what analysts view as one of the biggest market opportunities in the pharma industry's history. Here’s what’s coming next."}, {"date": "20240430003500", "headline": "Eli Lilly raises guidance on weight loss momentum", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430031400", "headline": "FTC expands patent listing challenges for drugs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430052400", "headline": "Novo, Teva, AstraZeneca issued FTC warnings over ‘bogus’ patents", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430054417", "headline": "Eli Lilly Stock Jumps On Strong Earnings, Guidance As Zepbound Sales Easily Beat", "summary": "Eli Lilly earnings beat but sales missed, despite strong demand of weight-loss drug Zepbound. The drug giant guided up. Eli Lilly stock rose."}, {"date": "20240430061500", "headline": "Lilly counts on manufacturing scale-up to unstick obesity drug supply", "summary": "Increasing the production capacity for Zepbound and Mounjaro is “the most ambitious expansion plan in our company’s history,” said CEO David Ricks."}, {"date": "20240430070300", "headline": "US challenges 'bogus' patents on Ozempic and other drugs in effort to spur competition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430092000", "headline": "Will These 5 Drug/Biotech Stocks Beat Q1 Earnings Forecast?", "summary": "Let's look at five large-cap pharma/biotech companies slated to release quarterly results this week."}, {"date": "20240430094500", "headline": "Eli Lilly (LLY) Q1 Earnings Top, Sales Miss, 2024 View Raised", "summary": "Eli Lilly (LLY) beats first-quarter estimates for earnings but misses the same for sales. It raises its guidance for 2024 on strong demand for Mounjaro and Zepbound."}, {"date": "20240430102117", "headline": "IBD Stock Of The Day Eli Lilly Surges After Weight-Loss Drug Obliterates Sales Views", "summary": "Eli Lilly stock jumped Tuesday despite a mixed first-quarter report, after sales of weight-loss drug Zepbound obliterated expectations."}, {"date": "20240430112330", "headline": "Eli Lilly reports $2 billion from Mounjaro, Zepbound in Q1 2024", "summary": "Eli Lilly missed on total sales in the first quarter, but its GLP-1 drugs helped boost sales by 26% over those in Q1 2023."}, {"date": "20240430141728", "headline": "Update: FTC Challenging 'Junk' Patent Listings for Ozempic, Victoza, Other Medications", "summary": "Update: FTC Challenging 'Junk' Patent Listings for Ozempic, Victoza, Other Medications"}, {"date": "20240430150031", "headline": "Ozempic Maker Novo Nordisk Has Denmark’s Economy Hooked", "summary": "(Bloomberg) -- There is no escaping Ozempic and Wegovy. The diabetes and obesity drugs are a global phenomenon. They’ve won over the rich and famous, generated billions in sales and blown open a new market for weight loss drugs, which Goldman Sachs estimates will reach $100 billion a year by 2030.Most Read from BloombergHSBC CEO Quinn Unexpectedly Steps Down After Almost 5 YearsWall Street Hit by Fed Jitters to Close Wild April: Markets WrapBinance and CZ’s Fortunes Are Set to Grow, Even in Jail"}, {"date": "20240430200200", "headline": "John Hussman's Strategic Moves: A Deep Dive into Super Micro Computer's Significant Reduction", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430211300", "headline": "Federal Trade Commission Targets 'Junk Patent Listings' For Diabetes, Weight Loss, Asthma Drugs From Companies Like Novo Nordisk, AstraZeneca", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430235200", "headline": "Galderma Seizes Ozempic Face Opportunity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501010230", "headline": "Novo Nordisk owner to invest $200 million in quantum computing startups", "summary": "LONDON (Reuters) -Novo Holdings, the controlling shareholder of Danish obesity drugmaker Novo Nordisk, said on Wednesday it planned to invest around $200 million in quantum computing startups.  The company, the investment arm of the Novo Nordisk Foundation, has 77% of voting shares in Novo Nordisk, which is known for producing blockbuster obesity drug Wegovy and diabetes treatment Ozempic.  Academics and industry analysts say quantum computing may prove to be among the most transformational technological developments of the 21st century."}, {"date": "20240501024800", "headline": "Novo Nordisk Completes Share Buyback", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501025400", "headline": "Novo Resources Launches Major Gold Drilling Program", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501025800", "headline": "Follow-Up Drilling to Commence at Nunyerry North and New Targets Defined Near Karratha", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501034016", "headline": "Denmark to restrict Ozempic, other GLP-1 drugs, to treat type 2 diabetes", "summary": "Denmark will start putting patients suffering from type 2 diabetes on cheaper drugs before prescribing so-called GLP-1 drugs such as Novo Nordisk's Ozempic, the Danish Medicines Agency said on Wednesday.  In 2023, 50% of new patients suffering from type 2 diabetes began treatment with a reimbursed GLP-1 drug without trying a cheaper alternative first, the Medicines Agency said.  Demand for Novo Nordisk's diabetes drug Ozempic has soared as many people have started using the diabetes drug for its weight-loss effects."}, {"date": "20240501034800", "headline": "Setback For Novo Nordisk? Denmark Shifts Prescription Guidelines, Favoring Cost-Effective Alternatives For Ozempic", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501040135", "headline": "UPDATE 1-Novo Nordisk owner to invest $200 million in quantum computing startups", "summary": "Novo Holdings, the controlling shareholder of Danish obesity drugmaker Novo Nordisk, said on Wednesday it planned to invest around $200 million in quantum computing startups.  The company, the investment arm of the Novo Nordisk Foundation, has 77% of voting shares in Novo Nordisk, which is known for producing blockbuster obesity drug Wegovy and diabetes treatment Ozempic.  Academics and industry analysts say quantum computing may prove to be among the most transformational technological developments of the 21st century."}, {"date": "20240501044400", "headline": "Moody’s, Booking, DraftKings, Amgen Stocks In Focus Ahead Of Earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501054100", "headline": "Stock Market Crash Warning: Don’t Get Caught Holding These 3 Consumer Stocks.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501060536", "headline": "Breakouts In Focus: Google Goes Wild As Tasty IPO Sets Up", "summary": "As Google stock gaps up and gets volatile, Novo Nordisk sets up while a hot IPO and leading chipmaker break out."}, {"date": "20240501063000", "headline": "Novo Nordisk A/S - share repurchase programme", "summary": "Bagsværd, Denmark, 1 May 2024 – On 6 February 2024, Novo Nordisk initiated a share repurchase programme in accordance with Article 5 of Regulation No 596/2014 of the European Parliament and Council of 16 April 2014 (MAR) and the Commission Delegated Regulation (EU) 2016/1052 of 8 March 2016 (the \"Safe Harbour Rules\"). This programme is part of the overall share repurchase programme of up to DKK 20 billion to be executed during a 12-month period beginning 6 February 2024. Under the programme init"}, {"date": "20240501064500", "headline": "Profit from the Panic: 3 Stocks to Pounce on When They Become Steals", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501084105", "headline": "Eli Lilly Shoots Higher: It's Time To Be Cautious", "summary": "If we see shares continue to climb like this, a downgrade for Eli Lilly and Company stock could be on the horizon. Learn why we rate LLY stock a hold."}, {"date": "20240501093600", "headline": "Danish Medicines Agency Says Type 2 Diabetes Patients Should Start Treatment With 'Cheaper' Drugs", "summary": "Danish Medicines Agency Says Type 2 Diabetes Patients Should Start Treatment With 'Cheaper' Drugs"}, {"date": "20240501110744", "headline": "Amgen Stock: Recent Weakness Is Not A Buying Opportunity Yet", "summary": "Amgen Inc. shares dropped 20% due to a below-consensus outlook. Their obesity candidate MariTide may be their biggest revenue producer. Click for my AMGN update."}, {"date": "20240501145748", "headline": "Apple, Novo Nordisk earnings, jobless claims: What to watch", "summary": "A number of companies release their quarterly earning reports on Thursday, including Apple (AAPL), Novo Nordisk (NVO), Shell (SHEL), ConocoPhillips (COP), Cigna (CI), Coinbase (COIN), Moderna (MRNA), DraftKings (DKNG), Kellanova (K), United States Steel (X), and more. On the economic front, jobless claims for the week ending on April 27 will be released. Economists expect claims to rise to 212,000 from 207,000 the prior week. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Nicholas Jacobino"}, {"date": "20240501151859", "headline": "Dow Jones Futures: Stock Market Round-Trips Fed Gains; Carvana Skyrockets Late", "summary": "The stock market round-tripped big initial gains as AI plays such as Nvidia retreated. Carvana soared late on earnings."}, {"date": "20240501170359", "headline": "Dow Jones Futures Rise, Carvana Skyrockets; Stock Market Erases Fed Gains", "summary": "The stock market round-tripped big initial gains as AI plays such as Nvidia retreated. Carvana soared late on earnings."}, {"date": "20240501210100", "headline": "Novo Nordisk now has more than 130,000 weight-loss prescriptions as it hikes financial outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501210600", "headline": "Weigh Loss Competition Heats Up In Britain, Online Pharmacies Slash Prices for Wegovy and Mounjaro", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501211500", "headline": "Novo Nordisk lifts guidance as Ozempic, Wegovy sales surge; but stock falls 3%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501221000", "headline": "TOP NEWS: Novo Nordisk earnings rise as diabetes, obesity demand grows", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501224500", "headline": "Amgen stock rallies 13% on weight-loss drug updates, tweaked guidanace", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501225100", "headline": "Amgen stock rallies 13% amid weight-loss drug updates, tweaked guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501225500", "headline": "Demand Soars For Novo Nordisk's Weight-Loss Drug Wegovy Despite Supply Constraints And Eli Lilly Competition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501230000", "headline": "FOCUS-British pharmacies vie for weight-loss patients with drug price cuts", "summary": "Online pharmacies and slimming clinics are cutting prices for Wegovy and Mounjaro in Britain just months after the weight-loss drugs were launched there, as initial supply shortages ease.  But growing competition between retailers has raised fears that some patients who buy the drugs themselves, rather than relying on the National Health Service (NHS), will miss out on long-term aftercare if they keep switching providers."}, {"date": "20240501230400", "headline": "Novo Nordisk: Q1 Earnings Snapshot", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501232400", "headline": "Analysts Offer Insights on Healthcare Companies: Novo Nordisk (NVO), Sarepta Therapeutics (SRPT) and Acadia Healthcare (ACHC)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501233000", "headline": "Novo Nordisk's sales increased by 22% in Danish kroner and by 24% at constant exchange rates to DKK 65.3 billion in the first three months of 2024", "summary": "Bagsværd, Denmark, 2 May 2024 - financial report for the period 1 January 2024 to 31 March 2024 Operating profit increased by 27% in Danish kroner and by 30% at constant exchange rates (CER) to DKK 31.8 billion. Sales in North America Operations increased by 34% in Danish kroner (35% at CER). Sales growth in the US was positively impacted by gross-to-net sales adjustments related to prior years. Sales in International Operations increased by 8% in Danish kroner (11% at CER).Sales within Diabetes"}, {"date": "20240501233403", "headline": "Obesity drugmaker Novo Nordisk raises outlook, Q1 profit beats forecast", "summary": "LONDON (Reuters) -Novo Nordisk raised its 2024 outlook on Thursday as it posted first-quarter operating profit above analyst forecasts.  Novo said it now expects sales growth this year of between 19% and 27% in local currencies, compared to the previously guided range for 18% to 26% growth."}, {"date": "20240501234203", "headline": "UPDATE 5-Novo Nordisk raises outlook fuelled by obesity drug demand", "summary": "Novo Nordisk raised its 2024 outlook on Thursday and delivered better-than-expected first-quarter profits as the Danish drugmaker races to boost output of its Wegovy weight-loss drug and fend off competition from rival Eli Lilly.  Novo is currently the most valuable company in Europe by market capitalisation, worth some 540.4 billion euro ($576.44 billion) before earnings on Thursday, on the back of Wegovy's popularity.  Sales growth in the U.S. was positively impacted by a one-off sales adjustment, the company said."}, {"date": "20240501235600", "headline": "NVO Earnings: Novo Nordisk Drops Despite Hiked Financial Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502003700", "headline": "Buy Rating Affirmed for Novo Nordisk on Strong Product Performance and Market Position", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502005000", "headline": "Novo Nordisk reports Q1 EPS DKK 5.68 vs. DKK 4.39 last year", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502013000", "headline": "Novo Nordisk Q1 Sales and Profit Surge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502022100", "headline": "Novo Nordisk says prices dropping for Wegovy, Ozempic: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502024000", "headline": "Unusually active option classes on open May 2nd", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502025800", "headline": "NVO Stock Earnings: Novo Nordisk Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502030400", "headline": "GLP-1 drug prices falling at UK pharmacies, clinics: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502031545", "headline": "Trending tickers: Shell, Apple, Novo Nordisk and Standard Chartered", "summary": "The latest investor updates on stocks that are trending on Thursday."}, {"date": "20240502035600", "headline": "Novo Nordisk says starter doses of weight-loss drug surge as company hikes financial outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502043921", "headline": "Growing demand for weight loss treatments drives sales at drugmaker Novo Nordisk", "summary": "The Danish company warned over supply constraints as it said it was seeing strong demand for its obesity treatments around the world."}, {"date": "20240502050300", "headline": "Why Markets Must Beware Powell’s Comments on Fed Rate Hikes, and 5 Other Things to Know Today", "summary": "Novo Nordisk hikes guidance as sales of weight-loss drugs surge, Qualcomm profit lifted amid high demand for AI on devices, and other news to start your day."}, {"date": "20240502053359", "headline": "Dow Jones Futures Rise In Stock Market's Day 2 Fed Reaction; Carvana Skyrockets", "summary": "Futures rose after the stock market erased big Fed-led gains as AI plays such as Nvidia retreated. Carvana soared on earnings."}, {"date": "20240502062114", "headline": "Novo Nordisk A/S (NVO) Q1 2024 Earnings Call Transcript", "summary": "Novo Nordisk A/S (NVO) Q1 2024 Earnings Conference Call May 2, 2024 7:00 AM ETCompany ParticipantsLars Fruergaard JÃ¸rgensen - Chief Executive Officer..."}, {"date": "20240502062444", "headline": "UPDATE 1-Novo Nordisk: Wegovy, Ozempic prices in US fell in Q1", "summary": "Novo Nordisk has seen the price of its hugely popular weight-loss drug Wegovy and diabetes drug Ozempic fall in the United States as volumes and competition have increased, a senior executive said on Thursday.  Wegovy prices in the United States were \"slightly down\" in the first quarter and Novo expects further decreases through the rest of 2024, Chief Financial Officer Karsten Munk Knudsen said on a call with media."}, {"date": "20240502062525", "headline": "Novo Nordisk A/S 2024 Q1 - Results - Earnings Call Presentation", "summary": "The following slide deck was published by Novo Nordisk A/S in conjunction with their 2024 Q1 earnings call."}, {"date": "20240502063911", "headline": "Novo Nordisk Lifts Full-Year Sales Outlook as Obesity, Diabetes Drugs Drive First-Quarter Topline Beat", "summary": "Novo Nordisk Lifts Full-Year Sales Outlook as Obesity, Diabetes Drugs Drive First-Quarter Topline Beat"}, {"date": "20240502064400", "headline": "Novo Nordisk GAAP EPADR of DKK 5.68, revenue of DKK 65.35B; updates FY24 outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502072300", "headline": "Novo Nordisk (NVO) Q1 Earnings Beat, GLP-1 Drugs Boost Sales", "summary": "Novo Nordisk (NVO) reports better-than-expected first-quarter results, beating both earnings and revenues, driven by strong sales of Diabetes and Obesity care products."}, {"date": "20240502081821", "headline": "2 Biotech Stocks To Watch Today Amid Earnings", "summary": "Here are two biotech stocks to watch after their recent earnings report."}, {"date": "20240502083500", "headline": "Wall Street Lunch: Peloton CEO Steps Down", "summary": "Barry McCarthy steps down as CEO, president, and board director of Peloton. Q1 nonfarm productivity crept up 0.3% Q/Q; Initial jobless claims steady 208k for the week."}, {"date": "20240502085308", "headline": "Novo Nordisk Stock Falls After Pricing Pressure Mounts for Wegovy", "summary": "Novo Nordisk’s American depositary receipts slipped nearly 3%, despite reporting higher quarterly sales and profits fueled by blockbuster diabetes and weight-loss drugs Ozempic and Wegovy.  Novo Nordisk said Thursday its net prices for Wegovy declined in the first quarter.  The U.S. list price is still more than $1,300 a month, but Novo has been offering rebates and discounts to insurers to expand coverage to more patients."}, {"date": "20240502095427", "headline": "Top Midday Stories: Novo Nordisk, Linde Shares Fall Post-Earnings; Peloton Shares Plummet After Announcing Job Cuts, CEO Change; Exxon-Pioneer Deal Gets FTC Approval With One Caveat", "summary": "Top Midday Stories: Novo Nordisk, Linde Shares Fall Post-Earnings; Peloton Shares Plummet After Announcing Job Cuts, CEO Change; Exxon-Pioneer Deal Gets FTC Approval With One Caveat"}, {"date": "20240502105556", "headline": "Novo Nordisk sales up 26% driven by GLP-1s, misses 11% on Wegovy", "summary": "Novo Nordisk CEO Lars Jørgensen tells Yahoo Finance the company is confident about a robust GLP-1 sales year despite missing Wall Street estimates."}, {"date": "20240502110013", "headline": "Novo Nordisk (NVO) Q1 2024 Earnings Call Transcript", "summary": "NVO earnings call for the period ending March 31, 2024."}, {"date": "20240502110800", "headline": "Novo Nordisk’s Wegovy Sales More Than Doubled. Why the Stock Is Falling.", "summary": "The Danish pharmaceutical firm, Europe’s most valuable company, said sales of the weight-loss drug jumped 106% in the first quarter."}, {"date": "20240502140236", "headline": "Novo Nordisk Dips After Wegovy Sales Double, But Miss Analysts' Forecast", "summary": "Novo Nordisk stock dipped Thursday after sales of weight-loss drug, Wegovy, nearly doubled, but missed even more bullish expectations."}, {"date": "20240502140808", "headline": "Market Chatter: Novo Nordisk, Eli Lilly's Weight-Loss Drugs Get Price Cuts in UK", "summary": "Market Chatter: Novo Nordisk, Eli Lilly's Weight-Loss Drugs Get Price Cuts in UK"}, {"date": "20240502141737", "headline": "Novo Nordisk slides while Moderna pops: Tale of two pharma stocks", "summary": "Pharmaceutical stocks Novo Nordisk (NVO) and Moderna (MRNA) are trending in opposite directions following their earnings reports. Despite topping Wall Street's profit expectations, Novo Nordisk shares are sinking as the company fell short of estimates for its popular GLP-1 weight-loss drug, Wegovy. Meanwhile, Moderna is on the rise even after reporting first quarter losses. Moderna's growth is largely due to an uptick in coronavirus boosters and an expansion into the Brazillian market. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Melanie Riehl"}, {"date": "20240502160146", "headline": "Weight Loss Competition Heats Up In Britain, Online Pharmacies Slash Prices for Wegovy and Mounjaro", "summary": "Online pharmacies and slimming clinics in Britain are reducing prices for Novo Nordisk A/S’s (NYSE:NVO) Wegovy and Eli Lilly And Co (NYSE:LLY) Mounjaro as initial supply shortages ease, a move driven by growing competition among retailers. The reduced prices at retailers like Simple Online Pharmacy, Mayfair Weight Loss Clinic, and London Slimming Clinic reflect the increasing demand for these weight-loss drugs. Simple Online Pharmacy, for instance, slashed the price of Mounjaro starter doses fro"}, {"date": "20240502194400", "headline": "3 Under-The-Radar Stocks That Could Be Worth Over $1 Trillion by 2030", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503020219", "headline": "Here’s How Novo Holdings’ Catalent (CTLT) Acquisition Affects Laughing Water Capital", "summary": "Laughing Water Capital, an investment management company, released its first-quarter 2024 investor letter. A copy of the same can be downloaded here. In the first quarter, investment in the fund returned 8.4% after all fees and expenses compared to 10.6% and 5.2% returns for the SP500TR and R2000 during the quarter, respectively. In addition, you […]"}, {"date": "20240503020800", "headline": "The Big Split: 3 Stock Spinoffs Are Coming. Should You Buy?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503022100", "headline": "Amgen ‘very encouraged’ by data from weight-loss-drug trial, as stock jumps", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503022800", "headline": "Catalent, Novo Nordisk receive FTC request for more information", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503022800", "headline": "Job Market Cools In April: Payrolls Miss Forecasts, Wages Rise Less Than Expected (UPDATED)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503023500", "headline": "Uranium, Battery, and Precious Metals Virtual Investor Conference: Presentations Now Available for Online Viewing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503033700", "headline": "Amgen stock rallies 13% on GLP-1 weight-loss drug update", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503034600", "headline": "AMGN Stock Alert: Is Amgen the Next Hot Weight-Loss Drug Company?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503035800", "headline": "Novo Resources Corp. March Quarterly Update", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503035816", "headline": "Novo Slides as Amgen Fuels Obesity Drug Competition Fears", "summary": "(Bloomberg) -- Novo Nordisk A/S shares slid as a US rival’s comments on an experimental obesity drug gave rise to concerns about potential new competition in the rapidly growing field.Most Read from BloombergSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineApple Rallies on Upbeat Forecast, Record-Setting BuybackTurkey Confirms All Trade Halt With Israel Over War in GazaHuawei Secretly Backs US Research, Awarding Millions in PrizesIn Jamie Dimon's America, the Stock Market Has Alread"}, {"date": "20240503040800", "headline": "Novo Resources Strikes Gold with High-Grade Intercepts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503041400", "headline": "Amgen price target raised by $10 at BofA, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503043618", "headline": "Novo Nordisk drops 5% after rival Amgen teases weight-loss drug data", "summary": "Novo Nordisk were last down 4.4% by 1022 GMT, having hit their lowest in two months earlier in the day.  Amgen on Thursday said it was very encouraged after completing an interim analysis of its mid-stage study of experimental weight-loss drug MariTide, which, if approved, would compete Novo's Wegovy and Eli Lilly's Zepbound.  \"Novo's share price today is certainly factoring in some negative reaction to Amgen's positive commentary on MariTide development yesterday,\" Kepler Cheuvreux analyst David Evans said, but added that \"a continued negative reaction to results and pricing concerns yesterday is likely also a smaller part of the move today\"."}, {"date": "20240503050000", "headline": "This Is a Huge Sigh of Relief for Novo Nordisk Investors", "summary": "The path is clear for even more growth from Novo Nordisk's top two drugs, Ozempic and Wegovy."}, {"date": "20240503050458", "headline": "How the CFOs of Eli Lilly and Novo Nordisk are coping with ‘unprecedented demand’ for weight-loss drugs", "summary": "And the demand isn't slowing down."}, {"date": "20240503063658", "headline": "UPDATE 2-US FTC seeks more information on Novo Nordisk parent-Catalent deal", "summary": "The U.S. FTC has sought more information on Novo Nordisk parent's $16.5 billion bid for contract drug manufacturer Catalent, weeks after an application to the regulator was refiled for approval of the deal.  Catalent said on Friday the companies were in the process of gathering information to respond to the U.S. Federal Trade Commission's request received on May 2.  Novo Holdings in February agreed to buy Catalent to boost output of the popular weight-loss drug Wegovy."}, {"date": "20240503065812", "headline": "US FTC seeks more information on Novo Nordisk parent-Catalent deal", "summary": "Catalent said on Friday the companies were in the process of gathering information to respond to the U.S. Federal Trade Commission's request received on May 2.  Novo Holdings in February agreed to buy Catalent to boost output of the popular weight-loss drug Wegovy."}, {"date": "20240503074554", "headline": "The FTC Cracks Down On Novo Nordisk's Ozempic", "summary": "Novo Nordisk is under intense pressure both from competitors and now from regulators at the FTC. Read more to see our analysis on NVO stock."}, {"date": "20240503075000", "headline": "FTC Seeks More Information on $16.5 Billion Novo-Catalent Deal", "summary": "The request signals that the agency is reviewing whether the deal could be anticompetitive under U.S. law."}, {"date": "20240503085100", "headline": "Amgen Knocks Novo Nordisk's Ozempic Stock Rally. Its Stock Is Flying.", "summary": "Amgen’s progress on its experimental weight-loss drug offered investors a reminder that Novo Nordisk isn’t the only game in town.  Amgen’s jumped some 13%.  Amgen late Thursday gave some brief but bullish commentary on its drug candidate, MariTide."}, {"date": "20240503092900", "headline": "Pharma Stock Roundup: LLY, NVO, PFE Q1 Results, JNJ's New Plan to Resolve Talc Claims", "summary": "Eli Lilly (LLY), Novo Nordisk (NVO), Pfizer (PFE) and AbbVie (ABBV) announce their first-quarter results."}, {"date": "20240503093526", "headline": "Weight-loss drug competition heats up. Is Wegovy in trouble?", "summary": "The competition among weight-loss drugs is heating up as Amgen (AMGN) reports positive early results from the development of its GLP-1 weight-loss drug, MariTide. The pharmaceutical company also topped first-quarter revenue estimates despite reporting a loss of $113 million. Yahoo Finance Senior Health Reporter Anjalee Khemlani breaks down how competition in the obesity drug market is ramping up as drug manufacturers find new medical use cases for this class of drugs. She refers back to comments made by Novo Nordisk (NVO) CEO Lars Fruergaard Jørgensen — Novo Nordisk makes Wegovy and Ozempic — and Eli Lilly (LLY) CEO Dave Ricks — Eli Lilly makes Zepbound and Mounjaro — to Yahoo Finance over the past several months. For more expert insight and the latest market action, click here to watch this full episode of Catalysts. This post was written by Melanie Riehl"}, {"date": "20240503114800", "headline": "Novo Nordisk A/S: Trading in Novo Nordisk shares by board members, executives and associated persons", "summary": "Bagsværd, Denmark, 3 May 2024 — This company announcement discloses the data of the transaction(s) made in Novo Nordisk shares by the company’s board members, executives and their associated persons in accordance with Article 19 of Regulation No. 596/2014 on market abuse. The company’s board members, executives and their associated persons have reported the transactions to Novo Nordisk and have given Novo Nordisk power of attorney on their behalf to publish trading in Novo Nordisk shares by the"}, {"date": "20240503125308", "headline": "Analyst unveils Amgen stock price target after weight-loss drug data", "summary": "Here's what could happen next to Amgen shares."}, {"date": "20240503131538", "headline": "Novo Nordisk A/S (NYSE:NVO) Q1 2024 Earnings Call Transcript", "summary": "Novo Nordisk A/S (NYSE:NVO) Q1 2024 Earnings Call Transcript May 2, 2024 Novo Nordisk A/S misses on earnings expectations. Reported EPS is $0.7 EPS, expectations were $0.77. NVO isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good day! And thank […]"}, {"date": "20240503150725", "headline": "Amgen's peek at its GLP-1 drug trial results heightens competition in obesity market", "summary": "Competition is heating up in the GLP-1 space as Amgen gets closer to the finish line with its candidate."}, {"date": "20240504031302", "headline": "Amgen Could Become A Real Contender In The Obesity Market", "summary": "Amgen's shares surge on positive phase 2 trial results for obesity candidate MariTide, increasing its potential as a strong player in the market."}, {"date": "20240504044500", "headline": "Can Pfizer Challenge Lilly and Novo Nordisk in the Obesity Market?", "summary": "Where there's a will, there's a way. And Pfizer appears to have the will to stake a claim in the massive obesity drug market."}, {"date": "20240504063000", "headline": "Move Over, Mounjaro. Eli Lilly Has Another Blockbuster in the Making", "summary": "Eli Lilly has made inroads in the red-hot weight-loss market thanks to its diabetes blockbuster, Mounjaro."}]}