{"news": [{"date": "20240315060400", "headline": "FDA Approves BeiGene's First Drug Candidate Produced Through Its Immuno-Oncology Program For Esophageal Cancer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240315083753", "headline": "MorphoSys AG (NASDAQ:MOR) Q4 2023 Earnings Call Transcript", "summary": "MorphoSys AG (NASDAQ:MOR) Q4 2023 Earnings Call Transcript March 14, 2024 MorphoSys AG isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good afternoon, ladies and gentlemen. Welcome and thank you for joining MorphoSys Full Year 2023 Results and Business Update […]"}, {"date": "20240315214348", "headline": "Cytokinetics: CEO Talks Down Buyout Prospects", "summary": "Cytokinetics' share price is down 40% from January highs due to Novartis reportedly giving up on acquiring the company. Read more about CYTK stock here."}, {"date": "20240317003304", "headline": "Novartis AG (VTX:NOVN) most popular amongst individual investors who own 54% of the shares, institutions hold 36%", "summary": "Key Insights Novartis' significant individual investors ownership suggests that the key decisions are influenced by..."}, {"date": "20240318112829", "headline": "US appeals court revives Regeneron's antitrust lawsuit against Novartis", "summary": "A U.S. appeals court on Monday revived an antitrust lawsuit by Regeneron Pharmaceuticals against Novartis related to prescription treatments to address a condition that can lead to eye disorders including permanent blindness.  The 2nd U.S. Circuit Court of Appeals in Manhattan said a lower court judge erred in dismissing the case, in part for having applied an improper legal standard to Regeneron's claims.  Regeneron in a statement said it was \"encouraged by the 2nd Circuit’s decision\" and looked forward to \"further advancing our position in future proceedings.\""}, {"date": "20240318161520", "headline": "Novartis (NVS) Stock Dips While Market Gains: Key Facts", "summary": "In the latest trading session, Novartis (NVS) closed at $95.92, marking a -1.39% move from the previous day."}, {"date": "20240319004645", "headline": "Bristol-Myers Squibb Is Not A Buy For Me", "summary": "Bristol-Myers Squibb may be on the value menu for a while as the acquisition strategy may take time to pay off. Read more to see our analysis on BMY stock."}, {"date": "20240319012100", "headline": "AstraZeneca-Fusion deal reignites radiopharma space", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240319041619", "headline": "3 Potential Biotech Buyout Targets In 2024", "summary": "Biotech M&A activity surged at the end of 2023, which helped small biotech sector surge. Find out 3 logical buyout targets in biotech/biopharma space in 2024."}, {"date": "20240319230200", "headline": "BioNTech names Annemarie Hanekamp as Chief Commercial Officer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240320043500", "headline": "GenScript Losses Shrink On Strong Growth For Cancer Cell Therapy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322001400", "headline": "Novartis gets US regulatory approval for MorphoSys acquisition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322003500", "headline": "Novartis reports Fabhalta receives positive CHMP opinion", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322010000", "headline": "13 Dividend Aristocrat Bargains Yielding As Much As 9%", "summary": ""}, {"date": "20240322033300", "headline": "MorphoSys gains after gaining U.S. antitrust approval for sale to Novartis", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322033800", "headline": "Ozempic Users Speak Out Over Side Effects, Lawsuits Against Novo Nordisk And Eli Lilly Surge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322052200", "headline": "Novartis Fabhalta® (iptacopan) receives positive CHMP opinion as first oral monotherapy for adult patients with paroxysmal nocturnal hemoglobinuria (PNH)", "summary": "Positive CHMP opinion based on robust Phase III data, including APPLY-PNH, demonstrating superior hemoglobin improvement in the absence of transfusions with Fabhalta compared to anti-C5 therapy1-5 If approved, Fabhalta® will be the first oral monotherapy available in Europe for the treatment of PNH, a chronic and rare blood disorder, in both complement inhibitor-treated and -naive PNH patients with hemolytic anemia1Despite anti-C5 therapy, a large proportion of patients remain anemic, fatigued a"}, {"date": "20240322190000", "headline": "Week In Review: Three Multinationals Plan Investments In Southeast Asia Facilities", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240324011500", "headline": "Week In Review: 3 Multinationals Plan Investments In Southeast Asia Facilities", "summary": "Shanghai WuXi Biologics has broken ground on a $1.4 billion facility in Singapore. Click here to read more."}, {"date": "20240324061500", "headline": "1 Magnificent Dividend Stock to Buy and Hold", "summary": "The company's business went through some important changes last year."}, {"date": "20240324064400", "headline": "Look beyond the Magnificent 7 to the GRANOLAS - Goldman", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240324200751", "headline": "Sanofi: My Top Pick In Big Pharma", "summary": "Sanofi has a stable dividend proposition and a strong balance sheet. Click here to read why SNY stock is my favorite Big Pharma pick."}, {"date": "20240325033000", "headline": "Magnificent 7 Stocks Become The Star Attractions For Norway's Sovereign Wealth Fund", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240325070732", "headline": "2 More Potential Biotech Buyout Targets", "summary": "M&A activity in the biotech/biopharma sector is expected to remain active due to significant cash on Big Pharma's balance sheets. Explore more details here."}, {"date": "20240325074700", "headline": "Wall Street Lunch: Calhoun To Leave Boeing", "summary": "Boeing's top boss Dave Calhoun plans to step down at the end of the year. Mizuho turns cautious on EV sector, downgrades Tesla, Rivian, and Nio."}, {"date": "20240325105823", "headline": "30 Countries with Highest Proportion of Older Adults", "summary": "In this article, we will be covering the 30 countries with the highest proportion of older adults. If you wish to skip our detailed analysis, you can move directly to the 5 Countries with Highest Proportion of Older Adults. An Uptick in Population Ageing Currently, we are witnessing a trend of global population ageing as […]"}, {"date": "20240326110657", "headline": "Harnessing AI for Drug Discovery: Top 3 Stocks to Watch", "summary": "Artificial intelligence (AI) spans above and beyond today’s popular large language models (LLMs). OpenAI’s ChatGPT-4 Turbo or even Anthropic’s Claude 3 make for an impressive assistant for everyday tasks. These LLMs are improving at a jarring rate (GPT-5 could blow GPT-4 right out of the water). However, they may not have as much “shock” factor as the original GPT-3.5 did back in late 2022. Undoubtedly, various firms are working hard on AI technology to make it yield something ground-breaking, p"}, {"date": "20240327040808", "headline": "DFIV: When Value, Growth And Yield Come Together", "summary": "DFIV ETF is an actively managed fund investing in companies with value characteristics outside the U.S. Find out my thoughts on the fund."}, {"date": "20240327090000", "headline": "Mesoblast (MESO) to File Pediatric GVHD Drug BLA, Stock Up", "summary": "Mesoblast (MESO) gains as the FDA states that the available phase III data for lead candidate, remestemcel-L, is sufficient to support a regulatory filing for pediatric SR-aGVHD indication."}, {"date": "20240327160018", "headline": "Novartis (NVS) Increases Yet Falls Behind Market: What Investors Need to Know", "summary": "Novartis (NVS) closed at $95.88 in the latest trading session, marking a +0.64% move from the prior day."}, {"date": "20240328070011", "headline": "Investors Heavily Search Novartis AG (NVS): Here is What You Need to Know", "summary": "Zacks.com users have recently been watching Novartis (NVS) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects."}, {"date": "20240328115949", "headline": "Palazestrant's Journey: Olema Pharmaceuticals' Long Oncology Path", "summary": "Olema Pharmaceuticals shows promise in developing targeted oncology therapies for women's cancer. Click here to read an analysis of OLMA stock now."}, {"date": "20240329150251", "headline": "15 Biggest Swiss Companies", "summary": "In this article, we will discuss the 15 biggest Swiss companies. If you want to skip our analysis, you can proceed to the section highlighting the 5 Biggest Swiss Companies. Economy of Switzerland According to a report by the Federal Council of Switzerland, the Swiss GDP growth is projected to remain sluggish at 1.1% in […]"}, {"date": "20240330010000", "headline": "The Magnificent 7 Of Dividend Aristocrats Yield As Much As 6%", "summary": "Check here to learn about the lucrative potential of the Magnificent 7 of high-yield dividend aristocrats with impressive growth and risk management."}, {"date": "20240330135219", "headline": "11 Oversold Blue Chip Stocks to Buy Right Now", "summary": "In this article, we will take a look at the 11 oversold blue chip stocks to buy right now. To skip our analysis of the recent trends and market activity, you can go directly to see the 5 Oversold Blue Chip Stocks to Buy Right Now. The S&P 500 Index, widely regarded as the leading […]"}, {"date": "20240331032535", "headline": "Outlook Therapeutics: De-Risked Regulatory Tracks Are Lining Up For Possible ONS-5010 Approval", "summary": "Click here for analysis of the positive CHMP opinion for ONS-5010, potential European approval, ongoing Phase 3 study for Wet-AMD treatment, and more about Outlook Therapeutics stock."}, {"date": "20240331143455", "headline": "25 Countries with Highest Malaria Death Rates", "summary": "In this article, we will be taking a look at the 25 countries with highest malaria death rates. If you do not want to learn about the global malaria diagnostics market, head straight to the 5 Countries with Highest Malaria Death Rates. Global Malaria Diagnostics Market and Fatalities Overview The global malaria diagnostics market is […]"}, {"date": "20240401000819", "headline": "Cytokinetics, Incorporated: Buyout Speculation Persists", "summary": "Cytokinetics has faced setbacks with other pipeline assets but has a strong balance sheet and positive analyst ratings. See why CYTK stock is a Buy."}, {"date": "20240401204200", "headline": "Intra-Cellular files lawsuits challenging Caplyta generics", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402043900", "headline": "Biotech Roundtable: Who will bring the next CRISPR drug to market?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402161520", "headline": "Novartis (NVS) Declines More Than Market: Some Information for Investors", "summary": "In the most recent trading session, Novartis (NVS) closed at $94.41, indicating a -1.52% shift from the previous trading day."}, {"date": "20240404060000", "headline": "Novartis: Higher Guidance, Now A Buy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405160020", "headline": "Novartis (NVS) Stock Sinks As Market Gains: Here's Why", "summary": "In the latest trading session, Novartis (NVS) closed at $95.79, marking a -1.14% move from the previous day."}, {"date": "20240406022800", "headline": "Bausch Health sues Amneal Pharma over Xifaxan generic", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240406141600", "headline": "New Novartis data show early addition of twice-yearly* Leqvio® (inclisiran) following maximally tolerated statin therapy significantly reduces LDL-C in ASCVD patients in real-world setting", "summary": "Novartis today announced new data demonstrating the early addition of twice-yearly* Leqvio® (inclisiran) to maximally tolerated statin therapy, prior to guideline-recommended ezetimibe, in a real-world setting significantly reduced low-density lipoprotein cholesterol (LDL-C) in patients with atherosclerotic cardiovascular disease (ASCVD), including those with a history of an ASCVD-related event, who could not reach their goal on statin therapy alone1. The late-breaking data were presented at the"}, {"date": "20240406235200", "headline": "Novartis announces new data on twice-yearly Leqvio in ASCVD", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407063300", "headline": "Morgan Stanley sees Fed rate cut fueling biotech stock performance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407063900", "headline": "Morgan Stanley sees Fed rate cut fueling biotech stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407192200", "headline": "Johnson & Johnson's Carvykti Stands Ahead Of Bristol Myers' Rival Blood Cancer Therapy With FDA Approval For Wider Population", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408005400", "headline": "Novartis a Top Ranked SAFE Dividend Stock With 3.9% Yield (NVS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408193300", "headline": "Enliven Therapeutics Well-Positioned, With Conservative Trading Levels-Analyst Says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408195800", "headline": "The top 10 names with relative cheap earnings volume for the season - Barclays", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409035400", "headline": "Novartis to cut 680 jobs in product development, Reuters reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409050000", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409053600", "headline": "Novartis To Axe 680 Development Jobs Amid Global Reshuffle: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409081557", "headline": "Novartis to cut 680 jobs in product development", "summary": "Novartis is to cut up to 680 jobs in its development organisation, which helps bring its drugs to market, the Swiss pharmaceuticals company said on Tuesday.  Around 440 jobs will go in Switzerland and up to 240 in the United States over the next two to three years, the Basel-based company said.  The job eliminations are separate from a restructuring programme which could lead up to 8,000 of Novartis's 78,000 global workforce being cut, it said."}, {"date": "20240410005033", "headline": "Halozyme's Strategic Partnerships Fueling Next-Gen Therapeutics", "summary": "Halozyme's ENHANZE technology drives growth, projecting strong revenue growth and expansion potential in the future. Find out if HALO stock is a buy."}, {"date": "20240410031400", "headline": "Novartis Layoffs 2024: What to Know About the Latest NVS Job Cuts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410034100", "headline": "Jack Ma Is Giving Alibaba (BABA) Stock a Big Boost", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410040700", "headline": "SOUN Stock Alert: The $150 Million Reason SoundHound AI Is Down Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410061100", "headline": "Novartis pauses some trials of cancer drug Kisqali to fix manufacturing", "summary": "The company said the pause is necessary to meet regulatory limits on nitrosamine, but added it will not affect commercial supply nor regulatory review of the drug in early breast cancer."}, {"date": "20240410195300", "headline": "Vertex's Alpine Acquisition: Unpacking Analyst Predictions on Povetacicept's Potential Impact", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410225100", "headline": "Novartis commences tender offer for MorphoSys", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410233500", "headline": "Evercore expects Vera Therapeutics to trade up on Alpine acquisition news", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411000600", "headline": "Arvinas enters exclusive strategic license agreement with Novartis for ARV-766", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411014100", "headline": "Vertex Pharma upgraded at Evercore on Alpine Immune deal", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411015900", "headline": "MorphoSys Management, Supervisory board recommend Novartis takeover", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411021300", "headline": "MorphoSys board recommends shareholders accept Novartis offer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411022000", "headline": "Novartis tender offer for MorphoSys AG commences", "summary": "Basel, April 11, 2024 – Novartis published today the offer document for the voluntary public takeover offer by its wholly owned subsidiary Novartis BidCo AG for all outstanding shares of MorphoSys AG (“MorphoSys”), including all shares represented by MorphoSys American Depositary Shares (the “Offer”), for an offer price of EUR 68.00 per share in cash. The offer price corresponds to a premium of 142% on the volume-weighted average price during the last three months, as of the unaffected January 2"}, {"date": "20240411023900", "headline": "UPDATE 3-Novartis begins tender offer for cancer-focused MorphoSys", "summary": "Novartis said on Thursday it has launched a tender offer to acquire MorphoSys , a German developer of cancer treatments, for an aggregate 2.7 billion euros ($2.9 billion).  Reuters reported in February that Swiss drugmaker Novartis would buy MorphoSys, which had an equity market value of around 1.6 billion euros before the offer was announced.  The Swiss drugmaker said its cash offer price of 68 euros per MorphoSys share corresponds to a premium of 142% on the volume-weighted average price during the last three months, as of the unaffected closing price on Jan. 25."}, {"date": "20240411032300", "headline": "Looking At Novartis's Recent Unusual Options Activity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411045900", "headline": "TOP NEWS: MorphoSys urges shareholders to accept Novartis takeover", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411050000", "headline": "Arvinas Enters into a Transaction with Novartis, including a Global License Agreement for the Development and Commercialization of PROTAC® Androgen Receptor (AR) Protein Degrader ARV-766 for the Treatment of Prostate Cancer", "summary": "– Arvinas to receive a $150 million upfront payment for the license of ARV-766 and the sale of Arvinas’ preclinical AR-V7 program, with the potential under the License Agreement for up to $1.01 billion in development, regulatory, and commercial milestones, as well as tiered royalties – – Novartis to be responsible for worldwide clinical development and commercialization of ARV-766 – – Partnership expected to accelerate and broaden the development of ARV-766 as a potential first-in-class treatmen"}, {"date": "20240411054034", "headline": "UPDATE 2-Novartis taps Arvinas' cancer drug for up to $1 billion", "summary": "Swiss drugmaker Novartis AG has entered into a licensing deal worth up to $1.01 billion with Arvinas to gain access to the U.S. biotech firm's experimental prostate cancer drug, Arvinas said on Thursday.  Shares of Connecticut-based Arvinas rose more than 6% to $39 in premarket trade.  The pact adds to Novartis' pursuit of cancer treatments after it launched a tender offer on Thursday to acquire German cancer drugmaker MorphoSys for an aggregate 2.7 billion euros ($2.9 billion)."}, {"date": "20240411062500", "headline": "Fastenal, CarMax fall; Alpine Immune Sciences, Arvinas rise, Thursday, 4/11/2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411074500", "headline": "Novartis (NVS) to Undertake Job Cuts in Development Department", "summary": "Novartis (NVS) is set to cut jobs by 680 in its development organization to reshape workforce."}, {"date": "20240411092348", "headline": "What Vertex Pharmaceuticals Is Getting With Acquisition Of Alpine Immune Sciences", "summary": "Vertex Pharmaceuticals is acquiring Alpine Immune Sciences for $4.9 billion, gaining access to povetacicept. Read more on VRTX and ALPN stocks here."}, {"date": "20240411095052", "headline": "Arvinas And Novartis Partnering On Prostate Cancer Protein Degrader Is A Win-Win Situation", "summary": "Arvinas entered into a strategic license agreement with Novartis for the development and commercialization of ARV-766.Â Learn more about ARVN and NVS stock here."}, {"date": "20240411104515", "headline": "Biotech Stocks Heat Up As Arvinas Scores Novartis Licensing Pact, Janux Reportedly Explores Options", "summary": "Biotech stocks heated up Thursday as Novartis scooped up a licensing pact with Arvinas and Janux was said to be exploring strategic options."}, {"date": "20240412115500", "headline": "Novartis (NVS) Inks Deal for ARVN's Prostate Cancer Candidate", "summary": "Novartis (NVS) enters into a license deal with Arvinas, Inc. (ARVN) for the worldwide development and commercialization of cancer candidate ARV-766. Shares of ARVN rise on the news."}, {"date": "20240413035600", "headline": "AbbVie keeps Humira market share near 100% despite biosimilars: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414090015", "headline": "Antitrust fervor is gripping Washington and Silicon Valley. But lawsuits have been declining.", "summary": "Antitrust lawsuits have declined since the pandemic despite a high-profile push by Washington to limit the concentration of power in key industries."}, {"date": "20240414190600", "headline": "Novartis reports results from interim analysis of Phase 3 APPLAUSE-IgAN study", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415091200", "headline": "IN BRIEF: Novartis issues positive data on kidney treatment, Fabhalta", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415120000", "headline": "New Novartis Fabhalta® (iptacopan) data show clinically meaningful and statistically significant proteinuria reduction of 38.3% versus placebo for patients with IgA nephropathy (IgAN)", "summary": "Novartis today presented results from a pre-specified interim analysis of the Phase III APPLAUSE-IgAN study of Fabhalta® (iptacopan), an investigational Factor B inhibitor of the alternative complement pathway, in patients with IgA nephropathy (IgAN)1. In the analysis, patients treated with Fabhalta achieved a 38.3% (p<0.0001) proteinuria reduction (as measured by 24-hour urine protein to creatinine ratio [UPCR]) at 9 months when compared to placebo on top of supportive care1."}, {"date": "20240416070600", "headline": "Novartis (NVS) Presents Positive Data on Rare Kidney Disease Drug", "summary": "Novartis (NVS) announces encouraging data on Fabhalta from a phase III study for the treatment for the treatment of immunoglobulin A nephropathy, a heterogeneous, progressive, rare kidney disease."}, {"date": "20240416081655", "headline": "VGK Vs. QQQ: How Europe's 'GRANOLAS' Could Outperform The US 'Magnificent 7'", "summary": ""}, {"date": "20240416192000", "headline": "Novartis Kesimpta® six-year efficacy data show substantial benefits in recently diagnosed treatment-naïve people with relapsing multiple sclerosis", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416231500", "headline": "Novartis Kesimpta® six-year efficacy data show substantial benefits in recently diagnosed treatment- naïve people with relapsing multiple sclerosis", "summary": "Continuous Kesimpta® treatment for up to six years showed sustained efficacy in recently diagnosed (≤3 years) treatment-naïve people living with relapsing multiple sclerosis (RMS) in an analysis of the ALITHIOS open-label extension study1Similar efficacy outcomes were demonstrated in a separate analysis of continuous Kesimpta treatment for up to six years in the overall ALITHIOS study population2 Switch from teriflunomide to Kesimpta resulted in significant improvements across several efficacy o"}, {"date": "20240416232100", "headline": "Novartis announces data from the ALITHIOS study of Kesimpta", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417023200", "headline": "CVS favors Humira copycats hurting AbbVie’s market share: Evercore", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417042412", "headline": "TG Therapeutics: The Cloud Over Briumvi", "summary": "TG Therapeutics is developing a subcutaneously injected version of Briumvi to compete with Roche's SC Ocrevus. Check out my recommendation on TGTX stock."}, {"date": "20240417045000", "headline": "Novartis Multiple Sclerosis Drug Kesimpta Shows Substantial Benefit Of Up To 6 Years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417073000", "headline": "2 High-Yield Dividend Stocks to Buy and Hold for 10 Years", "summary": "These income stocks look like good options at current levels."}, {"date": "20240418012839", "headline": "Johnson & Johnson: Buy This Bargain Before It's Gone", "summary": "Johnson & Johnson exceeds expectations with strong financial results and impressive sales growth. Read more to see why I am bullish on JNJ stock."}, {"date": "20240418062100", "headline": "TG Therapeutics wins VA contract for Briumvi", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418071523", "headline": "Exploring Analyst Estimates for Novartis (NVS) Q1 Earnings, Beyond Revenue and EPS", "summary": "Evaluate the expected performance of Novartis (NVS) for the quarter ended March 2024, looking beyond the conventional Wall Street top-and-bottom-line estimates and examining some of its key metrics for better insight."}, {"date": "20240418075929", "headline": "Caribou Biosciences: 2 Clinical Data Updates In 2024 Could Bring Value", "summary": "Caribou Biosciences, Inc. expects promising phase 1 studies on CB-010 and CB-011 for various lymphoma and myeloma treatments by Q2 2024. Click for my CRBU update."}, {"date": "20240418163309", "headline": "US FDA mandates label updates on CAR-T cancer therapies", "summary": "The U.S. Food and Drug Administration said on Thursday cancer therapies that use CAR-T technology will require changes to the so-called \"boxed warning\" to highlight the serious risk of T-cell blood cancer in patients who use these therapies.  The health regulor has required related updates to other sections of the label such as warnings and precautions, postmarketing experience, patient counseling information and medication guide.  In January, the FDA asked a host of drugmakers including Gilead Sciences, Johnson & Johnson and Novartis to add a boxed warning to their CAR-T cancer therapies, as it received reports of patients developing a type of T-cell blood cancer after being treated with them."}, {"date": "20240418195100", "headline": "Tech advances are catalyzing the Health Care sector with improved investor sentiment - SSGA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418231400", "headline": "FDA requires labeling changes to CAR-T cell therapies to reflect cancer risk", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419010348", "headline": "Unveiling Pfizer's Potent Cocktail: Key Drivers Of Free Cash Flow Growth", "summary": "Pfizer announced positive results from a pivotal clinical trial evaluating Abrysvo's efficacy against respiratory syncytial virus. See why PFE stock is a Buy."}, {"date": "20240419023000", "headline": "FDA Mandates \"Boxed Warning\" For Bristol Myers, Johnson & Johnson CAR-T-Based Blood Cancer Therapies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419050248", "headline": "Novartis Looks To Get Back On Track With Q1 Earnings", "summary": "Novartis'Â key drugs like Fabhalta and Cosentyx may drive short-term growth, offsetting potential losses from generic competition. Learn more on NVS stock here."}, {"date": "20240419081000", "headline": "Novartis (NVS) to Report Q1 Earnings: What to Expect?", "summary": "Novartis (NVS) key drugs Entresto, Kisqali and Pluvicto are likely to have fueled its top and bottom-line numbers in the first quarter."}, {"date": "20240420224900", "headline": "Can Magnificent 7 Help Script Market Turnaround? Earnings Pick Up Pace With Microsoft, Meta, Alphabet And Tesla Expected This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422044400", "headline": "Novartis Q1 2024 Earnings Preview", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422111700", "headline": "Top Analyst Reports for Novartis, American Express & ConocoPhillips", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Novartis AG (NVS), American Express Company (AXP) and ConocoPhillips (COP)."}, {"date": "20240422183500", "headline": "GLOBAL BRIEFING: Japan's business activity growth speeds up in April", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422191400", "headline": "Novartis wins pediatric indication for Lutathera for rare cancer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422210400", "headline": "Novartis shares jump as drugmaker boosts outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422220300", "headline": "Novartis upgrades guidance after \"strong momentum\" in opening quarter", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422221700", "headline": "Biggest stock movers today: IBRX, NVS, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422230000", "headline": "Novartis delivers double-digit sales growth and core margin expansion in Q1; FY 2024 guidance raised", "summary": "Ad hoc announcement pursuant to Art. 53 LRQ1 net sales grew +11% (cc1, +10% USD) with core operating income up +22% (cc, +16% USD) Key growth drivers continued strong sales momentum including Entresto (+36% cc), Cosentyx (+25% cc), Kesimpta (+66% cc), Kisqali (+54% cc), Pluvicto (+47% cc) and Leqvio (+139% cc)Core operating income margin 38.4%, +340 basis points (cc), mainly driven by higher net salesOperating income grew +39% (cc, +29% USD) and net income grew +37% (cc, +25% USD), mainly driven"}, {"date": "20240422230300", "headline": "Novartis: Q1 Earnings Snapshot", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422231600", "headline": "NVS Earnings: Novartis Beats Q1 Estimates, Raises Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422231825", "headline": "UPDATE 2-Novartis lifts guidance after Q1 results beat expectations", "summary": "Swiss drugmaker Novartis on Tuesday raised its full-year guidance after reporting better-than-expected first-quarter results.  In a statement, it said 2024 net sales would likely grow by a high-single to low double-digit percentage with adjusted operating income expected to grow by a low double-digit to mid-teens percentage.  It has previously predicted that adjusted operating income would increase by a \"high single-digit\" percentage with \"mid single-digit\" sales growth."}, {"date": "20240422233100", "headline": "Novartis Raises Guidance on Profit, Sales Growth", "summary": "Novartis lifted its full-year guidance after first-quarter profit and sales rose and beat consensus expectations, boosted by strong sales of key drugs."}, {"date": "20240422233500", "headline": "Novartis reports Q1 core EPS grew 23% in constant currency to $1.80", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422233700", "headline": "Novartis FY24 net sales, core operating income guidance raised", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000000", "headline": "Novartis Q1 Results Surge, 2024 Outlook Brightens", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000200", "headline": "Wall Street Set To Open Higher As Tesla To Kick Off 'Magnificent 7' Earnings: Why This Analyst Thinks Market Weakness Is A 'Healthy Pullback'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423002400", "headline": "Wall Street Set To Open Higher As Tesla Kicks Off 'Magnificent 7' Earnings: Why This Analyst Thinks Market Weakness Is A 'Healthy Pullback'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423010106", "headline": "Techs boost STOXX to one-week high; euro zone data on tap", "summary": "European stocks scaled on Tuesday to their highest levels in more than a week, driven by the technology sector as investors found comfort in upbeat corporate earnings, while UK's FTSE 100 Index climbed to hit an all-time peak.  The pan-European STOXX 600 index was up 0.6%, as of 0712 GMT, boosted by a nearly 2% jump in technology shares."}, {"date": "20240423013824", "headline": "Novartis AG 2024 Q1 - Results - Earnings Call Presentation", "summary": "The following slide deck was published by Novartis AG in conjunction with their 2024 Q1 earnings call."}, {"date": "20240423014300", "headline": "Biggest stock movers today: DHR, IBRX, NVS, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423024000", "headline": "Biggest stock movers today: GM, DHR, IBRX, NVS, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423025700", "headline": "Biggest stock movers today: SPOT, GM, DHR, IBRX, NVS, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423025843", "headline": "UPDATE 1-Healthcare, tech stocks boost STOXX 600 to one-week high", "summary": "European stocks scaled to their highest levels in more than a week on Tuesday, driven by the healthcare and technology sector, as investors found comfort in upbeat corporate earnings, while the UK's FTSE 100 Index climbed to hit an all-time peak.  The pan-European STOXX 600 index was up 0.6%, as of 0838 GMT, boosted by a nearly 0.9% jump in healthcare stocks ."}, {"date": "20240423031211", "headline": "Trending tickers: Tesla, ABF, Novartis, Taylor Wimpey, JD Sports", "summary": "The latest investor updates on stocks that are trending on Tuesday."}, {"date": "20240423040000", "headline": "Novartis: Strong Start To The Year With Beat-And-Raise First Quarter Results", "summary": "Beat-and-raise first quarter puts Novartis in a good position for shareholder value creation in the following years. Read more to see our analysis on NVS stock."}, {"date": "20240423054500", "headline": "Novartis raises forecasts as top drug sales beat Wall Street estimates", "summary": "Sales of Entresto and Cosentyx grew faster in the first quarter than analysts anticipated, helping drive the quarterly beat and raise."}, {"date": "20240423055600", "headline": "NVS Stock Earnings: Novartis Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423060200", "headline": "Former Bristol Myers CEO tapped as Novartis’ next board chair", "summary": "Giovanni Caforio, who left Bristol Myers in November after eight years as CEO, is set to succeed Novartis’ longtime board chair Joerg Reinhardt next year."}, {"date": "20240423060700", "headline": "Novartis, Danaher rise; Nucor, Cadence Design Systems fall, Tuesday, 4/23/2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423061900", "headline": "Health Care Roundup: Market Talk", "summary": "0710 GMT –  Novartis  raised its outlook after first-quarter results beat  Barclays  and market expectations on a stronger-than-expected business performance and higher spending, Barclays analysts say in a note.  0652 GMT – Novartis beat expectations for first-quarter sales and earnings and raised its 2024 outlook for both metrics by a wider margin than expected, which could trigger increases to consensus expectations, Jefferies analysts say in a research note.  The Swiss pharmaceutical giant reported quarterly sales of $11.83 billion and a core operating profit of $4.54 billion, beating Jefferies’s forecasts of $11.46 billion and $4.46 billion, respectively, the analysts say."}, {"date": "20240423063300", "headline": "Novartis beats top-line and bottom-line estimates; raises FY24 outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423063400", "headline": "Sanofi reportedly lining up banks for consumer products spinoff", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423063800", "headline": "Stocks Rally On Weaker PMI Data, Tech Earnings Optimism, Dollar Falls: What's Driving Markets Tuesday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423065700", "headline": "The Zacks Analyst Blog Highlights Novartis, American Express, ConocoPhillips, Netflix and Schlumberger", "summary": "Novartis, American Express, ConocoPhillips, Netflix and Schlumberger are part of the Zacks top Analyst Blog."}, {"date": "20240423065900", "headline": "Novartis reports FDA approves Lutathera for pediatric GEP-NETs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423070000", "headline": "Novartis (NVS) Q1 Earnings, Sales Beat, Guidance Raised", "summary": "Novartis (NVS) comfortably beats first-quarter earnings and sales estimates. The company ups its outlook for 2024 on strong growth across key brands."}, {"date": "20240423073028", "headline": "Compared to Estimates, Novartis (NVS) Q1 Earnings: A Look at Key Metrics", "summary": "The headline numbers for Novartis (NVS) give insight into how the company performed in the quarter ended March 2024, but it may be worthwhile to compare some of its key metrics to Wall Street estimates and the year-ago actuals."}, {"date": "20240423074400", "headline": "Incyte (INCY) to Report Q1 Earnings: What's in the Cards?", "summary": "Incyte's (INCY) first-quarter 2024 revenues are likely to have been driven by the U.S. sales and royalties from Novartis on ex-U.S. sales of its lead drug, Jakafi."}, {"date": "20240423085159", "headline": "Novartis raises full-year guidance on Q1 beat, drug sales", "summary": "Shares of Novartis (NVS) are soaring in Tuesday's pre-market trading session — holding onto steady gains into the market open — after the Swiss pharmaceutical giant reported better-than-expected first-quarter earnings and raised its full-year guidance. The robust financial performance was driven primarily by strong sales of the company's innovative heart failure and psoriasis treatment drugs. Yahoo Finance Health Reporter Anjalee Khemlani breaks down the details. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Angel Smith"}, {"date": "20240423091511", "headline": "Novartis Ag (NVS) Q1 2024 Earnings Call Transcript", "summary": "NVS earnings call for the period ending March 31, 2024."}, {"date": "20240423093237", "headline": "Novartis Stock Jumps After Beating Expectations, Raising Guidance", "summary": "Shares of Swiss drugmaker Novartis rallied after the company’s first-quarter sales surpassed analysts’ expectations, and it raised its full-year guidance.  Novartis executives touted strong sales across major brands on an analyst call on Tuesday.  The pharmaceutical company reported $11.8 billion in first-quarter net sales—higher than analysts' estimates, and fueled by more than $1 billion in quarterly sales for both heart-failure drug Entresto and psoriasis drug Cosentyx."}, {"date": "20240423095400", "headline": "IN BRIEF: FDA approves Novartis's Lutathera for pediatric patients", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423102449", "headline": "Top Midday Stories: Shares of GE, Novartis, Danaher and Philip Morris Up Post-Earnings; Pepsi Stock Down Post-Earnings; Apple iPhone China Sales Drop 19%; Trump Poised for Windfall From Media Company Stock", "summary": "Top Midday Stories: Shares of GE, Novartis, Danaher and Philip Morris Up Post-Earnings; Pepsi Stock Down Post-Earnings; Apple iPhone China Sales Drop 19%; Trump Poised for Windfall From Media Company Stock"}, {"date": "20240423114200", "headline": "Novartis radioligand therapy Lutathera® FDA approved as first medicine specifically for pediatric patients with gastroenteropancreatic neuroendocrine tumors", "summary": "Approval based on NETTER-P trial in which Lutathera demonstrated a consistent safety profile and comparable drug exposure between pediatric (ages 12-17) and adult patients Gastroenteropancreatic neuroendocrine tumors (GEP-NETs) are a rare cancer that is often unresectable and commonly diagnosed in the late stages of diseaseNovartis, a leader in radioligand therapy (RLT), is investigating a portfolio of RLTs to treat a broad range of cancers, including GEP-NETs, lung, prostate, breast, colon, bra"}, {"date": "20240423140103", "headline": "How Novartis Rode Two Blockbuster Drugs To Its Beat And Raise, And Three-Day Sprint", "summary": "Novartis stock jumped Tuesday after the drugmaker topped first-quarter sales and earnings forecasts, and raised its full-year outlook."}, {"date": "20240423150530", "headline": "FDA Approves Novartis' Lutathera As First Therapy For Pediatric Patients With Gastroenteropancreatic Neuroendocrine Tumors", "summary": "Tuesday, Novartis AG (NYSE:NVS) received FDA approval for its Lutathera (lutetium Lu 177 dotatate / INN: lutetium (177Lu) oxodotreotide) for pediatric patients 12 years and older with somatostatin receptor-positive (SSTR+) gastroenteropancreatic neuroendocrine tumors (GEP-NETs), including foregut, midgut, and hindgut NETs. This approval makes Lutathera the first therapy specifically reviewed and approved for use in pediatric patients with GEP-NETs. Related: Novartis Stock Gains On European Drugm"}, {"date": "20240423162509", "headline": "Why Novartis Stock Topped the Market on Tuesday", "summary": "A double beat on the latest quarterly results and raised guidance made investors happy."}, {"date": "20240423223000", "headline": "Novartis and Medicines for Malaria Venture announce positive efficacy and safety data for a novel treatment for babies <5 kg with malaria", "summary": "There is currently no evidence-based treatment for the smallest babies with malaria The CALINA study tested a new ratio and dose of Coartem® (artemether- lumefantrine) to account for metabolic differences in babies under 5 kg The CALINA trial indicated that the new formulation has good efficacy and safety, and the data have been submitted for regulatory review Basel, April 24, 2024 – Novartis and Medicines for Malaria Venture (MMV) announce positive data from their phase II/III CALINA study, dem"}, {"date": "20240423232500", "headline": "Novartis, MMV announce data for Phase II/III CALINA study of Coartem", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424002600", "headline": "BeiGene price target raised by $1 at TD Cowen, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424011000", "headline": "GLOBAL BROKER RATINGS: Stifel ups Adidas, Kepler cuts Siemens Energy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424045400", "headline": "Novartis price target raised by CHF 5 at JPMorgan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424053200", "headline": "Novartis price target raised by CHF 4 at UBS", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424073600", "headline": "Company News for Apr 24, 2024", "summary": "Companies in The News Are: UPS,PM,NVS,IVZ"}, {"date": "20240424083038", "headline": "Novartis AG (NYSE:NVS) Q1 2024 Earnings Call Transcript", "summary": "Novartis AG (NYSE:NVS) Q1 2024 Earnings Call Transcript April 23, 2024 Novartis AG isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning and good afternoon, and welcome to the Novartis Q1 2024 Results Release Conference Call and Live Webcast. […]"}, {"date": "20240424094219", "headline": "Novartis bags paediatric FDA label expansion for Lutathera", "summary": "Lutathera is approved by the US FDA to treat patients aged 12 years and older with rare gastroenteropancreatic neuroendocrine cancer."}, {"date": "20240424095200", "headline": "IN BRIEF: Novartis reports positive data for Coartem antimalarial", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425063031", "headline": "Why Big Pharma Is Following Novartis' Lead In A $25 Billion Market", "summary": "Novartis paved the way for radiopharmaceuticals. Now, Big Pharma thinks it can do better — and biotech stocks have soared on a spate of deals."}, {"date": "20240425065500", "headline": "What's Going On With Pfizer Stock On Thursday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425114916", "headline": "These Are The Biotechs Showing Up At The Biggest Cancer Meeting Of The Year (Oral Presentations)", "summary": "The Annual Meeting of ASCO is a major event for clinicians and researchers in the field of oncology. Explore more details here."}, {"date": "20240426013300", "headline": "GLOBAL BROKER RATINGS: Stifel cuts Caterpillar; HSBC likes Ashtead", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426093400", "headline": "Pharma Stock Roundup: MRK, SNY, AZN, NVS' Q1 Results, Pipeline & Regulatory Updates", "summary": "Merck (MRK), Sanofi (SNY), Novartis (NVS) and AstraZeneca (AZN) announce their first-quarter results."}, {"date": "20240426095640", "headline": "Diving Into Deciphera Pharmaceuticals", "summary": "Deciphera's Vimseltinib is expected to make significant progress in the TGCT indication. Check out myÂ investment analysis around DCPH stock here."}, {"date": "20240426204100", "headline": "Amgen’s Blincyto data send Cullinan higher", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427010000", "headline": "16 High-Yield Dividend Aristocrats Yielding Almost 5%", "summary": "Attempting to time the market is not a successful strategy. Read why long-term investing has consistently outperformed market timing."}, {"date": "20240427210000", "headline": "Pharma Stock Roundup: Merck, Sanofi, AstraZeneca, Novartis' Q1 Results, Pipeline & Regulatory Updates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428015800", "headline": "New safety risk for MorphoSys drug could complicate Novartis deal - STAT", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428060400", "headline": "J&J, Roche, AstraZeneca poised to have highest orphan drug sales by end of decade", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428201200", "headline": "Amgen court hearing in patent lawsuit vs Sandoz over generic Prolia cancelled (update)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428213300", "headline": "Terns Pharmaceutical releases promising phase 1 data on leukemia candidate", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428214000", "headline": "Terns Pharmaceuticals releases promising phase 1 data on leukemia candidate", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429000800", "headline": "New safety risk for MorphoSys drug could complicate Novartis deal - STAT (update)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429054200", "headline": "MorphoSys Says Novartis Deal Progressing Steadily Despite Safety Concerns Over Bone Marrow Cancer Drug, Pelabresib", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429055300", "headline": "Amgen court hearing in patent lawsuit vs Sandoz over generic Prolia cancelled", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429074011", "headline": "Why This 1 Value Stock Could Be a Great Addition to Your Portfolio", "summary": "Whether you're a value, growth, or momentum investor, finding strong stocks becomes easier with the Zacks Style Scores, a top feature of the Zacks Premium research service."}, {"date": "20240429103400", "headline": "MorphoSys on course for takeover by Novartis as quarterly revenue up", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429184800", "headline": "GLOBAL BRIEFING: HSBC CEO to retire; first-quarter profit edges down", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429235400", "headline": "Biotech Sector: M&A Fuels Renewed Excitement", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430010000", "headline": "PeptiDream Announces Expansion of Peptide Discovery Collaboration with Novartis", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430031400", "headline": "FTC expands patent listing challenges for drugs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430052400", "headline": "Novo, Teva, AstraZeneca issued FTC warnings over ‘bogus’ patents", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430075011", "headline": "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick", "summary": "Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores."}, {"date": "20240430095025", "headline": "Update: FTC Challenging 'Junk' Patent Listings for Ozempic, Victoza, Other Medications", "summary": "Update: FTC Challenging 'Junk' Patent Listings for Ozempic, Victoza, Other Medications"}, {"date": "20240430211300", "headline": "Federal Trade Commission Targets 'Junk Patent Listings' For Diabetes, Weight Loss, Asthma Drugs From Companies Like Novo Nordisk, AstraZeneca", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501005300", "headline": "IN BRIEF: Avacta picks Christina Coughlin to replace long-serving CEO", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501080002", "headline": "Novartis Is Tracking Well Above the Industry", "summary": "A closer look at one of the leaders in the global cancer therapeutics market"}, {"date": "20240501114627", "headline": "CVS stock plunges after earnings numbers one analyst 'did not even believe'", "summary": "CVS warns it could cede Medicare Advantage market share as reimbursement rates pressure the company."}, {"date": "20240501193700", "headline": "Radiopharma stocks higher as sector welcomes the latest M&A deal", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502002200", "headline": "Novartis to pay up to $1.75 billion for U.S. cancer-focused biotech", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502005000", "headline": "Novartis to buy Mariana Oncology for $1B upfront", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502010106", "headline": "The top pharmaceutical companies by R&D expenditure", "summary": "From Merck & Co to Sanofi, Pharmaceutical Technology lists the leading pharmaceutical companies spending the most on R&D in 2023."}, {"date": "20240502040600", "headline": "Genmab reports Q1 revenue increased 46% vs. last year", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502040900", "headline": "H.C. Wainwright sees Actinium as buyout candidate after Mariana deal", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502053027", "headline": "UPDATE 2-Novartis to buy radiology drug specialist Mariana for $1 billion", "summary": "Novartis agreed to acquire U.S. radiopharmaceutical company Mariana Oncology for $1 billion upfront, boosting its portfolio of precision cancer treatments in development, the Swiss drug manufacturer said on Thursday.  Mariana Oncology is working on novel radioligand cancer therapies (RLTs) that have not yet been tested on humans.  \"The transaction bolsters the Novartis RLT pipeline and expands the company’s research infrastructure and clinical supply capabilities,\" Novartis said in a statement."}, {"date": "20240502062000", "headline": "Novartis to buy Mariana Oncology in radiopharmaceutical expansion", "summary": "The $1 billion dollar acquisition will add to Novartis’ pipeline of the targeted radiation drugs, giving it a potential lung cancer treatment."}, {"date": "20240502095427", "headline": "Top Midday Stories: Novo Nordisk, Linde Shares Fall Post-Earnings; Peloton Shares Plummet After Announcing Job Cuts, CEO Change; Exxon-Pioneer Deal Gets FTC Approval With One Caveat", "summary": "Top Midday Stories: Novo Nordisk, Linde Shares Fall Post-Earnings; Peloton Shares Plummet After Announcing Job Cuts, CEO Change; Exxon-Pioneer Deal Gets FTC Approval With One Caveat"}, {"date": "20240503010000", "headline": "10 Sleep-Well-At-Night Dividend Aristocrats Perfect For Whatever's Coming Next", "summary": "Read here for an analysis of 10 SWAN aristocrats with an average 3% yield, an A-credit rating, and a 43-year dividend growth streak."}, {"date": "20240503035355", "headline": "TG Therapeutics: Less Room For Doubt About Briumvi", "summary": "TG Therapeutics beat first quarter revenue expectations and raised the full-year revenue guidance by $40 million at the mid-point. Read more on TGTX stock here."}, {"date": "20240503051529", "headline": "Swiss Helvetia Fund: High Yield, Quality Swiss Stocks At A Discount To Net Asset Value", "summary": "Swiss Helvetia Fund, a potential takeover target, offers diversified foreign stocks with high dividends and a 15% discount to NAV. Learn more on SWZ CEF here."}, {"date": "20240503061500", "headline": "Why selling to Novartis made sense for Mariana", "summary": "Conversations at this year's J.P. Morgan Healthcare Conference led to a $1 billion buyout that Mariana's CEO described as a \"perfect marriage.\""}, {"date": "20240503102900", "headline": "Alnylam (ALNY) Q1 Loss Narrower Than Expected, Sales Rise Y/Y", "summary": "Alnylam (ALNY) reports better-than-expected first-quarter 2024 results as both earnings and revenues beat estimates, primarily driven by strong Amvuttra sales."}]}