{"news": [{"date": "20240415070000", "headline": "Cheetos® Debuts 'Other Hand' Campaign, an Official Celebration of Fans who Reserve their Dominant Hand for Enjoying Cheetos", "summary": "Ninety-nine percent of people eat Cheetos® with their dominant hand, which means they need to live their life using their Other Hand... even if things get a little messy. Now, Cheetos officially celebrates those Cheetos lovers who have committed their dominant hand to solely eating their favorite snack with the launch of the Other Hand campaign. Through a series of new digital spots, advertising stunts and a partnership with 2023 NBA Champion and Cheetos fan Jamal Murray, the brand shows the ant"}, {"date": "20240415070000", "headline": "CHICAGO BLACKHAWKS FOUNDATION AND PEPSICO TEAM UP TO IGNITE YOUTH CAREERS WITH NEW GAMECHANGERS INITIATIVE", "summary": "The Chicago Blackhawks Foundation and PepsiCo kicked off April by providing career insights and resources to West Side high school students through the GameChangers initiative, launched this season by the Chicago Blackhawks Foundation, with PepsiCo serving as the presenting corporate sponsor. During visits to PepsiCo facilities in the Old Post Office and 35th Street Distribution Center, students gained hands-on exposure to careers in various industries, including sports, hospitality and food & b"}, {"date": "20240415081800", "headline": "The Zacks Analyst Blog Highlights PepsiCo, Canadian Pacific Kansas City, MercadoLibre, Lululemon Athletica, and Manulife Financial", "summary": "PepsiCo, Canadian Pacific Kansas City, MercadoLibre, Lululemon Athletica, and Manulife Financial are included in this Analyst Blog."}, {"date": "20240415094700", "headline": "Will Strategies Help Procter & Gamble (PG) Beat on Q3 Earnings?", "summary": "Procter & Gamble (PG) is progressing well with its pricing actions, business investments, and productivity and cost-saving plans. These are likely to have supported its Q3 performance."}, {"date": "20240415130000", "headline": "3 Brands That Should Sign Caitlin Clark After Her Viral March Madness Run", "summary": "The most obvious Caitlin Clark stocks are Nike (NYSE:NKE) and PepsiCo (NASDAQ:PEP). The NCAA basketball phenom already has deals with the two public companies. Although the soon-to-be WNBA star failed to win the NCAA Tournament for the second year in a row, she’s a marketer’s dream, so there will be no shortage of powerful companies looking to sign her to long-term sponsorships. She’ll undoubtedly make millions in the next few years. However, as she said at the Iowa Hawkeye’s celebration at thei"}, {"date": "20240416000100", "headline": "Beyond Market Price: Uncovering PepsiCo Inc's Intrinsic Value", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416030100", "headline": "/C O R R E C T I O N -- Frito-Lay North America/", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416044252", "headline": "PepsiCo Stock: Preparing For Q1 2024 Amid Continued Underperformance", "summary": "Consumer staples stocks, including PepsiCo, continue to underperform the market significantly. See what to expect from PEP from its Q1 earnings."}, {"date": "20240416070000", "headline": "Gatorade Named Official Sports Drink of Rob McElhenney and Ryan Reynolds' Wrexham AFC", "summary": "Today, Gatorade announced its official sports drink partnership with the Wrexham Association Football Club, fueling the club's Men's and Women's teams. The deal comes three days after the club's second consecutive promotion, up to League One, and enables Gatorade and its science-backed products and innovations to support Wrexham in the team's aspirations to reach the Premier League."}, {"date": "20240416070100", "headline": "Global Potato Chip Icon LAY'S® Teams Up with Soccer Icon Lionel Messi for Reveal of New Soccer Rally Cry: 'Oh-Lay's, Oh-Lay's, Oh-Lay's, Oh-Lay's'", "summary": "Soccer season is in full swing and fans around the country are getting together to enjoy games, LAY'S® potato chips in hand, singing the beloved \"Olé\" chant after every goal. Now, the iconic potato chip brand is giving fans a few extra reasons to cheer this season with help from none other than the soccer G.O.A.T, Lionel Messi, in a way only he and Lay's can. Together, the two global icons invite fans to embrace a new rally cry – \"Oh-Lay's\" – with the debut of a catchy new campaign and the launc"}, {"date": "20240416070200", "headline": "5 Soft Drink Stocks Set to Sway in a Prospering Industry", "summary": "The Beverages - Soft Drinks companies like KO, PEP, MNST, KDP and COCO look strong on robust consumer demand, innovation efforts, expansion into newer categories and digital investments despite inflation pressures."}, {"date": "20240416080044", "headline": "PepsiCo (PEP) Earnings Expected to Grow: Should You Buy?", "summary": "PepsiCo (PEP) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240416155017", "headline": "Why PepsiCo (PEP) Outpaced the Stock Market Today", "summary": "The latest trading day saw PepsiCo (PEP) settling at $168.18, representing a +0.74% change from its previous close."}, {"date": "20240417010000", "headline": "Low Risk, High Return? The Power Of The 15-Stock Dividend Growth Portfolio", "summary": "Dividends have contributed significantly to the total return of the S&P 500 since 1960, making dividend investing important. Read here for a portfolio approach."}, {"date": "20240417013600", "headline": "Zacks Industry Outlook Highlights Coca-Cola, PepsiCo, Monster Beverage, Keurig Dr Pepper and Vita Coco", "summary": "Coca-Cola, PepsiCo, Monster Beverage, Keurig Dr Pepper and Vita Coco have been highlighted in this Industry Outlook article."}, {"date": "20240417032004", "headline": "RSPS: Consumer Staples Dashboard For April", "summary": "RSPS has 39 holdings and a total expense ratio of 0.40%, which is significantly more expensive than XLP. Find out my thoughts on the fund."}, {"date": "20240417063000", "headline": "PepsiCo Announces Webcast of Annual Shareholders' Meeting", "summary": "PepsiCo, Inc.'s (NASDAQ: PEP) virtual annual shareholders' meeting (the \"Annual Meeting\") will be webcast live on Wednesday, May 1, 2024 at 9 a.m. Eastern Daylight Time. The Annual Meeting will be a virtual-only meeting. The virtual meeting and live audio webcast will be accessible at http://www.virtualshareholdermeeting.com/PEP2024 or through PepsiCo's website at www.pepsico.com in the \"Investors\" section under \"Financial Information – Events & Presentations.\""}, {"date": "20240417070000", "headline": "Rockstar Energy Drink® and Global Superstar Myke Towers Unveil the Next Rising Star in Latin Urban Music", "summary": "Rockstar Energy Drink and Myke Towers, a globally renowned Puerto Rican rapper and songwriter, today announced GiL as the official winner of \"Rockstar Energy Presents: Mic Check con Myke Towers,\" a national campaign launched in December of 2023 to discover the next generation of aspiring Latin urban music stars."}, {"date": "20240417095300", "headline": "Here's Why PepsiCo (PEP) Looks Poised for Earnings Beat in Q1", "summary": "PepsiCo's (PEP) Q1 results are expected to reflect gains from continued benefits of the mitigation of inflationary pressures through cost-management and revenue-management initiatives."}, {"date": "20240418024700", "headline": "RBC Capital Sticks to Its Hold Rating for PepsiCo (PEP)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418053300", "headline": "Forget Pepsi and Coke: The 3 Best Beverage Stocks to Buy Instead", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418063300", "headline": "PepsiCo Stock: Buy, Sell, or Hold?", "summary": "Can a business this mature still be a buy?"}, {"date": "20240418070400", "headline": "GRANDMA'S® Cookies Celebrates its New Look with Remix from Hip-Hop Legends Salt-N-Pepa and Gives One Lucky Winner $10,000", "summary": "No one can spoil you quite like grandma does, and GRANDMA'S® Cookies – the brand baking up memories for more than 110 years – is no exception. GRANDMA'S Cookies has enlisted iconic hip-hop duo Salt-N-Pepa to debut its new look and drop the first of many treats for cookie lovers and hip-hop fans alike: a reimagined version of the classic nursery rhyme, \"Who Stole the Cookie from the Cookie Jar?\". The remix was co-written with Cheryl \"Salt\" James and Sandra \"Pepa\" Denton who star in an accompanyin"}, {"date": "20240418071522", "headline": "PepsiCo (PEP) Q1 Earnings on the Horizon: Analysts' Insights on Key Performance Measures", "summary": "Get a deeper insight into the potential performance of PepsiCo (PEP) for the quarter ended March 2024 by going beyond Wall Street's top -and-bottom-line estimates and examining the estimates for some of its key metrics."}, {"date": "20240418080154", "headline": "Keurig Dr Pepper, Inc (KDP) Reports Next Week: What You Should Expect", "summary": "Keurig Dr Pepper (KDP) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240418200200", "headline": "Catalyst Watch: Tesla, Boeing and General Motors brace for earnings fireworks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418201700", "headline": "PepsiCo using only 37 of promised 100 Tesla Semis, Reuters reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418202100", "headline": "PepsiCo using only 36 of promised 100 Tesla Semis, Reuters reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418202500", "headline": "At least 70% of the S&P 500 names that reported results this week topped estimates - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419040028", "headline": "Ibotta: New IPO With Strong Growth", "summary": "Ibotta, Inc. had a successful trading debut, with shares trading up sharply and closing at over $103 per share. Check out my thoughts on IBTA stock."}, {"date": "20240419045100", "headline": "Did You Get the Average $3,011 Tax Refund for Your 2023 Return? 3 No-Brainer Stocks to Buy Now", "summary": "For those in a financial position to invest in them, this trio of stocks could help build long-term wealth."}, {"date": "20240419055000", "headline": "PepsiCo's Options Frenzy: What You Need to Know", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419075304", "headline": "Teamsters union files charges against PepsiCo with US labor board", "summary": "Teamsters local unions in threestates filed unfair labor practice charges against PepsiCowith the U.S. National Labor Relations Board, the unionsaid on Friday. The charges were filed..."}, {"date": "20240419115304", "headline": "Teamsters union files charges against PepsiCo with NLRB", "summary": "Teamsters local unions in three states filed unfair labor practice charges against PepsiCo with the U.S. National Labor Relations Board, the union said on Friday.  The charges were filed by five Teamsters local unions in the states of Illinois, Indiana and Iowa over PepsiCo's work rules that prohibit workers from discussing wages, hours, or other terms or conditions of employment, according to the union.  PepsiCo did not immediately respond to a request for comment."}, {"date": "20240419130100", "headline": "FOCUS-Tesla Semi trucks in short supply for PepsiCo as its rivals use competing EV big rigs", "summary": "Key Tesla customer PepsiCo made initial payments for 100 Tesla Semis in 2017, intending to use the electric-truck fleet to haul its Cheetos, Lays potato chips and Pepsi soda pop to retailers.  But according to the food-and-drinks maker and one of its executives with knowledge of the deal, PepsiCo was using only 36 of Teslas promised 100 electric trucks as of this month.  The shortfall, which hasn't been previously disclosed, lays bare the challenges for Tesla as it seeks to become a high-volume player in the truck-manufacturing business."}, {"date": "20240419130438", "headline": "Tesla Semi trucks in short supply for PepsiCo as its rivals use competing EV big rigs", "summary": "Key Tesla customer PepsiCo made initial payments for 100 Tesla Semis in 2017, intending to use the electric-truck fleet to haul its Cheetos, Lays potato chips and Pepsi soda pop to retailers.  But according to the food-and-drinks maker and one of its executives with knowledge of the deal, PepsiCo was using only 36 of Teslas promised 100 electric trucks as of this month.  The shortfall, which hasn't been previously disclosed, lays bare the challenges for Tesla as it seeks to become a high-volume player in the truck-manufacturing business."}, {"date": "20240419133432", "headline": "UPDATE 1-Teamsters union files charges against PepsiCo with US labor board", "summary": "Teamsters local unions in three states filed unfair labor practice charges against PepsiCo with the U.S. National Labor Relations Board, the union said on Friday.  The charges were filed by five Teamsters local unions in the states of Illinois, Indiana and Iowa over PepsiCo's work rules that prohibit workers from discussing wages, hours, or other terms or conditions of employment, according to the union.  \"We have been negotiating in good faith with Teamsters across Illinois and Indiana to reach mutually agreeable collective bargaining agreements,\" PepsiCo Beverages North America said in an emailed statement to Reuters and added it had not committed any \"unfair labor practices.\""}, {"date": "20240419154511", "headline": "Tesla, Boeing, Big Tech earnings, PCE data: What to watch", "summary": "As the week draws to a close at Yahoo Finance, anchors Julie Hyman and Madison Mills preview the key events to watch in the upcoming week. Earnings results will be in focus. Tuesday sees a number of big names reporting, such as Tesla (TSLA), PepsiCo (PEP), and General Electric (GE). On Wednesday, Boeing (BA) will unveil its first quarter earnings, an eagerly anticipated report as the company continues to navigate significant headwinds and operational challenges.  There are also earnings from Big Tech companies Meta (META), Alphabet (GOOGL, GOOG), and Microsoft (MSFT). Friday energy giants Chevron (CVX) and ExxonMobil (XOM) are scheduled to release their earnings reports, providing insights into the health and dynamics of the oil market. Last, the Personal Consumption Expenditures Price Index, the Federal Reserve's preferred inflation gauge, will be released on Friday. It's a crucial metric for the central bank's future monetary policy decisions. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Angel Smith"}, {"date": "20240420010000", "headline": "10 High-Yield Dividend Aristocrats Perfect For An Uncertain Market", "summary": "Volatility in the stock market is normal and healthy. Click here to read more about the ten lowest-volatility dividend aristocrats."}, {"date": "20240420214100", "headline": "Dividend Income Summary: March 2024 Summary", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420224900", "headline": "Can Magnificent 7 Help Script Market Turnaround? Earnings Pick Up Pace With Microsoft, Meta, Alphabet And Tesla Expected This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421004642", "headline": "Wall Street Breakfast: The Week Ahead", "summary": "Stay updated with the latest financial news and market trends by listening to the Wall Street Breakfast podcast available on Seeking Alpha, iTunes, and..."}, {"date": "20240421010500", "headline": "Earnings week ahead: Tesla, Meta Platforms, Google, Microsoft, Intel, Exxon Mobil, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421184139", "headline": "SCHD: If You've Won The Game, Take A Little Off The Top", "summary": "SCHD is a great capital gains storage for positions that may be getting over-concentrated in your portfolio. Read why SCHD ETF is a Buy."}, {"date": "20240421190300", "headline": "Chicago Pepsi drivers vote in favor of strike", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421202000", "headline": "Notable Monday Option Activity: PEP, ZS, ORCL", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421221700", "headline": "Here’s What You’ve Got To Watch For As Earnings Ramp Up", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422000200", "headline": "Options Volatility and Implied Earnings Moves This Week, April 22 – April 26, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422010139", "headline": "PepsiCo (PEP) Q1 Earnings: What To Expect", "summary": "Food and beverage company PepsiCo (NASDAQ:PEP) will be reporting results tomorrow before market open. Here's what you need to know."}, {"date": "20240422042900", "headline": "Pepsi Stock Chart Looks Bullish Ahead Of Q1 Ratings, But Analysts Are Cautious", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422043900", "headline": "PepsiCo Q1 earnings on deck: What to expect", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422062700", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422062900", "headline": "Pepsi Stock Chart Looks Bullish Ahead Of Q1 Earnings, But Analysts Are Cautious (CORRECTED)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422075000", "headline": "Are These 4 Beverage Stocks Poised to Hit Q1 Earnings Targets?", "summary": "Players in the beverage industry are expected to have witnessed positive trends from expanded digital platforms and strong demand for innovative products in the to-be-reported quarter. Inflationary cost pressures, particularly higher input costs, are likely to have hurt."}, {"date": "20240422090900", "headline": "Why PepsiCo (PEP) Might Surprise This Earnings Season.", "summary": "PepsiCo (PEP) is seeing favorable earnings estimate revision activity and has a positive Zacks Earnings ESP heading into earnings season."}, {"date": "20240422143000", "headline": "PepsiCo’s Earnings Are Tuesday. Wall Street Is Looking Further Ahead.", "summary": "The results are expected to highlight the challenge consumer-products companies face in dealing with inflation."}, {"date": "20240422174402", "headline": "PepsiCo Q1 Earnings Preview: Can Beverage Giant Keep Streak Of EPS Beats Alive? One Analyst Cautions On Salty Snacks", "summary": "Beverage and food giant PepsiCo Inc (NASDAQ:PEP) is set to report first-quarter financial results before the market open Tuesday. Here are the key earnings estimates and what analysts are saying ahead of the report. Earnings Estimates: Analysts expect Pepsi to report first-quarter revenue of $18.08 billion, according to estimates from Benzinga Pro. The company reported revenue of $17.85 billion in last year's first quarter. Pepsi beat revenue estimates from analysts in nine of the past 10 quarte"}, {"date": "20240422183500", "headline": "GLOBAL BRIEFING: Japan's business activity growth speeds up in April", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422193900", "headline": "General Motors, Tesla And 3 Stocks To Watch Heading Into Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422194200", "headline": "What Analysts Are Saying About PepsiCo's Q1 Earnings?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422195000", "headline": "Investor Optimism Improves, But Fear & Greed Index Remains In 'Fear' Zone", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422212600", "headline": "What You Missed On Wall Street On Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422230000", "headline": "Barclays Releases a Buy Rating on PepsiCo (PEP)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422230900", "headline": "PepsiCo Non-GAAP EPS of $1.61 beats by $0.09, revenue of $18.25B beats by $140M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422232600", "headline": "Nasdaq, S&P, Dow futures show little change as investors await more earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422232600", "headline": "PepsiCo in charts: International sales surge while North America fizzles in Q1", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422234200", "headline": "The Top 3 Stocks for Beginners With Little Money in April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422235000", "headline": "PepsiCo tops organic sales expectations as international business shines", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000109", "headline": "PepsiCo : Q1 2024 PepsiCo Earnings Press Release", "summary": "PepsiCo Reports First-Quarter 2024 Results; Affirms 2024 Financial Guidance Reported First-Quarter 2024 Results ..."}, {"date": "20240423000200", "headline": "Earnings Scheduled For April 23, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000200", "headline": "Wall Street Set To Open Higher As Tesla To Kick Off 'Magnificent 7' Earnings: Why This Analyst Thinks Market Weakness Is A 'Healthy Pullback'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000412", "headline": "PepsiCo : Reports First-Quarter 2024 Results; Affirms 2024 Financial Guidance - Form 8-K", "summary": "PepsiCo Reports First-Quarter 2024 Results; Affirms 2024 Financial Guidance Reported First-Quarter 2024 Results ..."}, {"date": "20240423000600", "headline": "Options Volatility and Implied Earnings Moves Today, April 23, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000809", "headline": "PepsiCo: Q1 Earnings Snapshot", "summary": "PURCHASE, N.Y. — PURCHASE, N.Y. — PepsiCo Inc. on Tuesday reported first-quarter earnings of $2.04 billion. The Purchase, New York-based company said it had profit of $1.48 per share...."}, {"date": "20240423002100", "headline": "TOP NEWS: PepsiCo backs outlook as profit up despite recall hit", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423002400", "headline": "Wall Street Set To Open Higher As Tesla Kicks Off 'Magnificent 7' Earnings: Why This Analyst Thinks Market Weakness Is A 'Healthy Pullback'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423002600", "headline": "PepsiCo’s profit beats estimates, but Quaker recalls weigh on earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423002600", "headline": "PepsiCo Exceeds Q1 Expectations with Strong Growth and Margin Expansion, Maintains Positive FY2024 Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423005900", "headline": "PEP Earnings: Pepsico Delivers Strong Q1 Results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423005900", "headline": "PepsiCo's International Growth Offsets North America Lull, Affirms 2024 Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423013608", "headline": "PepsiCo: EPS up 7% in Q1", "summary": "For the first three months of 2024, PepsiCo reports core EPS of $1.61, up 7% at constant exchange rates, on revenues of over $18.2 billion, with organic growth of 2.7%.The food and beverage group,..."}, {"date": "20240423022400", "headline": "4 stocks to watch on Tuesday: TSLA, UPS and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423022700", "headline": "PepsiCo reports Q1 core EPS $1.61, consensus $1.52", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423022800", "headline": "PepsiCo backs FY24 core EPS view 'at least' $8.15, consensus $8.15", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423023400", "headline": "Nasdaq, S&P, Dow advance as investors await more earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423023800", "headline": "PepsiCo: A Stable Performer with Uncertain Growth Trajectory – Maintaining Hold Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423024100", "headline": "Unusually active option classes on open April 23rd", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423024200", "headline": "Analysts Are Bullish on These Consumer Goods Stocks: Philip Morris (PM), PepsiCo (PEP)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423025500", "headline": "US Stocks Higher; PepsiCo Posts Upbeat Earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423030900", "headline": "Coca-Cola expects significant benefits from generative AI partnership with Microsoft", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423031108", "headline": "PepsiCo, Inc. (PEP) Q1 2024 Earnings Call Transcript", "summary": "PepsiCo, Inc. (NASDAQ:NASDAQ:PEP) Q1 2024 Earnings Conference Call April 23, 2024 8:15 AM ETCompany ParticipantsRavi Pamnani - Senior Vice President,..."}, {"date": "20240423035009", "headline": "Trending : Pepsi 1Q Revenue Beats Analyssts' Estmates", "summary": "09:34 ET -- PepsiCo is one of the most mentioned companies in the U.S. across all news items in the past 12 hours, according to Factiva data. PepsiCo earnings and sales jumped last quarter, as..."}, {"date": "20240423035400", "headline": "PEP Stock Earnings: PepsiCo Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423040033", "headline": "PepsiCo beats quarterly revenue estimates on price hikes, steady demand", "summary": "PepsiCo beat Wall Street expectations for first-quarter revenue on Tuesday as demand held steady for the soda and snacks giant's Tropicana juices and Cheetos in its international markets.  Consumers have remained resilient and shelled out money for PepsiCo's Lays chips and 7UP products across the company's international markets, helping offset a slowdown witnessed in its major market United States.  Several rounds of price hikes in the U.S. have led consumers in the region to push back on the company's sodas and juices as sticky inflation makes customers cautious with their spending."}, {"date": "20240423040546", "headline": "UPDATE 5-PepsiCo's results beat as international demand, higher prices drive growth", "summary": "PepsiCo beat Wall Street expectations for first-quarter revenue and profit on Tuesday as demand for its sodas and snacks like Cheetos and Doritos in international markets drove growth even as it witnessed a slowdown in the United States.  Consumers across Europe, Asia Pacific and China shelled out money for PepsiCo's pricey sodas and chips, while customers in the U.S. cut back on the products due to strained budgets.  International business accounted for about 40% of PepsiCo's fiscal 2023 revenue, while its North America businesses accounted for the remaining."}, {"date": "20240423040656", "headline": "PepsiCo's results beat as international demand, higher prices drive growth", "summary": "(Reuters) -PepsiCo beat Wall Street expectations for first-quarter revenue and profit on Tuesday as demand for its sodas and snacks like Cheetos and Doritos in international markets drove growth even as it witnessed a slowdown in the United States.  Consumers across Europe, Asia Pacific and China shelled out money for PepsiCo's pricey sodas and chips, while customers in the U.S. cut back on the products due to strained budgets.  International business accounted for about 40% of PepsiCo's fiscal 2023 revenue, while its North America businesses accounted for the remaining."}, {"date": "20240423041600", "headline": "PepsiCo (PEP) Q1 Earnings: A Mixed Bag with a Focus on Recovery", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423042000", "headline": "Tesla Unveils Timeline For Electric Semi-Truck Production, First Units To 'External Customers'  By 2026", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423042145", "headline": "PepsiCo (NASDAQ:PEP) Posts Q1 Sales In Line With Estimates", "summary": "Food and beverage company PepsiCo (NASDAQ:PEP) reported results in line with analysts' expectations in Q1 CY2024, with revenue up 2.3% year on year to $18.25 billion. It made a non-GAAP profit of $1.61 per share, improving from its profit of $1.50 per share in the same quarter last year."}, {"date": "20240423042500", "headline": "Chicago Pepsi drivers vote in favor of strike - updated", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423043924", "headline": "PepsiCo beats Q1 revenue forecasts as price increases moderate", "summary": "PepsiCo reported better-than-expected revenue in the first quarter on strong international demand for its snacks and beverages.  Pepsi reaffirmed its financial guidance for 2024, including organic revenue growth of 4%.  The company has said it expects to return to more normal rates of growth this year after several years of inflation-driven price increases."}, {"date": "20240423044300", "headline": "Celsius Holdings may have been the breakout star of the PepsiCo earnings call", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423045800", "headline": "Tesla Unveils Timeline For Scaling Up Electric Semi-Truck Production, First Units From New Factory To 'External Customers' By 2026", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423045800", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423051005", "headline": "PepsiCo (PEP) Q1 Earnings and Revenues Beat Estimates", "summary": "PepsiCo (PEP) delivered earnings and revenue surprises of 5.92% and 0.62%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240423063800", "headline": "Stocks Rally On Weaker PMI Data, Tech Earnings Optimism, Dollar Falls: What's Driving Markets Tuesday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423064101", "headline": "PepsiCo Fiscal First-Quarter Results Top Views But Quaker Foods Business Takes Hit from Product Recalls", "summary": "PepsiCo Fiscal First-Quarter Results Top Views But Quaker Foods Business Takes Hit from Product Recalls"}, {"date": "20240423073030", "headline": "Compared to Estimates, PepsiCo (PEP) Q1 Earnings: A Look at Key Metrics", "summary": "While the top- and bottom-line numbers for PepsiCo (PEP) give a sense of how the business performed in the quarter ended March 2024, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values."}, {"date": "20240423075000", "headline": "Wall Street Lunch: California Bill Takes Aim At Clear Secure", "summary": "California State Senator Josh Newman introduces bill to limit Clear's concierge service at airports, citing equity issues. GM reports higher-than-expected Q1 earnings."}, {"date": "20240423075206", "headline": "PepsiCo Boosted by International Growth as US Sales Drop", "summary": "(Bloomberg) -- PepsiCo Inc. posted stronger-than-expected sales growth thanks to robust demand in its international divisions, while volumes dropped in North America.Most Read from BloombergRay Dalio’s Famous Trade Is Sputtering, Investors BailingTesla Stock in ‘No Man’s Land’ After 43% Rout Ahead of EarningsBillionaire Pinaults Fight to Pull Gucci Off the Discount RackApple’s China iPhone Sales Dive 19% in Worst Quarter Since 2020‘Magnificent Seven’ Roar Hours Away From Earnings: Markets WrapTh"}, {"date": "20240423075537", "headline": "PepsiCo Q1 earnings top estimates, but recalls hurt results", "summary": "PepsiCo (PEP) reported first quarter results that topped Wall Street estimates on both the top and bottom lines. However, recalls from its Quaker Foods North America unit did put a damper on sales. Yahoo Finance's Seana Smith and Brad Smith recap the food giant's results. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Stephanie Mikulich."}, {"date": "20240423082400", "headline": "Pre-Markets Up, Q1 Earnings Beats for GM, UPS, Pepsi", "summary": "Ahead of economic prints like Friday's PCE report, Q1 earnings are starting to come in hot and heavy."}, {"date": "20240423092000", "headline": "PepsiCo Stock Dips After Earnings Beat Estimates. Quaker Recall Might Be Why.", "summary": "PepsiCo reports earnings of $1.61 a share on revenue of $18.3 billion in the first quarter of 2024, beating analysts' expectations."}, {"date": "20240423092043", "headline": "PepsiCo Q1 EPS Surpasses Expectations on Revenue Growth, Gross Margins Expansion, Wedbush Says", "summary": "PepsiCo Q1 EPS Surpasses Expectations on Revenue Growth, Gross Margins Expansion, Wedbush Says"}, {"date": "20240423101300", "headline": "NEW YORK MARKET CLOSE: Stocks motor as upbeat earnings provide spark", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423102449", "headline": "Top Midday Stories: Shares of GE, Novartis, Danaher and Philip Morris Up Post-Earnings; Pepsi Stock Down Post-Earnings; Apple iPhone China Sales Drop 19%; Trump Poised for Windfall From Media Company Stock", "summary": "Top Midday Stories: Shares of GE, Novartis, Danaher and Philip Morris Up Post-Earnings; Pepsi Stock Down Post-Earnings; Apple iPhone China Sales Drop 19%; Trump Poised for Windfall From Media Company Stock"}, {"date": "20240423102800", "headline": "PepsiCo (PEP) Q1 Earnings & Sales Beat, International Unit Aids", "summary": "PepsiCo's (PEP) Q1 results reflect strong momentum across its international business, driven by at least high-single-digit organic revenue growth in all its international regions."}, {"date": "20240423160600", "headline": "Why Pepsico Stock Slipped Today", "summary": "Problems at Quaker Foods overshadowed an otherwise solid quarter."}, {"date": "20240423190157", "headline": "PepsiCo Inc (PEP) Q1 2024 Earnings: Aligns with Analyst EPS Projections, Revenue Exceeds ...", "summary": "Comprehensive Analysis of PepsiCo's Latest Financial Performance"}, {"date": "20240423192200", "headline": "Investor Sentiment Improves Further, Dow Jumps Over 250 Points", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423195906", "headline": "Q1 2024 PepsiCo Inc Earnings Call", "summary": "Q1 2024 PepsiCo Inc Earnings Call"}, {"date": "20240423221100", "headline": "Analysts Are Bullish on Top Consumer Goods Stocks: PepsiCo (PEP), WH Group Limited (WHGRF)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423223000", "headline": "Madison Sustainable Equity Fund Q1 2024 Investment Strategy Letter", "summary": "Equity markets had a solid start to the year, with the S&P 500 up 10.6%. The Madison Sustainable Equity Fund lagged the S&P 500 for the first quarter."}, {"date": "20240423230141", "headline": "Decoding PepsiCo Inc (PEP): A Strategic SWOT Insight", "summary": "Unveiling the Strengths and Challenges: A Deep Dive into PepsiCo Inc (PEP) SWOT Analysis"}, {"date": "20240423235100", "headline": "Wall Street Analysts Are Neutral on Top Consumer Goods Picks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424000600", "headline": "Will the Stock Market Crash? 3 Apocalypse Stocks to Buy if You’re Worried.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424005700", "headline": "Jefferies Sticks to Its Buy Rating for PepsiCo (PEP)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424010141", "headline": "PepsiCo Inc (PEP) Q1 2024 Earnings Call Transcript Highlights: Strategic Insights and Growth ...", "summary": "Unveiling PepsiCo's robust international performance, margin strategies, and brand developments in the first quarter of 2024."}, {"date": "20240424011000", "headline": "GLOBAL BROKER RATINGS: Stifel ups Adidas, Kepler cuts Siemens Energy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424021300", "headline": "PepsiCo 'compressed valuation' likely to rebound, says Morgan Stanley", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424025000", "headline": "Artisan Global Discovery Fund Q1 2024 Commentary", "summary": "Artisan Global Discovery Fund portfolio outperformed the MSCI AC World Index in Q1 2024. Click here to read the full letter."}, {"date": "20240424033000", "headline": "Artisan Global Equity Fund Q1 2024 Commentary", "summary": "Artisan Global Equity Fund's portfolio solidly outperformed the MSCI AC World Index. Click here to read the full fund letter."}, {"date": "20240424043200", "headline": "PepsiCo First Quarter 2024 Earnings: EPS Misses Expectations", "summary": "PepsiCo ( NASDAQ:PEP ) First Quarter 2024 Results Key Financial Results Revenue: US$18.3b (up 2.3% from 1Q 2023). Net..."}, {"date": "20240424071935", "headline": "PepsiCo, Inc. (NASDAQ:PEP) Q1 2024 Earnings Call Transcript", "summary": "PepsiCo, Inc. (NASDAQ:PEP) Q1 2024 Earnings Call Transcript April 23, 2024 PepsiCo, Inc. misses on earnings expectations. Reported EPS is $1.48 EPS, expectations were $1.52. PEP isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning and welcome to PepsiCo’s […]"}, {"date": "20240424150958", "headline": "Why PepsiCo Stock Was Bouncing Back Today", "summary": "Morgan Stanley sees more upside to the beverage stock."}, {"date": "20240424214000", "headline": "PepsiCo Inc. stock underperforms Thursday when compared to competitors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424220900", "headline": "PepsiCo price target raised by $1 at Barclays, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424230600", "headline": "7 Stocks That Will Keep Going Up During the Next Downturn", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425010000", "headline": "PepsiCo call buyer realizes 285% same-day gains", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425021000", "headline": "March's Dividend Portfolio Update Sets New All-Time Record - 100 Holdings, 21 Buys", "summary": "Portfolio changes in March focus on BDCs, aiming to increase dividend income by at least $100 each month. Click here for a detailed analysis."}, {"date": "20240425024000", "headline": "Unusually active option classes on open April 25th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425051500", "headline": "Dow Cratering Toward Worst Day Since March 2023", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425053300", "headline": "Looking Into PepsiCo's Recent Short Interest", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425064908", "headline": "Pepsi Tops Estimates Despite A Weakened Domestic Market", "summary": "On Tuesday, Pepsi Co Inc (NASDAQ: PEP) showed it managed to navigate weaker U.S. demand that was the result of Quaker Oats recalls and backlash to higher prices for its drinks and snacks. But despite delivering better than expected earnings and revenue for its first quarter, Pepsi shares dipped about 2% upon the report as Wall Street watched at other things, such as a struggling domestic market. First quarter highlights For the quarter ended on March 23rd, Pepsi reported that revenue grew 2.3% t"}, {"date": "20240425074505", "headline": "Here's Why PepsiCo (PEP) is a Strong Growth Stock", "summary": "Whether you're a value, growth, or momentum investor, finding strong stocks becomes easier with the Zacks Style Scores, a top feature of the Zacks Premium research service."}, {"date": "20240425104319", "headline": "PepsiCo, Nestlé and Danone among top plastic polluters, study claims", "summary": "Food and drinks producers were found to be \"disproportionately large polluters\" in the assessment."}, {"date": "20240425233500", "headline": "3 Recession-Proof Stocks to Add to Your Portfolio in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426020000", "headline": "PEPSI® ANNOUNCE FOOTBALL STAR JACK GREALISH AS GLOBAL BRAND AMBASSADOR IN MULTI-YEAR PARTNERSHIP", "summary": "Pepsi has today unveiled the signing of its latest global brand ambassador, Jack Grealish, on a multi-year deal."}, {"date": "20240426050302", "headline": "Shareholders May Not Be So Generous With PepsiCo, Inc.'s (NASDAQ:PEP) CEO Compensation And Here's Why", "summary": "Key Insights PepsiCo to hold its Annual General Meeting on 1st of May Total pay for CEO Ramon Laguarta includes..."}, {"date": "20240426055213", "headline": "PepsiCo US woes, Nestlé in India, Heineken Europe sales – Just Drinks’ week in data", "summary": "Each week we bring you a snapshot of the news through data."}, {"date": "20240426071207", "headline": "The New Pepsi Challenge: A Dividend Stock Showdown Between Coca-Cola and PepsiCo", "summary": "Remember the Pepsi Challenge? The iconic marketing campaign where people were invited to participate in a blind taste test, choosing their favorite between Coca-Cola and Pepsi? Well, we’re bringing that concept back, but with a twist. Instead of ..."}, {"date": "20240426075010", "headline": "Are You a Momentum Investor? This 1 Stock Could Be the Perfect Pick", "summary": "Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores."}, {"date": "20240426091700", "headline": "Understanding PepsiCo (PEP) Reliance on International Revenue", "summary": "Examine PepsiCo's (PEP) international revenue patterns and their implications on Wall Street's forecasts and the prospective trajectory of the stock."}, {"date": "20240426102248", "headline": "PepsiCo sells interest in Serbian soft-drinks group Knjaz Miloš", "summary": "Czech soft-drinks supplier Mattoni 1873 has acquired full control of Knjaz Miloš."}, {"date": "20240426102845", "headline": "Is It Time To Buy These Beaten Down Dividend Stocks?", "summary": "Amid the growing volatility in the stock market, as the macroeconomic headwinds and geopolitical tensions pile on, investors are increasingly being drawn towards high-paying dividend stocks. These stocks often emerge as an attractive option for those ..."}, {"date": "20240426213300", "headline": "What Investing Account Types Are The Best Fit For You And Your Dividends?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427023000", "headline": "7 Stocks I'm Buying The First Week Of May", "summary": "Read here to learn more about the impact of trade barriers, economic headwinds, and the trade war on the global economy, as well as dividend growth stocks."}, {"date": "20240427040000", "headline": "7 Dividend Stocks to Buy Now for Steady Returns in Any Market", "summary": "Dividend stocks can be a great way to build wealth. If you are a long-term investor and believe in dividend reinvesting, you could generate above-average returns over a few years. However, the trick is to choose companies that have a steady cash flow and those that believe in rewarding shareholders, no matter how the market moves. If a stock market crash is predicted for the near future, invest in these seven dividend stocks for steady returns, you will continue to generate income while you wait"}, {"date": "20240427043800", "headline": "7 Stocks to Buy if Inflation Continues to Reign in 2024", "summary": "Before considering which stocks to buy if inflation continues, it’s good to remember the relationship between inflation and interest rates. The latest reading on CPI and PPI shows that the declining inflation rate may be ramping back up. The takeaway is that the Fed is less likely to lower interest rates, which puts pressure on equities. But while some stocks will struggle, others are built to shine during rising inflation. These are the companies that deliver the products and services that cons"}, {"date": "20240428063026", "headline": "Why I have hated this earnings season — and you might too", "summary": "This earnings has started with a whimper."}, {"date": "20240429032900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429040000", "headline": "Chinese spend more on diapers and Colgate despite economic woes", "summary": "Chinese shoppers are spending a little more on diapers and some Colgate toothpastes, according to executives at the makers of these products, even as consumers fret about the country's property crisis and faltering economy.  China's economic slump after the pandemic has weighed on sales at consumer packaged goods companies, who had targeted the world's second-biggest economy as a major source of growth.  Some consumer companies like Tide detergent maker Procter & Gamble, Reckitt, which manufactures Dettol cleaning solutions, and food producer PepsiCo are reporting some small signs of stronger spending in China."}, {"date": "20240429055430", "headline": "PEPSI ANNOUNCE FOOTBALL STAR JACK GREALISH AS GLOBAL BRAND AMBASSADOR IN MULTI-YEAR PARTNERSHIP", "summary": "LONDON-- Pepsi has today unveiled the signing of its latest global brand ambassador, Jack Grealish, on a multi-year deal.Jack will take centre stage in Pepsi's soon-to-be-announced global football..."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429073009", "headline": "Wall Street Bulls Look Optimistic About PepsiCo (PEP): Should You Buy?", "summary": "The average brokerage recommendation (ABR) for PepsiCo (PEP) is equivalent to a Buy. The overly optimistic recommendations of Wall Street analysts make the effectiveness of this highly sought-after metric questionable. So, is it worth buying the stock?"}, {"date": "20240429074010", "headline": "Are Consumer Staples Stocks Lagging  PepsiCo (PEP) This Year?", "summary": "Here is how PepsiCo (PEP) and Pilgrim's Pride (PPC) have performed compared to their sector so far this year."}, {"date": "20240429100010", "headline": "PepsiCo (PEP) Upgraded to Buy: What Does It Mean for the Stock?", "summary": "PepsiCo (PEP) might move higher on growing optimism about its earnings prospects, which is reflected by its upgrade to a Zacks Rank #2 (Buy)."}, {"date": "20240429213800", "headline": "PepsiCo increases dividend by ~7% to $1.355", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000100", "headline": "PepsiCo Inc: An Exploration into Its Intrinsic Value", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430001700", "headline": "Coca-Cola smashes organic sales expectations off strong global growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430013614", "headline": "Norway's wealth fund backs bid for PepsiCo biodiversity risk assessment", "summary": "Norway's sovereign wealth fund plans to back a shareholder proposal demanding PepsiCo conduct a biodiversity risk assessment to gauge how vulnerable the soft drink and snacks giant's operations are to biodiversity loss.  The decision by PepsiCo's seventh-largest shareholder adds to signs that biodiversity-related risks to businesses are rising up the agenda for investors.  It also challenges the PepsiCo board's recommendation to shareholders that they reject the proposal at the annual general meeting on Wednesday."}, {"date": "20240430041600", "headline": "Coca-Cola (KO) Surpasses Q1 Expectations and Raises FY24 Revenue Guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430060000", "headline": "Is PepsiCo Stock Still a Buy?", "summary": "The beverage and snack food company just reaffirmed its 2024 outlook."}, {"date": "20240430120000", "headline": "Why SCHD Should Be A Strategic Core Position Of Your Dividend Income Portfolio", "summary": "Discover why adding SCHD positions to your dividend income portfolio is a smart move, a superior choice in terms of risk and reward. Read here for more details."}, {"date": "20240430122341", "headline": "Coca-Cola CEO: Inflation will normalize throughout 2024", "summary": "The beverage giant is seeing normalizing costs for sugar, aluminum cans, and more."}, {"date": "20240430142703", "headline": "PepsiCo Shareholder Resolution on Biodiversity Reporting Draws Institutional Investor Support", "summary": "PepsiCo Shareholder Resolution on Biodiversity Reporting Draws Institutional Investor Support"}, {"date": "20240430143000", "headline": "PepsiCo Declares Quarterly Dividend", "summary": "The Board of Directors of PepsiCo, Inc. (NASDAQ: PEP) today declared a quarterly dividend of $1.355 per share of PepsiCo common stock, a 7 percent increase versus the comparable year-earlier period. Today's action is consistent with PepsiCo's previously announced increase in its annualized dividend to $5.42 per share from $5.06 per share, which will begin with the June 2024 payment. This dividend is payable on June 28, 2024 to shareholders of record at the close of business on June 7, 2024. Peps"}, {"date": "20240430182900", "headline": "GLOBAL BRIEFING: Downturn in Japanese manufacturing stabilises", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430213800", "headline": "PepsiCo Now #29 Largest Company, Surpassing Advanced Micro Devices", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430230400", "headline": "3 ETFs to Buy When the Market Gets Crazy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501030000", "headline": "Non-Farm Payrolls Preview For April 2024: 3 Major Considerations", "summary": "April 2024 jobs report expected to show an increase of 250,000 jobs, indicating continued tightness in the labor market. Check out 3 major things to consider."}, {"date": "20240501051200", "headline": "Starbucks's Financials Are In Needs Of A Pick Me Up Coffee", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501060000", "headline": "Quaker Launches Quaker Pickleball Academy, Invites Players Across the U.S. to Step Into the \"Kitchen\"", "summary": "This summer, Quaker is serving up the Quaker Pickleball Academy – a new series of free pickleball pop-up events that invites players of all levels to step into the \"kitchen.\" The Quaker Pickleball Academy will give players the opportunity to join free skills and drills sessions to help take their game to the next level. Players can also enjoy delicious and nutritious recipes from Quaker as they prepare to volley, dink and serve on the court in a fun \"oat-fficial\" tournament."}, {"date": "20240501070000", "headline": "Mondelez: Undervalued & Solid Growth Potential Following Q1 Earnings", "summary": "Mondelez has consistently shown strong growth and outperformed its peers in total return over the lastÂ twoÂ decades. Learn why I rate MDLZ stock a buy."}, {"date": "20240501070014", "headline": "Investors Heavily Search PepsiCo, Inc. (PEP): Here is What You Need to Know", "summary": "PepsiCo (PEP) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects."}, {"date": "20240501070200", "headline": "PopCorners® Bets Big on the Kentucky Derby to Debut New Limited-Time-Only Jalapeño Popper Flavor", "summary": "And they're off! … PopCorners®, that is. As a brand known for breaking convention, PopCorners is adding a new flavor to its stable – PopCorners Jalapeño Popper, a limited-edition flavor that offers a mix of jalapeño heat with the taste of smooth and savory cheese. The new take on a classic with a kick joins other fan favorite flavors, White Cheddar, Kettle Corn, and Sea Salt."}, {"date": "20240501194500", "headline": "Stock Market Crash Alert: 3 Must-Buy Restaurant Stocks When Prices Plunge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501231200", "headline": "XLP ETF: Invest in Consumer Staples Stocks with Durable Demand", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502024300", "headline": "Celsius Holdings price target lowered by $10 at Stifel, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502135200", "headline": "Dividend Watch: 3 Companies Boosting Payouts", "summary": "Companies with a history of consistent dividend payouts are prime considerations for income-focused investors, reflecting their commitment to shareholders. And recently, these three companies announced boosts to their quarterly payouts."}, {"date": "20240502160659", "headline": "Tracking Yacktman Asset Management Portfolio - Q1 2024 Update", "summary": "Discover the latest portfolio updates from Yacktman Asset Management, including new stakes and stake disposals, driving an increase in value."}, {"date": "20240502213300", "headline": "PepsiCo Shareholders Meeting: Director Elections and Plan Approvals", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503022800", "headline": "Job Market Cools In April: Payrolls Miss Forecasts, Wages Rise Less Than Expected (UPDATED)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503104900", "headline": "Decoding PEP & KO Post Q1 Earnings: Which Stock Stands Out?", "summary": "The earnings season is the ideal time to re-evaluate one's portfolio. Let us see to which side investors would incline when choosing between arch rivals PepsiCo and Coca-Cola."}, {"date": "20240503123316", "headline": "15 Most Common Counterfeit Foods in the US", "summary": "In this article, we will look at the 15 most common counterfeit foods in the US. If you want to see more of the most common counterfeit foods in the US, go directly to the 5 most common counterfeit foods in the US. The global food market brings together the many sectors of agriculture, production, […]"}, {"date": "20240503213935", "headline": "SCHD: A Must-Have In Every Dividend Portfolio", "summary": "Schwab U.S. Dividend Equity ETF (SCHD) offers diversification and resilience with a focus on healthy dividend-paying companies, but lower total returns. Read more here."}, {"date": "20240504030000", "headline": "5 Relatively Secure And Cheap Dividend Stocks To Invest In - May 2024", "summary": "There are safe, dividend-paying companies with large discounts to historical norms. Check out our selection process and our top 5 dividend stocks."}, {"date": "20240504041123", "headline": "Dividend Champion, Contender, And Challenger Highlights: Week Of May 5", "summary": "Stay updated on dividend activity with this weekly summary."}, {"date": "20240504062116", "headline": "PepsiCo's (NASDAQ:PEP) Upcoming Dividend Will Be Larger Than Last Year's", "summary": "The board of PepsiCo, Inc. ( NASDAQ:PEP ) has announced that the dividend on 28th of June will be increased to $1.36..."}, {"date": "20240504095500", "headline": "Dividend Investors Love Coca-Cola Stock and Pepsi Stock. But This Other Beverage Stock Might Be Poised for Better Dividend Growth.", "summary": "Will the No. 3 player in the space be the top dividend stock?"}]}