{"news": [{"date": "20240424143700", "headline": "Pfizer Declares Second-Quarter 2024 Dividend", "summary": "NEW YORK, April 24, 2024--Pfizer Inc. (NYSE: PFE) today announced that its board of directors declared a $0.42 second-quarter 2024 dividend on the company’s common stock, payable June 14, 2024, to holders of the Common Stock of record at the close of business on May 10, 2024. The second-quarter 2024 cash dividend will be the 342nd consecutive quarterly dividend paid by Pfizer."}, {"date": "20240424201900", "headline": "Noteworthy Thursday Option Activity: PFE, ON, PTON", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424203900", "headline": "Takeda said to have left industry trade group BIO", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424205500", "headline": "RSI Alert: Pfizer Now Oversold", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424214000", "headline": "Pfizer Inc. stock underperforms Thursday when compared to competitors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424235800", "headline": "Pantera Minerals Expands Lithium Project and Secures Funding", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425002657", "headline": "UPDATE 1-Ad group WPP reports 1.6% drop in first-quarter organic growth", "summary": "British ad group WPP reported a 1.6% drop in organic growth in the first quarter, lagging its major rivals, after it was hit by loss of business from healthcare client Pfizer and reduced spending by technology companies.  WPP, which had already warned that any organic growth this year would be weighted towards the second half, on Thursday reiterated its guidance for flat to 1% growth this year, with a margin improvement of 20-40 basis points."}, {"date": "20240425010100", "headline": "Bristol-Myers posts Q1 beat despite growth headwinds", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425013100", "headline": "Morning Brew: Tech Titans Lead Market Movements Amid Key Updates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425021000", "headline": "March's Dividend Portfolio Update Sets New All-Time Record - 100 Holdings, 21 Buys", "summary": "Portfolio changes in March focus on BDCs, aiming to increase dividend income by at least $100 each month. Click here for a detailed analysis."}, {"date": "20240425030000", "headline": "Dividend Harvesting Portfolio Week 164: $16,400 Allocated, $1,466.94 In Projected Dividends", "summary": "Dividend Harvesting Portfolio weathered market instability, thanks to its focus on ongoing dividend income and diversification. Read more on the portfolio here."}, {"date": "20240425040100", "headline": "GSK sues Pfizer, BioNTech over COVID-19 vaccines patents", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425064500", "headline": "Video: Daily Dividend Report: PFE, SCHW, CI, MPC, AVY", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425065500", "headline": "What's Going On With Pfizer Stock On Thursday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425073944", "headline": "GlaxoSmithKline sues Pfizer and BioNTech over Covid-19 vaccine technology", "summary": "(Reuters) -GlaxoSmithKline sued Pfizer and BioNTech in Delaware federal court on Thursday, accusing them of infringing GSK patents related to messenger RNA (mRNA) technology in the companies' blockbuster COVID-19 vaccines.  GSK said in the lawsuit that Pfizer and BioNTech's Comirnaty vaccines violate the company's patent rights in mRNA-vaccine innovations developed \"more than a decade before\" the outbreak of the COVID-19 pandemic."}, {"date": "20240425075425", "headline": "UPDATE 3-GlaxoSmithKline sues Pfizer and BioNTech over Covid-19 vaccine technology", "summary": "GlaxoSmithKline sued Pfizer and BioNTech in Delaware federal court on Thursday, accusing them of infringing GSK patents related to messenger RNA (mRNA) technology in the companies' blockbuster COVID-19 vaccines.  GSK said in the lawsuit that Pfizer and BioNTech's Comirnaty vaccines violate the company's patent rights in mRNA-vaccine innovations developed \"more than a decade before\" the outbreak of the COVID-19 pandemic."}, {"date": "20240425094204", "headline": "Heard on the Street: Bristol-Myers Goes From Big Pharma to Little Pharma", "summary": "Bristol-Myers Squibb’s market capitalization has dropped so much over the past year that it is now arguably no longer part of the big pharma club.  After reporting disappointing earnings figures on Thursday, the company’s shares fell sharply, giving it a market capitalization of about $95 billion.  The problem for Bristol-Myers is that its older blockbuster products, cancer drug Revlimid and blood thinner Eliquis, are expected to decline in the coming years and investors aren’t convinced that the company has enough growth drivers in the near term."}, {"date": "20240425105553", "headline": "Update: GSK Sues Pfizer, BioNTech Over mRNA Patents in Covid-19 Vaccines", "summary": "Update: GSK Sues Pfizer, BioNTech Over mRNA Patents in Covid-19 Vaccines"}, {"date": "20240425112824", "headline": "Wall Street plunges after US inflation shock", "summary": "US stock markets plunged amid fears of stagflation in the American economy, which grew at its slowest pace in nearly two years just as inflation jumped."}, {"date": "20240425114916", "headline": "These Are The Biotechs Showing Up At The Biggest Cancer Meeting Of The Year (Oral Presentations)", "summary": "The Annual Meeting of ASCO is a major event for clinicians and researchers in the field of oncology. Explore more details here."}, {"date": "20240425190800", "headline": "More than half of the S&P 500 names that reported results this week beat top and bottom line - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425195000", "headline": "COVID-19 Patent Dispute Sorted: Acuitas Therapeutics and CureVac Reach Settlement In Patent Battle", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425200600", "headline": "Catalyst Watch: Apple earnings, Viking IPO, Chinese EV deliveries and Russell indices' Rank Day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425234800", "headline": "Pfizer announces approval of BEQVE by FDA for adults with hemophilia B", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426010700", "headline": "Dividend Roundup: MetLife, General Motors, Pfizer, Citigroup, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426011525", "headline": "Pfizer Gets FDA OK For Beqvez Gene Therapy for Hemophilia B", "summary": "By Colin Kellaher Pfizer has won Food and Drug Administration approval of Beqvez, a one-time gene therapy for certain patients with the inherited bleeding disorder hemophilia B. The New..."}, {"date": "20240426025000", "headline": "Should You Buy Moderna Before May 12?", "summary": "This ambitious biotech aims to launch 15 products over the coming five years."}, {"date": "20240426030500", "headline": "Pfizer's Options: A Look at What the Big Money is Thinking", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426041200", "headline": "June 7th Options Now Available For Pfizer (PFE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426044500", "headline": "U.S. FDA Approves Pfizer’s BEQVEZ™ (fidanacogene elaparvovec-dzkt), a One-Time Gene Therapy for Adults with Hemophilia B", "summary": "NEW YORK, April 26, 2024--Pfizer Inc. (NYSE: PFE) announced today that the U.S. Food and Drug Administration (FDA) has approved BEQVEZ™ (fidanacogene elaparvovec-dzkt) for the treatment of adults with moderate to severe hemophilia B who currently use factor IX (FIX) prophylaxis therapy, or have current or historical life-threatening hemorrhage, or have repeated, serious spontaneous bleeding episodes, and do not have neutralizing antibodies to adeno-associated virus serotype Rh74var (AAVRh74var)"}, {"date": "20240426045300", "headline": "Pfizer hemophilia gene therapy arrives in US to uncertain future", "summary": "The Food and Drug Administration approval of Beqvez comes as other gene therapies for the bleeding condition struggle to gain traction."}, {"date": "20240426050019", "headline": "UPDATE 2-US FDA approves Pfizer's gene therapy for rare bleeding disorder", "summary": "The U.S. Food and Drug Administration approved Pfizer's gene therapy for hemophilia B on Friday, the second such therapy for the rare bleeding disorder that typically requires regular infusions of a blood-clotting protein.  People with hemophilia have a fault in a gene that regulates production of proteins called clotting factors, which can cause spontaneous as well as severe bleeding following injuries or surgery."}, {"date": "20240426050400", "headline": "Pfizer gets FDA approve for hemophilia B gene therapy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426053200", "headline": "US approves Pfizer gene therapy treatment for haemophilia", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426053400", "headline": "Pfizer (NYSE:PFE) Notches Up on New FDA Approval", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426054400", "headline": "Pfizer gets FDA approval for hemophilia B gene therapy Beqvez", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426054500", "headline": "Want $2,000 in Annual Dividends? Invest $30,000 in These 3 Stocks", "summary": "Put your money to work by investing in these three high-quality dividend stocks."}, {"date": "20240426060150", "headline": "AbbVie's Q1: Positive Surprise", "summary": "AbbVie's earnings beat estimates, with a smaller decline in Humira sales. Read how the biotech's next-generation drugs Rinvoq and Skyrizi are offsetting a decline in Humira sales."}, {"date": "20240426064502", "headline": "AbbVie (ABBV) Beats Q1 Earnings and Revenue Estimates", "summary": "AbbVie (ABBV) delivered earnings and revenue surprises of 2.21% and 2.65%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240426065405", "headline": "Pfizer Wins FDA Approval For $3.5 Million Gene Therapy, Rivaling CSL, Uniqure", "summary": "The FDA approved Pfizer's hemophilia gene therapy on Friday. But Pfizer stock only inched ahead on the approval early Friday."}, {"date": "20240426071523", "headline": "Gear Up for Pfizer (PFE) Q1 Earnings: Wall Street Estimates for Key Metrics", "summary": "Beyond analysts' top -and-bottom-line estimates for Pfizer (PFE), evaluate projections for some of its key metrics to gain a better insight into how the business might have performed for the quarter ended March 2024."}, {"date": "20240426081400", "headline": "Pfizer Receives FDA Approval for Bleeding Disorder Treatment", "summary": "Pfizer  has received approval from the Food and Drug Administration for a rare genetic bleeding disorder treatment—the drug-maker’s first gene therapy to be approved in the U.S.  The treatment, Beqvez, is for adults with moderate to severe hemophilia B—a disorder that prevents normal blood clotting—and will be available by prescription to eligible patients this quarter, according to the company.  “Many people with hemophilia B struggle with the commitment and lifestyle disruption of regular FIX infusions, as well as spontaneous bleeding episodes, which can lead to painful joint damage and mobility issues,” said Adam Cuker, director of University of Pennsylvania’s Comprehensive Hemophilia and Thrombosis Program."}, {"date": "20240426095640", "headline": "Diving Into Deciphera Pharmaceuticals", "summary": "Deciphera's Vimseltinib is expected to make significant progress in the TGCT indication. Check out myÂ investment analysis around DCPH stock here."}, {"date": "20240426112409", "headline": "Pfizer Gets FDA Approval for Bleeding Disorder Treatment", "summary": "Pfizer Gets FDA Approval for Bleeding Disorder Treatment"}, {"date": "20240426135714", "headline": "Sector Update: Health Care Stocks Edge Higher Late Afternoon", "summary": "Sector Update: Health Care Stocks Edge Higher Late Afternoon"}, {"date": "20240426140000", "headline": "S&P 500 Earnings: The Upward Revisions Are A Big Positive", "summary": "The forward 4-quarter estimate this week was $252.55, up from $252.51 last week."}, {"date": "20240426143008", "headline": "FDA Green Lights Pfizer's Gene Therapy For Rare Bleeding Disorder Hemophilia", "summary": "Friday, the FDA approved Pfizer Inc’s (NYSE:PFE) Beqvez (fidanacogene elaparvovec-dzkt) for moderate to severe hemophilia B in adult patients who currently use factor IX (FIX) prophylaxis therapy or have current or historical life-threatening hemorrhage, or have repeated, serious spontaneous bleeding episodes, and do not have neutralizing antibodies to adeno-associated virus serotype Rh74var capsid. Beqvez is a one-time treatment designed to enable hemophilia B patients to produce FIX themselves"}, {"date": "20240426161717", "headline": "A Big Week For The Stock Market: Apple, Amazon, Big Pharma And The Fed", "summary": "Stock market investors brace for a big week of earnings and econ as Apple, Amazon, Big Pharma and The Fed all line up to deliver news."}, {"date": "20240426191400", "headline": "WHO picks JN.1 variant for next set of COVID vaccines", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426230700", "headline": "7 Dividend Stocks to Buy Now for Steady Returns in Any Market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427051500", "headline": "3 Dividend Stocks to Buy and Hold for the Next Decade", "summary": "You'll get dividends and more with these great stocks."}, {"date": "20240428010300", "headline": "Earnings week ahead: Amazon, Apple, Pfizer, AMD, Coca-Cola, Starbucks and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428012226", "headline": "Wall Street Breakfast: The Week Ahead", "summary": "This article discusses the upcoming events in the financial world, including the Federal Reserve meeting, corporate earnings, IPOs, and investor events."}, {"date": "20240428035000", "headline": "3 High-Yield Dividend Stocks That Could Soar 22% to 49%, According to Wall Street", "summary": "Whether or not these stocks hit analysts' price targets, they all should be attractive to investors seeking great income and solid growth."}, {"date": "20240428230200", "headline": "3 Dividend Stocks to Buy on the Dip: April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428234300", "headline": "Genmab-Pfizer's gains full FDA approval for TIVDAK in Metastatic Cervical Cancer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428234400", "headline": "Genmab-Pfizer gain full FDA approval for TIVDAK in Metastatic Cervical Cancer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429000100", "headline": "Options Volatility and Implied Earnings Moves This Week, April 29 – May 02, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429000400", "headline": "Labcorp: FDA approves nAbCyte Anti-AAVRh74var HB-FE Assay", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429003500", "headline": "Labcorp’s companion diagnostic approved for use with Pfizer’s hemophilia B gene therapy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429005400", "headline": "Pfizer (PFE) Gets a Buy from Truist Financial", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429005700", "headline": "Pfizer, Genmab get full FDA approval for cervical-cancer drug", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429013100", "headline": "Morning Brew: Tesla's New Strategy Shakes Auto Sector", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429020100", "headline": "Novo Nordisk: Growth Is Still A Better Choice", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429032300", "headline": "Merck late-stage data strengthens profile of pneumonia vaccine candidate", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429032900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429044500", "headline": "Pfizer Highlights Progress in Accelerating Breakthrough Cancer Medicines at ASCO 2024 Annual Meeting", "summary": "NEW YORK, April 29, 2024--Pfizer Inc. (NYSE: PFE) highlights its progress in advancing new potential standards of care in Oncology at the 2024 American Society of Clinical Oncology (ASCO®) Annual Meeting, taking place May 31 to June 4 in Chicago. More than 50 abstracts, including 11 oral presentations, will be presented from Pfizer’s broadened portfolio of approved and pipeline therapies across the company’s key tumor areas and core scientific modalities, including small molecules, antibody-drug"}, {"date": "20240429053110", "headline": "Novel haemophilia B gene therapy approved", "summary": "The US Food and Drug Administration has approved the adeno-associated virus -based gene therapy BEQVEZ..."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429074009", "headline": "Why Pfizer (PFE) is a Top Value Stock for the Long-Term", "summary": "Whether you're a value, growth, or momentum investor, finding strong stocks becomes easier with the Zacks Style Scores, a top feature of the Zacks Premium research service."}, {"date": "20240429095822", "headline": "US FDA grants full approval for Pfizer's cervical cancer drug", "summary": "The U.S. Food and DrugAdministration granted traditional approval for Pfizer'sdrug for cervical cancer patients with disease progression on orafter chemotherapy, the agency said on..."}, {"date": "20240429100243", "headline": "mRNA Is Promising A Breakthrough In Fighting Cancer", "summary": "When it comes to cancer, there’s innovation both on the diagnostics and the treatment front thanks to messenger RNA, or mRNA, a genetic material we all got acquainted with during the COVID-19 era as it allowed pharmaceutical companies like Pfizer Inc (NYSE: PFE) and Moderna Inc (NASDAQ: MRNA) to develop their groundbreaking vaccines in record time. By the looks of it, this was only the beginning of the healthcare revolution that mRNA triggered. Mainz Biomed N.V. (NASDAQ: MYNZ) to revolutionize c"}, {"date": "20240429101200", "headline": "Here's How to Play Pfizer (PFE) Stock Ahead of Q1 Earnings", "summary": "Pfizer (PFE) expects its operational revenues to improve, driven by its in-line products like Vyndaqel, new launches like Abrysvo and newly acquired products, including those acquired from Seagen."}, {"date": "20240429115255", "headline": "Is 7%-Yielding Pfizer Stock A Buy On The Dip Before Q1?", "summary": ""}, {"date": "20240429132544", "headline": "13 Best Reddit Stocks to Buy Now", "summary": "In this article, we will take a detailed look at the 13 Best Reddit Stocks to Buy Now. For a quick overview of such stocks, read our article 5 Best Reddit Stocks to Buy Now. Millions of young retail investors turn to Reddit every day to talk or learn about the stock market. Back in the pandemic days, the […]"}, {"date": "20240429134046", "headline": "These 3 High-Yield Stocks Have Been Growing Their Dividends Non-Stop, And Analysts Expect Their Share Prices To Climb", "summary": "Income-seeking investors are always on the lookout for reliable high-yield stocks with a history of consistent dividend growth. Three companies that fit this bill are Federal Realty Investment Trust (NYSE:FRT), Realty Income Corp. (NYSE:O), and Pfizer ..."}, {"date": "20240429145114", "headline": "UPDATE 1-US FDA grants full approval for Pfizer's cervical cancer drug", "summary": "The U.S. Food and Drug Administration (FDA) granted full approval for Pfizer's drug for treating cervical cancer patients whose disease had progressed on or after chemotherapy, the agency said on Monday.  The treatment, Tivdak - an antibody-drug conjugate co-developed by Genmab A/S  and Seagen - received the FDA's accelerated approval for the same indication in 2021.  It was added to Pfizer's oncology portfolio last year through a $43 billion deal to acquire Seagen, along with other targeted cancer therapies."}, {"date": "20240429164000", "headline": "FDA Grants Full Approval for TIVDAK® to Treat Recurrent or Metastatic Cervical Cancer", "summary": "NEW YORK & COPENHAGEN, Denmark, April 29, 2024--Pfizer Inc. (NYSE: PFE) and Genmab A/S (Nasdaq: GMAB) today announced the U.S. Food and Drug Administration (FDA) approves the supplemental Biologics License Application (sBLA) granting full approval for TIVDAK® (tisotumab vedotin-tftv) for the treatment of patients with recurrent or metastatic cervical cancer with disease progression on or after chemotherapy."}, {"date": "20240429164000", "headline": "TIVDAK® (tisotumab vedotin-tftv) Receives U.S. FDA Approval to Treat Recurrent or Metastatic Cervical Cancer", "summary": "COPENHAGEN, Denmark, April 29, 2024--Genmab A/S (Nasdaq: GMAB) and Pfizer Inc. (NYSE: PFE) announced today the U.S. Food and Drug Administration (FDA) has approved the supplemental Biologics License Application (sBLA) for TIVDAK® (tisotumab vedotin-tftv) for the treatment of patients with recurrent or metastatic cervical cancer with disease progression on or after chemotherapy. This FDA action converts the September 2021 accelerated approval of TIVDAK to a full approval. TIVDAK is the first anti"}, {"date": "20240429190800", "headline": "Pfizer Q1 Earnings Preview: Covid assets to remain the focus this quarter", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429211100", "headline": "Longboard initiated with an Outperform at Baird on 'best-in-class potential", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429233000", "headline": "Pfizer, Genmab cervical cancer therapy wins full FDA approval", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430000000", "headline": "Chasing Novo and Lilly: The obesity drugs that could challenge Wegovy and Zepbound", "summary": "Large and small drugmakers are vying for a piece of what analysts view as one of the biggest market opportunities in the pharma industry's history. Here’s what’s coming next."}, {"date": "20240430013100", "headline": "Morning Brew: Tech Giants Lead Market Movements Amidst Earnings Season", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430025100", "headline": "Sensodyne maker Haleon to shut UK factory with loss of 435 jobs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430025300", "headline": "J&J, Bristol Myers latest to lose bids to halt Medicare price negotiations", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430030600", "headline": "Forget Nvidia: Prominent Billionaires Are Selling It and Buying These 2 Ultra-High-Yield Dividend Stocks Instead", "summary": "Wall Street's brightest, most successful billionaire money managers are ditching Nvidia in favor of two time-tested income stocks with yields of 6.6%!"}, {"date": "20240430031400", "headline": "FTC expands patent listing challenges for drugs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430035000", "headline": "(PFE) - Analyzing Pfizer's Short Interest", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430035000", "headline": "Why I'm Buying This Beaten-Down, High-Yield Dividend Stock Hand Over Fist", "summary": "The sun could be peeking through the dark clouds for Pfizer."}, {"date": "20240430042500", "headline": "Pfizer Sees Less Revenue From Covid-19 Treatments, Stock Faces Headwinds Ahead Of Q1 Earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430043000", "headline": "As Early-Onset Breast Cancer Cases Soar in North America and EU, Biotech Ramps Up Response", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430052204", "headline": "FDA approves Labcorp companion diagnostic for Pfizer gene therapy", "summary": "Labcorp’s diagnostic assay will act as a companion diagnostic for Pfizer’s recently approved haemophilia B gene therapy Beqvez."}, {"date": "20240430054500", "headline": "Pfizer call volume above normal and directionally bullish", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430054500", "headline": "5 Top Stocks to Buy in May", "summary": "Whether you're looking for a proven player, passive income, or a breakout growth story, there are plenty of stocks worth buying this spring."}, {"date": "20240430055505", "headline": "Eli Lilly (LLY) Tops Q1 Earnings Estimates", "summary": "Lilly (LLY) delivered earnings and revenue surprises of 1.98% and 0.47%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240430064000", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430064100", "headline": "10 Health Care Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430065200", "headline": "7 Safe Haven Stocks That Can Withstand the Market’s Worst Meltdowns", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430070914", "headline": "Pfizer : Goes Live in SXSW’s Podcast Lounge", "summary": "Pfizer Goes Live in SXSW's Podcast Lounge Tuesday, April 30, 2024 - 01:00pm Share ..."}, {"date": "20240430080206", "headline": "Pfizer and Genmab’s Tivdak wins full FDA approval for cervical cancer", "summary": "The FDA granted accelerated approval for the drug in September 2021, following positive Phase II trial data."}, {"date": "20240430090339", "headline": "XBI: The 2 Things Biotech Needs To Move Higher", "summary": "See what has influenced volatility of the biotech sector and learn about the key factors that will shape SPDRÂ® S&P Biotech ETF performance. Click for my XBI update."}, {"date": "20240430092000", "headline": "Will These 5 Drug/Biotech Stocks Beat Q1 Earnings Forecast?", "summary": "Let's look at five large-cap pharma/biotech companies slated to release quarterly results this week."}, {"date": "20240430095800", "headline": "BioNTech (BNTX) to Report Q1 Earnings: Is a Beat in Store?", "summary": "On BioNTech's (BNTX) first-quarter 2024 earnings call, investors' focus is likely to be on the updates related to its pipeline development now that the pandemic is over."}, {"date": "20240430101800", "headline": "NEW YORK MARKET CLOSE: Dow hit by new inflationary scare ahead of Fed", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430143000", "headline": "Pfizer’s Earnings Are Due. Questions About the Company’s Outlook Linger.", "summary": "Investors will be watching to see whether the company sticks with its current rock-bottom guidance or begins to push its targets upward."}, {"date": "20240430153850", "headline": "Fed rate decision, Qualcomm earnings: What to Watch", "summary": "Market Domination Overtime anchors Julie Hyman and Josh Lipton preview the top headlines for investors for tomorrow, Wednesday, May 1, 2024. Federal Reserve officials will issue their latest interest rate policy decision coming out of their FOMC meeting tomorrow afternoon, followed by a press conference by Fed Chair Jerome Powell. On the earnings front, a slew of companies are set to release quarterly reports, including names like DoorDash (DASH), Mastercard (MA), and Qualcomm (QCOM). For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Angel Smith"}, {"date": "20240430182900", "headline": "GLOBAL BRIEFING: Downturn in Japanese manufacturing stabilises", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430193700", "headline": "Dow Jumps 200 Points Following Fed Decision; Pfizer Earnings Top Estimates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430204619", "headline": "Haleon Pretax Profit Rises Despite Revenue Drop", "summary": "By Najat Kantouar Haleon reported a higher pretax profit for the first quarter despite lower revenue against tough comparatives in the prior year particularly in Respiratory Health and Pain..."}, {"date": "20240430204800", "headline": "Amazon, Pfizer And 3 Stocks To Watch Heading Into Wednesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430204800", "headline": "Investor Sentiment Falls, Dow Snaps Five-Month Win Streak", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430213500", "headline": "What You Missed On Wall Street On Wednesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430213600", "headline": "Jefferies Remains a Buy on Pfizer (PFE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430230300", "headline": "Pfizer plans direct-to-consumer platform to sell Covid, migraine drugs - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430232300", "headline": "Pfizer developing online platform to sell drugs directly to consumer, FT says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430234500", "headline": "Wall Street Set To Open Lower After AMD Earnings Disappoint As Traders Look To Fed's Powell For Relief: Why This Analyst Sees Incoming Summer Rally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430234600", "headline": "Pfizer reports Q1 adjusted EPS 82c, consensus 52c", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430234700", "headline": "Pfizer raises FY24 adjusted EPS view to $2.15-$2.35 from $2.05-$2.25", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430235000", "headline": "Pfizer beats top-line and bottom-line estimates; reaffirms FY24 outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501000600", "headline": "Options Volatility and Implied Earnings Moves Today, May 01, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501001500", "headline": "Pfizer first-quarter results top estimates, drugmaker boosts full-year profit outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501002700", "headline": "Earnings Summary: Pfizer tops expectations in Q1, reaffirms FY2024 outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501004605", "headline": "Pfizer Reports First-Quarter 2024 Results", "summary": "Solid First-Quarter Results Reflect Continued Growth of Key Products and Progress in Executing 2024 PrioritiesFirst-Quarter 2024 Revenues of $14.9 BillionExpected Decline in Comirnaty and..."}, {"date": "20240501004757", "headline": "Pfizer beats profit estimates on cost cuts, RSV vaccine sales", "summary": "Pfizer beat first-quarterprofit estimates on Wednesday, benefiting from cost cuts andstrong sales for its pneumonia and respiratory synctitial virusvaccines. The U.S. drugmaker posted..."}, {"date": "20240501005300", "headline": "IN BRIEF: Avacta picks Christina Coughlin to replace long-serving CEO", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501005509", "headline": "Pfizer: Q1 Earnings Snapshot", "summary": "NEW YORK — NEW YORK — Pfizer Inc. on Wednesday reported first-quarter net income of $3.12 billion. The New York-based company said it had profit of 55 cents per share. Earnings, adjusted..."}, {"date": "20240501013013", "headline": "Pfizer Earnings Top Views; Boosts Full-Year Guidance", "summary": "By Rob Curran Pfizer posted first-quarter earnings and sales that topped Wall Street targets and boosted its full-year projections as sales of blood thinners and cancer drugs helped shake off..."}, {"date": "20240501014100", "headline": "Pfizer raises guidance amid cost savings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501015600", "headline": "Pfizer’s first-quarter results top estimates, while drugmaker boosts full-year profit outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501015600", "headline": "Fly Intel: Pre-market Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501020100", "headline": "Novartis Is Tracking Well Above the Industry", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501020500", "headline": "Analysts Offer Insights on Healthcare Companies: SurModics (SRDX) and Pfizer (PFE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501020600", "headline": "UBS Reaffirms Their Hold Rating on Pfizer (PFE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501021600", "headline": "4 stocks to watch on Wednesday: PFE, QCOM and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501024200", "headline": "TOP NEWS: Pfizer profit declines on lower Covid-related sales", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501024500", "headline": "PFE Earnings: Pfizer Rises on Smashing Q1 Estimates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501024900", "headline": "These Stocks Are Moving the Most Today: AMD, Super Micro Computer, Amazon, Starbucks, Pinterest, Pfizer, and More", "summary": "AMD shares fall after the chip maker issues disappointing guidance, Amazon’s earnings are driven by strong growth in cloud computing, and Super Micro Computer’s fiscal third-quarter revenue misses Wall Street estimates."}, {"date": "20240501025402", "headline": "Stocks to Watch Wednesday: Amazon, Starbucks, Pinterest, AMD", "summary": "**↗️** **Amazon.com (AMZN)**: The company reported a surge in first-quarter sales as the AI boom powered growth in its cloud-computing unit. Amazon.com stock was higher in premarket trading. **↘️** **Starbucks (SBUX)**: The coffee chain's stock slid more than 12% in premarket."}, {"date": "20240501030000", "headline": "Non-Farm Payrolls Preview For April 2024: 3 Major Considerations", "summary": "April 2024 jobs report expected to show an increase of 250,000 jobs, indicating continued tightness in the labor market. Check out 3 major things to consider."}, {"date": "20240501031529", "headline": "News Highlights : Top Company News of the Day - Wednesday at 9 AM ET", "summary": "Pfizer's first-quarter results top estimates, while drugmaker boosts full-year profit outlook Pfizer on Wednesday reported first-quarter results that beat analyst expectations, and raised its..."}, {"date": "20240501035700", "headline": "Carvana, Enovix, Pfizer, Nio, Tesla: Why These 5 Stocks Are On Investors' Radars Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501035800", "headline": "PFE Stock Earnings: Pfizer Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501044100", "headline": "Pfizer Q1 Earnings and Revenues Beat Estimates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501050300", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501051648", "headline": "News Highlights : Top Company News of the Day - Wednesday at 11 AM ET", "summary": "Estée Lauder Stock Is Dropping. China Problems Aren't Going Away. Cosmetics firm Estée Lauder cut 2024 sales guidance, overshadowing a strong fiscal-third-quarter report. Viking Stock..."}, {"date": "20240501061000", "headline": "Pfizer’s strong Vyndaqel sales draw attention to rare disease drug’s patent life", "summary": "Sales of the transthyretin amyloidosis treatment widely beat Wall Street forecasts in the first quarter. The company aims to extend its patent exclusivity."}, {"date": "20240501061200", "headline": "US Stocks Mixed Ahead Of Fed Meeting, Chipmakers Tumble After AMD Earnings, Bitcoin Sinks: What's Driving Markets Wednesday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501061800", "headline": "GSK raises forecasts on strong vaccine, HIV drug sales", "summary": "Sales of the shingles vaccine Shingrix and the RSV shot Arexvy helped fuel quarterly revenue totals that surpassed analyst expectations, though the company warned momentum could slow in the months ahead."}, {"date": "20240501064445", "headline": "Pfizer Lifts Full-Year 2024 Earnings Outlook Following First-Quarter Beat", "summary": "Pfizer Lifts Full-Year 2024 Earnings Outlook Following First-Quarter Beat"}, {"date": "20240501070500", "headline": "Pfizer Stock Rises as Outlook Rises After Earnings Beat", "summary": "Pfizer  bumped up its earnings guidance on Wednesday while reporting better financial results than expected as it works to regain investors’ confidence after a disastrous 2023.  More notable was the increase in earnings guidance.  “This increase takes into consideration both our improving line of sight to our cost savings target, and continued strength in our underlying business,” CFO David Denton said in prepared remarks distributed ahead of the company’s Wednesday morning investor call."}, {"date": "20240501071644", "headline": "News Highlights : Top Company News of the Day - Wednesday at 1 PM ET", "summary": "Tesla's Downsizing Worries Supercharger Industry Widespread layoffs within the Tesla unit are a blow to efforts to build out a national charging network. Estée Lauder's China Problems..."}, {"date": "20240501073022", "headline": "Pfizer (PFE) Reports Q1 Earnings: What Key Metrics Have to Say", "summary": "While the top- and bottom-line numbers for Pfizer (PFE) give a sense of how the business performed in the quarter ended March 2024, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values."}, {"date": "20240501073225", "headline": "Pfizer Inc (PFE) Q1 2024 Earnings: Adjusted EPS Surpasses Expectations Amidst Revenue Decline", "summary": "Key Financial Metrics and Strategic Insights"}, {"date": "20240501075431", "headline": "Pfizer raises full-year outlook, stock rises on Q1 beat", "summary": "Pfizer (PFE) shares tick up in pre-market trading — continuing into the green after the market open — after the pharmaceutical giant raised its full-year profit outlook and topped first-quarter earnings estimates on the top and bottom lines. Yahoo Finance Health Reporter Anjalee Khemlani joins The Morning Brief to discuss Pfizer's outlook on its future product pipeline. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Luke Carberry Mogan."}, {"date": "20240501083528", "headline": "Trending : Pfizer 1Q Earnings Top Estimates; Raises FY24 View", "summary": "14:19 ET -- Pfizer is one of the most mentioned companies in the U.S. across all news items in the past 12 hours, according to Factiva data. The New York-based biopharmaceutical firm said..."}, {"date": "20240501084105", "headline": "Eli Lilly Shoots Higher: It's Time To Be Cautious", "summary": "If we see shares continue to climb like this, a downgrade for Eli Lilly and Company stock could be on the horizon. Learn why we rate LLY stock a hold."}, {"date": "20240501094300", "headline": "Pfizer (PFE) Q1 Earnings & Sales Top, EPS Guidance Raised", "summary": "Pfizer (PFE) beats first-quarter estimates for earnings and sales. It raises 2024 earnings guidance while retaining revenue expectations."}, {"date": "20240501095410", "headline": "Pfizer Inc. (PFE) Q1 2024 Earnings Call Transcript", "summary": "Pfizer Inc. (NYSE:NYSE:PFE) Q1 2024 Earnings Conference Call May 1, 2024 10:00 AM ETCorporate ParticipantsFrancesca DeMartino - Chief Investor Relations..."}, {"date": "20240501102221", "headline": "Top Midday Stories: CVS Reports Q1 Earnings Miss, Lowers Outlook; ADP Q1 Earnings Top Estimates; J&J Proposes $6.5 Billion Settlement for Talc Lawsuits", "summary": "Top Midday Stories: CVS Reports Q1 Earnings Miss, Lowers Outlook; ADP Q1 Earnings Top Estimates; J&J Proposes $6.5 Billion Settlement for Talc Lawsuits"}, {"date": "20240501103835", "headline": "Pfizer Embraces Direct-To-Consumer Model For Covid Antiviral, Says Comirnaty Revenues Continue To Perform Consistently With Expectations", "summary": "On Wednesday, Pfizer Inc. (NYSE:PFE) reported first-quarter adjusted EPS of $0.82, down 33% year over year, beating the consensus of $0.54. The company witnesses a significant decrease in Comirnaty and Paxlovid revenues globally and an unfavorable impact of foreign exchange of $107 million, or 1%. The U.S. drugmaker reported sales of $14.9 billion, down 20%, beating the consensus of $14.2 billion. Excluding contributions from Comirnaty and Paxlovid, revenues totaled $12.5 billion, an increase of"}, {"date": "20240501111819", "headline": "Pfizer Stock Is Near An 11-Year Low — But Is It A Buy On This 'Massive' Upside?", "summary": "Pfizer stock ran up to its 50-day line after the company reported better-than-expected sales and profit. Is PFE stock a buy?"}, {"date": "20240501121704", "headline": "Fed holds rates as it warns fight against inflation has hit a bump", "summary": "The world’s largest central bank has warned that its fight against inflation has hit a bump in the road, forcing it to keep interest rates at a 23-year-high."}, {"date": "20240501140629", "headline": "Pfizer stock gains 7% after earnings beat, company calls dividend 'secure'", "summary": "Pfizer had a surprise beat in its COVID portfolio despite dim forecasts, but the company is still not feeling the love in its stock."}, {"date": "20240501141154", "headline": "Sector Update: Health Care Stocks Rise Late Afternoon", "summary": "Sector Update: Health Care Stocks Rise Late Afternoon"}, {"date": "20240501141446", "headline": "Pfizer Jumps On 'Massive' First-Quarter Upside Thanks To Paxlovid Surprise", "summary": "Pfizer stock surged Wednesday after the pharma giant walloped analysts' first-quarter earnings forecast and hiked its guidance."}, {"date": "20240501143000", "headline": "These Stocks Moved the Most Today: CVS, AMD, Super Micro, Amazon, Starbucks, Pfizer, Norwegian, Pinterest, DuPont, and More", "summary": "CVS posts a wide miss on first-quarter earnings and cuts guidance, AMD shares fall after the chip maker issues a disappointing outlook, and Amazon’s profit is driven by strong growth in cloud computing."}, {"date": "20240501143500", "headline": "Pfizer Shares Jump After Beating Estimates", "summary": "Pfizer shares rose more than 6% Wednesday afternoon after the company's first-quarter results beat Wall Street analyst estimates and the drugmaker raised its earnings-per-share guidance for the year.  The pharmaceutical closed at $27.18, up $1.56 or 6.09%, the largest percent increase since Nov. 26, 2021, when it rose 6.11%  The New York-based company reported $14.9 billion in quarterly sales, down 20% from a year ago largely because of a drop in its Covid-19 vaccine revenue.  Pfizer Chief Executive Albert Bourla said in an interview Wednesday he was encouraged but that the company's stock is undervalued."}, {"date": "20240501155553", "headline": "Why Pfizer Stock Blasted More Than 6% Higher Today", "summary": "A double beat on earnings, plus raised bottom-line guidance, made the company a hot item on Hump Day."}, {"date": "20240501163016", "headline": "Pfizer (PFE) Q1 2024 Earnings Call Transcript", "summary": "PFE earnings call for the period ending March 31, 2024."}, {"date": "20240501194100", "headline": "Investor Optimism Improves Slightly Following Fed Decision", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501202100", "headline": "Pfizer Prospects Garner Mixed Sentiment From Analysts: 'Finally, The Pivot Investors Have Been Waiting For'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501205100", "headline": "Pfizer (PFE) Receives a Hold from Barclays", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501211100", "headline": "Analysts Conflicted on These Healthcare Names: InMode (INMD) and Pfizer (PFE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501211500", "headline": "Thoughts For Thursday: Lingering Inflation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501222100", "headline": "Pfizer’s Mixed Financial Signals: A Delicate Balance Between Growth and Uncertainty", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501233200", "headline": "Analysts Have Conflicting Sentiments on These Healthcare Companies: Pfizer (PFE), Sagimet Biosciences, Inc. Class A (SGMT) and Alkermes (ALKS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501235921", "headline": "4 Fortune 500 Industry Leaders Boast Ideal April/May Dividends", "summary": "Discover the top dividend stocks among the 500 biggest US companies, yielding from 0.14% to 8.07%, and their impressive net gains."}, {"date": "20240502001103", "headline": "Pfizer : Quarterly Corporate Performance - First Quarter 2024 Press Release", "summary": "Pfizer Reports First-Quarter 2024 Results Solid First-Quarter Results Reflect Continued Growth of Key Products and Progress in..."}, {"date": "20240502002800", "headline": "3 Contrarian Stocks That Could Make You a Fortune (If You Dare)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502003900", "headline": "Pfizer Exceeds Q1 Expectations with Strong Earnings and Raises 2024 Guidance: A Buy Rating by Evan Seigerman", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502005900", "headline": "Pfizer price target raised by $1 at Morgan Stanley, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502010106", "headline": "The top pharmaceutical companies by R&D expenditure", "summary": "From Merck & Co to Sanofi, Pharmaceutical Technology lists the leading pharmaceutical companies spending the most on R&D in 2023."}, {"date": "20240502011401", "headline": "Pfizer Stock: Finally The Market Is Waking Up", "summary": "Pfizer's stock is undervalued compared to its peers, offering a higher-than-average dividend yield. Find out if now is a good time to buy PFE stock."}, {"date": "20240502011727", "headline": "Pfizer Inc (PFE) Q1 2024 Earnings Call Transcript Highlights: Navigating Post-COVID Challenges ...", "summary": "Despite a revenue dip, Pfizer boosts EPS guidance and showcases robust oncology growth and strategic FDA approvals."}, {"date": "20240502023102", "headline": "Pfizer’s reported net income declines 44% in Q1 2024", "summary": "The company's revenues for the quarter totalled $14.9bn, a 20% decrease from the same quarter of the previous year."}, {"date": "20240502024800", "headline": "Pfizer Unusual Options Activity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502025900", "headline": "Company News for May 2, 2024", "summary": "Companies In The News Are: CVS, PFE, PPL, ADP."}, {"date": "20240502030000", "headline": "Dividend Harvesting Portfolio Week 165: $16,500 Allocated, $1,478.71 In Projected Dividends", "summary": "The markets had a good week, and the Dividend Harvesting Portfolio is meeting all the investment objectives. Learn more about Dividend Harvesting Portfolio here."}, {"date": "20240502031500", "headline": "Pfizer's Stock Is a Buy. Here Are Six Reasons Why.", "summary": "The pharma-giant's shares could be poised for a trend reversal."}, {"date": "20240502035000", "headline": "My Top 5 Favorite High-Yield Dividend Stocks to Buy in May", "summary": "Income investors can buy in May and go away with these stocks."}, {"date": "20240502040600", "headline": "Genmab reports Q1 revenue increased 46% vs. last year", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502050300", "headline": "Why Markets Must Beware Powell’s Comments on Fed Rate Hikes, and 5 Other Things to Know Today", "summary": "Novo Nordisk hikes guidance as sales of weight-loss drugs surge, Qualcomm profit lifted amid high demand for AI on devices, and other news to start your day."}, {"date": "20240502061700", "headline": "Buy Rating Affirmed for Pfizer Amid Strong Q1 Performance and Strategic Cost Savings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502064100", "headline": "10 Health Care Stocks Whale Activity In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502065100", "headline": "Moderna to seek parity for RSV shot as rivals lead in market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502091015", "headline": "Pfizer Inc. (NYSE:PFE) Q1 2024 Earnings Call Transcript", "summary": "Pfizer Inc. (NYSE:PFE) Q1 2024 Earnings Call Transcript May 1, 2024 Pfizer Inc. beats earnings expectations. Reported EPS is $0.82, expectations were $0.516. Pfizer Inc. isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good day, everyone, and welcome to the […]"}, {"date": "20240502232015", "headline": "AM Best Affirms Credit Ratings of Blue Whale Re Ltd", "summary": "AM Best has affirmed the Financial Strength Rating of A and the Long-Term Issuer Credit Rating of 'a+' of Blue Whale Re Ltd. .The outlook of these Credit Ratings is stable.The ratings reflect..."}, {"date": "20240503000200", "headline": "3 Ultra-Safe Stocks to Buy So You Can Rest Easy in Any Market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503022800", "headline": "Moderna price target raised to $155 from $125 at Jefferies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503032551", "headline": "BioNTech Earnings Preview: I Will Stay On The Sidelines", "summary": "Investors should pay attention to BioNTech's operating expenses and progress in its drug development pipeline. Learn why I rate BNTX stock a hold."}, {"date": "20240503033700", "headline": "Amgen stock rallies 13% on GLP-1 weight-loss drug update", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503040107", "headline": "NICE recommends new haemolytic anaemia treatment", "summary": "In final draft guidance, the National Institute For Health and Care Excellence has recommended voxelotor with or without hydroxycarbamide as a treatment for haemolytic anaemia, which is caused by..."}, {"date": "20240503041212", "headline": "GSK Sues Pfizer, Pharmacia & Upjohn & BioNTech For Infringing MRNA Vaccine Patents", "summary": "Late last week, GlaxoSmithKline Biologicals SA and GlaxoSmithKline LLC filed suit in the District of Delaware alleging that Pfizer, Pharmacia & Upjohn, BioNtech SE, BioNtech Manufacturing GMBH, and..."}, {"date": "20240503042236", "headline": "NHS to provide Pfizer’s Voxelotor to treat sickle cell disease", "summary": "The decision will benefit up to 4,000 patients in England with the genetic blood disorder."}, {"date": "20240503043929", "headline": "Q1 2024 Cardiff Oncology Inc Earnings Call", "summary": "Q1 2024 Cardiff Oncology Inc Earnings Call"}, {"date": "20240503075010", "headline": "Here's Why Pfizer (PFE) is a Strong Momentum Stock", "summary": "Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores."}, {"date": "20240503092900", "headline": "Pharma Stock Roundup: LLY, NVO, PFE Q1 Results, JNJ's New Plan to Resolve Talc Claims", "summary": "Eli Lilly (LLY), Novo Nordisk (NVO), Pfizer (PFE) and AbbVie (ABBV) announce their first-quarter results."}, {"date": "20240503110150", "headline": "Vanguard Health Care Fund's Strategic Moves in Q1 2024: A Focus on Pfizer Inc", "summary": "Insight into the Fund's Latest Investment Decisions and Stock Adjustments"}, {"date": "20240503150725", "headline": "Amgen's peek at its GLP-1 drug trial results heightens competition in obesity market", "summary": "Competition is heating up in the GLP-1 space as Amgen gets closer to the finish line with its candidate."}, {"date": "20240503213935", "headline": "SCHD: A Must-Have In Every Dividend Portfolio", "summary": "Schwab U.S. Dividend Equity ETF (SCHD) offers diversification and resilience with a focus on healthy dividend-paying companies, but lower total returns. Read more here."}, {"date": "20240504031700", "headline": "3 High-Yield Dividend Stocks to Buy Now and Hold at Least a Decade", "summary": "These highly advantaged businesses have what they need to keep raising their dividend payouts."}, {"date": "20240504041123", "headline": "Dividend Champion, Contender, And Challenger Highlights: Week Of May 5", "summary": "Stay updated on dividend activity with this weekly summary."}, {"date": "20240504044500", "headline": "Can Pfizer Challenge Lilly and Novo Nordisk in the Obesity Market?", "summary": "Where there's a will, there's a way. And Pfizer appears to have the will to stake a claim in the massive obesity drug market."}, {"date": "20240504065037", "headline": "Do These 3 Checks Before Buying Pfizer Inc. (NYSE:PFE) For Its Upcoming Dividend", "summary": "Readers hoping to buy Pfizer Inc. ( NYSE:PFE ) for its dividend will need to make their move shortly, as the stock is..."}]}