{"news": [{"date": "20240323032600", "headline": "Bernstein Sticks to Their Hold Rating for Philip Morris (PM)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240324193800", "headline": "Stock Market Looking Dangerous – 6 Safe Large Cap Dividend Blue Chips", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240324214100", "headline": "Philip Morris International Inc. stock underperforms Monday when compared to competitors despite daily gains", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240325032934", "headline": "Philip Morris International - Unleashing the Power How the 'Fifth Estate' Drives Decision-Makers in Business and Politics", "summary": "STAMFORD - Individuals now wield substantial influence over the decision-making process of established institutions.Philip Morris International examined this topic in a white paper and an..."}, {"date": "20240325101412", "headline": "4 Fortune 500 Industry Leaders Boast Ideal March Dividends", "summary": "The Summer 2023 edition of Fortune Magazine revealed 500 biggest U.S. companies by revenue. Explore more details here."}, {"date": "20240326004800", "headline": "Pampa Metals Intersects Wide Interval of Copper Mineralization with Bornite Rich Core in Second Drillhole at Piuquenes, San Juan Province, Argentina", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240326005900", "headline": "Here’s how Wall Street analysts’ favorite stock picks performed over the past five years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240326022944", "headline": "Philip Morris: appoints future head of External Affairs", "summary": "Philip Morris International announces the appointment of Christos Harpantidis as Senior Vice President, External Affairs, effective May 1, 2024. Since joining PMI in 2003, Christos Harpantidis has..."}, {"date": "20240326034800", "headline": "Philip Morris International Names New External Affairs Leader", "summary": "STAMFORD, Conn, March 26, 2024--Philip Morris International Inc. (PMI) (NYSE: PM) is pleased to announce the appointment of Christos Harpantidis to the position of Senior Vice President, External Affairs effective May 1, 2024. In his new role, Mr. Harpantidis will report to the company’s CEO, Jacek Olczak."}, {"date": "20240326082500", "headline": "Philip Morris' (PM) Smoke-Free Strength & Pricing Bode Well", "summary": "Philip Morris (PM) gains from its smoke-free transition efforts and pricing power amid rising costs and receding cigarette volumes."}, {"date": "20240326132026", "headline": "Dip Buying Bonanza: 3 Rock-Solid Stocks to Scoop Up Now", "summary": "Despite U.S. markets reaching record highs, some stocks are moving in the opposite direction. Many registered lows for the year in the past week. Analysts also worry that a few tech and artificial intelligence (AI) stocks are primarily driving the market. A rotation into some stocks to buy on the dip can be expected. Often, participants focus on growth stocks leading the charge. However, this can leave many stocks to buy in the dip as long as they have compelling valuations and robust financials"}, {"date": "20240326200928", "headline": "U.S. Wide-Moat Stocks On Sale - The March 2024 Heat Map", "summary": "We believe stocks that have a 5-star Morningstar rating and/or finish in the upper quintile of the PRVit ranking are worth a closer look. Click here for a detailed analysis."}, {"date": "20240326203600", "headline": "The 3 Highest-Yielding Dividend Kings for March 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240327024600", "headline": "5 Absolutely Best Dividend Stocks Yielding Over 5%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240327154500", "headline": "The 3 Best Dividend Stocks to Buy in Q2 2024", "summary": "Dividends are a key part of the total return equation. Indeed, adding some of the best dividend stocks to buy can boost your portfolio returns. At the same time, it can lower your overall portfolio volatility. According to Fidelity, since 1930, dividends have accounted for 40% of the S&P 500’s total return. Even better, the return contribution was higher during inflationary periods. Notably, during the 1940s, 1970s and 1980s, when inflation soared, dividends contributed 54% of the total return."}, {"date": "20240328033300", "headline": "First Week of May 17th Options Trading For Philip Morris International (PM)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328035700", "headline": "May 10th Options Now Available For Philip Morris International (PM)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328053800", "headline": "Philip Morris International Demonstrates Clear Progress Toward Its Purpose as It Releases 2023 Integrated Report", "summary": "STAMFORD, CT, March 28, 2024--Philip Morris International Inc. (PMI) (NYSE: PM) today releases its fifth annual Integrated Report, which outlines the company’s ongoing work to advance toward its 2025 Roadmap goals, with the primary focus on addressing the health impacts of the company’s products."}, {"date": "20240328074710", "headline": "Philip Morris nears Texas launch of flagship heated tobacco device", "summary": "Philip Morris Internationalis preparing to launch its flagship heated tobacco deviceIQOS in Austin, Texas, indicating it will be the first testingground for its U.S. entry, job adverts on LinkedIn..."}, {"date": "20240328115216", "headline": "Exclusive-Philip Morris nears Texas launch of flagship heated tobacco device", "summary": "Philip Morris International is preparing to launch its flagship heated tobacco device IQOS in Austin, Texas, indicating it will be the first testing ground for its U.S. entry, job adverts on LinkedIn show.  IQOS, the top selling heated tobacco device globally, sits at the core of the world's biggest tobacco company's efforts to transform its image from a purveyor of cigarettes to a driving force behind the switch to healthier options."}, {"date": "20240328120830", "headline": "Starter Stock Portfolio: 12 Safe Stocks To Invest In Now", "summary": "In this article, we will be taking a look at 12 safe stocks to invest in now. To skip our detailed analysis of current stock market news, you can go directly to see the Starter Stock Portfolio: 5 Safe Stocks To Invest In Now. Safe Investing For Beginner Investors Investing in defensive sectors has always been […]"}, {"date": "20240328213000", "headline": "Tesla And Two Other Stocks Trading At 52-Week Lows That Can Rebound Strongly", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240329025900", "headline": "10 Big-Name Stocks Near 52 Week Lows: Are They A Buy?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240330010000", "headline": "The Magnificent 7 Of Dividend Aristocrats Yield As Much As 6%", "summary": "Check here to learn about the lucrative potential of the Magnificent 7 of high-yield dividend aristocrats with impressive growth and risk management."}, {"date": "20240330011800", "headline": "5 Very Large Cap Blue Chip Stocks With 5% and Higher Dividends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240330130200", "headline": "My Oh My, This 5.7% Yield Dividend Stock Is a Magnificent Buy", "summary": "IQOS and Zyn are big reasons to invest in Philip Morris."}, {"date": "20240330234600", "headline": "Here’s how Wall Street analysts’ favorite stock picks performed over the past 5 years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401034900", "headline": "The least shorted S&P 500 stocks as a percentage of float - BofA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401065700", "headline": "7 Defensive Stocks to Buy Based on the ‘Pawn Shop Indicator’", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402010900", "headline": "The U.S. ban on menthol cigarettes may be pushed to after the election", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402034700", "headline": "Another State Takes On BlackRock, Claiming 'Fraudulent Action' With Its ESG Policies As ESG Backlash Intensifies Against Biden's Wishes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403052800", "headline": "America’s Top Companies By Revenue (1994 Vs. 2023)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403072300", "headline": "The Millionaire Makers: 7 Stealth Stocks for a 7-Figure Portfolio", "summary": "Certain stocks are hidden gems in investing because they can provide considerable returns and expand a portfolio to hit the million-dollar mark. Here, seven companies offer appealing returns based on solid fundamentals. To be specific, the first one has a growing client base. The company’s impressive increase in client accounts indicates a rising user base and confidence in its services, which paves the way for long-term leads. Meanwhile, the second one has an extensive user network. The company"}, {"date": "20240403170549", "headline": "British American Tobacco: Strong Catalysts Ahead (Buy)", "summary": "British American Tobacco's bet on non-combustible products could sustain growth and cash flow in the future. See why BTI stock is a Buy."}, {"date": "20240403171000", "headline": "Are Heated-Tobacco Products the Future of Philip Morris International? 3 Things Investors Should Watch as the Company Nears Texas Launch", "summary": "Philip Morris is planning to launch IQOS in the U.S."}, {"date": "20240403214300", "headline": "Philip Morris International Takes Over #61 Spot From Micron Technology", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403222200", "headline": "FDA issues warning letters to retailers for underage sale of ZYN pouches", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404072832", "headline": "Passive Income Perfection: 7 Dividend Stocks to Generate $50,000 Per Year", "summary": "The topic of passive income is popular these days. Investors, consumers, and many other individuals are curious about any method that can produce income without work. Dividend stocks are an excellent example of one such method. In fact, investors can buy dividend stocks for $50,000 per year income. Dividend stocks are one of the most reliable sources of passive income available. Investors have been using dividends to create wealth for hundreds of years, in fact several hundred years. In 1602, th"}, {"date": "20240404115803", "headline": "US FDA issues warning letters to retailers against underage sale of ZYN nicotine pouches", "summary": "The U.S. Food and DrugAdministration on Thursday said it had issued warning lettersand filed civil money penalty complaints against retailersengaged in underage sale of various flavors of ZYN..."}, {"date": "20240404120000", "headline": "Strategic Allocation For A $100,000 Dividend Income Portfolio With A Sustainable Dividend Yield", "summary": "Discover how to allocate $100,000 among the top ETFs and stocks in the Dividend Income Accelerator Portfolio for a 4.44% weighted average dividend. Read more here."}, {"date": "20240404214500", "headline": "Philip Morris International Inc. stock underperforms Friday when compared to competitors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405161519", "headline": "Philip Morris (PM) Stock Dips While Market Gains: Key Facts", "summary": "In the most recent trading session, Philip Morris (PM) closed at $89.48, indicating a -0.69% shift from the previous trading day."}, {"date": "20240406021500", "headline": "2 Reasons to Buy 5.6% Dividend-Yielding Philip Morris International Stock Today", "summary": "Philip Morris International offers an attractive yield and strong growth opportunities."}, {"date": "20240406030445", "headline": "Dividend Champion, Contender, And Challenger Highlights: Week Of April 7", "summary": "Get the latest updates on dividend activity for Dividend Champions, Contenders, and Challengers, including changes, ex-dividend dates, and pay dates."}, {"date": "20240407212222", "headline": "DGI For The DIY: 2023 Dividend Portfolio Review", "summary": "The stock market shrugged off rising interest rates and global unrest to produce strong gains during 2023. Check out the portfolio review for 2023."}, {"date": "20240408003200", "headline": "Pampa Metals Upsizes Fully Subscribed Private Placement to $2m", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408130525", "headline": "3 Sin Stocks to Add Some Spice to Your Spring Holdings", "summary": "When economic circumstances become challenging, it’s time to get an edge, which brings us to sin stocks to buy. Yes, the sector dives into controversial arenas. However, controversies can also yield significant upside. Certainly, the March jobs report may have provided a fire for sin stocks. You see, the U.S. economy added 303,000 jobs, yet another impressive print. Naturally, this result implies greater inflation, which has been the scourge of American households. To take the edge off the troub"}, {"date": "20240409061500", "headline": "3 Stocks to Consider Adding to Your Retirement Portfolio in April", "summary": "For your true long-term money, dial back the risk just a bit. Just bear in mind you'll still want to achieve some growth."}, {"date": "20240409213400", "headline": "$100K Starter Kit: 3 Stocks to Become a Millionaire by 2034", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409231720", "headline": "Philip Morris: A Top Income Stock With A 6% Yield", "summary": "Philip Morris International has ambitious growth targets for its tobacco-free products. Check out why I upgrade PM stock from hold to buy."}, {"date": "20240410003500", "headline": "Pampa Metals' Third Hole to Extend Strongly Mineralized Copper-Gold Porphyry Core at Piuquenes Project, San Juan, Argentina", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410032500", "headline": "Andvari Associates Q1 2024 Letter", "summary": "For the first quarter of 2024, Andvari was up 12.1% net of fees, while the SPDR S&P 500 ETF was up 10.4%."}, {"date": "20240410055700", "headline": "Philip Morris (PM) Smoke-Free Options Aid Amid Volume Concerns", "summary": "Philip Morris (PM) benefits from its focus on a smoke-free transition and strategic priorities amid soft cigarette volumes and cost concerns."}, {"date": "20240411032100", "headline": "2 Ultra-High-Yield Dividend Stocks Billionaires Are Selling, and the Surprising High-Octane Income Stock They Can't Stop Buying", "summary": "Some of Wall Street's most widely owned, high-octane dividend stocks were added or disposed of by top-tier billionaire money managers during the December-ended quarter."}, {"date": "20240411040900", "headline": "May 31st Options Now Available For Philip Morris International (PM)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411060900", "headline": "7 Boring Stocks to Buy as Inflation Crimps Sentiment", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411173708", "headline": "12 Best Counter Cyclical Stocks to Invest in", "summary": "In this piece, we will take a look at the 12 best counter cyclical stocks to invest in. If you want to skip our introduction of what counter cyclical stocks are and how they behave with respect to the economy and other macroeconomic indicators, then you can skip ahead to take a look at the […]"}, {"date": "20240411203600", "headline": "Philip Morris (PM) Receives a Buy from Barclays", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411231148", "headline": "U.S. Wide-Moat Stocks On Sale - The April 2024 Heat Map", "summary": "Our 3-step process focuses on wide-moat stocks (as per Morningstarâ\u0080\u0099s rating). Read more to see the April 2024 heat map."}, {"date": "20240412002900", "headline": "Philip Morris price target lowered by $1 at BofA, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412005600", "headline": "Philip Morris: A Strong Buy on iQOS Momentum and Sustainable Growth Prospects", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412020800", "headline": "Pampa Metals Strikes High-Grade Mineralization", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412020800", "headline": "Pampa Metals Strikes Copper Rich Zone in Argentina", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412020800", "headline": "Pampa Metals Reports High-Grade Copper Discovery", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412023600", "headline": "Bank of America Securities Remains a Buy on Philip Morris (PM)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412023800", "headline": "Pampa Metals Expands Placement After Drill Success", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412023800", "headline": "Pampa Metals Expands Copper-Gold Discovery Depth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412023800", "headline": "Pampa Metals Raises $1.2M for Copper-Gold Project", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412030000", "headline": "Moon Capital Management Q1 2024 Letter", "summary": ""}, {"date": "20240413123600", "headline": "Is This 5.5% Yielding Dividend Grower the Ultimate Income Stock?", "summary": "This company is making all the right moves. But will shareholders be rewarded?"}, {"date": "20240414030000", "headline": "Andvari Associates - Altria Group: Smoke Signals", "summary": "An example of a high-yielding security is the stock of Altria Group that Andvari has a stake in. Click here to read Andvari's thesis on MO stock."}, {"date": "20240415034200", "headline": "Short interest for tobacco and personal care industries surge in March", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415085450", "headline": "Philip Morris: FX A Transitory Risk, Solid Earnings Support The Big Yield", "summary": "Philip Morris International's valuation appears favorable, with a high dividend yield and undervalued share price. Find out if PM stock is a buy."}, {"date": "20240416081200", "headline": "Philip Morris International to Host Webcast of 2024 First-Quarter Results", "summary": "STAMFORD, CT, April 16, 2024--Regulatory News: Philip Morris International Inc. (PMI) (NYSE: PM) will host a live audio webcast at www.pmi.com/2024Q1earnings on Tuesday, April 23, 2024, at 9:00 a.m. ET, to discuss its 2024 first-quarter results, which will be issued at approximately 7:00 a.m. ET the same day."}, {"date": "20240416093625", "headline": "Philip Morris Yields 6% But Faces Credit Downgrade Risk", "summary": "Philip Morris International's undervalued stock offers a high yield, but concerns arise over payout ratios, debt, and credit rating. Find out my analysis of PM."}, {"date": "20240416143000", "headline": "The Underpriced Steals: 7 Stocks You Can’t Afford to Overlook This Year", "summary": "Seven stocks stand out due to their strategic placement and excellent growth prospects among many investing alternatives. With careful post-merger integration, the first one has improved operating efficiency and produced significant savings, setting it up for future success. The second one keeps growing, leveraging the development of the digital payments industry and securing its sources of income. The third one’s large user base on all of its platforms highlights how effective its monetization"}, {"date": "20240417011300", "headline": "GLOBAL BROKER RATINGS: JPMorgan raises Fresnillo; Bernstein cuts VW", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417032100", "headline": "3 No-Brainer Stocks to Buy With $100 Right Now", "summary": "A modest amount of money can go a long way in the stock market when it's put to work in time-tested businesses with well-defined competitive advantages."}, {"date": "20240417052500", "headline": "Moon Capital - British American Tobacco: Has The Potential To Substantially Rerate", "summary": "We recently acquired shares in British American Tobacco. Why do we believe BTI has the potential to substantially re-rate? Find out."}, {"date": "20240418013100", "headline": "Pampa Metals Closes Oversubscribed $2M Private Placement", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418020900", "headline": "Pampa Metals Secures $2M for Copper-Gold Project", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418071524", "headline": "Ahead of Philip Morris (PM) Q1 Earnings: Get Ready With Wall Street Estimates for Key Metrics", "summary": "Besides Wall Street's top -and-bottom-line estimates for Philip Morris (PM), review projections for some of its key metrics to gain a deeper understanding of how the company might have fared during the quarter ended March 2024."}, {"date": "20240418200200", "headline": "Catalyst Watch: Tesla, Boeing and General Motors brace for earnings fireworks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418211400", "headline": "Bullish Two Hundred Day Moving Average Cross - PM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419010000", "headline": "Altria: Price Appreciation Isn't What's Valued Here", "summary": "Altria Group offers potential upside with a large dividend yield and successful adaptation to market shifts, providing income opportunities. Learn more on MO stock here."}, {"date": "20240419033000", "headline": "America’s Cigarette Market Is Up for Grabs", "summary": "Philip Morris will soon be able to sell its most successful smoke-free product in the U.S., setting up a battle with its former parent company Altria."}, {"date": "20240419033300", "headline": "First Week of December 20th Options Trading For Philip Morris International (PM)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419070011", "headline": "These 2 Consumer Staples Stocks Could Beat Earnings: Why They Should Be on Your Radar", "summary": "The Zacks Earnings ESP is a great way to find potential earnings surprises. Why investors should take advantage now."}, {"date": "20240420010200", "headline": "Tobacco stocks could heat up as catalysts include earnings, M&A and dividend firepower", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420042153", "headline": "20 Countries that Export the Most Tobacco in the World", "summary": "In this article, we are going to discuss the 20 countries that export the most tobacco in the world. You can skip our detailed analysis of the global tobacco market, the most popular cigarette brand in the world, and the various sustainability initiatives taken by some major players in the tobacco industry, and go directly […]"}, {"date": "20240421004642", "headline": "Wall Street Breakfast: The Week Ahead", "summary": "Stay updated with the latest financial news and market trends by listening to the Wall Street Breakfast podcast available on Seeking Alpha, iTunes, and..."}, {"date": "20240421010500", "headline": "Earnings week ahead: Tesla, Meta Platforms, Google, Microsoft, Intel, Exxon Mobil, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422022600", "headline": "Philip Morris (PM) Gets a Buy from Jefferies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422034700", "headline": "Philip Morris, Altria Q1 earnings on deck: What to expect", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422050000", "headline": "Want Decades of Passive Income? 3 Stocks to Buy Now and Hold Forever", "summary": "Look for leading companies in businesses that are timeless. A record of steady and rising dividend payments doesn't hurt either."}, {"date": "20240422055900", "headline": "Goldman’s debt issuers stocks basket", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422062700", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422065000", "headline": "Should You Buy Philip Morris International (PM) Ahead of Earnings?", "summary": "Philip Morris International (PM) is seeing favorable earnings estimate revision activity and has a positive Zacks Earnings ESP heading into earnings season."}, {"date": "20240422085900", "headline": "3 Dividend Stocks to Buy Now for Lifelong Income", "summary": "Securing a consistent income stream while guaranteeing long-term growth potential is a top priority in today’s volatile investing environment. Dividend stocks appeal to our search since they provide a stable and profitable mix. Three dividend stocks to buy now stand out with their strong business models, calculated efforts, and optimistic financial outlooks. These businesses, representing the breadth of dividend investment, range from consumer staples to healthcare. The first one’s unwavering em"}, {"date": "20240422150000", "headline": "Philip Morris Earnings Are Coming. The Popularity of Smokeless Products Is Key.", "summary": "Philip Morris International  is set to report earnings on Tuesday, with investors eyeing  heated tobacco and oral nicotine products that have driven much of the recent growth.  For the first three months of 2024, Wall Street expects the cigarette giant to post $8.4 billion in sales and $1.41 in earnings per share, up 5.3% and 2.2%, respectively, from the year-ago period.  In the fourth quarter of 2023, Philip Morris increased revenue by 11% from a year ago to $9 billion."}, {"date": "20240422183500", "headline": "GLOBAL BRIEFING: Japan's business activity growth speeds up in April", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422212600", "headline": "What You Missed On Wall Street On Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422232600", "headline": "Nasdaq, S&P, Dow futures show little change as investors await more earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000200", "headline": "Philip Morris reports Q1 adjusted EPS $1.50, consensus $1.41", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000200", "headline": "Earnings Scheduled For April 23, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000500", "headline": "Philip Morris raises FY24 adjusted EPS view, excluding currency, to $6.55-$6.67", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000900", "headline": "Philip Morris beats top-line and bottom-line estimates; raises FY24 outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423002100", "headline": "Philip Morris International slips after cutting full-year profit guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423002600", "headline": "Philip Morris’ stock slips after profit beats expectations but outlook misses", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423003200", "headline": "Philip Morris in charts: HTU shipment volume heats up 18% in Q1, Smoke-free sales on fire with a 21% increase", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423003300", "headline": "3 Stocks That Will Fly While the Market Dies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423011233", "headline": "Philip Morris: Q1 Earnings Snapshot", "summary": "STAMFORD, Conn. — STAMFORD, Conn. — Philip Morris International Inc. on Tuesday reported first-quarter net income of $2.15 billion. The Stamford, Connecticut-based company said it had..."}, {"date": "20240423011319", "headline": "Philip Morris International : Q1 2024 Glossary & Non-GAAP Reconciliations", "summary": "PRESS RELEASE Philip Morris International Reports First-Quarter 2024 Results and Updates Full Year Guidance Reported..."}, {"date": "20240423014600", "headline": "Buy Rating Affirmed for Philip Morris on Strong Q1 Performance and Raised FY2024 Guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423020500", "headline": "Fly Intel: Pre-market Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423020700", "headline": "Philip Morris’s stock pulls back premarket as profit beats expectations but outlook misses", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423021300", "headline": "TOP NEWS: Philip Morris sees smoke-free benefits as raises outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423023400", "headline": "Nasdaq, S&P, Dow advance as investors await more earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423024100", "headline": "Unusually active option classes on open April 23rd", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423024200", "headline": "Analysts Are Bullish on These Consumer Goods Stocks: Philip Morris (PM), PepsiCo (PEP)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423030713", "headline": "Philip Morris International : Q1 2024 Script", "summary": "Philip Morris International Inc. 2024 First-Quarter Conference Call April 23, 2024 JAMES BUSHNELL ..."}, {"date": "20240423034508", "headline": "Philip Morris raises annual targets", "summary": "Philip Morris International has raised its targets for 2024, anticipating adjusted EPS at constant exchange rates of between $6.55 and $6.67, up 9 to 11% on 2023 .The Stamford, Connecticut-based..."}, {"date": "20240423045800", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423045900", "headline": "Philip Morris International Reports First-Quarter 2024 Results and Updates Full Year Guidance", "summary": "STAMFORD, CT, April 23, 2024--Regulatory News: Philip Morris International Inc. (PMI) (NYSE: PM) today announces its 2024 first-quarter results1."}, {"date": "20240423050000", "headline": "PM Stock Earnings: Philip Morris Intl Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423051200", "headline": "Philip Morris (NYSE:PM) Rises on Solid Q1 Results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423053400", "headline": "Stocks with the least price swings, most attractive option-sale candidates - JPM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423055928", "headline": "Marlboro maker Philip Morris earnings beat estimates amid demand for heated tobacco sticks", "summary": "The Marlboro maker's flagship heated tobacco device IQOS, expected to launch in the United States in the second quarter, has been a driving force behind its effort to make more money from alternatives to traditional cigarettes.  The company's first-quarter revenue of $8.79 billion beat market expectations of $8.47 billion, according to LSEG data.  Demand for the IQOS device and associated tobacco sticks in major markets like Japan helped the company offset the impact of a ban on flavored heated tobacco products in the European Union."}, {"date": "20240423055928", "headline": "Philip Morris results beat estimates on demand for heated tobacco sticks", "summary": "The Marlboro maker's flagship heated tobacco device IQOS, expected to launch in the United States in the second quarter, has been a driving force behind its effort to make more money from alternatives to traditional cigarettes.  The company's first-quarter revenue of $8.79 billion beat market expectations of $8.47 billion, according to LSEG data.  Demand for the IQOS device and associated tobacco sticks in major markets like Japan helped the company offset the impact of a ban on flavored heated tobacco products in the European Union."}, {"date": "20240423063148", "headline": "Philip Morris International Inc. (PM) Reports First-Quarter 2024 Results: Aligns with EPS ...", "summary": "Comprehensive Review and Future Outlook Amidst Strong Smoke-Free Product Performance"}, {"date": "20240423075000", "headline": "Wall Street Lunch: California Bill Takes Aim At Clear Secure", "summary": "California State Senator Josh Newman introduces bill to limit Clear's concierge service at airports, citing equity issues. GM reports higher-than-expected Q1 earnings."}, {"date": "20240423075102", "headline": "Philip Morris International Inc. (PM) Q1 2024 Earnings Call Transcript", "summary": "Philip Morris International Inc. (NYSE:NYSE:PM) Q1 2024 Earnings Conference Call April 23, 2024 9:00 AM ETCorporate ParticipantsJames Bushnell - VP, IR, and..."}, {"date": "20240423080004", "headline": "Philip Morris (PM) Q1 Earnings: How Key Metrics Compare to Wall Street Estimates", "summary": "The headline numbers for Philip Morris (PM) give insight into how the company performed in the quarter ended March 2024, but it may be worthwhile to compare some of its key metrics to Wall Street estimates and the year-ago actuals."}, {"date": "20240423093600", "headline": "Philip Morris Stock Climbs on Earnings Beat. Its Smokeless Strategy Is Working.", "summary": "The cigarette maker posted first quarter adjusted earnings of $1.50 a share, beating Wall Street’s call for $1.41."}, {"date": "20240423101300", "headline": "NEW YORK MARKET CLOSE: Stocks motor as upbeat earnings provide spark", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423102449", "headline": "Top Midday Stories: Shares of GE, Novartis, Danaher and Philip Morris Up Post-Earnings; Pepsi Stock Down Post-Earnings; Apple iPhone China Sales Drop 19%; Trump Poised for Windfall From Media Company Stock", "summary": "Top Midday Stories: Shares of GE, Novartis, Danaher and Philip Morris Up Post-Earnings; Pepsi Stock Down Post-Earnings; Apple iPhone China Sales Drop 19%; Trump Poised for Windfall From Media Company Stock"}, {"date": "20240423122536", "headline": "Philip Morris Reports Soaring Sales of Zyn Nicotine Pouches", "summary": "Philip Morris International said it shipped 131.6 million cans of its Zyn nicotine pouches in the U.S. in the first quarter of 2024, an increase of nearly 80% compared to the same period last year.  Zyn's share of the U.S. nicotine pouch category increased for the fourth consecutive quarter to more than 74%, the tobacco giant said.  Zyn's volume growth contributed to the company's overall revenue increase of 11% excluding currency impacts and the impact of acquisitions, Philip Morris said."}, {"date": "20240423144527", "headline": "Why Philip Morris International Stock Was Climbing Today", "summary": "Shares of the tobacco giant jumped on a strong earnings report."}, {"date": "20240423152300", "headline": "Philip Morris Scores an Earnings Beat. Its Smoke-free Strategy Is Working.", "summary": "The cigarette maker posted first quarter adjusted earnings of $1.50 a share, beating Wall Street’s call for $1.41."}, {"date": "20240423190800", "headline": "Philip Morris International Inc (PM) (Q1 2024) Earnings Call Transcript Highlights: Strong ...", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423200900", "headline": "See Which Of The Latest 13F Filers Holds Philip Morris International", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423211300", "headline": "Philip Morris continues gains for seven straight sessions, stock nears 52-week high", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423231441", "headline": "Philip Morris International, Inc. delivers on its promises", "summary": "Full steam ahead for the world's leading cigarette manufacturer, whose business model transition is running at full speed."}, {"date": "20240424001000", "headline": "Philip Morris price target raised by $7 at Stifel, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424073600", "headline": "Company News for Apr 24, 2024", "summary": "Companies in The News Are: UPS,PM,NVS,IVZ"}, {"date": "20240424084937", "headline": "Philip Morris International Inc. (NYSE:PM) Q1 2024 Earnings Call Transcript", "summary": "Philip Morris International Inc. (NYSE:PM) Q1 2024 Earnings Call Transcript April 23, 2024 Philip Morris International Inc. beats earnings expectations. Reported EPS is $1.5, expectations were $1.41. Philip Morris International Inc. isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good […]"}, {"date": "20240424111958", "headline": "3 Sin Stocks to Buy as Consumers Crave Distraction", "summary": "There’s a proverb that states idle hands are the devil’s workshop, which makes sin stocks so compelling. Humans engage in certain practices, whether that involves imbibing or gambling as a means to let off some steam. Yes, the concept undergirding sin stocks is controversial. I don’t think there’s any way of getting around this reality. Not surprisingly, many ethical portfolios avoid enterprises that cover areas such as alcohol, tobacco and gambling, among other “vices.” Still, there’s another a"}, {"date": "20240424132544", "headline": "Philip Morris International First Quarter 2024 Earnings: Revenues Beat Expectations, EPS Lags", "summary": "Philip Morris International ( NYSE:PM ) First Quarter 2024 Results Key Financial Results Revenue: US$8.79b (up 9.7..."}, {"date": "20240424214000", "headline": "Philip Morris International Inc. stock underperforms Thursday when compared to competitors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425021000", "headline": "March's Dividend Portfolio Update Sets New All-Time Record - 100 Holdings, 21 Buys", "summary": "Portfolio changes in March focus on BDCs, aiming to increase dividend income by at least $100 each month. Click here for a detailed analysis."}, {"date": "20240425024000", "headline": "Unusually active option classes on open April 25th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425031500", "headline": "How Is The Market Feeling About Philip Morris Intl?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425092700", "headline": "Philip Morris Beats Estimates in Q1 Earnings: ETFs in Focus", "summary": "Philip Morris beat expectations for both revenues and earnings, driven by robust pricing and increased product volumes."}, {"date": "20240425162039", "headline": "15 Best Cheap Stocks To Buy For 2024", "summary": "In this article, we will take a look at the 15 best cheap stocks to buy for 2024. If you’d like to skip our overview of investing and some recent financial news, then please take a look at the 5 Best Cheap Stocks To Buy For 2024. While the Federal Reserve may take its time […]"}, {"date": "20240425172700", "headline": "Smokeless Products Are the Future of Big Tobacco. This Company Is Losing the Race.", "summary": "Philip Morris and Altria earnings showed which one is gaining market share of smokeless alternatives."}, {"date": "20240425190600", "headline": "White House drops plan to ban menthol cigarettes, WSJ reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425194100", "headline": "HHS says proposed menthol cigarette rule to take 'significantly more time'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425202300", "headline": "Tobacco companies breathe easier as menthol cigarette ban gets reprieve", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426015926", "headline": "Altria Group's Market Share Woes Warrant Attention", "summary": "Altria Group's management is reducing debt and buying back stock, but caution is still warranted. Read more to see my analysis on MO stock."}, {"date": "20240426030126", "headline": "What to know about Zyn, the tiny nicotine pouch that's sparked a big health debate", "summary": "WASHINGTON — A tiny Philip Morris product called Zyn has been making big headlines, sparking debate about whether new nicotine-based alternatives intended for adults may be catching on with..."}, {"date": "20240426065400", "headline": "Philip Morris (PM) International Revenue in Focus: Trends and Expectations", "summary": "Explore how Philip Morris' (PM) revenue from international markets is changing and the resulting impact on Wall Street's predictions and the stock's prospects."}, {"date": "20240426230504", "headline": "Decoding Philip Morris International Inc (PM): A Strategic SWOT Insight", "summary": "Unveiling Financial Dynamics and Strategic Directions"}, {"date": "20240427000313", "headline": "Altria: Don't Overthink This Strong Buy", "summary": "Altria's stock declined due to regulatory concerns and a decrease in combustibles, but its portfolio of alternative nicotine products offers growth. Read more."}, {"date": "20240427010000", "headline": "16 High-Yield Dividend Aristocrats Yielding Almost 5%", "summary": "Attempting to time the market is not a successful strategy. Read why long-term investing has consistently outperformed market timing."}, {"date": "20240427041900", "headline": "Slingshot Stocks: 3 Picks Primed to Catapult Higher in the Next Market Surge", "summary": "Finding opportunities for a steady and high return is crucial before the next market boom. Three exceptional businesses provide attractive opportunities in various industries. Leading the aerospace and military industries, the first one gains from significant revenue growth fueled by important government contracts. The corporation has secured its place as a top performer in the industry by receiving more money for essential initiatives with the passage of the FY2024 defense budget. Similarly, th"}, {"date": "20240427140000", "headline": "In 4 Days, Philip Morris Stock Becomes an Even Better Investment", "summary": "The tobacco giant will soon be allowed to sell a proven product in a proven market."}, {"date": "20240428162400", "headline": "Philip Morris Stock Has 24% Upside, According to 1 Wall Street Analyst", "summary": "Its products might be controversial, but the company has many admirers in the investment community."}, {"date": "20240428165443", "headline": "Dividend Stock Portfolio For Income: Top 15 Stocks", "summary": "In this article, we will discuss dividend stocks for regular income. You can skip our detailed analysis of dividend stocks and their historical performance, and go directly to read Dividend Stock Portfolio For Income: Top 5 Stocks. It is generally believed that dividend stocks are primarily suitable for people approaching retirement. However, this is far from […]"}, {"date": "20240428230448", "headline": "Analysis-Philip Morris faces key test with US heated tobacco push", "summary": "Philip Morris International's goals for heated tobacco in the United States are reachable, analysts and investors say, even though rivals see limited potential in a market where vaping dominates.  The world's biggest tobacco company by market value will launch its flagship heated tobacco device IQOS in the U.S. in the second quarter, developing the brand pretty much from scratch.  IQOS is already the top selling heated tobacco device globally and is central to PMI's efforts to transform its image from a cigarette maker to a company driving the shift to healthier options."}, {"date": "20240429013400", "headline": "Philip Morris, Accenture And 2 Other Stocks Insiders Are Selling", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429100000", "headline": "Altria Q1: Buybacks & Smokeless Products Continue To Be Growth Drivers", "summary": "Altria's net debt-to-EBITDA remained flat, and the company retired $1.1 billion worth of notes during the quarter. Learn whyÂ MO stock remains a long-term buy."}, {"date": "20240429145531", "headline": "Philip Morris' Ambitious Plans for Heated Tobacco Gains Traction Among Analysts and Investors", "summary": "Philip Morris International Inc’s (NYSE:PM) ambitions for heated tobacco in the United States garner attention from analysts and investors, who believe the company’s goals are within reach despite skepticism from rivals entrenched in the vaping market. As Philip Morris gears up to introduce its flagship heated tobacco device, IQOS, in the U.S. in the second quarter, it aims to carve out a significant market share in a country dominated by vaping products. Also Read: Tobacco Use Falls To 1 In 5 A"}, {"date": "20240429230400", "headline": "Analysts Are Sounding the Alarm Bells on These 7 Stocks: April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430003100", "headline": "Pampa Metals intersects Wide Interval of Intense Porphyry Quartz Veining and Copper Mineralization in Third Drillhole at Piuquenes, San Juan Province, Argentina", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430011800", "headline": "Pampa Metals Strikes Copper Riches in Argentina", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430021000", "headline": "High Yield Or Growth? Get Both With These 2 Top Picks", "summary": "See about 2 non-tech companies offering high yield and growth. PM offers growth potential and 5.5% dividend yield. BIM provides inflation protection and yields 6%."}, {"date": "20240430075920", "headline": "2 Dividend Stocks To Watch In May 2024", "summary": "Dividend stocks for your May 2024 watch list."}, {"date": "20240430230400", "headline": "7 Ultra-Safe Dividend Stocks to Buy With Yields Over 5%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501011900", "headline": "Analysts Offer Insights on Consumer Goods Companies: Philip Morris (PM), Sysco (SYY) and Walmart (WMT)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501072000", "headline": "Philip Morris International to Host Webcast of 2024 Virtual Annual Meeting of Shareholders", "summary": "STAMFORD, CT, May 01, 2024--Regulatory News: Philip Morris International Inc. (PMI) (NYSE: PM) will host a live audio webcast of its 2024 Annual Meeting of Shareholders on Wednesday, May 8, 2024, at 9:00 a.m. ET. The meeting will be held in a virtual format only and can be accessed at www.virtualshareholdermeeting.com/PM2024. Presentation slides, script and an archived recording of the webcast will be available at the same link. The recording will be available for approximately one year from the"}, {"date": "20240501191815", "headline": "Philip Morris Stock (NYSE:PM): Strong Q1 Results to Fuel Gains", "summary": "Philip Morris (NYSE:PM) posted its Q1 results last Tuesday, with numbers coming in very strong across the board. The global tobacco powerhouse saw impressive growth in both its Heated Tobacco and Oral Nicotine divisions. Even its supposedly waning Combustibles division recorded growth in revenues despite a tiny decline in shipment volumes. With the company poised for continued success, management revised its guidance upwards, forecasting another year of record earnings. Thus, I’m bullish on PM s"}, {"date": "20240501231200", "headline": "XLP ETF: Invest in Consumer Staples Stocks with Durable Demand", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501235921", "headline": "4 Fortune 500 Industry Leaders Boast Ideal April/May Dividends", "summary": "Discover the top dividend stocks among the 500 biggest US companies, yielding from 0.14% to 8.07%, and their impressive net gains."}, {"date": "20240502042706", "headline": "We Think Some Shareholders May Hesitate To Increase Philip Morris International Inc.'s (NYSE:PM) CEO Compensation", "summary": "Key Insights Philip Morris International's Annual General Meeting to take place on 8th of May Salary of US$1.65m is..."}, {"date": "20240502070010", "headline": "Is Trending Stock Philip Morris International Inc. (PM) a Buy Now?", "summary": "Zacks.com users have recently been watching Philip Morris (PM) quite a bit. Thus, it is worth knowing the facts that could determine the stock's prospects."}, {"date": "20240502073009", "headline": "Wall Street Analysts Think Philip Morris (PM) Is a Good Investment: Is It?", "summary": "The average brokerage recommendation (ABR) for Philip Morris (PM) is equivalent to a Buy. The overly optimistic recommendations of Wall Street analysts make the effectiveness of this highly sought-after metric questionable. So, is it worth buying the stock?"}, {"date": "20240502091200", "headline": "Philip Morris International to Present at 2024 Jefferies Virtual Reduced Risk Seminar", "summary": "STAMFORD, CT, May 02, 2024--Regulatory News: Philip Morris International Inc. (PMI) (NYSE: PM) will present at the 2024 Jefferies Virtual Reduced Risk Seminar on May 7, 2024."}, {"date": "20240502200000", "headline": "Catalyst Watch: Disney earnings, Apple iPad event and Fed speakers back on the circuit", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503010000", "headline": "10 Sleep-Well-At-Night Dividend Aristocrats Perfect For Whatever's Coming Next", "summary": "Read here for an analysis of 10 SWAN aristocrats with an average 3% yield, an A-credit rating, and a 43-year dividend growth streak."}, {"date": "20240503020100", "headline": "The Bottom May Be in for British American Tobacco", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503041500", "headline": "Individual Investors Just Don’t Like Feeding The Ducks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}]}