{"news": [{"date": "20240310211200", "headline": "Regeneron initiated with bullish view at Bernstein, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240311003800", "headline": "Regeneron says FDA has extended approval of Praluent", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240311005700", "headline": "Regeneron's Praluent injection gets FDA approval to treat kids with genetic form of high cholesterol", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240311050000", "headline": "Praluent® (alirocumab) Injection Receives FDA Approval to Treat Children with Genetic Form of High Cholesterol", "summary": "Approval extends treatment of Praluent to children aged 8 and older with heterozygous familial hypercholesterolemia (HeFH)TARRYTOWN, N.Y., March 11, 2024 (GLOBE NEWSWIRE) -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) announced the U.S. Food & Drug Administration (FDA) has extended the approval of Praluent® (alirocumab) as an adjunct to diet and other low-density lipoprotein cholesterol (LDL-C) lowering therapies to include pediatric patients aged 8 and older with heterozygous familial hyperc"}, {"date": "20240312025100", "headline": "Oracle, Dollar General upgraded: Wall Street's top analyst calls", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240312073531", "headline": "Regeneron Pharmaceuticals, Inc. (REGN) Management Presents at Barclays 26th Annual Global Healthcare Conference (Transcript)", "summary": ""}, {"date": "20240312075800", "headline": "ASLAN (ASLN) Up 161% on Upbeat Initial Data From Eczema Study", "summary": "ASLAN (ASLN) rises on upbeat initial data from a phase II study of eblasakimab in patients with eczema, who have previously been treated with Dupixent but did not achieve an adequate response."}, {"date": "20240312103200", "headline": "Regeneron (REGN) Gets FDA Nod for Praluent Label Extension", "summary": "Regeneron (REGN) obtains FDA approval for Praluent as an adjunct to diet and other LDL-C, lowering therapies to include pediatric patients aged eight and older with HeFH."}, {"date": "20240312215500", "headline": "High School Seniors Win $1.8 Million at Regeneron Science Talent Search 2024 for Innovative Scientific Research on Artificial Intelligence, Cancer Metabolism and Mathematical Optimization", "summary": "Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) and Society for Science (the Society) announced that Achyuta Rajaram, 17, of Exeter, NH, won the top award in the Regeneron Science Talent Search (STS) 2024, America's oldest and most prestigious science and math competition for high school seniors."}, {"date": "20240312220200", "headline": "Analysts’ Top Healthcare Picks: Cooper Co (COO), Regeneron (REGN)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313001000", "headline": "Regeneron price target raised by $11 at Morgan Stanley, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313015700", "headline": "NVIDIA To Rally Around 20%? Here Are 10 Top Analyst Forecasts For Wednesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313070507", "headline": "Regeneron Pharmaceuticals, Inc. (REGN) Leerink Partners Global Biopharma Conference (Transcript)", "summary": ""}, {"date": "20240313085532", "headline": "The 3 Most Undervalued Biotech Stocks to Buy in March 2024", "summary": "Biotech stocks are not for investors with a low-risk tolerance. This sector has stocks that are either considered blue-chip names or pre-revenue lotto tickets. It is also one of the most important sectors that produce treatments and drugs for the betterment of mankind. Investing in biotech stocks can be risky since the clinical results of many of their treatments can be unpredictable. However, choosing the right companies can benefit both your portfolio and millions of patients in dire need of t"}, {"date": "20240314060800", "headline": "Cardiff Oncology (CRDF) Moves 20.5% Higher: Will This Strength Last?", "summary": "Cardiff Oncology (CRDF) was a big mover last session on higher-than-average trading volume. The latest trend in earnings estimate revisions might help the stock continue moving higher in the near term."}, {"date": "20240314210600", "headline": "Unpacking the Latest Options Trading Trends in Regeneron Pharmaceuticals", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314222100", "headline": "Analysts Are Bullish on These Healthcare Stocks: 89bio (ETNB), Intuitive Surgical (ISRG)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240315041204", "headline": "Biocon Settles With Bayer And Regeneron, Securing Canada Market Entry Date For Aflibercept Biosimilar", "summary": "On March 4, Biocon Biologics Ltd. announced it has signed a settlement agreement with Bayer Inc. and Regeneron Pharmaceuticals, Inc. regarding YESAFILI, Biocon's proposed biosimilar to EYLEA . The..."}, {"date": "20240317050011", "headline": "Regeneron Pharmaceuticals Insiders Sold US$26m Of Shares Suggesting Hesitancy", "summary": "Over the past year, many Regeneron Pharmaceuticals, Inc. ( NASDAQ:REGN ) insiders sold a significant stake in the..."}, {"date": "20240317152004", "headline": "11 Oversold Biotech Stocks To Buy Right Now", "summary": "In this article, we will be taking a look at 11 oversold biotech stocks to buy right now. To skip our detailed analysis of the biotech sector, you can go directly to see the 5 Oversold Biotech Stocks To Buy Right Now. Dealmaking in Biotech Healthcare has been performing well so far in 2024, and […]"}, {"date": "20240318112829", "headline": "US appeals court revives Regeneron's antitrust lawsuit against Novartis", "summary": "A U.S. appeals court on Monday revived an antitrust lawsuit by Regeneron Pharmaceuticals against Novartis related to prescription treatments to address a condition that can lead to eye disorders including permanent blindness.  The 2nd U.S. Circuit Court of Appeals in Manhattan said a lower court judge erred in dismissing the case, in part for having applied an improper legal standard to Regeneron's claims.  Regeneron in a statement said it was \"encouraged by the 2nd Circuit’s decision\" and looked forward to \"further advancing our position in future proceedings.\""}, {"date": "20240319063700", "headline": "Buy Rating Affirmed for Regeneron on Eylea HD Success and Innovative Obesity Program", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240319202200", "headline": "Regeneron Pharmaceuticals Unusual Options Activity For March 20", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240321040500", "headline": "May 3rd Options Now Available For Regeneron Pharmaceuticals (REGN)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322054300", "headline": "Intellia opts out of hemophilia pact with Regeneron", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240322150727", "headline": "Hot Stocks: The 3 Best Opportunities for Investing in Weight Loss Drugs", "summary": "Prescription weight loss drugs, like GLP-1 agonists and orlistat, offer effectiveness for some individuals and have proven effects the market has taken notice of. These drugs focus on curbing appetite, which investors in weight loss drug stocks have noticed. These drugs, combined with exercise and other diet enhancements, have proven effective. However, with FDA approvals for only certain conditions (depending on the label) and Medicare coverage differing by insurance provider, there’s still som"}, {"date": "20240324200751", "headline": "Sanofi: My Top Pick In Big Pharma", "summary": "Sanofi has a stable dividend proposition and a strong balance sheet. Click here to read why SNY stock is my favorite Big Pharma pick."}, {"date": "20240325000300", "headline": "Regeneron receives CRL from FDA on odronextamab BLA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240325010700", "headline": "US FDA declines to approve Regeneron's blood cancer therapy", "summary": "Regeneron Pharmaceuticalssaid on Monday the U.S. Food and Drug Administration hasdeclined to approve its blood cancer therapy for two most commonsubtypes of non-Hodgkin lymphoma due to an issue..."}, {"date": "20240325013421", "headline": "FDA Rejects Regeneron's Odronextamab in Follicular, Diffuse Large B-cell Lymphoma", "summary": "By Colin Kellaher Regeneron Pharmaceuticals on Monday said the U.S. Food and Drug Administration has turned away its application seeking approval of odronextamab to treat the two most common..."}, {"date": "20240325033100", "headline": "FDA declines to approve Regeneron lymphoma drug odronextamab", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240325045100", "headline": "FDA Delays Decision For Regeneron's Inaugural Blood Cancer Therapy, Highlights Trial Concerns", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240325050000", "headline": "Regeneron Provides Update on Biologics License Application for Odronextamab", "summary": "TARRYTOWN, N.Y., March 25, 2024 (GLOBE NEWSWIRE) -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced that the U.S. Food and Drug Administration (FDA) has issued Complete Response Letters (CRLs) for the Biologics License Application (BLA) for odronextamab in relapsed/refractory (R/R) follicular lymphoma (FL) and in R/R diffuse large B-cell lymphoma (DLBCL), each after two or more lines of systemic therapy. The only approvability issue is related to the enrollment status of the confi"}, {"date": "20240325052758", "headline": "UPDATE 3-Regeneron's blood cancer therapy faces setback as FDA raises trial concerns", "summary": "Regeneron Pharmaceuticals said on Monday the U.S. FDA has declined approval for its blood cancer therapy for two forms of lymphoma on concerns over the progress of ongoing confirmatory trials.  The FDA said in its response letter that it needs more data from enrollments in dose-finding and confirmatory portions of trials, delaying its decision on the drug, while confirming no issues with clinical efficacy or safety, trial design, labeling or manufacturing.  The company was testing its experimental drug, odronextamab, in multiple late-stage trials in patients with follicular lymphoma and diffuse large B-cell lymphoma, the two most common subtypes of non-Hodgkin lymphoma."}, {"date": "20240325053200", "headline": "Analysts Offer Insights on Healthcare Companies: Alphatec Holdings (ATEC) and Regeneron (REGN)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240325054100", "headline": "Analysts Offer Insights on Healthcare Companies: Regeneron (REGN) and Alphatec Holdings (ATEC)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240325055500", "headline": "FDA rejects Regeneron lymphoma drug, setting back company’s oncology push", "summary": "The agency wants Regeneron to make more progress with a confirmatory trial before clearing odronextamab, a “bispecific” antibody being developed for multiple blood cancers."}, {"date": "20240325215200", "headline": "Analysts Offer Insights on Healthcare Companies: United Therapeutics (UTHR), Regeneron (REGN) and Intuitive Surgical (ISRG)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240326014600", "headline": "Truist Financial Remains a Buy on Regeneron (REGN)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240326030800", "headline": "Decoding 12 Analyst Evaluations For Regeneron Pharmaceuticals", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240326044400", "headline": "3 Biotech Stocks to Buy for the Next Bull Run: March 2024", "summary": "As we step into March 2024, the spotlight is turning towards the biotech sector, with investors searching for biotech stocks to buy. Biotech stocks are ready to soar after a period of under-performance relative to the broader market. With advancements in gene editing, personalized medicine and novel therapeutics, the sector is on the cusp of delivering transformative healthcare solutions. The global biotechnology market is set for remarkable growth. It is forecast to soar from $1 trillion in 202"}, {"date": "20240326050021", "headline": "Is Regeneron Pharmaceuticals (NASDAQ:REGN) A Risky Investment?", "summary": "Howard Marks put it nicely when he said that, rather than worrying about share price volatility, 'The possibility of..."}, {"date": "20240326083626", "headline": "Regeneron's Triple Threat: Eylea, Libtayo, And Dupixent Dominate", "summary": "Regeneron benefits financially from Dupixent sales and a strong balance sheet. Learn why we feel REGN stock is a compellingÂ Buy."}, {"date": "20240326083700", "headline": "Regeneron's (REGN) Lymphoma Candidate Rejected by the FDA", "summary": "Regeneron's (REGN) efforts to expand its oncology portfolio get a hit as the FDA refuses to approve the lymphoma drug odronextamab."}, {"date": "20240327030000", "headline": "SillaJen Submits CSR to the US FDA for REN026 Study in Patients with RCC", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240327214600", "headline": "Regeneron Pharmaceuticals Inc. stock outperforms competitors despite losses on the day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240327230000", "headline": "Biotech veteran Art Krieg postpones retirement to build an unorthodox drug startup", "summary": "With Zola Therapeutics, Krieg plans to design and sell a series of cancer immunotherapies without the help of outside investors, he told BioPharma Dive."}, {"date": "20240328001712", "headline": "Market Definition For Patented Products: The Second Circuit Reinstates Regeneron v. Novartis", "summary": "The Second Circuit U.S. Court of Appeals has reinstated an antitrust complaint brought by pharma firm, Regeneron Pharmaceuticals, Inc., against the Swiss pharmaceutical giant, Novartis Pharma AG, and..."}, {"date": "20240328060000", "headline": "Stock-Split Watch: Are These 2 Top Growth Stocks Next?", "summary": "Shares of Eli Lilly and Regeneron are both well into the range where splits would make sense."}, {"date": "20240328061700", "headline": "Xeris gains as Oppenheimer highlights drug technology", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328063300", "headline": "Biotech Stock Roundup: PRAX, VKTX Up on Study Results & MRNA, REGN Give Updates", "summary": "Praxis Precision Medicines, Inc. (PRAX) and Viking Therapeutics, Inc. (VKTX) gain from positive study updates."}, {"date": "20240330080010", "headline": "Is Regeneron Pharmaceuticals, Inc.'s (NASDAQ:REGN) Stock's Recent Performance A Reflection Of Its Financial Health?", "summary": "Most readers would already know that Regeneron Pharmaceuticals' (NASDAQ:REGN) stock increased by 9.6% over the past..."}, {"date": "20240331023700", "headline": "Sanofi and Regeneron’s Dupixent set for large gains with likely COPD approval", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240331032535", "headline": "Outlook Therapeutics: De-Risked Regulatory Tracks Are Lining Up For Possible ONS-5010 Approval", "summary": "Click here for analysis of the positive CHMP opinion for ONS-5010, potential European approval, ongoing Phase 3 study for Wet-AMD treatment, and more about Outlook Therapeutics stock."}, {"date": "20240331203600", "headline": "Here's How Much $100 Invested In Regeneron Pharmaceuticals 10 Years Ago Would Be Worth Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401140500", "headline": "Regeneron to Report First Quarter 2024 Financial and Operating Results and Host Conference Call and Webcast on May 2, 2024", "summary": "TARRYTOWN, N.Y., April 01, 2024 (GLOBE NEWSWIRE) -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced that it will report its first quarter 2024 financial and operating results on Thursday, May 2, 2024, before the U.S. financial markets open. The Company will host a conference call and simultaneous webcast at 8:30 AM Eastern Time that day. Conference Call Information Participants may access the conference call live via webcast on the ’Investors and Media’ page of Regeneron’s website"}, {"date": "20240401213100", "headline": "5 Healthcare Stocks to Buy for 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402043900", "headline": "Biotech Roundtable: Who will bring the next CRISPR drug to market?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403200307", "headline": "LLY, REGN, BHVN: Which Biotech Stock Offers the Most Upside?", "summary": "The biotechnology scene is becoming difficult to ignore if you consider yourself a growth investor who seeks upside potential beyond just the numerous crowded artificial intelligence (AI) plays. Though there are still lower-cost AI stocks in the mega-cap universe, I’d argue that few are capable of the type of upside as some of the market’s most innovative biotechnology firms — like LLY, REGN, and BHVN. Further, the biotechnology scene stands out as one of the industries that can also be made mor"}, {"date": "20240404100900", "headline": "Kodiak (KOD) Counts on Tarcocimab Program Despite Setbacks", "summary": "Kodiak (KOD) initiates a phase III study evaluating tarcocimab in diabetic retinopathy, which is expected to serve as the basis for a regulatory filing for three eye disease indications."}, {"date": "20240404214500", "headline": "Regeneron Pharmaceuticals Inc. stock rises Friday, still underperforms market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405050000", "headline": "Should You Sell This Stock Following a Regulatory Roadblock?", "summary": "It's not the first such obstacle this high-performing drugmaker has faced."}, {"date": "20240406060130", "headline": "Investors in Regeneron Pharmaceuticals (NASDAQ:REGN) have seen impressive returns of 146% over the past five years", "summary": "When you buy shares in a company, it's worth keeping in mind the possibility that it could fail, and you could lose..."}, {"date": "20240406215000", "headline": "Regeneron presents pivotal data from Phase 1/2 LINKER-MM1 trial of linvoseltamab", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407010500", "headline": "Phathom Pharma, Rhythm, Vaxcyte most likely takeover targets in pharma - analyst", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407140000", "headline": "Linvoseltamab Pivotal Data Presented at AACR Reinforce High Response Rate that Deepens Over Time in Patients with Heavily Pre-Treated Multiple Myeloma", "summary": "Regulatory applications for linvoseltamab currently under review by the U.S. Food and Drug Administration (FDA) and European Medicines Agency (EMA)TARRYTOWN, N.Y., April 07, 2024 (GLOBE NEWSWIRE) -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced the oral plenary session presentation of positive pivotal data from the Phase 1/2 LINKER-MM1 trial of linvoseltamab in patients with relapsed/refractory (R/R) multiple myeloma (MM) at the American Association for Cancer Research (AACR) An"}, {"date": "20240408225000", "headline": "Analysts Offer Insights on Healthcare Companies: Regeneron (REGN), Veeva Systems (VEEV) and Ultragenyx Pharmaceutical (RARE)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408234600", "headline": "Regeneron (REGN) Receives a Buy from RBC Capital", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409052500", "headline": "Regeneron Pharmaceuticals Achieves #96 Analyst Rank, Surpassing Costco Wholesale", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409052600", "headline": "Video: S&P 500 Analyst Moves: REGN", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409053717", "headline": "11 Best Biotech ETFs To Buy", "summary": "In this article, we discuss 11 best biotech ETFs to buy. If you want to skip our discussion on the biotech industry, head over to 5 Best Biotech ETFs To Buy. The new era in biotech is defined by the convergence of biology, data, and artificial intelligence. According to The Journal of mHealth, the focus […]"}, {"date": "20240409094012", "headline": "EXEL or REGN: Which Is the Better Value Stock Right Now?", "summary": "EXEL vs. REGN: Which Stock Is the Better Value Option?"}, {"date": "20240409212700", "headline": "DOJ files false claims act complaint against Regeneron over drug pricing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409221200", "headline": "DOJ sues Regeneron over Eylea Medicare pricing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409231600", "headline": "Regeneron accused of ‘fraudulent’ drug-pricing reporting for eye drug Eylea", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410070010", "headline": "An Intrinsic Calculation For Regeneron Pharmaceuticals, Inc. (NASDAQ:REGN) Suggests It's 47% Undervalued", "summary": "Key Insights Regeneron Pharmaceuticals' estimated fair value is US$1,774 based on 2 Stage Free Cash Flow to Equity..."}, {"date": "20240410105911", "headline": "US Justice department files complaint against Regeneron, alleges fraudulent drug pricing", "summary": "The U.S. Justice Department said on Wednesday it had filed a false claims act complaint against Regeneron Pharmaceuticals, claiming the company filed false average sales price reports...."}, {"date": "20240410145249", "headline": "UPDATE 2-US accuses Regeneron of fraudulent price reporting for eye drug", "summary": "The U.S. Justice Department on Wednesday accused Regeneron Pharmaceuticals of manipulating Medicare's drug-pricing process by inflating the average sales price for its expensive macular degeneration drug Eylea.  The department, in a complaint filed in federal court in Boston, alleged the drugmaker failed for years to report how it paid hundreds of millions of dollars to subsidize Eylea purchases by reimbursing drug distributors for credit-card processing fees.  The drug, which the Tarrytown, New York-based company began marketing in 2011, is approved by the U.S. Food and Drug Administration for treating conditions including wet age-related macular degeneration, which impairs vision."}, {"date": "20240410145911", "headline": "US accuses Regeneron of fraudulent price reporting for eye drug", "summary": "BOSTON (Reuters) -The U.S. Justice Department on Wednesday accused Regeneron Pharmaceuticals of manipulating Medicare's drug-pricing process by inflating the average sales price for its expensive macular degeneration drug Eylea.  The department, in a complaint filed in federal court in Boston, alleged the drugmaker failed for years to report how it paid hundreds of millions of dollars to subsidize Eylea purchases by reimbursing drug distributors for credit-card processing fees.  Those payments were made to ensure that specialty drug distributors would accept credit cards from doctors and retina practices purchasing Eylea while continuing to charge physicians a lower price, according to the lawsuit."}, {"date": "20240411003100", "headline": "Regeneron (NASDAQ:REGN) Accused of Manipulating Pricing of Eylea", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411015900", "headline": "DOJ files complaint against Regeneron over Eylea Medicare pricing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411041000", "headline": "These Stocks Are Moving the Most Today: Alpine Immune, Vertex, Robinhood, Regeneron, Costco, Constellation Brands, CarMax, and More", "summary": "Alpine Immune Sciences is being acquired by Vertex Pharmaceuticals for $4.9 billion in cash, Robinhood stock is downgraded, and Constellation Brands, CarMax, and Fastenal are scheduled to report earnings."}, {"date": "20240411045900", "headline": "RBC sees buying opportunity following Regeneron's 'overdone DOJ downside'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411050600", "headline": "US sues Regeneron, alleging false price reporting on Eylea", "summary": "The lawsuit claims the drugmaker didn’t disclose reimbursement to drug distributors for credit card fees, artificially inflating the reported price of the blockbuster eye drug."}, {"date": "20240411051900", "headline": "Regeneron Pharmaceuticals's Options: A Look at What the Big Money is Thinking", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411061900", "headline": "Regeneron hits three-month low after DOJ complaint; RBC defends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411075833", "headline": "Stocks to Watch Thursday: Robinhood, Alpine Immune, Constellation Brands", "summary": "↗️ **Alpine Immune Sciences (ALPN)**: Biotech company **Vertex Pharmaceuticals (VRTX)** agreed to buy Alpine for $4.9 billion, to bolster its kidney-disease portfolio. The target company's shares soared over 36%, extending Wednesday's gains."}, {"date": "20240411082742", "headline": "Dow Jones Lower Despite PPI Inflation Relief; Nvidia, Microsoft Price Targets Raised", "summary": "The Dow fell after initially rising on the PPI inflation report on the stock market today. Analysts hiked Microsoft and Nvidia price targets."}, {"date": "20240411110151", "headline": "Are Regeneron's Legal Troubles — And Six-Week Slide — A Buying Opportunity?", "summary": "Regeneron stock toppled Thursday after the DOJ filed a lawsuit saying the drugmaker fraudulently inflated the prices of its drug, Eylea."}, {"date": "20240411144300", "headline": "These Stocks Moved the Most Today: CarMax, Apple, Fastenal, Rivian, Alpine Immune, Nike, Robinhood, Constellation Brands, and More", "summary": "Earnings at CarMax miss analysts’ estimates, Alpine Immune Sciences is being acquired by Vertex Pharmaceuticals for $4.9 billion in cash, Robinhood stock is downgraded, and Nike receives an upgrade."}, {"date": "20240411222100", "headline": "Analysts Offer Insights on Healthcare Companies: Teladoc (TDOC), Instil Bio (TIL) and Regeneron (REGN)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412000000", "headline": "Regeneron price target raised by $10 at BofA, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412013400", "headline": "Analysts Are Bullish on These Healthcare Stocks: BioMarin Pharmaceutical (BMRN), Regeneron (REGN)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412030400", "headline": "Breaking Down Regeneron Pharmaceuticals: 13 Analysts Share Their Views", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412034800", "headline": "Stocks with the least price swings, most attractive option-sale candidates - JPM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412115400", "headline": "Regeneron (REGN) Accused of Fraudulent Practices Related to Eylea", "summary": "The U.S. Department of Justice files a complaint against Regeneron (REGN), alleging fraudulent drug pricing practices related to its lead drug, Eylea."}, {"date": "20240414090015", "headline": "Antitrust fervor is gripping Washington and Silicon Valley. But lawsuits have been declining.", "summary": "Antitrust lawsuits have declined since the pandemic despite a high-profile push by Washington to limit the concentration of power in key industries."}, {"date": "20240415054500", "headline": "Regeneron commits $500M to new venture capital fund", "summary": "While corporate venture arms are commonplace among pharmaceutical companies, the new fund announced Monday is Regeneron’s first."}, {"date": "20240415130707", "headline": "Regeneron Pharmaceuticals : Statement on Department of Justice Filing Related to EYLEA® (aflibercept) Injection 2 mg", "summary": "Media Statement April 15, 2024 Statement on Department of Justice Filing Related to EYLEA® Injection 2 mg Regeneron..."}, {"date": "20240415172004", "headline": "Regeneron to defend US Justice Department's complaint on drug-pricing manipulation", "summary": "Regeneron Pharmaceuticals said on Monday the U.S. Justice Department's complaint against the company misreporting the average sales price for its macular degeneration drug Eylea is \"meritless\" and it plans to defend this case in court.  The Justice Department last week had accused Regeneron of manipulating Medicare's drug-pricing process by inflating the average sales price for its Eylea drug."}, {"date": "20240415172402", "headline": "Regeneron to defend against DOJ complaint on drug-price manipulation", "summary": "\"Reimbursing credit card service fees to distributors is not a price concession and does not affect EYLEA's price,\" Regeneron said in a statement, adding that it considered the complaint to be \"meritless\".  The DOJ last week, in a complaint filed in federal court in Boston, alleged the drugmaker failed for years to report how it paid hundreds of millions of dollars to subsidize Eylea purchases by reimbursing drug distributors for credit-card processing fees."}, {"date": "20240415175913", "headline": "UPDATE 1-Regeneron to defend against DOJ complaint on drug-price manipulation", "summary": "Regeneron Pharmaceuticals said on Monday it seeks to defend against U.S. Department of Justice's complaint that alleged the company misreported the average sales price of its macular degeneration drug Eylea.  \"Reimbursing credit card service fees to distributors is not a price concession and does not affect EYLEA's price,\" Regeneron said in a statement, adding that it considered the complaint to be \"meritless\".  The DOJ last week, in a complaint filed in federal court in Boston, alleged the drugmaker failed for years to report how it paid hundreds of millions of dollars to subsidize Eylea purchases by reimbursing drug distributors for credit-card processing fees."}, {"date": "20240416013900", "headline": "Regeneron to “vigorously defend” against DOJ on Eylea pricing complaint", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416014500", "headline": "Regeneron to 'vigorously defend' against DOJ on Eylea pricing complaint", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416101015", "headline": "Why Regeneron (REGN) Could Beat Earnings Estimates Again", "summary": "Regeneron (REGN) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report."}, {"date": "20240416194100", "headline": "Amgen/AstraZeneca's Asthma Drug Tezspire Vs. Sanofi/Regeneron's Blockbuster Dupixent - Analyst Gives His Pick", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416214800", "headline": "Regeneron Pharmaceuticals Inc. stock outperforms competitors on strong trading day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416235600", "headline": "Cantor Fitzgerald Reaffirms Their Hold Rating on Regeneron (REGN)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417020100", "headline": "Wall Street Analysts Are Bullish on Top Healthcare Picks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417060300", "headline": "If You Invested $100 In This Stock 20 Years Ago, You Would Have $6,700 Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417070010", "headline": "Why Investors Need to Take Advantage of These 2 Medical Stocks Now", "summary": "Investors looking for ways to find stocks that are set to beat quarterly earnings estimates should check out the Zacks Earnings ESP."}, {"date": "20240417081606", "headline": "The Law Offices of Frank R. Cruz Announces Investigation of Regeneron Pharmaceuticals, Inc. (REGN) on Behalf of Investors", "summary": "The Law Offices of Frank R. Cruz announces an investigation of Regeneron Pharmaceuticals, Inc. on behalf of investors concerning the Company’s possible violations of federal securities laws.If..."}, {"date": "20240418115500", "headline": "Biotech Stock Roundup: REGN, SAGE, NMRA Down on Updates, ITCI Gains on Study Success", "summary": "Regeneron (REGN) and Sage Therapeutics (SAGE) are in focus on regulatory and pipeline updates."}, {"date": "20240419080017", "headline": "Regeneron Pharmaceuticals Insiders Sell US$26m Of Stock, Possibly Signalling Caution", "summary": "Over the past year, many Regeneron Pharmaceuticals, Inc. ( NASDAQ:REGN ) insiders sold a significant stake in the..."}, {"date": "20240421204800", "headline": "Additions and deletions of Oppenheimer’s OPCO Trifecta", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422013100", "headline": "Regeneron (REGN) Gets a Buy from Piper Sandler", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422021008", "headline": "MDL Panel Grants Transfer Of Aflibercept BPCIA Case", "summary": "As we previously reported, on January 11, 2024, Regeneron Pharmaceuticals, Inc. moved to establish a multi-district litigation for its aflibercept BPCIA litigation, and to transfer its case against..."}, {"date": "20240422021700", "headline": "Agenus (AGEN) Soars 6.8%: Is Further Upside Left in the Stock?", "summary": "Agenus (AGEN) saw its shares surge in the last session with trading volume being higher than average. The latest trend in earnings estimate revisions could translate into further price increase in the near term."}, {"date": "20240422155400", "headline": "Regeneron to Highlight Advances in Genetic Medicine Research at American Society of Gene and Cell Therapy (ASGCT)", "summary": "Oral presentations include updated results from clinical study of otoferlin gene therapy DB-OTO demonstrating restoration in children with profound genetic hearing loss Additional presentations cover progress in novel genetic medicine delivery systems and immune response modulation TARRYTOWN, N.Y., April 22, 2024 (GLOBE NEWSWIRE) -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced that new and updated data across its genetic medicines portfolio will be presented at the American Soc"}, {"date": "20240424002100", "headline": "Regeneron price target raised by $10 at TD Cowen, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424073434", "headline": "Kiniksa Pharmaceuticals: Arcalyst Performs While Abiprubart Plans Take Shape", "summary": "Kiniksa plans to develop abiprubart for treatment of Sjogren's syndrome, with phase 2b trial expected to start in the second half. Read more on KNSA stock here."}, {"date": "20240424080500", "headline": "Regeneron to Showcase Progress in Advancing Novel Investigational Treatment Approaches for a Broad Range of Solid Tumors and Blood Cancers at ASCO", "summary": "Oral presentation will feature new data for investigational REGN7075, an EGFRxCD28 costimulatory bispecific with the potential to enhance the treatment of certain advanced solid tumors in combination with Libtayo® (cemiplimab-rwlc) 17 presentations to highlight Regeneron's investigational pipeline including checkpoint inhibitors, CD3 bispecifics and CD28 costimulatory bispecifics TARRYTOWN, N.Y., April 24, 2024 (GLOBE NEWSWIRE) -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced ne"}, {"date": "20240424135100", "headline": "Top Stock Reports for Danaher, Regeneron Pharmaceuticals & Palo Alto Networks", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Danaher Corporation (DHR), Regeneron Pharmaceuticals, Inc. (REGN) and Palo Alto Networks, Inc. (PANW)."}, {"date": "20240424190200", "headline": "AbbVie's Dermatitis Drug Shown 'Superior' To Sanofi/Regeneron's Dupixent In Head-To-Head Study", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424224500", "headline": "Wells Fargo Reaffirms Their Buy Rating on Regeneron (REGN)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425002900", "headline": "Regeneron, Mammoth collaborate to purse next-generation gene editing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425010000", "headline": "Regeneron expands in gene editing with Mammoth deal", "summary": "“With each passing year, we're more committed to becoming a serious player in the genetic medicine space,” a Regeneron executive said."}, {"date": "20240425012500", "headline": "Regeneron, Mammoth in pact to develop CRISPR-based gene editing therapies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425020527", "headline": "Regeneron Sets Crispr-Based Collaboration With Mammoth Biosciences", "summary": "By Colin Kellaher Regeneron Pharmaceuticals has inked a deal with privately held Mammoth Biosciences to research, develop and commercialize Crispr-based gene-editing therapies targeting ..."}, {"date": "20240425043000", "headline": "AbbVie reports positive results from Rinvoq versus Dupixent study", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425050000", "headline": "Regeneron and Mammoth Biosciences Collaborate to Pursue Next-Generation CRISPR-Based Gene Editing for Multiple Diseases", "summary": "Mammoth’s proprietary ultracompact CRISPR-based gene editing platform and Regeneron’s proprietary delivery technologies set to advance in vivo programs in multiple tissue and cell types Mammoth to receive $100 million total upfront payment and equity investment from Regeneron at signing TARRYTOWN, N.Y., April 25, 2024 (GLOBE NEWSWIRE) -- Regeneron Pharmaceuticals, Inc. (NASDAQ:REGN) and Mammoth Biosciences, Inc., today announced a collaboration to research, develop and commercialize in vivo CRIS"}, {"date": "20240425050000", "headline": "Regeneron to collaborate on gene editing therapies with Doudna-founded Mammoth", "summary": "Regeneron Pharmaceuticals and Mammoth Biosciences will collaborate to research, develop and commercialize gene editing therapies for multiple diseases, the companies said on Thursday.  Mammoth's CRISPR-based gene editing platform and Regeneron's delivery technologies will be used to create disease-modifying medicines that can be delivered to tissues beyond the liver.  CRISPR, discovered by Jennifer Doudna and CRISPR Therapeutics co-founder Emmanuelle Charpentier, uses molecular \"scissors\" to trim faulty parts of genes that can then be disabled or replaced with new strands of normal DNA."}, {"date": "20240425064400", "headline": "The Zacks Analyst Blog Highlights Danaher, Regeneron Pharmaceuticals, Palo Alto Networks, Workday and American Electric Power", "summary": "Danaher, Regeneron Pharmaceuticals, Palo Alto Networks, Workday and American Electric Power are part of the Zacks top Analyst Blog."}, {"date": "20240425064404", "headline": "UPDATE 1-AbbVie's skin disease drug found to be more effective than Regeneron's Dupixent in study", "summary": "AbbVie said on Thursday its drug, Rinvoq, for treating a type of inflammatory skin condition was found to be more effective than Regeneron Pharmaceuticals and Sanofi's Dupixent in a late-stage head-to-head study.  Rinvoq helped 19.9% of patients simultaneously achieve near-complete skin clearance with a no-to-little itch after 16 weeks of treatment, compared with 8.9% of patients treated with Dupixent, the study showed.  The study is the first head-to-head trial in adults and adolescents with moderate-to-severe atopic dermatitis and had shown an inadequate response to systemic therapy, AbbVie said."}, {"date": "20240425080213", "headline": "Regeneron (REGN) Reports Next Week: What You Should Expect", "summary": "Regeneron (REGN) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240425094012", "headline": "EXEL vs. REGN: Which Stock Is the Better Value Option?", "summary": "EXEL vs. REGN: Which Stock Is the Better Value Option?"}, {"date": "20240425094204", "headline": "Heard on the Street: Bristol-Myers Goes From Big Pharma to Little Pharma", "summary": "Bristol-Myers Squibb’s market capitalization has dropped so much over the past year that it is now arguably no longer part of the big pharma club.  After reporting disappointing earnings figures on Thursday, the company’s shares fell sharply, giving it a market capitalization of about $95 billion.  The problem for Bristol-Myers is that its older blockbuster products, cancer drug Revlimid and blood thinner Eliquis, are expected to decline in the coming years and investors aren’t convinced that the company has enough growth drivers in the near term."}, {"date": "20240425114916", "headline": "These Are The Biotechs Showing Up At The Biggest Cancer Meeting Of The Year (Oral Presentations)", "summary": "The Annual Meeting of ASCO is a major event for clinicians and researchers in the field of oncology. Explore more details here."}, {"date": "20240425214900", "headline": "Barclays Sticks to Their Buy Rating for Regeneron (REGN)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425221210", "headline": "DOJ Files False Claims Act Complaint Against Regeneron, Alleging Fraudulent Eylea Drug Pricing", "summary": "As we previously reported, the U.S. Department of Justice filed a lawsuit under the Anti-Kickback Statute against Regeneron Pharmaceuticals in the District of Massachusetts regarding Regeneron's..."}, {"date": "20240426012200", "headline": "Analysts Are Bullish on Top Healthcare Stocks: Regeneron (REGN), Gilead Sciences (GILD)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426014200", "headline": "Regeneron price target raised by $50 at Oppenheimer, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426055300", "headline": "Interesting REGN Put And Call Options For June 7th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428163204", "headline": "11 Oversold Growth Stocks to Buy Right Now", "summary": "In this article, we will take a look at the 11 oversold growth stocks to buy right now. To skip our analysis of the recent trends and market activity, you can go directly to see the 5 Oversold Growth Stocks to Buy Right Now. Growth is a highly sought after phenomenon whether it pertains to […]"}, {"date": "20240429001700", "headline": "Regeneron announces presentations on EYLEA HD, EYLEA Injection at ARVO meeting", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429050000", "headline": "EYLEA® HD (aflibercept) Injection 8 mg Presentations at ARVO Reinforce Sustained and Clinically Meaningful Outcomes in Serious Retinal Diseases", "summary": "Long-term data and subgroup analyses from pivotal EYLEA HD clinical program continue to demonstrate durable efficacy and consistent safety in patients with wet age-related macular degeneration and certain diabetic eye diseasesTARRYTOWN, N.Y., April 29, 2024 (GLOBE NEWSWIRE) -- Regeneron Pharmaceuticals, Inc. (NASDAQ: REGN) today announced the presentation of positive long-term results and subgroup analyses from the pivotal clinical program of EYLEA® HD (aflibercept) Injection 8 mg. The presentat"}, {"date": "20240429071600", "headline": "Countdown to Regeneron (REGN) Q1 Earnings: A Look at Estimates Beyond Revenue and EPS", "summary": "Evaluate the expected performance of Regeneron (REGN) for the quarter ended March 2024, looking beyond the conventional Wall Street top-and-bottom-line estimates and examining some of its key metrics for better insight."}, {"date": "20240429073505", "headline": "Down -8.24% in 4 Weeks, Here's Why Regeneron (REGN) Looks Ripe for a Turnaround", "summary": "Regeneron (REGN) has become technically an oversold stock now, which implies exhaustion of the heavy selling pressure on it. This, combined with strong agreement among Wall Street analysts in revising earnings estimates higher, indicates a potential trend reversal for the stock in the near term."}, {"date": "20240430002100", "headline": "Analysts Offer Insights on Healthcare Companies: Regeneron (REGN), DocGo (DCGO) and Revvity (RVTY)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430033300", "headline": "Behind the Scenes of Regeneron Pharmaceuticals's Latest Options Trends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430064100", "headline": "10 Health Care Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430064700", "headline": "Should You Consider Regeneron (REGN) Ahead of Q1 Earnings?", "summary": "An increase in profits from Dupixent and further uptake of Eylea HD are likely to have aided Regeneron (REGN) in partially offsetting the decline in Eylea sales."}, {"date": "20240430092000", "headline": "Will These 5 Drug/Biotech Stocks Beat Q1 Earnings Forecast?", "summary": "Let's look at five large-cap pharma/biotech companies slated to release quarterly results this week."}, {"date": "20240501003400", "headline": "Regeneron sees FY24 adjusted EPS $1.42-$1.49, consensus $1.46", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501024900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501043700", "headline": "Regeneron Pharmaceuticals Q1 2024 Earnings Preview", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501044215", "headline": "Roche’s VABYSMO has successful Q1 sales despite Regeneron and Bayer’s EYLEA HD launch", "summary": "Sales of EYLEA HD in the US fell from $6.3bn in 2022 to $5.9bn in 2023."}, {"date": "20240501062100", "headline": "Adverum Biotechnologies a new buy at H.C. Wainwright on wet AMD gene therapy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501065600", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501183500", "headline": "GLOBAL BRIEFING: Federal Reserve notes \"lack of progress\" on inflation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501193300", "headline": "Regeneron’s stock climbs 4% as analyst look past earnings miss to focus on pipeline", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501233200", "headline": "Regeneron reports Q1 adjusted EPS $9.55, consensus $10.10", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501233300", "headline": "Regeneron announces new $3B share repurchase program", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501233400", "headline": "Regeneron Pharmaceuticals misses top-line and bottom-line estimates; updates FY24 outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501233400", "headline": "Regeneron lowers FY24 CapEx view to $780M-$880M from $825M-$950M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501235600", "headline": "Regeneron’s stock dips after earnings fall short of estimates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502003433", "headline": "Regeneron misses profit estimates on weaker Eylea and Dupixent sales", "summary": "U.S. drugmaker RegeneronPharmaceuticals Inc missed Wall Street estimates forfirst-quarter profit on Thursday due to softer sales of itsblockbuster eye drug Eylea and its eczema treatment,..."}, {"date": "20240502004517", "headline": "Regeneron: Q1 Earnings Snapshot", "summary": "TARRYTOWN, N.Y. — TARRYTOWN, N.Y. — Regeneron Pharmaceuticals Inc. on Thursday reported first-quarter net income of $722 million. The Tarrytown, New York-based company said it had profit..."}, {"date": "20240502005700", "headline": "Regeneron falls after Q1 miss; announces $3B share buybacks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502011148", "headline": "Regeneron Pharmaceuticals 1Q Revenue Declines Amid Lower EYLEA Sales", "summary": "By Denny Jacob Regeneron Pharmaceuticals posted lower-than-expected revenue in its latest quarter which resulted in part from lower sales of EYLEA in the U.S. The biotechnology company..."}, {"date": "20240502012326", "headline": "Regeneron: Adjusted EPS down 4% in Q1", "summary": "Regeneron reports Q1 sales of $3,145 million, down 1% on the same period a year earlier. The US biotech company reported adjusted net income of $1116 million, down 4%.' While investing in innovation..."}, {"date": "20240502020400", "headline": "Regeneron 10-Q cites FDA calling for more Dupi data, says RBC Capital", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502020700", "headline": "Regeneron says FDA requested additional analyses during Dupixent sBLA review", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502022958", "headline": "Regeneron Pharmaceuticals, Inc. 2024 Q1 - Results - Earnings Call Presentation", "summary": "The following slide deck was published by Regeneron Pharmaceuticals, Inc."}, {"date": "20240502033600", "headline": "Here's How Much You Would Have Made Owning Regeneron Pharmaceuticals Stock In The Last 20 Years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502034200", "headline": "Regeneron quarterly net profit falls after dive of Covid-related sales", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502035500", "headline": "REGN Stock Earnings: Regeneron Pharmaceuticals Misses EPS, Misses Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502040400", "headline": "Industry Comparison: Evaluating Regeneron Pharmaceuticals Against Competitors In Biotechnology Industry", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502043000", "headline": "Regeneron Reports First Quarter 2024 Financial and Operating Results", "summary": "First quarter 2024 revenues decreased 1% to $3.15 billion versus first quarter 2023; excluding RonapreveTM(a)(b), revenues increased 7%First quarter 2024 Dupixent® global net sales (recorded by Sanofi) increased 24% to $3.08 billion versus first quarter 2023First quarter 2024 U.S. net sales for EYLEA® HD and EYLEA® were $1.40 billion, including $200 million from EYLEA HDFirst quarter 2024 Libtayo® global net sales increased 45% to $264 million versus first quarter 2023First quarter 2024 GAAP dil"}, {"date": "20240502051500", "headline": "3 Biotech Stocks to Buy and Hold Through 2030 and Beyond", "summary": "It pays to develop novel medicines for life-threatening illnesses."}, {"date": "20240502060022", "headline": "Is Weakness In Regeneron Pharmaceuticals, Inc. (NASDAQ:REGN) Stock A Sign That The Market Could be Wrong Given Its Strong Financial Prospects?", "summary": "It is hard to get excited after looking at Regeneron Pharmaceuticals' (NASDAQ:REGN) recent performance, when its stock..."}, {"date": "20240502062813", "headline": "Regeneron Pharmaceuticals, Inc. (REGN) Q1 2024 Earnings Call Transcript", "summary": "Regeneron Pharmaceuticals, Inc. (NASDAQ:NASDAQ:REGN) Q1 2024 Earnings Conference Call May 2, 2024 8:30 AM ETCompany ParticipantsRyan Crowe - Senior Vice..."}, {"date": "20240502063258", "headline": "Regeneron Pharmaceuticals Inc (REGN) Q1 2024 Earnings: Challenges and Opportunities Amidst ...", "summary": "First Quarter Results Show Revenue Decline but Strong Dupixent and Libtayo Sales Growth"}, {"date": "20240502064100", "headline": "Wall Street Inches Up Post Fed; Chipmakers Rebound; Gold, Crude Falter: What's Driving Market Thursday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502064500", "headline": "Wall Street Inches Up After Powell's Inflation Remarks; Chipmakers Rebound; Gold, Crude Falter: What's Driving Markets Thursday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502073023", "headline": "Regeneron (REGN) Reports Q1 Earnings: What Key Metrics Have to Say", "summary": "Although the revenue and EPS for Regeneron (REGN) give a sense of how its business performed in the quarter ended March 2024, it might be worth considering how some key metrics compare with Wall Street estimates and the year-ago numbers."}, {"date": "20240502080100", "headline": "Regeneron (REGN) Q1 Earnings, Sales Miss on Lower Eylea Sales", "summary": "Regeneron (REGN) reports Q1 results, wherein both the top and bottom lines miss estimates due to lower Eylea sales. Shares down."}, {"date": "20240502095207", "headline": "Regeneron Reverses On Better-Than-Feared Eylea Sales As Patent Expiration Looms", "summary": "Regeneron stock jumped early Thursday, bolstered by strong sales of a high-dose version of its blockbuster eye disease treatment, Eylea."}, {"date": "20240502230838", "headline": "Decoding Regeneron Pharmaceuticals Inc (REGN): A Strategic SWOT Insight", "summary": "Insightful Analysis of Regeneron's Financials and Strategic Positioning"}, {"date": "20240502232000", "headline": "Shhh! 3 Secret Pharma Stocks Flying Below Wall Street’s Radar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502233700", "headline": "Buy Rating Affirmed: Regeneron’s Promising Pipeline and Potential for Surpassing Earnings Expectations", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502234800", "headline": "Buy Rating Affirmed for Regeneron on Strong Product Performance and Promising Pipeline Developments", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503003100", "headline": "Truist Financial Keeps Their Buy Rating on Regeneron (REGN)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503010900", "headline": "Regeneron (REGN) Receives a Buy from Oppenheimer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503011035", "headline": "Regeneron Pharmaceuticals Inc (REGN) Q1 2024 Earnings Call Transcript Highlights: Key Financial ...", "summary": "Discover how Regeneron sustains robust growth with significant advancements in clinical programs and strategic market maneuvers."}, {"date": "20240503012400", "headline": "Analysts Are Bullish on These Healthcare Stocks: Elevation Oncology (ELEV), Moderna (MRNA)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503040200", "headline": "Why Investors Are Eyeing Regeneron Pharmaceuticals Inc (REGN): The Key Drivers of Market ...", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503043400", "headline": "June 14th Options Now Available For Regeneron Pharmaceuticals (REGN)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503050000", "headline": "Assessing Regeneron Pharmaceuticals: Insights From 16 Financial Analysts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503070116", "headline": "Regeneron Pharmaceuticals First Quarter 2024 Earnings: Misses Expectations", "summary": "Regeneron Pharmaceuticals ( NASDAQ:REGN ) First Quarter 2024 Results Key Financial Results Revenue: US$3.15b (flat on..."}, {"date": "20240503081546", "headline": "Regeneron Pharmaceuticals, Inc. (NASDAQ:REGN) Q1 2024 Earnings Call Transcript", "summary": "Regeneron Pharmaceuticals, Inc. (NASDAQ:REGN) Q1 2024 Earnings Call Transcript May 2, 2024 Regeneron Pharmaceuticals, Inc. misses on earnings expectations. Reported EPS is $9.55 EPS, expectations were $10.17. Regeneron Pharmaceuticals, Inc. isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Welcome to […]"}, {"date": "20240504031302", "headline": "Amgen Could Become A Real Contender In The Obesity Market", "summary": "Amgen's shares surge on positive phase 2 trial results for obesity candidate MariTide, increasing its potential as a strong player in the market."}, {"date": "20240504053818", "headline": "23 Most Profitable Stocks of the Last 12 Months", "summary": "In this article, we discuss the 23 most profitable stocks of the last 12 months. If you want to skip our detailed analysis of these stocks, go directly to 5 Most Profitable Stocks of the Last 12 Months. The United States stock market has come a long way since the turn of the millennium more […]"}]}