{"news": [{"date": "20240331225600", "headline": "Buy Rating Affirmed for Raytheon Technologies Amidst Recovery and Growth Catalysts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240331233600", "headline": "RTX added to 'Q2 Tactical Ideas List' at Wells Fargo", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401020000", "headline": "Wells Fargo's high-conviction tactical longs and shorts for Q2", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401020247", "headline": "Procter & Gamble, Johnson & Johnson Among 10 Dividend Growth Companies Announcing Increases In First Half Of April", "summary": "The pattern of moderate dividend increases continued in March. Find out my predictions of annual dividend increases for long-term dividend growth companies."}, {"date": "20240401023000", "headline": "RTX: Leading Aerospace Company Is Flying High Again", "summary": "Growth in commercial aerospace is expected to remain robust and support RTX's rally in the medium term. Find out if RTX stock is a buy."}, {"date": "20240401040617", "headline": "Raytheon - RTX's SM-6 intercepts ballistic missile target at sea", "summary": "A Standard Missile-6 built by Raytheon, an RTX business, intercepted a medium-range ballistic missile target at sea in its final seconds of flight, after being fired from the USS Preble .This test..."}, {"date": "20240401054800", "headline": "Market Whales and Their Recent Bets on RTX Options", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401072029", "headline": "Lockheed Martin, RTX, And L3Harris: Any Value Left In The Defense Sector?", "summary": "Lockheed Martin, RTX Corp. and L3Harris Technologies, defense stocks benefited from recent heightened geopolitical tensions. Click here to read more."}, {"date": "20240401095100", "headline": "Collins Aerospace and Luminace Partner with Common Energy to Support Community Solar Projects Across Portland", "summary": "NEW YORK, April 01, 2024--Collins Aerospace, an RTX (NYSE: RTX) business, and Common Energy, a leading community solar provider, today announced a partnership to support a portfolio of four new community solar projects across the greater Portland area. In aggregate, the projects have a capacity of 12 megawatts and will generate 17 million kilowatt hours of clean energy each year. Clean electricity from the projects will flow directly to the electric grid and replace fossil fuel generation, there"}, {"date": "20240401192700", "headline": "11 Dividend Increases Expected In April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401212200", "headline": "RTX edges higher for its seventh straight session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402012600", "headline": "Raytheon Technologies: Hold Rating Amidst GTF Engine Concerns and Financial Uncertainties", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402045600", "headline": "RTX Secures a $287M Contract to Modernize 166 Tomahawk Missiles", "summary": "RTX is set to offer recertification and modernization of 166 Tomahawk Block IV All-Up-Round Missiles to help enable the missiles to be operational, for up to an additional 15 years of service."}, {"date": "20240402060000", "headline": "RTX to release first quarter results on April 23, 2024", "summary": "RTX (NYSE: RTX) will issue its first quarter 2024 earnings Tuesday, April 23, prior to the stock market opening. A conference call will take place at 8:30 a.m. ET."}, {"date": "20240402074046", "headline": "12 Dividend Increases Expected In April 2024", "summary": "Discover the 12 expected dividend increases in April 2024, featuring 6 Dividend Kings and 2 Dividend Aristocrats, crucial for financial freedom in high..."}, {"date": "20240402084624", "headline": "RTX Stock Has 23% Upside, According to 1 Wall Street Analyst", "summary": "2024 could be a better year for this aerospace and defense company if the analyst's projections hold true."}, {"date": "20240402101015", "headline": "Why RTX (RTX) is Poised to Beat Earnings Estimates Again", "summary": "RTX (RTX) has an impressive earnings surprise history and currently possesses the right combination of the two key ingredients for a likely beat in its next quarterly report."}, {"date": "20240403090934", "headline": "GE Aerospace: GE Is Dead, Long Live GE", "summary": "GE has completed its half a decade restructuring program, resulting in a streamlined entity focused on the aerospace market. Find out why GE stock is a Strong Buy."}, {"date": "20240404000700", "headline": "Raytheon Technologies (RTX) Receives a Buy from Wells Fargo", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404011600", "headline": "Jefferies Reaffirms Their Hold Rating on Raytheon Technologies (RTX)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404031708", "headline": "RTX : Ships of the Navy", "summary": "Ships of the Navy The inside story of a poster so popular it surprised even us April 04, 2024 Share this..."}, {"date": "20240404090309", "headline": "RTX : In the middle of a mission, these UAVs learned new tricks", "summary": "In the middle of a mission, these UAVs learned new tricks Collins Aerospace, with help from a startup, brings new power to uncrewed aerial vehicles ..."}, {"date": "20240404213100", "headline": "Spotlight on RTX: Analyzing the Surge in Options Activity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404214500", "headline": "RTX Corp. stock outperforms competitors on strong trading day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405024100", "headline": "Unusually active option classes on open April 5th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405024300", "headline": "Jefferies aerospace/defense analysts to hold analyst/industry conference call", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405034100", "headline": "Stock losers of Republican policy if Trump wins - GS", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405054600", "headline": "Raytheon Technologies call volume above normal and directionally bullish", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405060239", "headline": "RTX Corporation Is In The Right Place At The Right Time", "summary": "RTX Corporation, Collins Aerospace, and Pratt & Whitney show impressive sales growth in 2023, with strong performance in the commercial segment. Learn more on RTX stock here."}, {"date": "20240405084556", "headline": "What To Expect After March's Hot Inflation Report", "summary": "Markets are volatile ahead of next week's inflation report, but bullish sentiment is firmly in place. Check out my thoughts on the upcoming March CPI report."}, {"date": "20240405103624", "headline": "RTX Corporation: Neither Value Nor Growth", "summary": "RTX Technologies generates 40% of its sales from military contracts, but revenue doesnâ\u0080\u0099t show growth in real terms. Check out why RTX stock is rated hold."}, {"date": "20240406030200", "headline": "Cosmic Profits: 3 Space Stocks With Sky-High Potential", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240406080800", "headline": "Can a New CEO Save Boeing?", "summary": "Despite all the doom and gloom, the stock still has a value case, and the company's strategy makes sense."}, {"date": "20240408003600", "headline": "Spirit Airlines to defer Airbus deliveries, furlough pilots to boost liquidity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408042900", "headline": "Spirit to defer Airbus plane deliveries, furlough 260 pilots this year", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408053613", "headline": "RTX's Raytheon completes critical milestone for VIIRS program; Company completes thermal vacuum testing of the fourth sensor", "summary": "EL SEGUNDO, Calif-- Raytheon, an RTX business , has completed a major test milestone on its latest Visible Infrared Imaging Radiometer Suite sensor. The VIIRS instrument observes and collects global..."}, {"date": "20240408080000", "headline": "RTX's Raytheon completes critical milestone for VIIRS program", "summary": "Raytheon, an RTX business (NYSE: RTX), has completed a major test milestone on its latest Visible Infrared Imaging Radiometer Suite (VIIRS) sensor. The VIIRS instrument observes and collects global environmental data that spans visible and infrared wavelengths across land, ocean, and atmosphere and is a pivotal part of the NASA-NOAA Joint Polar Satellite System (JPSS) series of satellites."}, {"date": "20240409080000", "headline": "RTX's Pratt & Whitney announces North American Technology Accelerator", "summary": "(MRO Americas) Pratt & Whitney, an RTX (NYSE: RTX) business, today announced details of its North American Technology Accelerator (NATA), a commercial and military aftermarket operations center of excellence based in Florida. The NATA will have dedicated floor space, equipment and resources for the development and industrialization of technology insertion programs that will support the company's global maintenance, repair and overhaul (MRO) network."}, {"date": "20240409202100", "headline": "Uber, Emerson Electric, Caterpillar among top industrial Quant picks ahead of Q1 earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409214254", "headline": "Spirit Airlines: Beyond Merger, Turnaround Potential Exists", "summary": "Spirit Airlines' stock valuation and price have been impacted by the blocked merger with JetBlue. Read why there is potential for investment in SAVE despite this."}, {"date": "20240410033500", "headline": "RTX's Pratt & Whitney announces $20M investment to increase GTF MRO capacity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410042907", "headline": "RTX : Satair extends parts distribution agreement with RTX's Collins Aerospace", "summary": "Satair extends parts distribution agreement with RTX's Collins Aerospace April 10, 2024 Share this article on Facebook ..."}, {"date": "20240410051441", "headline": "RTX's Pratt & Whitney to Invest $20 Million in West Palm Beach Engine Center", "summary": "By Chris Wack RTX said its Pratt & Whitney business is investing $20 million to increase the GTF maintenance, repair and overhaul capacity of its West Palm Beach, Fla., Engine Center. The..."}, {"date": "20240410065107", "headline": "RTX : Ascentia to receive significant upgrades", "summary": "RTX's Ascentia to receive significant upgrades Software to aggregate and analyze large data sets and provide information to operators April..."}, {"date": "20240410080000", "headline": "RTX provides Blue Canyon satellite to help solve a crucial climate challenge", "summary": "Blue Canyon Technologies, RTX's (NYSE: RTX) small satellite manufacturer and mission services provider, announced the successful launch and initial contact with the MethaneSAT satellite. MethaneSAT is the first satellite funded by a nonprofit organization to accelerate more effective efforts to reduce emissions of methane, a greenhouse pollutant responsible for about 30 percent of today's global warming."}, {"date": "20240410130826", "headline": "Raytheon: Tailwinds From A Defense Boom Will Converge Nicely With Economic Strength", "summary": "Discover why I believe Raytheon is an ideal investment option, offering stellar performance over the past six months. Read why I rate RTX stock as a Buy."}, {"date": "20240410235200", "headline": "China sanctions 2 US defense companies and says they support arms sales to Taiwan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410235200", "headline": "China sanctions 2 U.S. defense companies and says they support arms sales to Taiwan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411033124", "headline": "RTX's Pratt & Whitney Canada surpasses 25 million PT6A flying hours on Textron Aviation's Cessna Caravan", "summary": "LAKELAND - Pratt & Whitney Canada today celebrates a milestone achievement of the PT6A engine, surpassing 25 million flight hours and 40 years of powering the Cessna Caravan turboprop family for..."}, {"date": "20240411033124", "headline": "RTX's Pratt & Whitney announces GTF MRO capacity expansion at West Palm Beach facility", "summary": "CHICAGO - Pratt & Whitney, an RTX business, today announced a $20 million investment to increase the GTF maintenance, repair and overhaul capacity of its West Palm Beach Engine Center.The..."}, {"date": "20240411060909", "headline": "RTX : Fokker Services America and RTX's Collins Aerospace sign IDG repair capability agreement", "summary": "Fokker Services Americas-a subsidiary of Fokker Services Group and a global leader in aircraft maintenance, modifications, completions, and conversions-and Collins ..."}, {"date": "20240411064025", "headline": "RTX's Pratt & Whitney announces GTF MRO capacity expansion at West Palm Beach facility; Engine center's GTF capacity to increase 40% by 2025", "summary": "CHICAGO - Pratt & Whitney, an RTX business, today announced a $20 million investment to increase the GTF maintenance, repair and overhaul capacity of its West Palm Beach Engine Center. The..."}, {"date": "20240411064800", "headline": "RTX's Options Frenzy: What You Need to Know", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411065300", "headline": "Attractive call overwriting opportunities for Russell 1000 stocks - JPM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411074504", "headline": "Are You a Growth Investor? This 1 Stock Could Be the Perfect Pick", "summary": "Whether you're a value, growth, or momentum investor, finding strong stocks becomes easier with the Zacks Style Scores, a top feature of the Zacks Premium research service."}, {"date": "20240411111728", "headline": "GE Aerospace: The Pure Turbofan Powerhouse To Propel Your Aerospace Portfolio", "summary": "GE Aerospace is a pure aerospace and defense stock with a strong market share in commercial airplane engines. Find out why GE stock is a Buy."}, {"date": "20240411202100", "headline": "Noteworthy Friday Option Activity: RTX, HOOD, DE", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412010000", "headline": "Here It Is! My 20-Stock 6-Figure Market-Beating Dividend Portfolio", "summary": "In this article, I share my 20-stock dividend growth portfolio, which I haven't done for more than a year. Explore more details here."}, {"date": "20240412074010", "headline": "Why RTX (RTX) is a Top Value Stock for the Long-Term", "summary": "The Zacks Style Scores offers investors a way to easily find top-rated stocks based on their investing style. Here's why you should take advantage."}, {"date": "20240413220300", "headline": "Boeing weighs on large-cap industrials in turbulent week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414194500", "headline": "Remain cautious on defense stocks amid Iran escalation: Wells Fargo", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415024100", "headline": "Unusually active option classes on open April 15th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415040000", "headline": "Boeing: 3 Reasons For An Upgrade", "summary": "Boeing stock has underperformed, yet holds potential for improvement, with more realistic earnings estimates for '24 and '25. Learn why we rate BA stock a hold."}, {"date": "20240415061500", "headline": "Congress Members Invest In Defense Stocks As Middle East Tensions Mount: How Pelosi, Gottheimer, Hern And Others Could Benefit", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415082340", "headline": "3 Blue Chip Stocks For Your April 2024 Watchlist", "summary": "Blue Chip stocks to watch in the stock market today."}, {"date": "20240415095200", "headline": "Sharpen Your Defense: 3 Military Stocks Guarding Your Wealth", "summary": "With many if not most of the world’s countries afraid of their neighbors and several active military conflicts unfortunately occurring, it’s a good time to be a defense contractor. It is also a good time to invest in certain military stocks. There appears to be no end in sight to the was in the Ukraine. Furthermore, many European nations have been increasing their military spending in response to the conflict. In the Mideast, Israel is at war with two Iranian proxies, Hamas and Hezbollah. Now, i"}, {"date": "20240415103229", "headline": "How to manage a portfolio amid geopolitical tensions", "summary": "After Iran's weekend air attack against Israel, concerns about the potential impacts on the overall market have begun to rise. Mahoney Asset Management CEO Ken Mahoney joins Wealth! to discuss pricing geopolitical shocks into portfolios and market risks to watch. Mahoney offers suggestions as to how investors can hedge against exogenous foreign relations threats: \"One can use, a military defense company like RTX, Raytheon (RTX), is one of the symbols viewers can take a look at. Oil (BZ=F, CL=F), whether you buy a basket or individual stocks, like Exxon (XOM) or Chevron (CVX). There's definitely ways to go around as a hedge, not as, again, we really think technology and the big tech is still the way to go, the outsized earnings that they have, but if you want to say, hey, I want to hedge my portfolio a little bit, inverse ETFs maybe some oil, maybe some defense contractors or maybe selling off 20-25% put in cash, so we get that wish down.\" For more expert insight and the latest market action, click here to watch this full episode of Wealth! This post was written by Nicholas Jacobino"}, {"date": "20240415110750", "headline": "Sysco And Grainger Among 10 Companies To Announce Annual Dividend Increases In Second Half Of April", "summary": ""}, {"date": "20240415194500", "headline": "SA Roundtable: What's next for Boeing?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415195200", "headline": "SA Analyst Roundtable: What's next for Boeing?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416003300", "headline": "Defense spending and defense stocks: Why they don't always reflect each other", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416024100", "headline": "Unusually active option classes on open April 16th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416080044", "headline": "RTX (RTX) Earnings Expected to Grow: What to Know Ahead of Next Week's Release", "summary": "RTX (RTX) possesses the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240416080300", "headline": "Vinci reports 12% rise in first quarter airport passenger numbers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416125616", "headline": "Steady Income, Steady Growth: 7 Blue-Chip Dividend Stocks to Buy Now", "summary": "Blue-chip dividend stocks have always been relevant. While they’re not the most exciting investments, they provide a steady hand during market uncertainty. This attribute has just become even more critical. With an already tense situation in the geopolitical realm boiling over, investors will likely seek reassurances. It doesn’t get much better than established stalwarts that pay consistent and/or reliable passive income. On this note, below are top blue-chip dividend stocks to consider. RTX (RT"}, {"date": "20240417040000", "headline": "Zacks Investment Ideas feature highlights: Raytheon, Northrop Grumman, Gold ETF, Silver ETF and Russell 2000", "summary": "Raytheon, Northrop Grumman, Gold ETF, Silver ETF and Russell 2000 have been highlighted in this Investment Ideas article."}, {"date": "20240417075004", "headline": "Why RTX (RTX) is a Top Momentum Stock for the Long-Term", "summary": "The Zacks Style Scores offers investors a way to easily find top-rated stocks based on their investing style. Here's why you should take advantage."}, {"date": "20240417080001", "headline": "RTX Is Heading to a Healthy Correction After Outperforming the Competition", "summary": "Attractive management incentive plan and high growth are insufficient to justify out-of-hand valuation"}, {"date": "20240417110714", "headline": "RTX : Narita airport selects RTX to improve the travel experience for passengers", "summary": "Collins Aerospace, an RTX business, has been selected to deploy systems to improve the passenger experience through streamlined processing and self-service kiosks at NARITA INTERNATIONAL AIRPORT..."}, {"date": "20240417114614", "headline": "FIDU: Industrials Dashboard For April", "summary": "Industrials are the second most overpriced sector behind technology, but some subsectors are moderately overvalued. Read more on FIDU ETF here."}, {"date": "20240418000700", "headline": "RTX signs renewable electricity deal in Texas, its largest to date", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418014446", "headline": "RTX Signs Renewable Electricity Deal for 12 Texas Facilities", "summary": "By Sabela Ojea RTX said it has signed a deal with Engie North America to receive renewable electricity at 12 of its Texas facilities. The aerospace and defense company on Thursday said the..."}, {"date": "20240418035630", "headline": "RTX's Pratt & Whitney Canada marks 500th PT6 E-Series engine milestone and more than 200,000 hours of flight", "summary": "Friedrichshafen - Pratt & Whitney Canada announced today that the 500th PT6 E-Series engine has rolled off the production line at the company's PT6 Engine center of excellence located in Lethbridge,..."}, {"date": "20240418045000", "headline": "RTX Inks Largest Renewable Electricity Agreement: 'On Path To Achieve 2025 Goal'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418050000", "headline": "RTX signs its largest renewable electricity deal to date", "summary": "RTX (NYSE: RTX) announced an agreement with a subsidiary of ENGIE North America (ENGIE) that will provide 100% renewable electricity to 12 of the company's Texas facilities. The agreement with ENGIE Resources LLC, which runs through 2033, will begin with six RTX locations in Texas in 2024 and expand to 12 locations by 2028. The deal is RTX's largest renewable energy procurement to date, nearly doubling the company's usage of renewable electricity in 2023."}, {"date": "20240419005900", "headline": "RTX price target raised by $8 at RBC Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419062507", "headline": "RTX : This lab has the power to make electrified flight a reality", "summary": "This lab has the power to make electrified flight a reality The Grid, Collins Aerospace's first-of-its-kind facility, prepares to test new technologies ..."}, {"date": "20240421190900", "headline": "RTX Q1 results preview: GTF recall still weighs on investors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421191500", "headline": "RTX Q1 results preview: GTF engine recall still weighs on investors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421221700", "headline": "RTX awarded $212.51M Navy contract modification", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422000200", "headline": "Options Volatility and Implied Earnings Moves This Week, April 22 – April 26, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422055900", "headline": "Goldman’s debt issuers stocks basket", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422062700", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422062900", "headline": "Goldman’s buybacks basket: Buyback growth will be 13% in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422070000", "headline": "Equity Investing Is About The Way Things Are, Not The Way Things Should Be", "summary": "Rob Isbitts discusses navigating market risk with offense and defense. Building a 40-name portfolio and using options as a retail investor."}, {"date": "20240422215900", "headline": "RTX break ground on $115M expansion of Alabama missile integration facility", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000200", "headline": "Raytheon Technologies Non-GAAP EPS of $1.34 beats by $0.11, revenue of $19.3B beats by $900M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000200", "headline": "Earnings Scheduled For April 23, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000400", "headline": "RTX reports Q1 adjusted EPS $1.34, consensus $1.23", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000600", "headline": "Options Volatility and Implied Earnings Moves Today, April 23, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000600", "headline": "RTX backs FY24 adjusted EPS view $5.25-$5.40, consensus $5.39", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000900", "headline": "RTX Corporation Non-GAAP EPS of $1.34 beats by $0.11, revenue of $19.3B beats by $900M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423002100", "headline": "RTX in charts: Pratt & Whitney sales rise 23%; commercial aerospace backlog reaches $125B in Q1", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423010400", "headline": "RTX: Q1 Earnings Snapshot", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423011320", "headline": "RTX : Q1 2024 RTX Earnings Conference Call Presentation", "summary": "1Q 2024 Earnings Conference Call April 23, 2024 © 2024 RTX Corporation. All rights reserved. ..."}, {"date": "20240423012810", "headline": "RTX 1Q Profit Jumps as Sales Climb", "summary": "By Dean Seal RTX recorded higher sales and earnings for the first three months of the year and ended the quarter with a $202 billion backlog. The aerospace and defense company posted a..."}, {"date": "20240423023700", "headline": "Buy Rating Affirmed for Raytheon Technologies Amid Strong Financial Performance and Strategic Initiatives", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423031200", "headline": "JetBlue says 'moving quickly' to execute on standalone plan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423033000", "headline": "JetBlue says fleet moderization program is 'coming to fruition'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423041104", "headline": "RTX Corporation 2024 Q1 - Results - Earnings Call Presentation", "summary": "The following slide deck was published by RTX Corporation in conjunction with their 2024 Q1 earnings call."}, {"date": "20240423045500", "headline": "RTX Reports Q1 2024 Results", "summary": "RTX (NYSE: RTX) reported first quarter 2024 results."}, {"date": "20240423045500", "headline": "RTX profit jumps 20% on aviation strength, military demand", "summary": "Aerospace and defense major RTX on Tuesday reported a 20% jump in its first-quarter profit, helped by robust commercial aftermarket business and military equipment demand.  The Arlington, Virginia-based company reported net income of $1.71 billion, or $1.28 per share, for the quarter ended March 31, compared with $1.43 billion, or 97 cents per share, a year earlier.  The aftermarket business gained as airlines had to extend the service life of aircraft to keep up with the recovery in air travel amid the limited availability of new commercial planes."}, {"date": "20240423045937", "headline": "RTX beats estimates on military demand, aviation strength", "summary": "(Reuters) -Aerospace and defense major RTX on Tuesday beat first-quarter earnings estimates, helped by demand for missile defense systems and strength in the commercial aftermarket business.  The aftermarket business gained as airlines had to extend the service life of aircraft to keep up with the recovery in air travel amid the limited availability of new commercial planes.  Pratt and Whitney, a subsidiary of RTX, reported a sales rise of 23% amid the ongoing inspection drive to check for potentially flawed components in its geared turbofan (GTF) jet engines."}, {"date": "20240423050000", "headline": "RTX Stock Earnings: Raytheon Technologies Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423061144", "headline": "RTX Corp (RTX) Q1 2024 Earnings: Surpasses Analyst Revenue Forecasts with Strong Sales Growth", "summary": "Comprehensive Analysis of RTX's Financial Performance and Strategic Highlights"}, {"date": "20240423061727", "headline": "UPDATE 2-RTX beats estimates on military demand, aviation strength", "summary": "Aerospace and defense major RTX on Tuesday beat first-quarter earnings estimates, helped by demand for missile defense systems and strength in the commercial aftermarket business.  The aftermarket business gained as airlines had to extend the service life of aircraft to keep up with the recovery in air travel amid the limited availability of new commercial planes.  Pratt and Whitney, a subsidiary of RTX, reported a sales rise of 23% amid the ongoing inspection drive to check for potentially flawed components in its geared turbofan (GTF) jet engines."}, {"date": "20240423063009", "headline": "RTX Corporation (RTX) Q1 2024 Earnings Call Transcript", "summary": "RTX Corporation (NYSE:NYSE:RTX) Q1 2024 Earnings Call Transcript April 23, 2024 8:30 AM ETCompany ParticipantsGreg Hayes - Chairman and CEOChris Calio -..."}, {"date": "20240423065500", "headline": "RTX Soars Above Estimates in Q1, Reiterates FY24 Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423073029", "headline": "RTX (RTX) Reports Q1 Earnings: What Key Metrics Have to Say", "summary": "While the top- and bottom-line numbers for RTX (RTX) give a sense of how the business performed in the quarter ended March 2024, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values."}, {"date": "20240423073824", "headline": "RTX Earnings Buoyed by Aerospace Giant's Record Orders", "summary": "RTX's order backlog rose to a record $202 billion, as the aerospace and defense company booked European orders for missiles and air-defense systems, and airlines boosted purchases of spare parts.  RTX left its full-year financial guidance unchanged, as it digests the cost of problems with its GTF jetliner engines that have left hundreds of aircraft rounded.  Shares of RTX, previously known as Raytheon Technologies, edged lower in early trading to just under $101."}, {"date": "20240423080412", "headline": "Even With Big Gains, I'm Still Convinced RTX Is One Of The Best Dividend Stocks On The Market", "summary": "RTX Corp. has seen a big increase in its stock price and has become a core holding in family portfolios. Find out why RTX stock is a Strong Buy."}, {"date": "20240423120019", "headline": "RTX (RTX) Q1 2024 Earnings Call Transcript", "summary": "RTX earnings call for the period ending March 31, 2024."}, {"date": "20240423132852", "headline": "GE Aerospace: Shares Have Flown Too High (Rating Downgrade)", "summary": "GE Aerospace, a division of General Electric, specializes in aircraft engines and services. General Electric just reported Q1 earnings, click for my update."}, {"date": "20240423145700", "headline": "RTX breaks ground on $115 million expansion of Alabama missile integration facility", "summary": "Raytheon, an RTX (NYSE: RTX) business, recently broke ground on a $115 million, 26,000 square-foot expansion of its Redstone Raytheon Missile Integration Facility, which will increase the factory's space for integrating and delivering on critical defense programs by more than 50 percent."}, {"date": "20240423150637", "headline": "1 Wall Street Analyst Thinks RTX Stock Is Going to $96. Is It a Sell?", "summary": "There's uncertainty around the company's earnings potential from two key sources."}, {"date": "20240423190500", "headline": "RTX Corp (RTX) Q1 2024 Earnings Call Transcript Highlights: Strong Performance and Optimistic ...", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423204622", "headline": "Q1 2024 RTX Corp Earnings Call", "summary": "Q1 2024 RTX Corp Earnings Call"}, {"date": "20240423214800", "headline": "Peering Into RTX's Recent Short Interest", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423224300", "headline": "Analysts Have Conflicting Sentiments on These Industrial Goods Companies: Enovis (ENOV), Raytheon Technologies (RTX) and Axon Enterprise (AXON)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423234800", "headline": "Raytheon Technologies (RTX) Receives a Rating Update from a Top Analyst", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423234900", "headline": "RTX price target raised by $2 at UBS, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423235800", "headline": "RTX price target raised by $10 at BofA, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424000000", "headline": "RTX price target raised by $15 at Citi, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424004100", "headline": "RTX price target raised by $9 at Susquehanna, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424025600", "headline": "Balancing Act: Solid Revenue vs. Operational Challenges in Raytheon Technologies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424044000", "headline": "JetBlue beefs up in-flight entertainment, but investors are unimpressed", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424051443", "headline": "RTX Stock Price Has More Upside On Big Profit Boost Despite GTF Engine Crisis", "summary": "RTX Corporation beats expectations in Q1 with 12% sales growth and 10% rise in adjusted earnings. Check out my PT for RTX and why I rate the stock a Buy."}, {"date": "20240424055449", "headline": "RTX First Quarter 2024 Earnings: Beats Expectations", "summary": "RTX ( NYSE:RTX ) First Quarter 2024 Results Key Financial Results Revenue: US$19.3b (up 12% from 1Q 2023). Net income..."}, {"date": "20240424084353", "headline": "Raytheon Technologies Corporation (NYSE:RTX) Q1 2024 Earnings Call Transcript", "summary": "Raytheon Technologies Corporation (NYSE:RTX) Q1 2024 Earnings Call Transcript April 23, 2024 Raytheon Technologies Corporation misses on earnings expectations. Reported EPS is $ EPS, expectations were $1.23. Raytheon Technologies Corporation isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good day, […]"}, {"date": "20240424102914", "headline": "Biden is sending $61 billion to Ukraine. Much of it will pass through the US economy first.", "summary": "Washington is spending another $61 billion to help Ukraine. But most of the money will flow through the US economy first."}, {"date": "20240424193900", "headline": "See Which Of The Latest 13F Filers Holds RTX Corp", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424203500", "headline": "A Closer Look at RTX's Options Market Dynamics", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424232000", "headline": "RTX price target lowered by $1 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425010600", "headline": "RTX's Raytheon awarded $344M contract", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425024700", "headline": "RTX awarded $344M contract to modernize electronics unit for missile development program", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425040000", "headline": "Ukraine, Israel bill to bolster Lockheed, RTX profits", "summary": "Lockheed Martin Corp and RTX Corp, fresh off a surge of orders in response to Russian aggression against Ukraine and the war in Gaza, stand to profit from $95 billion of mostly new weapons funding as the increasingly drawn out conflicts renew demand for pricey equipment.  On Wednesday, President Joe Biden signed a hard-fought bill into law that provides billions of dollars of new U.S. aid to Ukraine for its war with Russia, including $61 billion for Ukraine and $26 billion for Israel.  \"There are now factories breaking ground around the country,\" because of the new funding and several recent \"supplemental\" funding rounds, said the Pentagon's acquisitions chief Bill LaPlante on Wednesday."}, {"date": "20240425055610", "headline": "RTX Corporation Just Recorded A 38% EPS Beat: Here's What Analysts Are Forecasting Next", "summary": "RTX Corporation ( NYSE:RTX ) just released its quarterly report and things are looking bullish. The company beat..."}, {"date": "20240425060000", "headline": "RTX awarded $344 million contract to modernize electronics unit for missile development program", "summary": "Raytheon, an RTX (NYSE: RTX) business, has been awarded a $344 million contract for the development of two missile variants – the SM-2 Block IIICU and SM-6 Block IU – which will be based on a common guidance section, where the electronics and software that guide a missile to its target are housed."}, {"date": "20240425190300", "headline": "30 out of 34 industrial stocks post EPS wins, while half of them beat revenue estimates - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425190300", "headline": "Balancing Act: Hold Rating on Raytheon Technologies Amid Strong Backlog and Divisional Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425230139", "headline": "Decoding RTX Corp (RTX): A Strategic SWOT Insight", "summary": "Insightful Analysis of RTX Corp's Financial Health and Strategic Position"}, {"date": "20240425233956", "headline": "Raytheon: Customers Out Of Money, Company Selling Weapons For Wars Past", "summary": "Raytheon's stock struggles despite Ukraine's war, as its signature weapons may not be suitable for modern needs, impacting growth prospects. Read more here."}, {"date": "20240426013116", "headline": "RTX recognized for industry leading innovation in patented technology", "summary": "ARLINGTON - RTX received recognition from three separate organizations for innovation in patented technology.The Harrity Patent Analytics Patent 300 List, The European Patent Office Patent Index,..."}, {"date": "20240426053000", "headline": "Roundtable Discussion On Gold, Tech, Bitcoin, Country ETFs And Ignored Stocks", "summary": "Rob Isbitts joins analysts Amrita Roy, Uttam Dey, Emma Johnston, aka The Country Investor, and Mike Kehoe, The Undercover Investor to discuss current market trends and portfolio advice."}, {"date": "20240426073514", "headline": "RTX : Collins Aerospace celebrates groundbreaking of new solar farm at Rockford campus", "summary": "RTX's Collins Aerospace celebrates groundbreaking of new solar farm at Rockford campus New installation will help supply roughly 10 percent of Rockford plant's..."}, {"date": "20240426103449", "headline": "3 Overvalued Defense Stocks to Sell Before the 2024 Election", "summary": "There’s a general understanding among most financial analysts that defense companies provide significant portfolio stability during recessions. Indeed, these companies, especially defense companies with no commercial exposure, dip directly into the coffers of their countries’ governments. Thus, they are less subject to rising inflation costs and falling consumer spending. However, these bullish perceptions evaporate with significant changes in government, leading to overvalued defense stocks to"}, {"date": "20240427040900", "headline": "U.S. to rush Patriot missiles to Ukraine as part of $6B aid package", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240427064200", "headline": "RTX: Surging OE Offsets Continuing Aftermarket Normalization", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428030000", "headline": "How Stock Markets Will Likely React After FOMC Announcement", "summary": "Investors should pay attention to inflation rates, employment strength, & consumer spending trends. Know more about upcoming Fed meeting and its impact on stock market."}, {"date": "20240428080000", "headline": "Ukraine Aid Lifts Defense Industry as Debate Over Profits Reignites", "summary": "A long-delayed $95 billion package supports shells, missiles and drones for three countries, boosting defense companies, as scrutiny grows on share buybacks."}, {"date": "20240428142929", "headline": "14 Strongest Military Forces in the Middle East", "summary": "In this article, we list and discuss the 14 Strongest Military Forces In The Middle East. If you would like to skip our detailed discussion of the use of drones in modern-day warfare in the Middle East, you can go directly to the top 5 Strongest Military Forces In The Middle East. The Middle East, […]"}, {"date": "20240429023145", "headline": "Apple, Cardinal Health Among 12 Companies To Announce Dividend Increases In First Half Of May", "summary": "Eleven long-term dividend growth companies announced their annual dividend increases in the second half of April. Read more to see a full review."}, {"date": "20240429044911", "headline": "RTX's Collins Aerospace celebrates groundbreaking of new solar farm at Rockford campus", "summary": "ROCKFORD - Collins Aerospace, an RTX business, today celebrated the groundbreaking of a new 6.5-acre solar farm at its Electric Power Systems facility in Rockford, Illinois.The farm will be owned..."}, {"date": "20240429045145", "headline": "RTX's Collins Aerospace celebrates groundbreaking of new solar farm at Rockford campus; New installation will help supply roughly 10 percent of Rockford plant's electricity needs annually", "summary": "ROCKFORD, Ill. - Collins Aerospace, an RTX business, today celebrated the groundbreaking of a new 6.5-acre solar farm at its Electric Power Systems facility in Rockford, Illinois. The farm will be..."}, {"date": "20240429050800", "headline": "RTX Unusual Options Activity For April 29", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429052551", "headline": "RTX Corporation: A Solid Investment But Looking More Expensive These Days", "summary": "RTX Corporation's valuation is near the upper bounds of its historical fair value range, making it easier to let shares go for now. Read more on RTX stock here."}, {"date": "20240429080000", "headline": "RTX's Raytheon awards contract to Spain's Sener for missile production support", "summary": "Raytheon, an RTX business (NYSE: RTX), has awarded Spanish supplier, Sener, a contract to develop and produce the electro-mechanical control section of the Patriot® GEM-T missile. Sener will directly contribute to missile production in Europe in support of the recently awarded GEM-T contract by the NATO Support and Procurement Agency (NSPA) for a quantity of up to 1,000 missiles for a coalition of nations, including Germany, the Netherlands, Romania and Spain."}, {"date": "20240429221400", "headline": "RTX price target raised by $10 at Barclays, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429224200", "headline": "Analysts Have Conflicting Sentiments on These Industrial Goods Companies: Heartland Express (HTLD) and Raytheon Technologies (RTX)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430044710", "headline": "RTX's Raytheon awards contract to Spain's Sener for missile production support; Spanish partner to contribute to European GEM-T missile development and production", "summary": "TUCSON, Ariz., - Raytheon, an RTX business , has awarded Spanish supplier, Sener, a contract to develop and produce the electro-mechanical control section of the Patriot GEM-T missile.Sener will..."}, {"date": "20240430044710", "headline": "RTX's Pratt & Whitney awarded $65.8 million F100 engine maintenance contract for Saudi Arabia's F-15s", "summary": "EAST HARTFORD, Conn., - Pratt & Whitney, an RTX business, has been awarded an F100 engine contract for a material management program by Saudi Arabia's Middle East Propulsion Company , the prime..."}, {"date": "20240430060919", "headline": "The meaning of mentorship: A look at RTX’s employee resource group for the armed services community", "summary": "The meaning of mentorship: A look at RTX's employee resource group for the armed services community April 30, 2024 Share this..."}, {"date": "20240430060919", "headline": "Leading beyond limits: A look at RTX’s Asian Pacific Islander employee resource group", "summary": "Leading beyond limits: A look at RTX's Asian Pacific Islander employee resource group April 30, 2024 Share this article on..."}, {"date": "20240430064723", "headline": "1 Wall Street Analyst Says RTX Stock Has 18% Upside", "summary": "Given its 50% stock price appreciation since hitting a 52-week low, is RTX stock still a buy?"}, {"date": "20240501030000", "headline": "Non-Farm Payrolls Preview For April 2024: 3 Major Considerations", "summary": "April 2024 jobs report expected to show an increase of 250,000 jobs, indicating continued tightness in the labor market. Check out 3 major things to consider."}, {"date": "20240501053700", "headline": "Is RTX Corporation Stock Going to $119? 1 Wall Street Analyst Thinks So.", "summary": "Sure, RTX stock has potential -- but its shares already look expensive."}, {"date": "20240501063300", "headline": "U.S., Saudi Arabia are said to be close to signing defense treaty", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501070000", "headline": "RTX's Pratt & Whitney Canada and Angola's TAAG Airlines sign Fleet Management™ Program agreement for PW150A engines", "summary": "Pratt & Whitney Canada and TAAG Angola Airlines E.P., Angola's state-owned airline, have signed a six-year Fleet Management™ Program (FMP) agreement. The engine maintenance services cover the airline's PW150A engines which power their fleet of Dash 8-400 regional turboprops. The agreement allows Pratt & Whitney to tailor coverage to meet the airline's operating environment. Pratt & Whitney is an RTX business."}, {"date": "20240502071910", "headline": "RTX : new CEO, Chris Calio, reflects on ‘remarkable opportunity ahead’", "summary": "RTX's new CEO, Chris Calio, reflects on 'remarkable opportunity ahead' May 02, 2024 Share this article on Facebook ..."}, {"date": "20240502141500", "headline": "RTX Board of Directors Increases Quarterly Cash Dividend", "summary": "RTX (NYSE: RTX) announced today that its Board of Directors declared a dividend of 63 cents per outstanding share of RTX common stock, which represents an increase of 6.8 percent over the prior quarter's dividend amount. The dividend will be payable on June 13, 2024 to shareowners of record at the close of business on May 17, 2024."}, {"date": "20240502195200", "headline": "Raytheon Technologies raises dividend by 6.8% to $0.63", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502231500", "headline": "Boeing faces parts related issue due to Russia sanctions, WSJ reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503033000", "headline": "Boeing’s Latest Trouble Is a Jet Part Caught Up in Russia Sanctions", "summary": "The plane maker can’t deliver enough 787 Dreamliners after sanctions disrupted production of heat exchangers."}, {"date": "20240503064300", "headline": "5 Expected Dividend Increases In May 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503075011", "headline": "Here's Why RTX (RTX) is a Strong Momentum Stock", "summary": "The Zacks Style Scores offers investors a way to easily find top-rated stocks based on their investing style. Here's why you should take advantage."}, {"date": "20240503083300", "headline": "RTX's new generation of commercial satellite imagers launches with Maxar's WorldView Legion", "summary": "Two next-generation imaging instruments designed by Raytheon, an RTX (NYSE: RTX) business, launched yesterday as part of Maxar's WorldView Legion satellites. These are the first two of six planned WorldView Legion satellites, which will provide a significant leap forward in Earth observation capabilities, offering improved surveillance and monitoring for a wide range of applications."}, {"date": "20240503193000", "headline": "RTX Dividend Increase", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}]}