{"news": [{"date": "20240216030700", "headline": "Denali slips as Sanofi fails in mid-stage trial for ALS therapy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240216061300", "headline": "ALS drug from Denali, Sanofi falls short in mid-stage study", "summary": "The disclosure the experimental therapy missed its trial goal comes after Sanofi had earmarked the drug for advancement into Phase 3."}, {"date": "20240216061500", "headline": "2 Healthcare Stocks You Can Buy and Hold for the Next Decade", "summary": "Don't count these companies out too soon."}, {"date": "20240216073954", "headline": "UPDATE 2-Denali-Sanofi's ALS drug fails to meet mid-stage trial goal", "summary": "Drug developer Denali Therapeutics said on Friday its and partner Sanofi's experimental drug for a fatal neurodegenerative disease failed to slow decline of motor function in a mid-stage study.  Shares of Denali were down nearly 8% in morning trading.  This marks the latest setback in the long list of roadblocks in the path to develop effective treatments against amyotrophic lateral sclerosis (ALS), a condition which affects 16,000 to 32,000 people in the United States, and almost completely paralyzed late British physicist Stephen Hawking."}, {"date": "20240218064000", "headline": "Cruising For A Bruising", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240219114450", "headline": "Sanofi CEO: AI promises a great era of drug discovery that could fundamentally change medicine–but only if we allow it to deliver", "summary": "'There is reason to believe that through AI, we are on the cusp of a great era of discovery that could fundamentally change the field of medicine.'"}, {"date": "20240219213400", "headline": "What You Missed On Wall Street On Tuesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240220015600", "headline": "Denali continues decline after Sanofi ALS study failure", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240220020000", "headline": "Denali Therapeutics ALS study failue 'clearing event,' says B. Riley", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240220022800", "headline": "Sanofi consumer health unit seeing intertest ahead of split, Bloomberg says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240220023000", "headline": "Teva Presents New Data Supporting Safety, Tolerability and Target Engagement of Anti-TL1A (TEV-‘574) Antibody at the 2024 ECCO Annual Meeting", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240220033000", "headline": "Sanofi gains amid report of PE intersest in $20B consumer health unit", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240220033700", "headline": "Sanofi gains amid report of PE interest in $20B consumer health unit", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240220061700", "headline": "FDA puts hold on Rapt trials of drug for eczema, asthma", "summary": "Rapt reported one case of liver failure in a study participant who received the biotech’s drug, which is seen by analysts as a possible competitor to Dupixent."}, {"date": "20240220085652", "headline": "Advent, Blackstone Among Firms Circling $20 Billion Sanofi Arm", "summary": "(Bloomberg) -- Some of the world’s largest buyout firms, including Advent International and Blackstone Group Inc., are circling the consumer health division of French pharmaceutical giant Sanofi ahead of a potential separation of the business, according to people familiar with the matter. Most Read from BloombergLargest Covid Vaccine Study Yet Finds Links to Health ConditionsCapital One to Buy Discover for $35 Billion in Year's Biggest Deal Amazon Deserves to Be Called Out for Swindling UsersYou"}, {"date": "20240220102858", "headline": "Sanofi's consumer healthcare spin-off attracts private equity interest, sources say", "summary": "Drugmaker Sanofi's consumer healthcare division has attracted interest from private equity funds as the French group prepares to spin out the business, two sources close to the matter told Reuters.  Buyout groups including Blackstone and CVC are considering making offers for the division, the sources said, speaking on condition of anonymity.  The news comes months after Sanofi announced it was reviewing \"separation scenarios\" for the unit in a bid to focus on its core innovative drugs business."}, {"date": "20240220164100", "headline": "Sanofi: Information concerning the total number of voting rights and shares - January 2024", "summary": "Information concerning the total number of voting rights and shares, provided pursuant to article L. 233-8 II of the Code de commerce (the French Commercial Code) and article 223-16 of the Règlement général de l’Autorité des Marchés Financiers (Regulation of the French stock market authority) Sanofia French société anonyme with a registered share capital of 2,529,599,938 €Registered office : 46, avenue de la Grande Armée - 75017 Paris - FranceRegistered at the Paris Commercial and Companies Regi"}, {"date": "20240220213400", "headline": "What You Missed On Wall Street On Wednesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240220232000", "headline": "Sanofi's RSV shot had a bumpy rollout, more popular than expected, WSJ says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240221001400", "headline": "Regeneron, Vertex Pharma join $100B club in biotech", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240221005000", "headline": "Wall Street Breakfast: The AI Trade", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240221043000", "headline": "This RSV Shot Keeps Babies Out of the Hospital. But Parents Can’t Find It.", "summary": "A new antibody that protects babies from a deadly virus proved far more popular than drugmaker Sanofi expected."}, {"date": "20240221231400", "headline": "Move Over Magnificent 7, Say Hello to the GRANOLAS", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240222120200", "headline": "Press Release: Sanofi’s Board of Directors proposes the appointment of Clotilde Delbos, Anne-Françoise Nesmes and John Sundy as independent Directors", "summary": "Sanofi’s Board of Directors proposes the appointment of Clotilde Delbos, Anne-Françoise Nesmes and John Sundy as independent Directors Paris, February 22, 2024. At its meeting on February 22, 2024, Sanofi’s Board of Directors has decided to propose, on the occasion of its next General Shareholder Meeting to be held on April 30, 2024, the renewal of the terms of office of Rachel Duan and Lise Kingo and the appointment of Clotilde Delbos, Anne-Françoise Nesmes and John Sundy as independent Directo"}, {"date": "20240222143800", "headline": "Top Analyst Reports for Microsoft, Amazon.com & Berkshire Hathaway", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Microsoft Corporation (MSFT), Amazon.com, Inc. (AMZN) and Berkshire Hathaway Inc. (BRK.B)."}, {"date": "20240222150124", "headline": "Novo Nordisk: SOTP After Impressive FY23 And Weight Loss Going Mainstream, Maintain Buy", "summary": "A positive outlook for Novo Nordisk's FY24 as we highlight key achievements, progress in CagriSema, expansion into cardiovascular disease, and maintain our..."}, {"date": "20240222213700", "headline": "Regeneron and Sanofi's Dupixent gets US FDA priority review approval", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240222221700", "headline": "Regeneron, Sanofi announce FDA acceptance for priority review of Dupixent sBLA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240222222401", "headline": "Q4 2023 Kymera Therapeutics Inc Earnings Call", "summary": "Q4 2023 Kymera Therapeutics Inc Earnings Call"}, {"date": "20240222224400", "headline": "Sanofi Proposes Appointment of New Independent Directors", "summary": "By Nina Kienle Sanofi said it would propose the appointment of new independent directors, as Diane Souza, and Thomas Suedhof intend to leave at the end of..."}, {"date": "20240222224600", "headline": "Sanofi, Regeneron win FDA priority review for Dupixent label expansion", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240222232000", "headline": "IN BRIEF: Sanofi appoints Smith & Nephew CFO Nesmes to board", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240223000000", "headline": "Press Release: Dupixent® sBLA accepted for FDA Priority Review for treatment of COPD with type 2 inflammation", "summary": "Dupixent® sBLA accepted for FDA Priority Review for treatment of COPD with type 2 inflammation Priority Review granted based on positive results from two Phase 3 trialsIf approved, Dupixent would be the only biologic therapy for COPD and the first new treatment approach for the disease in more than a decadeRegulatory submissions are also under review in China and Europe Paris and Tarrytown, N.Y. February 23, 2024. The U.S. Food and Drug Administration (FDA) has accepted for Priority Review the s"}, {"date": "20240223044317", "headline": "20 Fastest Growing Biotech Companies in the US", "summary": "In this article, we will be taking a look at the 20 fastest growing biotech companies in the US. If you are not interested in learning about the landscape of biotech companies, head straight to the 5 Fastest Growing Biotech Companies In The US. The biotechnology sector in the United States is witnessing a surge […]"}, {"date": "20240223105945", "headline": "Kymera Therapeutics, Inc. (NASDAQ:KYMR) Q4 2023 Earnings Call Transcript", "summary": "Kymera Therapeutics, Inc. (NASDAQ:KYMR) Q4 2023 Earnings Call Transcript February 22, 2024 Kymera Therapeutics, Inc. beats earnings expectations. Reported EPS is $-0.25, expectations were $-0.44. KYMR isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning, and welcome to the […]"}, {"date": "20240223114500", "headline": "Press Release: Filing of the 2023 U.S. Form 20-F and French “Document d’Enregistrement Universel” containing the Annual Financial Report", "summary": "Filing of the 2023 U.S. Form 20-F and French “Document d’Enregistrement Universel” containing the Annual Financial Report Paris, February 23, 2024. Sanofi announces today the filing of its Form 20-F with the U.S. Securities and Exchange Commission (SEC) and its “Document d’Enregistrement Universel” containing its Annual Financial Report with the French market regulator Autorité des marchés financiers (AMF). These documents are available on the company’s website: https://www.sanofi.com/en/investo"}, {"date": "20240224085100", "headline": "Press Release: Phase 2 results demonstrate rilzabrutinib rapidly reduced itch severity and significantly improved disease activity in adults with chronic spontaneous urticaria", "summary": "Phase 2 results demonstrate rilzabrutinib rapidly reduced itch severity and significantly improved disease activity in adults with chronic spontaneous urticaria Late-breaking data at 2024 AAAAI showed rilzabrutinib, an oral BTK inhibitor, significantly reduced weekly itch severity score (ISS7) as early as the first week of treatment in adults with moderate to severe CSUData form the basis for the Phase 3 CSU and prurigo nodularis programs to start in 2024Pivotal Phase 3 readout in immune thrombo"}, {"date": "20240224202400", "headline": "Sanofi reports 'positive' results from Phase 2 RILECSU study", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240225144841", "headline": "Exscientia: A Strategic Hold In The AI-Driven Drug Discovery Sector (Rating Downgrade)", "summary": "Exscientia's Sanofi collaboration could potentially bring in $45M upfront and $300M in milestones and royalties. Read why my recommendation shifts to Hold for EXAI."}, {"date": "20240227055325", "headline": "Denali, fresh off study setback, gets $500M lift", "summary": "The infusion from unnamed private investors will bolster the company’s balance sheet days after a Sanofi-partnered ALS drug stumbled in a clinical trial."}, {"date": "20240227064700", "headline": "‘Tripledemic’ burden lower this winter despite COVID impact: Airfinity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240227165157", "headline": "3 Cash Cow Dividend Stocks for Outsized Income & Upside", "summary": "Following another shaky day in the market, investors may want to consider cash cow dividend stocks. They’re not sexy and they probably won’t make you rich. However, they get the job done when faced with challenging circumstances. For football fans, cash cow dividend stocks symbolize the jumbo package of Wall Street. Basically, you grab your biggest, meanest players – Samuel L. Jackson’s favorite word applies here – to drive the ball for that extra yard or two that you need. Just like in the inve"}, {"date": "20240227194600", "headline": "11 'Granolas' Stocks Outperform Magnificent 7 With Lower Volatility, Higher Yields", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240228004000", "headline": "Inhibrx just downgraded at Jefferies, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240228070800", "headline": "Denali's (DNLI) Q4 Earnings Miss, Pipeline in Focus, Stock Up", "summary": "Denali (DNLI) reports lower than expected fourth-quarter financial results. The stock, however, rises 38% on news of funding raised by the company, which is expected to strengthen its cash position."}, {"date": "20240229023300", "headline": "‘GRANOLAS’ vs. the Magnificent Seven: Which should you dig into now?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240229040548", "headline": "Amicus Therapeutics: Expect Improved Commercial Momentum In 2024", "summary": ""}, {"date": "20240229075000", "headline": "Pharma Stock Roundup: FDA Priority Tag to SNY, ABBV Filings, CHMP Nod for AZN, JNJ, MRK", "summary": "The FDA grants priority review status to Sanofi's (SNY) and AbbVie's (ABBV) sBLAs for Dupixent and Epkinly, respectively"}, {"date": "20240303211200", "headline": "Biotechs on the Rise: 3 Stocks to Buy for a Shot of Profits", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240304014900", "headline": "Sanofi price target lowered by EUR 6 at Guggenheim, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240304100509", "headline": "Sanofi (SNY) TD Cowen 44th Annual Health Care Conference (Transcript)", "summary": "Sanofi (NASDAQ:NASDAQ:SNY) TD Cowen 44th Annual Health Care Conference March 4, 2024 12:50 PM ETCompany ParticipantsNaimish Patel - Global Head of..."}, {"date": "20240305015655", "headline": "13 Best Pharma Dividend Stocks To Buy in 2024", "summary": "In this article, we discuss 13 best pharma dividend stocks to buy in 2024. You can skip our detailed analysis of the pharma sector and its performance, and go directly to read 5 Best Pharma Dividend Stocks To Buy in 2024. Within the healthcare industry in the US, the pharmaceutical sector has experienced significant transformations […]"}, {"date": "20240305045700", "headline": "European stocks with a “sustainable yield” - JPM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240305061400", "headline": "How the Medical Industry Could Produce the Biggest AI Stock Winners", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240305072808", "headline": "Apogee Therapeutics' Innovative Leap In Atopic Dermatitis Management", "summary": "Apogee Therapeutics reported Q4 earnings and provided pipeline updates today, inspiring a 30%-plus rally in its stock. Check out why I rate APGE stock as a Buy."}, {"date": "20240306101340", "headline": "Apogee Therapeutics: Success In Phase 1 Bodes Well For Continued APG777 Advancement", "summary": "Apogee Therapeutics, Inc. positive results from phase 1 study of APG777 for Atopic Dermatitis, Phase 2 study coming in 2024 and 2025. Click for my APGE update."}, {"date": "20240307063700", "headline": "FDA experts recommend changes to flu shots", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240307131555", "headline": "UPDATE 1-Astra-Sanofi's RSV therapy 'highly effective' against infant hospitalizations, CDC study shows", "summary": "AstraZeneca and Sanofi's antibody therapy was 90% effective in protecting infants from hospitalizations associated with respiratory syncytial virus (RSV), a U.S. Centers of Disease Control and Prevention study showed.  Early real-world data from the agency's surveillance network showed the therapy nirsevimab's effectiveness in protecting infants against RSV-related hospitalization in their first season of potential exposure to the virus."}, {"date": "20240307190000", "headline": "Astra, Sanofi's antibody 90% effective against RSV in infants - CDC", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240308032600", "headline": "Teva upgraded at J.P. Morgan on upcoming catalysts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240308041900", "headline": "(SNY) - Analyzing Sanofi's Short Interest", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240310233000", "headline": "Sanofi reports 'positive' results from Part 2 of STREAM-AD study", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240311000000", "headline": "Press Release: New Phase 2b results for amlitelimab support potential for best-in-class maintenance of response in atopic dermatitis", "summary": "New Phase 2b results for amlitelimab support potential for best-in-class maintenance of response in atopic dermatitis Late-breaking data at AAD show sustained off-drug improvements of AD signs and symptoms with amlitelimab for 28 weeks The safety profile for patients dosed to 52 weeks was consistent with amlitelimab 24 weeks data showing it to be well-tolerated with no new safety concerns identifiedDurability of response supports quarterly dosing currently being investigated in Phase 3 pivotal p"}, {"date": "20240311005700", "headline": "Regeneron's Praluent injection gets FDA approval to treat kids with genetic form of high cholesterol", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240311022237", "headline": "International Wide-Moat Stocks On Sale - The March 2024 Heat Map", "summary": "We share the heat map of the most investable candidates that may be worth your time for further analysis. Check out the March 2024 Heat Map."}, {"date": "20240312075800", "headline": "ASLAN (ASLN) Up 161% on Upbeat Initial Data From Eczema Study", "summary": "ASLAN (ASLN) rises on upbeat initial data from a phase II study of eblasakimab in patients with eczema, who have previously been treated with Dupixent but did not achieve an adequate response."}, {"date": "20240312082905", "headline": "Sanofi (SNY) Leerink Partners Global Biopharma Conference (Transcript)", "summary": "Sanofi (NASDAQ:NASDAQ:SNY) Leerink Partners Global Biopharma Conference March 12, 2024 10:40 AM ETCompany ParticipantsNaimish Patel - Global Head of..."}, {"date": "20240312195600", "headline": "Passport to Profits: 7 Global Growth Gems to Diversify Your Holdings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313021900", "headline": "GLOBAL BROKER RATINGS: Nordisk, Novartis and Astra cut to 'neutral'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313040100", "headline": "European Stocks: Unnoticed Records, Overlooked Opportunities", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240313042519", "headline": "Sanofi (SNY) Barclays 26th Annual Global Healthcare Conference (Transcript)", "summary": "Sanofi (NASDAQ:NASDAQ:SNY) Barclays 26th Annual Global Healthcare Conference March 13, 2024 8:00 AM ETCompany ParticipantsNaimish Patel - Global Head of..."}, {"date": "20240313213400", "headline": "To the Moon and Beyond: 7 Stocks With Cosmic Potential", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314022800", "headline": "Stifel gets more bullish on Sanofi, upgrades shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314031700", "headline": "GLOBAL BROKER RATINGS: Kepler raises Diageo, Stifel lifts Sanofi", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240314073812", "headline": "12 Most Profitable Biotech Stocks To Invest In", "summary": "In this piece, we will take a look at the 12 most profitable biotech stocks to invest in. If you want to skip our overview of the global biotechnology industry and the latest trends, then you can take a look at the 5 Most Profitable Biotech Stocks To Invest In. Biotechnology is the riskiest and […]"}, {"date": "20240315060900", "headline": "Sanofi unit attracts PE firms seeking €7.5B leveraged financing: Bloomberg", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240315080039", "headline": "PE Firms Eye €7.5 Billion Leveraged Financing for Sanofi Unit", "summary": "(Bloomberg) -- Potential bidders for Sanofi’s consumer health division are mulling debt packages of about €7.5 billion ($8.16 billion), according to people familiar with the matter, which would make it one of the biggest leveraged buyout financings in recent years.Most Read from BloombergA $2 Billion Airport Will Test Modi’s Mission, Adani’s AmbitionsBitcoin Extends Retreat From Record as ‘Bubble’ Talk EscalatesApple Buys Canadian AI Startup as It Races to Add FeaturesMillennium Trader Scored $4"}, {"date": "20240315130400", "headline": "Sanofi: Information concerning the total number of voting rights and shares - February 2024", "summary": "Information concerning the total number of voting rights and shares, provided pursuant to article L. 233-8 II of the Code de commerce (the French Commercial Code) and article 223-16 of the Règlement général de l’Autorité des Marchés Financiers (Regulation of the French stock market authority) Sanofia French société anonyme with a registered share capital of 2,529,599,938 €Registered office : 46, avenue de la Grande Armée - 75017 Paris - FranceRegistered at the Paris Commercial and Companies Regi"}, {"date": "20240318052100", "headline": "AstraZeneca to cap costs of inhalers at $35 per month", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240319063700", "headline": "Sanofi’s Buy Rating Affirmed by Analyst on Strong Clinical Trials and Market Opportunities", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240319195800", "headline": "Sanofi’s Amlitelimab Shows Lasting Benefits", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240321050001", "headline": "Mirador Therapeutics raises over $400 mln in early funding rounds", "summary": "Mirador Therapeutics said on Thursday it had secured more than $400 million to develop precision medicines for immune-related diseases, in a rare, large early-stage fundraise.  Easing inflationary pressures, increasing bets of a soft landing and promising data from drug trials are starting to boost the biotech funding market, which saw a downturn last year along with other industries.  \"This is one of the largest series A rounds, probably in history, certainly this year,\" Mirador CEO and founder Mark McKenna said, without disclosing the valuation at which the funds were raised or the breakdown of the amounts raised in the latest two rounds."}, {"date": "20240322003000", "headline": "Press Release: Availability of the Q1 2024 Memorandum for modelling purposes", "summary": "Availability of the Q1 2024 Memorandum for modelling purposes Paris, France – March 22, 2024. Sanofi announced today that its Q1 2024 Memorandum for modelling purposes is available on the \"Investors\" page of the company's website: First quarter 2024 results (sanofi.com) As for each quarter, Sanofi prepared this document to assist in the financial modelling of the Group's quarterly results. This document includes a reminder on various non-comparable items and exclusivity losses as well as the for"}, {"date": "20240322093337", "headline": "Innate Pharma S.A. (NASDAQ:IPHA) Q4 2023 Earnings Call Transcript", "summary": "Innate Pharma S.A. (NASDAQ:IPHA) Q4 2023 Earnings Call Transcript March 21, 2024 Innate Pharma S.A. isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: At this time, I would like to welcome everyone to the Innate Pharma Full Year 2023 Financial […]"}, {"date": "20240324064400", "headline": "Look beyond the Magnificent 7 to the GRANOLAS - Goldman", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240324200751", "headline": "Sanofi: My Top Pick In Big Pharma", "summary": "Sanofi has a stable dividend proposition and a strong balance sheet. Click here to read why SNY stock is my favorite Big Pharma pick."}, {"date": "20240325035100", "headline": "First Week of September 20th Options Trading For Sanofi (SNY)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240325074700", "headline": "Wall Street Lunch: Calhoun To Leave Boeing", "summary": "Boeing's top boss Dave Calhoun plans to step down at the end of the year. Mizuho turns cautious on EV sector, downgrades Tesla, Rivian, and Nio."}, {"date": "20240325202100", "headline": "Krispy Kreme-McDonald's Deal Spikes Insulin Stock Interest: 'We're About To Cash In On The Aftermath'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240326031027", "headline": "32 Countries with the Highest Rates of Diabetes", "summary": "In this article, we will be taking a look at the 32 countries with the highest rates of diabetes. If you do not want to learn about the global diabetes market, head straight to the 5 Countries with the Highest Rates of Diabetes. The Global Diabetes Market and Its Implications The global diabetes market is […]"}, {"date": "20240326220200", "headline": "LONDON BRIEFING: Diploma makes buy; Astra wins Japan drug approvals", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240326230300", "headline": "LONDON MARKET OPEN: FTSE 100 slips as unease lingers before US data", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240326231600", "headline": "Annexon price target raised by $1 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240326231900", "headline": "AstraZeneca treatments become \"first and only\" to be approved in Japan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240326232600", "headline": "AstraZeneca, Sanofi announce Beyfortus approved in Japan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240326233700", "headline": "Dr. Reddy's enters partnership with Sanofi to distribute vaccines in India", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240327000700", "headline": "Japan approves AstraZeneca-Sanofi drug for prevention of RSV disease in infants", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240327020200", "headline": "LONDON MARKET MIDDAY: FTSE 100 underperforms ahead of US PCE data", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240327033300", "headline": "First Week of May 17th Options Trading For Sanofi (SNY)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240327044800", "headline": "How Is The Market Feeling About Sanofi?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240327233700", "headline": "Smith & Nephew CFO designate John Rogers to start next week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328093045", "headline": "Why Is Denali Therapeutics (DNLI) Up 2.8% Since Last Earnings Report?", "summary": "Denali Therapeutics (DNLI) reported earnings 30 days ago. What's next for the stock? We take a look at earnings estimates for some clues."}, {"date": "20240330035600", "headline": "U.S. CDC warns bacteria causing meningitis are on the rise", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240331023700", "headline": "Sanofi and Regeneron’s Dupixent set for large gains with likely COPD approval", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402215800", "headline": "Sanofi to resolve roughly 5,000 Zantac lawsuits in U.S., Bloomberg says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402224700", "headline": "Sanofi agrees to settle ~4K Zantac cancer lawsuits in all U.S. states except Delaware", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403154050", "headline": "UPDATE 1-Sanofi to settle 4,000 Zantac cancer lawsuits in US state courts", "summary": "Sanofi  has reached an agreement in principle to settle 4,000 lawsuits linking the discontinued heartburn drug Zantac to cancer, the company said on Wednesday.  Sanofi did not disclose financial terms of the deal.  Sanofi did not admit any liability in the settlement, and said it is settling to avoid the expense and ongoing distraction of the litigation."}, {"date": "20240403170200", "headline": "Sanofi to Settle Claims That Heartburn Drug Zantac Caused Cancer", "summary": "The French healthcare company said the deal would require the consent of individual plaintiffs and would take time to conclude."}, {"date": "20240403211900", "headline": "What You Missed On Wall Street On Thursday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404012700", "headline": "CureVac posts early efficacy results for GSK-partnered flu shot", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404013100", "headline": "Diabetes medication appears to slow progress of Parkinson’s disease in French-backed trial", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404022300", "headline": "In Heart Burn Drug Zantac's Litigation Saga, Sanofi Nears Settlement in Major Lawsuit Cluster", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404023600", "headline": "Barclays Sticks to Its Buy Rating for Sanofi (SNYNF)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404030051", "headline": "UPDATE 1-European stocks rise ahead of inflation data; Basilea shines", "summary": "European stocks climbed on Thursday with investors awaiting an inflation print and minutes from the European Central Bank's latest meeting, while shares of Basilea jumped following the U.S. regulatory approval for the drugmaker's bacterial therapy.  The continent-wide STOXX 600 index was up 0.2%, as of 0837 GMT, led by a 1.6% gain in the basic resources sector as copper prices hit levels seen last in January 2023."}, {"date": "20240404043100", "headline": "Sanofi says to reach settlement on Zantac lawsuits in US", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404221500", "headline": "Sanofi Announces Launch of Verorab® (Sanofi Inactivated Rabies Vaccine) in the UK for Pre-exposure and Post-exposure Prophylaxis of Rabies in All Age Groups", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404225400", "headline": "Sanofi announces launch of Verorab in UK", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405060600", "headline": "Brookline Capital starts Immunic at buy, cites MS drug candidate", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240406184753", "headline": "10 Best Weight Loss Drug Stocks to Buy Now", "summary": "In this piece, we will take a look at the ten best weight loss drug stocks to buy now. If you want to skip our introduction to the rising weight loss drug industry and how it’s one of the biggest trends on the stock market right now, then you can take a look at the […]"}, {"date": "20240408030800", "headline": "Sanofi Layoffs 2024: What to Know About the Latest SNY Job Cuts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408032300", "headline": "AIRC Stock Alert: Blackstone Is Taking Apartment Income REIT Private", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408041600", "headline": "Why Is Auddia (AUUD) Stock Up 192% Today?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408100000", "headline": "Sanofi - AGM 30.04.2024 - Availability of Preparatory documents", "summary": "COMBINED GENERAL MEETING OF APRIL 30, 2024 AVAILABILITY OF PREPARATORY DOCUMENTS The Company’s shareholders are invited to attend the Combined General Meeting to be held on Thursday April 30, 2024 at 2:30 p.m. (CET) at the Palais des Congrès – Amphithéâtre Bleu – 2, place de la Porte Maillot – 75017 Paris. The notice of meeting (avis de réunion), including the agenda and the draft resolutions as well as the terms and conditions for participating and voting in the meeting, was published on the we"}, {"date": "20240408192200", "headline": "Nurix gains after extending Sanofi research pact", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409002200", "headline": "Nurix eligible for $2.5B in research collaboration with Sanofi  for 'STAT6'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409194700", "headline": "Vaccine Player Vaxcyte Has Advantage Over Pfizer, Merck's Pneumococcal Shots - Analyst Says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410214600", "headline": "Meet First Wave BioPharma: Exclusive interview with CEO James Sapirstein", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411025200", "headline": "The $5 BILLION Reason Alpine Immune Sciences (ALPN) Stock Is Up 30% Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412000900", "headline": "No link between weight loss drugs and suicidal thoughts, EU regulator concludes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412034400", "headline": "Novo Nordisk/Eli Lilly's Weight Loss Drugs Does Not Cause Suicidal Behaviors - After FDA, European Medicines Agency Says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412050300", "headline": "GLP-1s benefit Parkinson’s: Barclays sees implications across biopharma", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412120500", "headline": "Sanofi: Information concerning the total number of voting rights and shares - March 2024", "summary": "Information concerning the total number of voting rights and shares, provided pursuant to article L. 233-8 II of the Code de commerce (the French Commercial Code) and article 223-16 of the Règlement général de l’Autorité des Marchés Financiers (Regulation of the French stock market authority) Sanofia French société anonyme with a registered share capital of 2,529,599,938 €Registered office : 46, avenue de la Grande Armée - 75017 Paris - FranceRegistered at the Paris Commercial and Companies Regi"}, {"date": "20240416081655", "headline": "VGK Vs. QQQ: How Europe's 'GRANOLAS' Could Outperform The US 'Magnificent 7'", "summary": ""}, {"date": "20240416194100", "headline": "Amgen/AstraZeneca's Asthma Drug Tezspire Vs. Sanofi/Regeneron's Blockbuster Dupixent - Analyst Gives His Pick", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416214900", "headline": "IN BRIEF: Sanofi notes positive results in multiple sclerosis trial", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416230000", "headline": "Press Release: New 48-week frexalimab phase 2 data support potential for high sustained efficacy in multiple sclerosis", "summary": "New 48-week frexalimab phase 2 data support potential for high sustained efficacy in multiple sclerosis Data support frexalimab as a potential first-in-class, high-efficacy, non-lymphocyte depleting treatment for relapsing multiple sclerosis96% of participants receiving high-dose intravenous frexalimab had no new Gd+ T1 lesions and an annualized relapse rate of 0.04 after 48 weeksSanofi has initiated global phase 3 studies of frexalimab in relapsing MS and non-relapsing secondary progressive MS"}, {"date": "20240417015200", "headline": "IGM Biosciences announces refocusing of Sanofi collaboration", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417044300", "headline": "Sanofi's Multiple Sclerosis Antibody Shows Reduction Of Disease Activity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417045000", "headline": "Novartis Multiple Sclerosis Drug Kesimpta Shows Substantial Benefit Of Up To 6 Years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417052700", "headline": "Maintaining Buy Rating on Sanofi: A Resilient Financial Outlook Despite Currency Headwinds", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417065500", "headline": "International Wide-Moat Stocks On Sale - The April 2024 Heat Map", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417190900", "headline": "IGM Biosciences weakness creates 'interesting opportunity,' says Stifel", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417205000", "headline": "Dodge & Cox Global Stock Fund's 1st-Quarter Commentary: A Look Back", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418142854", "headline": "Sanofi to overhaul US operations of vaccines, cut jobs", "summary": "Sanofi would implement a \"stream­lined strate­gic sales struc­ture\" to better support its customers and patients, it said without disclosing any details on the changes to be made, the time­frame and the num­ber of em­ploy­ees to be im­pact­ed.  Sanofi CEO Paul Hudson has been trying to build investor confidence in the company's drug pipeline since he unexpectedly abandoned 2025 margin targets last October to instead boost drug development spending.  The company's vaccine portfolio includes preventive shots for a common respiratory infection in infants, influenza vaccines, COVID vaccines and vaccines for infections like meningitis and tetanus."}, {"date": "20240418195100", "headline": "Tech advances are catalyzing the Health Care sector with improved investor sentiment - SSGA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420013100", "headline": "Big pharma is looking to fatten profits with buyouts of weight-loss drug companies. Here are 4 candidates.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420224900", "headline": "Can Magnificent 7 Help Script Market Turnaround? Earnings Pick Up Pace With Microsoft, Meta, Alphabet And Tesla Expected This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421014100", "headline": "Biden sees a $35 price cap for insulin as a pivotal campaign issue. It’s not that clear-cut", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421203700", "headline": "UBS Keeps Their Buy Rating on Sanofi (SNYNF)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422033400", "headline": "Sanofi to pay $100M to settle Zantac cancer lawsuits, Bloomberg says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422043700", "headline": "Previously announced Zantac settlement worth $100M, Bloomber says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422051200", "headline": "Sanofi reportedly settles 4K Zantac cases for $100M", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422051600", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422094003", "headline": "Market Chatter: Sanofi to Pay More Than $100 Million to Settle 4,000 Suits Alleging Zantac Causes Cancer", "summary": "Market Chatter: Sanofi to Pay More Than $100 Million to Settle 4,000 Suits Alleging Zantac Causes Cancer"}, {"date": "20240422223300", "headline": "Buy Rating Affirmed for Sanofi Amid Strong Growth Prospects and Undervalued Stock", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422230000", "headline": "Press Release: Rilzabrutinib LUNA 3 phase 3 study met primary endpoint in immune thrombocytopenia", "summary": "Rilzabrutinib LUNA 3 phase 3 study met primary endpoint in immune thrombocytopenia Pivotal data from the first phase 3 study of a BTKi in immune thrombocytopenia (ITP) underscore the potential of rilzabrutinib to provide a clinically meaningful benefit to patients living with ITPRegulatory submissions in the US and EU anticipated by year-endRilzabrutinib is one of 12 potential medicines and vaccines in Sanofi’s robust immunology pipeline and a testament to Sanofi’s ability to successfully accele"}, {"date": "20240423025100", "headline": "Sanofi succeeds in late-stage trial for blood disorder candidate", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423050900", "headline": "IN BRIEF: Sanofi's rilzabrutinib meets phase-3 trial efficacy endpoint", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423062700", "headline": "Alto Neuroscience schizophrenia treatment shows good phase 1 results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423063400", "headline": "Sanofi reportedly lining up banks for consumer products spinoff", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423100300", "headline": "Sanofi (SNY) Rilzabrutinib Shows Benefit in Blood Disorder Study", "summary": "Sanofi's (SNY) BTK inhibitor, rilzabrutinib, demonstrates durable platelet response in the phase III LUNA 3 study in adult patients with immune thrombocytopenia."}, {"date": "20240423102759", "headline": "Sanofi Asks Banks to Pitch for $20 Billion OTC Spinoff", "summary": "(Bloomberg) -- French drugmaker Sanofi has asked banks to pitch for roles on the separation of its consumer-health business, according to people familiar with the matter, one of the biggest deals likely to happen in Europe this year. Most Read from BloombergTesla Stock in ‘No Man’s Land’ After 43% Rout Ahead of EarningsTaylor Swift Is Proof That How We Critique Music Is BrokenRay Dalio’s Famous Trade Is Sputtering, Investors BailingTech Giants Roar as Tesla Spikes in Late Hours: Markets WrapBill"}, {"date": "20240424071900", "headline": "What's in Store for These 5 Pharma Bigwigs in Q1 Earnings?", "summary": "Let's look at five biotech/drug companies, MRK, SNY, BMY, GILD and ABBV, slated to release their first quarter 2024 earnings results this week."}, {"date": "20240424190200", "headline": "AbbVie's Dermatitis Drug Shown 'Superior' To Sanofi/Regeneron's Dupixent In Head-To-Head Study", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424193500", "headline": "DZ BANK AG Keeps Their Hold Rating on Sanofi (SNYNF)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424231800", "headline": "Sanofi expects FY24 business EPS to remain relatively stable", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424231800", "headline": "Sanofi reports Q1 IRFS EPS EUR 0.91, down 43.1%", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424232300", "headline": "US Stocks Brace For Negative Start Amid Tech Earnings Disappointments, Caution Ahead Of Data: 'Worst Of This Two-Week Decline Is Behind Us,' Says Analyst", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424233000", "headline": "Press Release: Sanofi Q1: robust 7% sales growth driven by launches, underpins full-year guidance", "summary": "Sanofi Q1: robust 7% sales growth driven by launches, underpins full-year guidance Paris, April 25, 2024 Sales growth of 6.7% at CER and business EPS(1) of €1.78 Dupixent sales up 24.9% to €2,835 million, on target to deliver ~€13bn in 2024Pharma launches up 90.5% to €606 million, led by Nexviazyme and ALTUVIIIOVaccines sales up 5.6%, boosted by BeyfortusConsumer Healthcare (CHC) up 9.0%, benefiting from the Qunol acquisition in Physical and Mental Wellness and strong Digestive Wellness performa"}, {"date": "20240424233237", "headline": "Sanofi Q1 profit slips on generic competition, forex effects", "summary": "(Reuters) -Sanofi reported on Thursday that its first-quarter operating income declined 14.7%, as unfavourable currency effects and cheap competition to multiple sclerosis drug Aubagio outweighed rising sales of anti-inflammatory drug Dupixent.  The company reiterated it expects 2024 adjusted earnings per share (EPS) to slip by a \"low single-digit\" percentage, excluding currency swings, citing higher taxes and an increase in development expenditure.  Finance chief Francois-Xavier Roger said in a media call that the decline in the Argentine Peso was a particular drag on first-quarter overseas sales."}, {"date": "20240424234800", "headline": "SNY Earnings: Sanofi Jumps on Healthy Q1 Performance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425000544", "headline": "UPDATE 2-Sanofi profit slips on generic competition and currency effects", "summary": "Sanofi's first-quarter operating income fell 14.7% as currency effects and cheap competition to its multiple sclerosis drug Aubagio outweighed rising sales of anti-inflammatory drug Dupixent, the French drugmaker said on Thursday.  Operating income adjusted for one-offs slipped to 2.84 billion euros ($3.04 billion), a touch above the 2.79 billion euros expected by analysts in a poll on Sanofi's website.  The company reiterated that it expects 2024 adjusted earnings per share (EPS) to slip by a low single-digit percentage, excluding currency swings, citing higher taxes and an increase in development expenditure."}, {"date": "20240425005600", "headline": "SNY Stock Earnings: Sanofi Beats EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425012500", "headline": "Sanofi Sales, Profit Beat Expectations", "summary": "Sanofi backed its full-year earnings guidance after it reported first-quarter profit ahead of consensus, with sales growth driven by continued strength in anti-inflammatory drug Dupixent and its new drug launches."}, {"date": "20240425015200", "headline": "Sanofi: Q1 Earnings Snapshot", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425032200", "headline": "Sanofi Reports Strong Earnings, Joins Kirby, Sonic Automotive, Union Pacific And Other Big Stocks Moving Higher On Thursday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425033500", "headline": "Jefferies Sticks to Its Buy Rating for Sanofi (SNYNF)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425043000", "headline": "AbbVie reports positive results from Rinvoq versus Dupixent study", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425050200", "headline": "Sanofi SA Starts 2024 with Strong Sales Growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425051200", "headline": "TOP NEWS: Sanofi in \"excellent\" start to 2024 as Dupixent sales jump", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425061754", "headline": "Sanofi 2024 Q1 - Results - Earnings Call Presentation", "summary": "The following slide deck was published by Sanofi in conjunction with their 2024 Q1 earnings call."}, {"date": "20240425064400", "headline": "Sanofi Non-GAAP EPS of €1.78, revenue of €10.46B; reaffirms FY24 business EPS guidance", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425083033", "headline": "AstraZeneca Flirts With A Breakout After Cancer Drug Sales Shine; Sanofi, Bristol Stocks Diverge", "summary": "AstraZeneca stock bolted higher Thursday — and is now within striking distance of a breakout — after its cancer drugs propelled a sales beat."}, {"date": "20240425091900", "headline": "Sanofi (SNY) Q1 Earnings In Line, Sales Miss Estimates, Stock Up", "summary": "Sanofi (SNY) posts first-quarter 2024 results and maintains the earnings growth guidance for the year."}, {"date": "20240425093424", "headline": "20 Fastest Growing Health Tech Companies in the World", "summary": "In this article, we will be taking a look at the 20 fastest growing health tech companies in the world. If you do not want to learn about the trends in digital health market, head straight to the 5 Fastest Growing Health tech Companies in the World. Explosive Growth and Key Trends in the Digital […]"}, {"date": "20240425114519", "headline": "Sanofi (SNY) Q1 2024 Earnings Call Transcript", "summary": "SNY earnings call for the period ending March 31, 2024."}, {"date": "20240425114916", "headline": "These Are The Biotechs Showing Up At The Biggest Cancer Meeting Of The Year (Oral Presentations)", "summary": "The Annual Meeting of ASCO is a major event for clinicians and researchers in the field of oncology. Explore more details here."}, {"date": "20240425193600", "headline": "Bristol, Sanofi, Takeda gain positive CHMP recommendations", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426013300", "headline": "GLOBAL BROKER RATINGS: Stifel cuts Caterpillar; HSBC likes Ashtead", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426020200", "headline": "Sobi® receives positive CHMP opinion recommending approval of efanesoctocog alfa for once-weekly treatment of haemophilia A", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426024600", "headline": "Kepler Capital  Keeps Their Hold Rating on Sanofi (SNYNF)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426093400", "headline": "Pharma Stock Roundup: MRK, SNY, AZN, NVS' Q1 Results, Pipeline & Regulatory Updates", "summary": "Merck (MRK), Sanofi (SNY), Novartis (NVS) and AstraZeneca (AZN) announce their first-quarter results."}, {"date": "20240427210000", "headline": "Pharma Stock Roundup: Merck, Sanofi, AstraZeneca, Novartis' Q1 Results, Pipeline & Regulatory Updates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428201400", "headline": "Sanofi price target raised by EUR 4 at JPMorgan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429012700", "headline": "Deutsche Bank Reaffirms Their Sell Rating on Sanofi (SNYNF)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429020100", "headline": "Novo Nordisk: Growth Is Still A Better Choice", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429022800", "headline": "GLOBAL BROKER RATINGS: Bernstein raises Apple, Barclays cuts JD Sports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429032900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429184800", "headline": "GLOBAL BRIEFING: HSBC CEO to retire; first-quarter profit edges down", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430031400", "headline": "FTC expands patent listing challenges for drugs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430053018", "headline": "Sanofi: Q1 Earnings Reflect Growth And Strategic Acquisitions (Rating Upgrade)", "summary": "Sanofi beat Q1 earnings estimates with strong revenue and performance of key drugs. Growth lags sector, but has good margins. Learn more about SNY stock here."}, {"date": "20240430100000", "headline": "Press Release: Annual General Meeting of April 30, 2024", "summary": "Annual General Meeting of April 30, 2024 Approval of the financial statements for the fiscal year 2023Distribution of a cash dividend of €3.76 per share, with payment as of May 15, 2024Board composition: renewal of two Directors and appointment of three new Independent Directors Paris, April 30, 2024. The Combined General Shareholders’ Meeting of Sanofi was held on April 30, 2024, under the chairmanship of Frédéric Oudéa. All resolutions submitted to the vote were adopted by the shareholders. Th"}, {"date": "20240430112220", "headline": "Sanofi (NASDAQ:SNY) Q1 2024 Earnings Call Transcript", "summary": "Sanofi (NASDAQ:SNY) Q1 2024 Earnings Call Transcript April 25, 2024 Sanofi reports earnings inline with expectations. Reported EPS is $0.96 EPS, expectations were $0.96. Sanofi isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Paul Hudson: Welcome to the Q1 2024 conference […]"}, {"date": "20240430213800", "headline": "SNY Crosses Above Key Moving Average Level", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501082740", "headline": "Sanofi Q1: Wait And See For Now (Downgrade)", "summary": ""}, {"date": "20240501220000", "headline": "Sanofi’s Frexalimab Shows Promise in MS Trial", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501230000", "headline": "Press Release: Beyfortus real-world evidence published in The Lancet shows 82% reduction in infant RSV hospitalizations", "summary": "Beyfortus real-world evidence published in The Lancet shows 82% reduction in infant RSV hospitalizations New real-world evidence shows Beyfortus (nirsevimab) substantially reduced RSV lower respiratory tract disease and hospitalizations in infants during the 2023-2024 RSV season, versus no intervention1-6Results add to the consistent high efficacy of Beyfortus against medically attended RSV lower respiratory tract disease, shown in the pivotal clinical studies and the outcomes from HARMONIE, a p"}, {"date": "20240502005700", "headline": "Regeneron falls after Q1 miss; announces $3B share buybacks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502051500", "headline": "3 Biotech Stocks to Buy and Hold Through 2030 and Beyond", "summary": "It pays to develop novel medicines for life-threatening illnesses."}, {"date": "20240502080100", "headline": "Regeneron (REGN) Q1 Earnings, Sales Miss on Lower Eylea Sales", "summary": "Regeneron (REGN) reports Q1 results, wherein both the top and bottom lines miss estimates due to lower Eylea sales. Shares down."}, {"date": "20240502215911", "headline": "Q1 2024 Kymera Therapeutics Inc Earnings Call", "summary": "Q1 2024 Kymera Therapeutics Inc Earnings Call"}, {"date": "20240503081546", "headline": "Regeneron Pharmaceuticals, Inc. (NASDAQ:REGN) Q1 2024 Earnings Call Transcript", "summary": "Regeneron Pharmaceuticals, Inc. (NASDAQ:REGN) Q1 2024 Earnings Call Transcript May 2, 2024 Regeneron Pharmaceuticals, Inc. misses on earnings expectations. Reported EPS is $9.55 EPS, expectations were $10.17. Regeneron Pharmaceuticals, Inc. isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Welcome to […]"}]}