{"news": [{"date": "20240327232907", "headline": "T-Mobile Launches \"Mission Critical Push-to-Talk\"", "summary": "* Real-time, secure communication is about to get easier for first responders, government agencies and businesses on the country's largest 5G network.BELLEVUE, Wash. - T-Mobile is taking push to..."}, {"date": "20240328041700", "headline": "May 10th Options Now Available For T-Mobile US (TMUS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328133536", "headline": "15 Best 5G Stocks To Buy According to Hedge Funds", "summary": "In this article, we will take a look at the 15 best 5G stocks to buy according to hedge funds. To see more such companies, go directly to the 5 Best 5G Stocks To Buy According to Hedge Funds. While artificial intelligence (AI) has been dominating headlines, another technological advancement is quietly gaining momentum and […]"}, {"date": "20240328211400", "headline": "META, NFLX, PARA among top S&P500 communication movers in Q1", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328223900", "headline": "TMUS, RCI, AMT: Which Telecom Stock Has the Most Upside?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328224100", "headline": "TMUS, RCI, AMT: Which Telecom Stock Has the Most Upside Potential?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240328235759", "headline": "Director, 10% Owner Telekom Deutsche Sells Shares of T-Mobile US Inc (TMUS)", "summary": "T-Mobile US Inc (NASDAQ:TMUS), a leading provider of wireless services, including voice, messaging, and data, recently experienced a significant insider transaction."}, {"date": "20240329040700", "headline": "Legal Money Printer? 7 No-Brainer Stocks for Endless Income Streams.", "summary": "Cash is the lifeblood of any business, and the end goal of every startup is to generate as much cash as it can and then return that cash to its shareholders through either buybacks or dividends. While it’s exciting to invest in growth companies and startups in the hopes that they will deliver significant returns in the long run, this approach also exposes you to significant risk. This has led to this list of stocks for endless income. That’s why it’s crucial to keep a portion of your portfolio i"}, {"date": "20240331194500", "headline": "How Ryan Reynolds Builds Billion Dollar Companies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240331222600", "headline": "T-Mobile’s Growth Trajectory: Strategic Expansion and Positive Outlook Reinforce Buy Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401021409", "headline": "T-Mobile to Host Q1 2024 Earnings Call on April 25, 2024", "summary": "Bellevue, Washington - T-Mobile US, Inc. looks forward to discussing first quarter 2024 financial and operational results on Thursday, April 25, 2024, at 4:30 p.m. Eastern Time . The call will be..."}, {"date": "20240401084711", "headline": "AT&T Says Data From 73 Million Accounts Leaked on Dark Web", "summary": "(Bloomberg) -- AT&T Inc. said that personal data from about 73 million current and former customers was leaked onto the dark web, prompting it to reset 7.6 million account passcodes.Most Read from BloombergErdogan Suffers Historic Loss in Turkey Municipal ElectionsTesla Has Wall Street Worried About How Many Cars It Just SoldGold Retreats From Record as US Factory Data Spurs Fed DebateUS Oil Suppliers Muscling Into OPEC+ Markets All Over the WorldTrump Media Erases Debut Surge as Filings Show $5"}, {"date": "20240401091500", "headline": "Last-Minute Tax Season Tips for Making the Most of Your Tax Return", "summary": "Make financial plans for the year ahead with tips from experts who can help make your tax season seamless. NORTHAMPTON, MA / ACCESSWIRE / April 1, 2024 / Tax season isn't just a time to gather all your necessary paperwork together in time for the ..."}, {"date": "20240401093000", "headline": "1 Incredible Dividend Growth Stock to Buy Hand Over Fist Right Now", "summary": "T-Mobile's dividend can grow 10% per year for the foreseeable future."}, {"date": "20240401114507", "headline": "T-Mobile: Clear Buy Among Peers AT&T And Verizon", "summary": "T-Mobile has faster customer acquisition rate than Verizon and AT&T. Its top and bottom line growth expectation exceeds its peers. Find out why TMUS stock is a Buy."}, {"date": "20240401190000", "headline": "48 HOURS: The best way to see Seattle? Tips from T-Mobile CEO Sievert", "summary": "If you are ever in thePacific Northwest and catch sight of a seaplane, take a closerlook: It might be T-Mobile president and CEO Mike Sievert at thecontrols. The head of the wireless..."}, {"date": "20240401190400", "headline": "Decoding T-Mobile US's Options Activity: What's the Big Picture?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401204000", "headline": "T Mobile US (TMUS) Receives a Buy from Barclays", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403005600", "headline": "Oppenheimer Remains a Buy on T Mobile US (TMUS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403081500", "headline": "Last-Minute Tax Season Tips To Avoid Scams", "summary": "Protect yourself from the annual scammer surge with tips from experts who can help make your tax season seamless. NORTHAMPTON, MA / ACCESSWIRE / April 3, 2024 / Tax season is a time when scammers are on high alert - which means you should be too. ..."}, {"date": "20240403214300", "headline": "T-Mobile Now #40 Largest Company, Surpassing Qualcomm", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403221000", "headline": "Analysts Offer Insights on Communication Services Companies: TKO Group Holdings (TKO), CMGE Technology Group Limited (HK:0302) and T Mobile US (TMUS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404045300", "headline": "Want to work part time in retirement? These are the 5 top cities to do it.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404063017", "headline": "T-Mobile Gives New 5G Internet Customers Free Blink Home Security Cameras This Moving Season", "summary": "* Whether planning a big move or just spring cleaning in life, get a free Blink Smart security package when switching to T-Mobile 5G Home or Small Business InternetBELLEVUE, Wash. - Not today,..."}, {"date": "20240405145500", "headline": "Top Analyst Reports for T-Mobile US, Abbott Laboratories & Palo Alto Networks", "summary": "Today's Research Daily features new research reports on 16 major stocks, including T-Mobile US, Inc. (TMUS), Abbott Laboratories (ABT) and Palo Alto Networks, Inc. (PANW)."}, {"date": "20240406191400", "headline": "Citi's top recommended large-cap stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407235824", "headline": "Fitch Affirms Sprint Spectrum Securitization Class A Notes at 'A'; Outlook Stable", "summary": "Fitch Ratings has affirmed the 2018-1 notes issued by Sprint Spectrum Co LLC , Sprint Spectrum Co II LLC and Sprint Spectrum Co III LLC at 'A'.As per Fitch's Sprint Spectrum Securitization Bespoke..."}, {"date": "20240408071300", "headline": "The Zacks Analyst Blog Highlights T-Mobile US, Abbott Laboratories, Palo Alto Networks, Enterprise Products Partners and The PNC Financial Services", "summary": "T-Mobile US, Abbott Laboratories, Palo Alto Networks, Enterprise Products Partners and The PNC Financial Services are part of the Zacks top Analyst Blog."}, {"date": "20240409045446", "headline": "T-Mobile: Growth And New Dividend Not Enough For A Buy", "summary": "T-Mobile's strong financial health, future prospects, market dominance, and growth potential make it an attractive investment despite mixed analysis."}, {"date": "20240409081000", "headline": "Here's Why You Should Keep American Tower (AMT) in Your Kitty", "summary": "Solid demand for American Tower's (AMT) wireless communication assets by network carriers and expansion efforts bode well. However, customer concentration and high interest rates are major woes."}, {"date": "20240409091441", "headline": "Warren Buffett’s Portfolio: 15 Longest Held Stocks", "summary": "In this piece, we will take a look at Warren Buffett’s portfolio and the 15 longest held stocks. If you want to skip our introduction to the Oracle of Omaha, his stocks, and trading strategies, then you can skip ahead to Warren Buffett’s Portfolio: 5 Longest Held Stocks. Warren Buffett is the most successful investor […]"}, {"date": "20240410042500", "headline": "If You Can Only Buy One Dividend Stock in April, It Better Be One of These 3 Names", "summary": "Looking ahead, the future of the US economy is shaped by ongoing debates over interest rate policy and inflation. Recent robust economic data has led investors to anticipate fewer interest rate cuts by the U.S. Federal Reserve in 2024. This has caused a reversal from earlier expectations of more aggressive cuts. This shift reflects a growing belief that the economy’s strength might warrant less monetary easing than previously thought. The Fed’s response to inflation and economic growth will rema"}, {"date": "20240410055100", "headline": "Pomeroy Forms Strategic Partnership with T-Mobile for Business", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410061500", "headline": "T-Mobile Launches in Sam’s Club as Exclusive In-Club Wireless Provider", "summary": "BELLEVUE, Wash., April 10, 2024--T-Mobile gives Sam’s Club a splash of magenta! Today, T-Mobile (NASDAQ: TMUS) announced it’s expanding its retail presence by launching in nearly all Sam’s Club locations as the membership chain’s exclusive in-club wireless provider. Now, new and existing Sam’s Club members can shop the latest T-Mobile devices and plans, as well as T-Mobile 5G Home and Business Internet, directly with T-Mobile’s award-winning Mobile Experts."}, {"date": "20240410070500", "headline": "3 Wireless Stocks Likely to Profit Despite Near-Term Hiccups", "summary": "The accelerated pace of 5G deployment should help the Zacks Wireless National industry thrive despite short-term headwinds and raw material price volatility. TMUS, VZ and USM are well poised to make the most of the current scenario."}, {"date": "20240410214907", "headline": "T-Mobile Launches in Sam's Club as Exclusive In-Club Wireless Provider", "summary": "* T-Mobile is now available in nearly all Sam's Club locations, offering members major value when making the switch to America's leading 5G networkBELLEVUE, Wash. - T-Mobile gives Sam's Club a..."}, {"date": "20240411055900", "headline": "Zacks Industry Outlook Highlights T-Mobile US, Verizon Communications and United States Cellular", "summary": "T-Mobile US, Verizon Communications and United States Cellular are part of the Zacks Industry Outlook article."}, {"date": "20240411070000", "headline": "T-Mobile Upgrades \"Smartphone Equality\"", "summary": "BELLEVUE, Wash., April 11, 2024--What’s the news: Today, T-Mobile announced a major update to Smartphone Equality — the Un-carrier’s signature program that gives more people a way to get the latest smartphones regardless of their credit score or how they choose to pay. At its inception, Smartphone Equality enabled Metro and T-Mobile Prepaid customers to get great deals on a new class of devices, but the very best deals — reserved for customers with high credit scores — were out of reach. Over ne"}, {"date": "20240412022300", "headline": "Nvidia, 'Caitlin Clark' Of Stock Market, Says Analyst: AI Leader's Stock Performance, EPS Growth Leaves S&P 500 Peers Biting Dust", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412024500", "headline": "Paramount most shorted S&P 500 communications stock in March; Alphabet least shorted", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415061900", "headline": "Paramount, Etsy, Albemarle among most shorted S&P 500 stocks in March", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416012700", "headline": "Buyback Bonanza: The Top 7 ETFs to Profit From Corporate Cash Splurges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416094500", "headline": "How T-Mobile’s Project 10Million Is Helping Bridge the Digital Divide", "summary": "NORTHAMPTON, MA / ACCESSWIRE / April 16, 2024 / T-Mobile: The Affordable Connectivity Program (ACP) was created by the Infrastructure Investment and Jobs Act (IIJA) that Congress passed in 2021. The program offered eligible households a discount on ..."}, {"date": "20240417000100", "headline": "Navigating Market Uncertainty: Intrinsic Value of T-Mobile US Inc", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417050200", "headline": "Comcast launches NOW brand for low-cost Internet, mobile, TV", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417060300", "headline": "Telekom Deutsche Sells Over Half a Million Shares of T-Mobile US Inc (TMUS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417072200", "headline": "T-Mobile Creates Lasting Change in California with $50,000 Donation to Nonprofits", "summary": "BELLEVUE, Wash., April 17, 2024--T-Mobile (NASDAQ: TMUS) today announced a donation totaling $50,000 to five nonprofit organizations that are making a difference in the Golden State. The organizations — Boys & Girls Clubs of Oakland, Court Appointed Special Advocates of Contra Costa County (CASA), Common Ground Society, Raphael House San Francisco and the Ronald McDonald House Charities Bay Area — each received $10,000 to support their vital programs and initiatives."}, {"date": "20240417213400", "headline": "Here's How Much You Would Have Made Owning T-Mobile US Stock In The Last 5 Years", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418033300", "headline": "First Week of May 31st Options Trading For T-Mobile US (TMUS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418080600", "headline": "Delta Air Lines Selects T-Mobile as Preferred Mobility Partner", "summary": "BELLEVUE, Wash. & ATLANTA, April 18, 2024--Today, Delta Air Lines (NYSE: DAL) announced it has named T-Mobile (NASDAQ: TMUS) as its preferred mobility partner, uniting America’s most awarded airline with America’s most awarded 5G network. Over the span of this long-term agreement, Delta will move more than 60,000 lines to T-Mobile and deploy a T-Mobile 5G hybrid network at their Atlanta headquarters to strengthen operational efficiency and enhance customer service."}, {"date": "20240418114500", "headline": "T-Mobile and Governor Jeff Landry Reveal Massive $290 Million 5G Network Upgrade in Louisiana", "summary": "The Un-carrier's network investment brings faster speeds and more coverage in Greater New Orleans and dozens of small and rural communities across the state BATON ROUGE, LA / ACCESSWIRE / April 18, 2024 / The Pelican State just got a major boost. ..."}, {"date": "20240418190900", "headline": "Telekom Deutsche Sells Shares of T-Mobile US Inc (TMUS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419003800", "headline": "T-Mobile US announces USD290 million 5G network upgrade in Louisiana", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420224900", "headline": "Can Magnificent 7 Help Script Market Turnaround? Earnings Pick Up Pace With Microsoft, Meta, Alphabet And Tesla Expected This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421000000", "headline": "American Tower: Buy-And-Hold Investors Should Be Euphoric About This Bargain", "summary": "American Tower has shown solid growth in a challenging economic environment. Read what makes AMT stock a Buy at current levels."}, {"date": "20240422002200", "headline": "Verizon gains as Q1 earnings top estimates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422025000", "headline": "Verizon slips as Q1 earnings top estimates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422025117", "headline": "PKW: Buyback ETF Combining Value And Growth", "summary": "Invesco BuyBack Achievers ETF invests in companies that have reduced shares outstanding by at least 5% in last 12 months. Read more on PKW ETF here."}, {"date": "20240422041000", "headline": "Dividend yield and growth stock list by Goldman", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422051600", "headline": "Verizon Outperforms Earnings Expectations But Faces Market Skepticism", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422062900", "headline": "Goldman’s buybacks basket: Buyback growth will be 13% in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422094700", "headline": "Will Top-Line Growth Boost T-Mobile's (TMUS) Q1 Earnings?", "summary": "T-Mobile (TMUS) will likely witness a top-line expansion year over year in the first quarter of 2024, driven by growing demand for postpaid services."}, {"date": "20240422104943", "headline": "Smartphone upgrade: The two features consumers focus on most", "summary": "If you're in the market for a new smartphone, perhaps due to an unfortunate incident or simply desiring to trade in your personal device for the latest generation, CNET Senior Editor Lisa Eadicicco joins Wealth! to share insights on factors to consider when upgrading your smartphone. Eadicicco highlights two aspects consumers prioritize when selecting a new phone, beyond a comfortable budget: screen size and camera capabilities. She emphasizes that these are the two features consumers tend to utilize the most, stating \"they're two factors you can't really change.\" Additionally, Eadicicco outlines several considerations when choosing a network provider, including exploring better deals, evaluating coverage in your area, and even testing out the carrier's service before fully committing. For more expert insight and the latest market action, click here to watch this full episode of Wealth! This post was written by Angel Smith"}, {"date": "20240422211200", "headline": "T-Mobile announces $163M in completed network upgrades in Arkansas", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423015000", "headline": "Altice USA price target lowered by $1 at Loop Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423063800", "headline": "10 Communication Services Stocks Whale Activity In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423070700", "headline": "T-Mobile Rolls Out Two New Internet Plans to Give Customers Enhanced Options for Home and On the Go", "summary": "BELLEVUE, Wash., April 23, 2024--T-Mobile (NASDAQ: TMUS):"}, {"date": "20240423080600", "headline": "Level Up Mom’s Day with Epic Savings at T-Mobile", "summary": "BELLEVUE, Wash., April 23, 2024--Do the most for Mom this Mother’s Day, just like she always does for you. T-Mobile (NASDAQ: TMUS) today announced deals on some of its best-selling tech that Mom will use daily — from iPhone to iPad to Apple Watch. And they’re all available to both new and existing customers:"}, {"date": "20240423112700", "headline": "AT&T (T) vs. T-Mobile (TMUS): Which Stock Wins in Q1 Earnings?", "summary": "TMUS appears to be a better pick now compared to T, given the solid EPS growth in recent quarters, greater 5G coverage and robust demand for postpaid services."}, {"date": "20240423231600", "headline": "Buy Rating Affirmed for T Mobile US Amid Strong Growth and Free Cash Flow Prospects", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424005300", "headline": "AT&T climbs on Q1 profit beat as postpaid phone subscribers rise, affirms FY24 outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424020000", "headline": "Can T-Mobile Reach New All-Time Highs After Q1 Earnings?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424063900", "headline": "Telekom Deutsche Sells Shares of T-Mobile US Inc", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424080000", "headline": "T-Mobile Announces $163 Million in Completed Network Upgrades for Arkansas", "summary": "The Un-carrier's network investment is creating new opportunities for millions across the Natural State with its network delivering faster speeds and better coverage than ever before LITTLE ROCK, AR / ACCESSWIRE / April 24, 2024 / There's nothing ..."}, {"date": "20240424081300", "headline": "T-Mobile Unveils BIG Moves to Help Small Businesses Grow", "summary": "BELLEVUE, Wash., April 24, 2024--It’s nearly Small Business Week and T-Mobile is going big for small business customers with deals starting April 25! T-Mobile is launching Business Unlimited Edge and new small business customers that add at least 10 or more lines can get up to a $1,000 credit for each voice line on Business Unlimited Edge – that’s like $10,000 back in their pockets!"}, {"date": "20240424155048", "headline": "Alphabet, Microsoft, Southwest earnings: What to watch", "summary": "Here are some of the biggest stories investors will be watching on Thursday, April 25, 2024. A slew of companies will report their quarterly results including Microsoft (MSFT), Alphabet (GOOG, GOOGL), and Southwest Airlines (LUV). On the economic data front, the highly anticipated preliminary read on first quarter GDP will be released. Economists are expecting that the US economy grew by 2.2% in the first three months of the year. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Angel Smith"}, {"date": "20240424191700", "headline": "FCC approves T-Mobile purchase of Mint Mobile, with conditions", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424200000", "headline": "T-Mobile gets FCC OK to buy Mint Mobile", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424210700", "headline": "T-Mobile reports Q1 postpaid net account additions 218K", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424210700", "headline": "T-Mobile reports Q1 EPS $2.00, consensus $1.87", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424213000", "headline": "What You Missed On Wall Street On Thursday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424214000", "headline": "T-Mobile US Inc. stock outperforms competitors despite losses on the day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424222200", "headline": "Fly Intel: After-Hours Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424232300", "headline": "US Stocks Brace For Negative Start Amid Tech Earnings Disappointments, Caution Ahead Of Data: 'Worst Of This Two-Week Decline Is Behind Us,' Says Analyst", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425005600", "headline": "TMUS Stock Earnings: T-Mobile US Beats EPS, Misses Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425030900", "headline": "T-Mobile, EQT announce joint venture to acquire Lumos", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425031106", "headline": "T-Mobile and EQT Announce Joint Venture to Acquire Lumos and Build Out the Un-carrier’s First Fiber Footprint", "summary": "T-Mobile’s scalable broadband and wireless growth engine combined with EQT’s infrastructure expertise will leverage Lumos' fiber platform to deliver broadband services to more Americans..."}, {"date": "20240425034327", "headline": "T-Mobile, EQT Form JV to Buy Fiber Optic Company Lumos", "summary": "By Chris Wack T-Mobile and EQT have formed a joint venture with EQT's Infrastructure VI fund to buy fiber-to-the-home platform Lumos from EQT's predecessor fund, EQT Infrastructure III. ..."}, {"date": "20240425035617", "headline": "Is AT&T Or Verizon The Better Dividend Stock After Q1 2024 Earnings?", "summary": "The article examines the correlation between AT&T Inc. and Verizon Communications Inc. stocks with long-end Treasury yields. Click for our choice between T and VZ."}, {"date": "20240425060900", "headline": "Notable companies reporting after market close", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425063800", "headline": "Stocks Drop, Tech Tumbles With Meta's Weak Outlook, Q1 Stagflation Fears; Gold Miners Advance: What's Driving Markets Thursday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425080000", "headline": "How I Would Invest $100k In Today's Market To Collect A Safe Near 9% Yield", "summary": "I recommend four stocks to invest $100k in today to collect a near 9% yield. Explore more details here."}, {"date": "20240425080855", "headline": "How To Earn $500 A Month From T-Mobile US Stock Ahead Of Q1 Earnings Report", "summary": "T-Mobile US, Inc. (NASDAQ:TMUS) is set to release earnings results for its first quarter, after the closing bell on April 25, 2024. Analysts expect the Bellevue, Washington-based company to report quarterly earnings at $1.87 per share, up from $1.58 per share in the year-ago period. T-Mobile US is projected to post revenue of $19.81 billion (roughly the same as the year-earlier quarter, per data from Benzinga Pro). T-Mobile recently announced $163 Million in completed network upgrades for Arkans"}, {"date": "20240425081400", "headline": "T-Mobile and EQT Announce Joint Venture to Acquire Lumos and Build Out the Un-carrier's First Fiber Footprint", "summary": "T-Mobile (NASDAQ: TMUS), America's 5G leader and fastest growing broadband provider, and EQT, a purpose-driven global investment organization, today announced they have entered into a joint venture (JV) with EQT's Infrastructure VI fund (EQT) that will acquire fiber-to-the-home platform Lumos from EQT's predecessor fund EQT Infrastructure III."}, {"date": "20240425100225", "headline": "T-Mobile raises forecast for subscriber additions on demand for its discounted plans", "summary": "T-Mobile US on Thursdayraised its annual forecast for monthly bill-paying phonesubscriber growth, as more customers tap into its discountedplans and on expansion of 5G network coverage. ..."}, {"date": "20240425101819", "headline": "T-Mobile: Q1 Earnings Snapshot", "summary": "BELLEVUE, Wash. — BELLEVUE, Wash. — T-Mobile US Inc. on Thursday reported first-quarter earnings of $2.37 billion. On a per-share basis, the Bellevue, Washington-based company said it had..."}, {"date": "20240425101841", "headline": "T-Mobile US, Inc. 2024 Q1 - Results - Earnings Call Presentation", "summary": "The following slide deck was published by T-Mobile US, Inc."}, {"date": "20240425101927", "headline": "T-Mobile to invest $950 mln in venture with EQT to buy fiber optic network provider Lumos", "summary": "Wireless carrier T-Mobile US expects to invest about $950 million for a 50% stake in a joint venture with Swedish investment firm EQT's fund that will buy fiber optic network provider Lumos, the companies said on Thursday.  Washington-based T-Mobile will invest another $500 million between 2027 to 2028 to help Lumos reach 3.5 million homes by the end of the period.  T-Mobile will acquire all existing fiber customers of Lumos as part of the deal with EQT's Infrastructure VI fund, which is expected to close in late 2024 or early 2025."}, {"date": "20240425102436", "headline": "T-Mobile to invest $950 million in venture with EQT to buy fiber optic network provider Lumos", "summary": "Washington-based T-Mobile will invest another $500 million between 2027 to 2028 to help Lumos reach 3.5 million homes by the end of the period.  T-Mobile will acquire all existing fiber customers of Lumos as part of the deal with EQT's Infrastructure VI fund, which is expected to close in late 2024 or early 2025.  Lumos, which provides its fiber internet to 320,000 households, will transition to a wholesale model after the deal with T-Mobile as its main client, owning customer relationships."}, {"date": "20240425110200", "headline": "T-Mobile US raises outlook after profit grows despite flat sales", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425123304", "headline": "US FCC approves T-Mobile deal to buy budget provider Mint Mobile", "summary": "WASHINGTON (Reuters) -The U.S. Federal Communications Commission said on Thursday it will approve the T-Mobile US deal to buy Ka'ena Corp, the owner of budget service provider Mint Mobile, for up to $1.35 billion.  The FCC cited T-Mobile's voluntary agreement to implement a 60-day unlocking period for all Mint Mobile and Ultra Mobile devices activated on the T-Mobile network before and after the closing."}, {"date": "20240425140200", "headline": "T-Mobile Delivers Industry-Leading Customer, Service Revenue and Profitability Growth in Q1 2024, and Raises 2024 Guidance", "summary": "BELLEVUE, Wash., April 25, 2024--T-Mobile US, Inc. (NASDAQ: TMUS):"}, {"date": "20240425140937", "headline": "T-Mobile raises forecast for subscriber additions on strength from bundled plans", "summary": "(Reuters) -T-Mobile US raised its annual forecast for growth in monthly bill-paying phone subscribers on Thursday, as more people take to its plans that bundle high-speed internet with access to streaming services.  The U.S. telecom carrier's offerings such as Go5G Next and Go5G Plus provide subscriptions for services such as Netflix and Apple TV+ and are among its most popular offerings.  \"Over 60% of our new customers that come in are choosing those plans,\" Mike Katz, president of marketing, strategy and products, told Reuters."}, {"date": "20240425142841", "headline": "T-Mobile Raises 2024 Guidance After Mixed Quarter", "summary": "T-Mobile shares were little changed after the telecommunications provider reported mixed results as net subscriber additions slipped from last year.  Postpaid net account additions were 218,000 in the first quarter, down from 287,000 in the first quarter 2023.  Postpaid net customer additions were 1.2 million, also down from last year."}, {"date": "20240425143024", "headline": "UPDATE 1-US FCC approves T-Mobile deal to buy budget provider Mint Mobile", "summary": "The U.S. Federal Communications Commission said on Thursday it will approve the T-Mobile US deal to buy Ka'ena Corp, the owner of budget service provider Mint Mobile, for up to $1.35 billion.  The FCC cited T-Mobile's voluntary agreement to implement a 60-day unlocking period for all Mint Mobile and Ultra Mobile devices activated on the T-Mobile network before and after the closing.  The FCC said the agreement will make it easier for Mint Mobile and Ultra Mobile customers to switch service providers."}, {"date": "20240425150009", "headline": "T-Mobile US, Inc. (TMUS) Q1 2024 Earnings Call Transcript", "summary": "T-Mobile US, Inc. (NASDAQ:NASDAQ:TMUS) Q1 2024 Earnings Conference Call April 25, 2024 4:30 PM ETCompany ParticipantsJud Henry - Senior Vice President and..."}, {"date": "20240425154210", "headline": "T-Mobile US Inc (TMUS) Q1 2024 Earnings: Strong Growth and Surpassing Analyst Expectations", "summary": "Industry-Leading Performance with Enhanced Financial Outlook"}, {"date": "20240425154452", "headline": "T-Mobile Earnings, Wireless Subscriber Adds Top Estimates", "summary": "T-Mobile US on Thursday reported first-quarter earnings that topped consensus estimates while revenue missed."}, {"date": "20240425183500", "headline": "GLOBAL BRIEFING: Yen slumps to new multi-decade low as BoJ stands pat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425193600", "headline": "KeyBanc Sticks to Their Buy Rating for T Mobile US (TMUS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425194511", "headline": "T-Mobile US (TMUS) Q1 2024 Earnings Call Transcript", "summary": "TMUS earnings call for the period ending March 31, 2024."}, {"date": "20240425202600", "headline": "Analysts Offer Insights on Communication Services Companies: Comcast (CMCSA), T Mobile US (TMUS) and Alphabet Class A (GOOGL)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425210900", "headline": "What You Missed On Wall Street On Friday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425213900", "headline": "Analysts’ Top Communication Services Picks: Comcast (CMCSA), T Mobile US (TMUS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425215100", "headline": "Barclays Reaffirms Their Buy Rating on T Mobile US (TMUS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425222600", "headline": "Wells Fargo Remains a Buy on T Mobile US (TMUS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425225600", "headline": "T-Mobile’s Strong Q1 Performance and Positive 2024 Outlook Reinforce Buy Rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425234000", "headline": "T-Mobile price target raised by $10 at KeyBanc, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425234200", "headline": "Analysts Offer Insights on Communication Services Companies: T Mobile US (TMUS) and Alphabet Class A (GOOGL)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426003200", "headline": "T Mobile US (TMUS) Receives a Buy from Scotiabank", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426004900", "headline": "Charter continues to shed internet subscribers, reflecting cable’s growth woes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426005500", "headline": "T-Mobile price target raised by $4 at RBC Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426013100", "headline": "Analysts Are Bullish on These Communication Services Stocks: Roku (ROKU), T Mobile US (TMUS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426013721", "headline": "T-Mobile US Inc (TMUS) Q1 2024 Earnings Call Transcript Highlights: Strategic Growth and ...", "summary": "Explore key insights on customer growth, financial projections, and strategic partnerships shaping T-Mobile's future."}, {"date": "20240426020100", "headline": "T-Mobile price target lowered by $2 at TD Cowen, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426020300", "headline": "T-Mobile price target lowered by $1 at Scotiabank, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426020800", "headline": "Analyst Scoreboard: 6 Ratings For T-Mobile US", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426024400", "headline": "T-Mobile price target raised by $11 at Raymond James, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426050400", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426053500", "headline": "T Mobile US (TMUS) Gets a Buy from UBS", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426061105", "headline": "Q1 2024 T-Mobile US Inc Earnings Call", "summary": "Q1 2024 T-Mobile US Inc Earnings Call"}, {"date": "20240426070000", "headline": "T-Mobile's (TMUS) Q1 Earnings Top on Industry-Leading Growth", "summary": "Backed by industry-leading postpaid customer growth with a record low churn rate, T-Mobile (TMUS) beats first-quarter 2024 earnings estimates."}, {"date": "20240426080752", "headline": "T-Mobile Earnings Beat, Revenue Misses. Are Price Hikes Coming?", "summary": "T-Mobile US on Thursday reported first-quarter earnings that topped consensus estimates while revenue missed."}, {"date": "20240426230336", "headline": "Decoding T-Mobile US Inc (TMUS): A Strategic SWOT Insight", "summary": "Insightful Analysis of T-Mobile's Financials and Strategic Positioning"}, {"date": "20240427202700", "headline": "With rate cuts pushed out, Goldman looks at quality stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428054400", "headline": "The Top 3 Telecom Stocks to Buy in April 2024", "summary": "The telecommunications industry saw an uptick in demand due to the expansion of 5G networks and fiber optic infrastructure. This industry also has recently faced a fair share of challenges ranging from geopolitical tensions and inflation. However, the telecoms industry has now seen a rebound due to the growing need for connectivity and IoT services. This led us to create this list of telecom stocks to buy. Already, we’ve seem many telecom leaders making steady investments into their networks and"}, {"date": "20240428193700", "headline": "FCC fines U.S. wireless carriers over $200M for illegally sharing location data", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429043300", "headline": "$100 Invested In T-Mobile US 10 Years Ago Would Be Worth This Much Today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429045500", "headline": "T Mobile US (TMUS) Gets a Buy from DZ BANK AG", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429062200", "headline": "The “highest quality” stocks within each sector - GS", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429064200", "headline": "FCC fines largest wireless carriers nearly $200M for location data violations", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429074053", "headline": "FCC fines US wireless carriers nearly $200 million over illegal location data sharing", "summary": "The Federal Communications Commission fined the largest U.S. wireless carriers nearly $200 million for illegally sharing access to customers' location information. The FCC is..."}, {"date": "20240429081914", "headline": "FCC fines US wireless carriers over illegal location data sharing", "summary": "The FederalCommunications Commission on Monday fined the largest U.S.wireless carriers nearly $200 million for illegally sharingaccess to customers’ location information. The FCC is..."}, {"date": "20240429093419", "headline": "FCC Fines Wireless Carriers for Sharing Customer-Location Data -- Update", "summary": "By Ben Glickman Federal regulators fined wireless carriers Verizon, AT&T, T-Mobile and Sprint nearly $200 million for sharing customer-location data without consent. The Federal..."}, {"date": "20240429135733", "headline": "T-Mobile, AT&T, Verizon Face $200 Million in Fines for Alleged Consumer Location Data Violations, FCC Says", "summary": "T-Mobile, AT&T, Verizon Face $200 Million in Fines for Alleged Consumer Location Data Violations, FCC Says"}, {"date": "20240429135748", "headline": "Wireless Carriers Say They’ll Fight FCC on Fines  Over Customer Location Data", "summary": "(Bloomberg) -- The top three US wireless providers vowed to fight fines totaling almost $200 million by regulators who said the carriers illegally shared customers’ location information.Most Read from BloombergTesla Soars on Tentative China Approval for Driving SystemStocks Trade for 390 Minutes a Day. Increasingly, Only 10 MatterYen Sparks Intervention Suspicion After U-Turn From 1990 LowsWhat 60,000 Headlines Say About the Fed’s Next MoveUS Warns ICC Action on Israel Would Hurt Cease-Fire Chan"}, {"date": "20240429155600", "headline": "FCC Fines Wireless Carriers About $200 Million for Sharing Customer Data", "summary": "Federal regulators fined wireless carriers  Verizon AT&T T-Mobile  and Sprint nearly $200 million for sharing customer-location data without consent.  The Federal Communications Commission on Monday said that an investigation found the four carriers sold access to customers’ location data to aggregators, who resold the data to third parties.  The FCC said that Verizon was fined $46.9 million, AT&T was fined $57.3 million, T-Mobile was fined $80.1 million and Sprint was fined $12.2 million."}, {"date": "20240429192700", "headline": "FCC fines wireless carriers nearly $200 million for sharing user locations without consent", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429193800", "headline": "3 Stocks Riding the M&A Wave to Riches", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429214500", "headline": "T-Mobile to sell €2B of Euro-Denominated Senior Notes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430005038", "headline": "Wall Street Breakfast Podcast: NBC Pitches $2.5B A Year For NBA TV Rights", "summary": "NBC pitches paying $2.5B a year for NBA TV rights to edge out Warner Bros' TNT. FCC fines U.S. wireless carriers nearly $200M for illegally sharing location data."}, {"date": "20240430012900", "headline": "T-Mobile Announces Proposed Public Offering of Euro-Denominated Senior Notes", "summary": "BELLEVUE, Wash., April 30, 2024--T-Mobile US, Inc. (NASDAQ: TMUS) (\"T-Mobile\") announced today that T-Mobile USA, Inc., its direct wholly-owned subsidiary (\"T-Mobile USA\" or the \"Issuer\"), plans to offer, subject to market and other conditions, euro-denominated senior notes (the \"notes\") in a registered public offering. T-Mobile USA intends to use the net proceeds from the offering for general corporate purposes, which may include among other things, share repurchases, any dividends declared by"}, {"date": "20240430041711", "headline": "T-Mobile US, Inc. Just Beat EPS By 7.5%: Here's What Analysts Think Will Happen Next", "summary": "T-Mobile US, Inc. ( NASDAQ:TMUS ) came out with its quarterly results last week, and we wanted to see how the business..."}, {"date": "20240430072818", "headline": "4 Buyable Berkshire DiviDogs From April, Plus 5 To Watch", "summary": "25 of 41 current BKH owned stocks pay dividends.Â Read more to see a detailed analysis of the stocks listedÂ in this article."}, {"date": "20240430074510", "headline": "Why T-Mobile (TMUS) is a Top Growth Stock for the Long-Term", "summary": "Wondering how to pick strong, market-beating stocks for your investment portfolio? Look no further than the Zacks Style Scores."}, {"date": "20240430093107", "headline": "T-Mobile US, Inc. (NASDAQ:TMUS) Q1 2024 Earnings Call Transcript", "summary": "T-Mobile US, Inc. (NASDAQ:TMUS) Q1 2024 Earnings Call Transcript April 25, 2024 T-Mobile US, Inc. beats earnings expectations. Reported EPS is $2, expectations were $1.87. T-Mobile US, Inc. isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good afternoon. All participants […]"}, {"date": "20240430113421", "headline": "Crushed From $60 To $40, Is It Time To Buy 6.6% Yielding Verizon?", "summary": "Telco businesses have fallen out of favor with investors due to rising interest rates and high leverage. Read why is it time to buy 6.6% yielding Verizon here."}, {"date": "20240430143000", "headline": "T-Mobile Agrees to Sell €2.0 Billion of Euro-Denominated Senior Notes", "summary": "BELLEVUE, Wash., April 30, 2024--T-Mobile US, Inc. (NASDAQ: TMUS) (\"T-Mobile\") announced today that T-Mobile USA, Inc., its direct wholly-owned subsidiary (\"T-Mobile USA\" or the \"Issuer\"), has agreed to sell €600,000,000 aggregate principal amount of its 3.550% Senior Notes due 2029 (the \"2029 Notes\"), €750,000,000 aggregate principal amount of its 3.700% Senior Notes due 2032 (the \"2032 Notes\") and €650,000,000 aggregate principal amount of its 3.850% Senior Notes due 2036 (the \"2036 Notes,\" an"}, {"date": "20240430214008", "headline": "T-Mobile Expands Advertising Solutions Business with New Products and Partnerships", "summary": "* With an omnichannel offering, T-Mobile Advertising Solutions transforms the way brands reach their target audience, giving advertisers a next-level way to engage with consumersBELLEVUE, Wash. -..."}, {"date": "20240501000100", "headline": "Unlocking Intrinsic Value: Analysis of T-Mobile US Inc", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501010000", "headline": "Insider Selling at T-Mobile US Inc (TMUS): Director and 10% Owner Telekom Deutsche Sells Shares", "summary": "On April 30, 2024, Telekom Deutsche, Director and 10% Owner of T-Mobile US Inc (NASDAQ:TMUS), executed a sale of 379,340 shares of the company."}, {"date": "20240501054800", "headline": "Behind the Scenes of T-Mobile US's Latest Options Trends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501062700", "headline": "T-Mobile announces completion of acquisition of Ka'ena Corporation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501075010", "headline": "Why T-Mobile (TMUS) is a Top Momentum Stock for the Long-Term", "summary": "The Zacks Style Scores offers investors a way to easily find top-rated stocks based on their investing style. Here's why you should take advantage."}, {"date": "20240501111800", "headline": "Mint and Ultra: Welcome to the T-Mobile Family!", "summary": "BELLEVUE, Wash., May 01, 2024--The deal is done! T-Mobile US Inc. (NASDAQ: TMUS) today announced the completion of its acquisition of Ka’ena Corporation, which includes direct-to-consumer (D2C) prepaid wireless brands Mint Mobile, internationally-focused value brand Ultra Mobile, and wholesale wireless solutions provider Plum. And, as it does, the Un-carrier is letting Mint and Ultra customers know it’s great to have them here by giving them magenta goodness right out of the gate – a few freebie"}, {"date": "20240502000300", "headline": "Stock Market Crash Alert: 3 Must-Buy Warren Buffett Stocks When Prices Plunge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502022925", "headline": "XLC: An Eclectic Growth ETF", "summary": "XLC ETF is a surprisingly high growth portfolio (18% EPS growth) at a reasonable valuation at 1.1x PEG. Read why I think the fund has substantial upside."}, {"date": "20240502071500", "headline": "T-Mobile Is a Top Military Employer — Here’s Why!", "summary": "NORTHAMPTON, MA / ACCESSWIRE / May 2, 2024 / T-Mobile As the Un-carrier celebrates hitting its cumulative goal of hiring 10,000 veterans and military spouses over the past five years, leaders at partner organizations Hiring Our Heroes and Blue Star ..."}, {"date": "20240502123400", "headline": "Maui sues cell carriers over wildfire warning alerts that were never received during service outages", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503011000", "headline": "Clearfield just upgraded at Northland, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240504065800", "headline": "Insider Selling at T-Mobile US Inc (TMUS): Director, 10% Owner Telekom Deutsche Sells Shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}]}