{"news": [{"date": "20240407160000", "headline": "Uber-Backed E-Bike Startup Lime Planning Global Fleet Expansion", "summary": "(Bloomberg) -- Lime, the operator of a shared electric bike and scooter network backed by Uber Technologies Inc., is planning to invest more than $55 million this year to expand its global fleet. Most Read from BloombergTrumpism Is Emptying ChurchesRBC Fires CFO Ahn After Probe Into Personal RelationshipThe Odds of $100 Oil Are Rising as Supply Shocks Convulse the MarketYellen Implores China to Rethink Economic Growth StrategyWhy India’s South Rejects Modi — And Why It MattersThe San Francisco-b"}, {"date": "20240408080000", "headline": "Best Momentum Stocks to Buy for April 8th", "summary": "SM, GOEV and UBER made it to the Zacks Rank #1 (Strong Buy) momentum stocks list on April 8, 2023."}, {"date": "20240408100009", "headline": "All You Need to Know About Uber (UBER) Rating Upgrade to Strong Buy", "summary": "Uber (UBER) has been upgraded to a Zacks Rank #1 (Strong Buy), reflecting growing optimism about the company's earnings prospects. This might drive the stock higher in the near term."}, {"date": "20240408101315", "headline": "Uber Joins Nvidia, Meta On Two Exclusive Lists — With A Bonus", "summary": "Uber stock sets up its latest potential breakout move as it joins Nvidia and Meta on IBD Leaderboard and this list of new buys by top funds."}, {"date": "20240408114300", "headline": "Top Research Reports for SAP, Verizon Communications & Lowe's", "summary": "Today's Research Daily features new research reports on 16 major stocks, including SAP SE (SAP), Verizon Communications Inc. (VZ) and Lowe's Companies, Inc. (LOW)."}, {"date": "20240408191400", "headline": "Meet Grab: Southeast Asia’s post-Uber “everything app”", "summary": "While you may never have heard of it, the Grab app has become as ubiquitous in southeast Asia as Uber, DoorDash, and Venmo are in the U.S. — and it just posted a profit for the first time since listing on the Nasdaq in 2021."}, {"date": "20240409002652", "headline": "India's Ola to stop ride-hailing operations in international markets", "summary": "Ola said on Tuesday it was exiting its ride-hailing businesses in the UK, Australia and New Zealand as the startup focuses on its home market India, where it is locked in a battle for market share..."}, {"date": "20240409020000", "headline": "Uber, Aptiv And A Major Airline Stock On CNBC's 'Final Trades'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409020000", "headline": "Uber: Cash Is King, Free Cash Flow Is Queen", "summary": "With rapidly increasing scale and free cash flow generation, Uber is turning into an infinite buyback pump. Find out if UBER stock is a buy."}, {"date": "20240409033000", "headline": "Tesla: When The Time Comes To Buy, You Won't Want To (Rating Upgrade)", "summary": "Tesla stock has underperformed the S&P 500 by 45% since our initial bearish article in November. See why I upgrade TSLA stock from sell to buy."}, {"date": "20240409033830", "headline": "Uber: Are Robotaxis A Threat? (Rating Downgrade)", "summary": "We've been bullish on Uber in the past, and the stock has gone on quite the run over the last few quarters. See why we downgrade UBER from strong buy to hold."}, {"date": "20240409050400", "headline": "Announcement On Tesla Robo Taxis Ahead – Opportunities For Investors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409095459", "headline": "Uber Eats Embraces TikTok Wave with New Short-Form Video Discovery Tool", "summary": "Uber Technologies, Inc’s (NYSE:UBER) Uber Eats is introducing a TikTok-style short-form video feature to enhance food discovery and enable restaurants to highlight their offerings more vividly. This feature, which is currently undergoing testing in New York, San Francisco, and Toronto, represents Uber Eats’ foray into the burgeoning realm of short-form video content, aligning with a trend popularized by platforms like Meta Platforms Inc (NASDAQ:META) Instagram, Alphabet Inc (NASDAQ:GOOG) (NASDAQ"}, {"date": "20240409154517", "headline": "Uber Technologies (UBER) Stock Moves 0.15%: What You Should Know", "summary": "In the most recent trading session, Uber Technologies (UBER) closed at $75.14, indicating a +0.15% shift from the previous trading day."}, {"date": "20240409192200", "headline": "General Motors (NYSE:GM) Takes Cautious Approach to Revive Self-Driving Unit", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409202100", "headline": "Uber, Emerson Electric, Caterpillar among top industrial Quant picks ahead of Q1 earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409225000", "headline": "If You Can Only Buy One Meme Stock in April, It Better Be One of These 3 Names", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410031108", "headline": "Set it and Forget it: How to Maximize Your Safety Features", "summary": "Going out at night should be fun and safe. Instead, 53% of women reported feeling unsafe at night even when walking alone within a mile from their home. Whether..."}, {"date": "20240410050100", "headline": "New additions to Goldman’s High Operating Leverage list", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410055000", "headline": "Uber Empowers Women Passengers With Enhanced Safety Features Amid Rising Concerns", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410064900", "headline": "Global Stock leaders for 2030 in Enabling Tech - UBS", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240410085042", "headline": "Uber boosts safety features for passengers", "summary": "Uber Technologies said on Wednesday that it is boosting its safety features for passengers around the world, as it looks to minimize risk and ensure security for women at night.  The features allow passengers during a ride to select up to four safety preferences including encrypted audio recordings, PIN verification and live location sharing.  Uber has been facing scrutiny for years regarding its responses to thousands of alleged assaults by drivers with complaints ranging from failure to conduct proper background checks on drivers to inadequate safety training."}, {"date": "20240410085436", "headline": "Uber boosts safety features aimed at women passengers", "summary": "The features allow passengers during a ride to select up to four safety preferences including encrypted audio recordings, PIN verification and live location sharing.  Uber has been facing scrutiny for years regarding its responses to thousands of alleged assaults by drivers with complaints ranging from failure to conduct proper background checks on drivers to inadequate safety training.  The company faces a number of lawsuits from victims accusing the ride-sharing platform of failing to prevent sexual assaults against passengers."}, {"date": "20240410094252", "headline": "UPDATE 1-Uber boosts safety features aimed at women passengers", "summary": "Uber Technologies said on Wednesday that it is boosting its safety features for passengers around the world, as it looks to minimize risk and ensure security for women at night.  The features allow passengers during a ride to select up to four safety preferences including encrypted audio recordings, PIN verification and live location sharing.  Uber has been facing scrutiny for years regarding its responses to thousands of alleged assaults by drivers with complaints ranging from failure to conduct proper background checks on drivers to inadequate safety training."}, {"date": "20240410224600", "headline": "Lyft, Uber shares climb as Minneapolis delays ride-share wage hike until July", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411012600", "headline": "Uber and Lyft delay plans to leave Minneapolis after driver pay-raise plan pushed back", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411034700", "headline": "Unpacking the Latest Options Trading Trends in Uber Technologies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411044100", "headline": "The consumer boycott of Planet Fitness is seen fading like other well-known examples", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411050100", "headline": "Interesting UBER Put And Call Options For May 31st", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411064606", "headline": "Minneapolis expected to give Uber and Lyft a reason to stick around — at least until July", "summary": "Lyft and Uber might hit reverse on plans to leave Minneapolis by May 1 over a new minimum wage for rideshare drivers set to go into effect on that day, if a city council measure passes Thursday."}, {"date": "20240411124800", "headline": "3 Buy-Rated Companies Enjoying Stellar Sales Growth", "summary": "Consistent sales growth is key, as it's the foundation of generating profits. And when it comes to top-line compounders, these three companies stick out in a big way."}, {"date": "20240411170250", "headline": "Uber and Lyft delay their plans to leave Minneapolis after officials push back driver pay plan", "summary": "The ride-hailing companies Uber and Lyft said they will delay their planned exit from Minneapolis after city officials decided Wednesday to push back the start of a driver pay raise by two months.  The Minneapolis City Council voted unanimously to implement the ordinance on July 1 instead of May 1."}, {"date": "20240411192400", "headline": "Uber And Lyft's Minneapolis Exit Delayed As Wage Ordinance Postponed", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411213100", "headline": "Wall Street Favorites: 3 Long-Term Stocks With Strong Buy Ratings for April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411213437", "headline": "Uber and Lyft delay their plans to leave Minneapolis", "summary": "The Minneapolis City Council voted unanimously on Wednesday to implement the ordinance that ensures rideshare drivers in the city are paid a minimum wage of $15.57 an hour from July 1 instead of May 1, the Associated Press reported on Thursday.  \"The ordinance is unsustainable for our customers and would force us to shut down operations in Minneapolis when the ordinance does inevitably take effect,\" a Lyft spokesperson told Reuters.  Lyft and Uber had originally planned to stop operations in Minneapolis starting May 1."}, {"date": "20240412033916", "headline": "Tesla's Robotaxi Plans Face Major Challenges", "summary": "Tesla, Inc. CEO Elon Musk's plan to launch a robotaxi service brings potential profitability, but there are many hurdles to overcome. Explore more details here."}, {"date": "20240412065400", "headline": "Zacks Investment Ideas feature highlights: Uber Technologies, Dream Finders Home and NVIDIA", "summary": "Uber Technologies, Dream Finders Home and NVIDIA are part of the Zacks Investment Ideas article."}, {"date": "20240412070014", "headline": "Investors Heavily Search Uber Technologies, Inc. (UBER): Here is What You Need to Know", "summary": "Uber (UBER) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects."}, {"date": "20240413023022", "headline": "Uber: Increasing Uber One Members Boost Booking Growth", "summary": "Discover why Uber's stock is undervalued with potential for growth in margin and free cash flow. Read the article to learn more about the buy rating."}, {"date": "20240413031500", "headline": "Will Uber Reach a Trillion-Dollar Market Cap by 2035?", "summary": "The ride-hailing and delivery company's shares have been on an incredible run."}, {"date": "20240413064300", "headline": "Will The Growth Of Indexing Lead To Its Downfall?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240413193918", "headline": "10 Unstoppable Stocks That Will Make You Richer", "summary": "In this article, we discuss the 10 unstoppable stocks that will make you richer. To skip the detailed analysis of the economy and market, go directly to the 5 Unstoppable Stocks That Will Make You Richer. On April 12, the week closed out with stocks tumbling as the S&P 500 recorded its worst day since […]"}, {"date": "20240413220300", "headline": "Boeing weighs on large-cap industrials in turbulent week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414020500", "headline": "California's fast-food chains weigh options after AB 1228", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414031800", "headline": "Zomato (ZOMATO) Shares Skyrocket, Analysts Hustle to Update Forecasts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414165200", "headline": "Minimum pay for Uber, Lyft drivers in Minneapolis pushed back to July", "summary": "A new law in Minneapolis that was to go into effect May 1 on Uber, Lyft compensation has been delayed. The post Minimum pay for Uber, Lyft drivers in Minneapolis pushed back to July appeared first on FreightWaves."}, {"date": "20240414205424", "headline": "Portfolio Review: The Cat, The Tortoise And Me", "summary": "For many investors, navigating the complexities of the financial markets can feel like a jungle. See my thematic portfolios inspired by animal archetypes."}, {"date": "20240414215200", "headline": "What the Options Market Tells Us About Uber Technologies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415023400", "headline": "How Is The Market Feeling About Uber Technologies?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415035509", "headline": "Electric air taxis are nearing launch. Here’s how to invest.", "summary": "You could be flying above traffic to the airport in an electric air taxi for the same cost as an Uber (UBER) by 2025, at least according to Joby Aviation (JOBY). Electric Vertical Takeoff and Landing vehicles (eVTOLs) promise efficient, battery-powered transport akin to urban Ubers or Lyfts (LYFT) in the sky. With backing from major players like Delta (DAL) and Toyota (TM), Joby thinks they can be first to market in the crowded space. However, regulatory approval remains a key hurdle. The Federal Aviation Administration thinks a competitive, scaled air taxi market could launch in at least one location by 2028. Yahoo Finance spoke with industry investors, officials, and analysts, and traveled to Joby’s manufacturing facility in Marina, CA, to get a closer look at what to expect from this emerging sector. For those looking to play the future of aviation, regulatory hurdles, lack of infrastructure, and customer affordability are among the top considerations when sussing out eVTOL investments. If you’re going to future-proof your portfolio, you need to know what’s NEXT. In this series, Yahoo Finance will feature stories that give a glimpse at the future, and show how companies are making big moves today that will matter tomorrow. For more on our NEXT series, click here, and tune in to Yahoo Finance Live for more expert insight and the latest market action, Monday through Friday. Editor's note: This article was written by Luke Brooks."}, {"date": "20240415040200", "headline": "Is Uber Technologies Inc (UBER) Set to Underperform? Analyzing the Factors Limiting Growth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415052649", "headline": "Tesla: An Underappreciated Problem With FSD", "summary": "US infrastructure issues challenge Tesla's self-driving goals as the current GPS falls short in accuracy, leaving room for rivals. Read more on TSLA stock here."}, {"date": "20240415053900", "headline": "Nvidia is the No. 1 S&P 500 growth stock in this screen. See which other companies joined or left the list.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415083039", "headline": "Entrepreneur Naval Ravikant launches voice-centric social media app AirChat", "summary": "April 15 - Venture capitalist Naval Ravikant has rolled out a socialmedia app centered around communicating through voice notes,looking to challenge the..."}, {"date": "20240415095600", "headline": "3 Picks from the Still-Strong Internet Services Industry", "summary": "A rate cut this year would be a tailwind for the capital-intensive Internet - Services industry although the economic slowdown reduces visibility. Crexendo (CXDO), Upwork (UPWK) and Uber (UBER) are worth picking from this very broad-based industry."}, {"date": "20240415135438", "headline": "Jetsons-like travel in air taxis is 'as close as we've seen,' Joby's chief product officer says", "summary": "With backing from companies like Delta, United, and Boeing, air taxi startups say they plan to launch commercial flights by 2025. Will battery-powered Ubers in the sky be the norm?"}, {"date": "20240415142214", "headline": "3 Stocks to Buy Now Before the Robotaxi Revolution", "summary": "When Tesla (NASDAQ:TSLA) founder and CEO Elon Musk announced a date of August 8 for its robotaxi event, the stock managed to nudge higher amid its multi-year downturn. Though shares have since reversed lower again, everybody will tune in when Musk hits the stage this summer. The company’s potential innovations may just be able to help Tesla regain its magnificence. Undoubtedly, the nascent robotaxi market has experienced setbacks over the past year. With General Motors (NYSE:GM) pulling back on"}, {"date": "20240415231500", "headline": "These 10 \"Low PEG Ratio\" AI Stocks Have Out-Performed The Sector Almost 10-Fold YTD", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416001400", "headline": "Amazon remains best internet idea at JPMorgan into earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416020100", "headline": "DoorDash price target raised by $15 at Deutsche Bank, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416024800", "headline": "Zacks Industry Outlook Highlights Crexendo, Upwork and Uber", "summary": "Crexendo, Upwork and Uber have been highlighted in this Industry Outlook article."}, {"date": "20240416035509", "headline": "Ohio man fatally shot Uber driver after scammers targeted both of them, authorities say", "summary": "SOUTH CHARLESTON, Ohio — An elderly Ohio man who authorities say fatally shot an Uber driver who he thought was trying to rob him after a scam caller deceived them both has been indicted on a..."}, {"date": "20240416035600", "headline": "GRAB, ZS, SONO: Which “Strong Buy” Tech Stock Is the Better Buy?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240416080000", "headline": "Best Momentum Stock to Buy for April 16th", "summary": "NPSNY, UBER and AMAT made it to the Zacks Rank #1 (Strong Buy) momentum stocks list on April 16, 2024."}, {"date": "20240416083908", "headline": "JPMorgan names Amazon 'best idea' in 2024", "summary": "As the first quarter earnings season progresses, analysts at JPMorgan (JPM) have taken a bullish stance on the internet sector. The investment bank is particularly positive about names like Netflix (NFLX), Meta (META), and Uber (UBER). However, JPMorgan's top pick among the group is Amazon (AMZN), which the firm calls its \"best idea\" for 2024. Yahoo Finance's Seana Smith and Brad Smith break down the details. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Angel Smith"}, {"date": "20240416091134", "headline": "Ohio man fatally shot Uber driver after scam phone calls targeted both of them, authorities say", "summary": "SOUTH CHARLESTON, Ohio — An elderly Ohio man who authorities say fatally shot an Uber driver who he thought was trying to rob him after scam phone calls deceived them both has been indicted on..."}, {"date": "20240416094611", "headline": "Why a ‘collapse’ of younger VC firms may not be a bad thing, according to a top angel investor who backed Uber and Robinhood", "summary": "Careless investors were seeding companies and shouldn’t have been, said Jason Calacanis, who’s happy to see “venture tourism” evaporate."}, {"date": "20240416114943", "headline": "Uber Portugal office raided in tax probe of delivery partners", "summary": "Portuguese police and tax agents searched the premises of Uber Technologies in Lisbon on Tuesday as part of a wider investigation and raids targeting some of its delivery partners, but not the U.S.-based company's local unit, Uber said.  In a statement, Uber confirmed the searches and said \"Uber is not the targeted entity\".  The Public Prosecutor's Office said in a separate statement officers conducted 65 searches on Tuesday in an investigation of suspected tax fraud worth 28 million euros ($30 million)."}, {"date": "20240416143000", "headline": "Uber Announces Date of First Quarter 2024 Results Conference Call", "summary": "SAN FRANCISCO, April 16, 2024--Uber Technologies, Inc. (NYSE: UBER) will hold its quarterly conference call to discuss its first quarter 2024 financial results on Wednesday, May 8th at 5:00 a.m. Pacific Time (8:00 a.m. Eastern Time)."}, {"date": "20240416145544", "headline": "Grindr Goes Beyond Dating", "summary": "How do you grow a business where a customer's success often means they leave your product?"}, {"date": "20240416154519", "headline": "Why Uber Technologies (UBER) Outpaced the Stock Market Today", "summary": "In the closing of the recent trading day, Uber Technologies (UBER) stood at $74.27, denoting a +1.18% change from the preceding trading day."}, {"date": "20240416181500", "headline": "Time to Buy Lyft or Uber Technologies Stock for More Upside?", "summary": "Let's see if there could be more upside in Lyft (LYFT) or Uber Technologies (UBER) shares and if their stocks should be considered after a market correction."}, {"date": "20240416200700", "headline": "Uber aiding investigation into account that sent driver to Ohio home where she was killed", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417013015", "headline": "Uber Technologies : The 2024 Uber Lost & Found Index", "summary": "With Mercury in Retrograde, which astrologists say influences forgetfulness, we're back with the eighth annual Uber Lost & Found Index - a snapshot of the most surprising and most..."}, {"date": "20240417040200", "headline": "Exploring The Competitive Space: Uber Technologies Versus Industry Peers In Ground Transportation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417052700", "headline": "New constituents of Goldman Sachs’ ROE growth basket", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417060013", "headline": "Here's Your Second Chance To Own 7 Leading Stocks Like Nvidia", "summary": "Tired of listening to your neighbors bragging about all their winning S&P 500 stocks. You just got another shot at some."}, {"date": "20240417110554", "headline": "7 Stocks the Hedge Fund Gurus Are Piling Into: April 2024", "summary": "With a lot of uncertainty in the market from geopolitics down to monetary policy, jittery investors may find comfort in hedge fund picks. Specifically, ideas that the alpha wolves of the market have put their money into may offer both confidence and upside. When I think about this theme, I can’t help but recall the film “Wall Street” (the original one). The antihero of the movie, Gordon Gekko, remarks that he hates losses. Instead, he prefers sure things, which eventually moves the narrative for"}, {"date": "20240417114614", "headline": "FIDU: Industrials Dashboard For April", "summary": "Industrials are the second most overpriced sector behind technology, but some subsectors are moderately overvalued. Read more on FIDU ETF here."}, {"date": "20240417123151", "headline": "Uber is helping investigators look into account that sent driver to Ohio home where she was killed", "summary": "Uber is helping investigators look into the account that sent a driver to the Ohio home where an 81-year-old man allegedly shot the woman to death because he erroneously believed she was part of a scam, the ride-hailing company said Wednesday.  The March 25 shooting death of Loletha Hall is “a horrific tragedy,\" and that account has since been banned, an Uber spokesperson wrote in an emailed statement.  William J. Brock was indicted Monday on charges of murder, felonious assault and kidnapping for Hall's death."}, {"date": "20240417143000", "headline": "Put $500 in These 3 Tech Stocks Before May", "summary": "Technology stocks have outperformed other sectors since the turn of the year, collectively outpacing their nearest counterpart (financial services) by more than 2x. Although technology stocks can be cyclical, many are secular, meaning they possess the means to deliver returns throughout the economic cycle. As such, adding high-quality technology stocks to your portfolio is always a good idea. Investing in technology ETFs is an option if you’re looking for low-risk exposure. However, cherry-picki"}, {"date": "20240417195700", "headline": "Serve Robotics Inc. Announces Pricing of $40 Million Public Offering and Uplisting to the Nasdaq Capital Market Under New Ticker \"SERV\"", "summary": "Serve Robotics Inc. (the \"Company\" or \"Serve\"), a leading autonomous sidewalk delivery company, today announced the pricing of its underwritten public offering of 10,000,000 shares of common stock at a price to the public of $4.00 per share, for aggregate gross proceeds of $40 million, prior to deducting underwriting discounts and offering expenses. The offering includes the participation of one of Serve's largest stockholders and strategic partners, Postmates, LLC, a wholly-owned subsidiary of"}, {"date": "20240417235600", "headline": "Loop Capital starts Instacart at Buy on growing market share", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418002500", "headline": "Serve Robotics prices $40M public offering, uplisting to Nasdaq", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418010100", "headline": "7 Penny Growth Stocks to Buy ASAP Before They Go Parabolic", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418030600", "headline": "Serve Robotics opens at $4.75, IPO priced at $4", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418040000", "headline": "Zacks Investment Ideas feature highlights: Nvidia, Arista, Applied Materials and Uber", "summary": "Nvidia, Arista, Applied Materials and Uber have been highlighted in this Investment Ideas article."}, {"date": "20240418221800", "headline": "Getir Evaluates Strategic Options Amid Financial Strain", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419003200", "headline": "Meme Stock Massacre: 3 Reddit Darlings on the Brink of Collapse", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419023600", "headline": "SoftBank-backed Indian ride-hailing firm Ola plans for $500M IPO - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419031503", "headline": "Uber Eats links up with Forage for SNAP", "summary": "Starting later this year, the payment option will become available to all eligible grocery partners on the delivery provider’s platform."}, {"date": "20240419032300", "headline": "Uber price target raised by $24 at Tigress Financial, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419032600", "headline": "Buy Rating for Uber: Strong Growth and Share Buyback Signal Confidence in Expansion and Innovation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419044600", "headline": "Defense and infrastructure improves Industrials - SSGA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419050400", "headline": "Expert Ratings For Uber Technologies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419073010", "headline": "Is Uber (UBER) a Buy as Wall Street Analysts Look Optimistic?", "summary": "According to the average brokerage recommendation (ABR), one should invest in Uber (UBER). It is debatable whether this highly sought-after metric is effective because Wall Street analysts' recommendations tend to be overly optimistic. Would it be worth investing in the stock?"}, {"date": "20240419204800", "headline": "SPDR ETF Report For Friday, April 19", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420042900", "headline": "Sell in May and Go Away? Absolutely Not -- 2 Stocks You'll Want to Buy Instead", "summary": "Seasonality is a factor in the stock market, but it isn't a reason to abandon your long-term investment strategy."}, {"date": "20240420050000", "headline": "Have $100? 1 Magnificent Stock to Buy Hand Over Fist Now", "summary": "Investors who don't have access to fractional share purchases can buy this growth stock for less than $100."}, {"date": "20240420200800", "headline": "3 Travel Stocks to Buy Now: Q2 Edition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240420232500", "headline": "Opening Day: Ibotta soars in strong market debut", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421023900", "headline": "This Year's Average Tax Refund Was $3,011, According to the IRS. 3 Excellent Stocks You Can Buy for Less", "summary": "A tax refund is your money, not the government's. Put those funds to good use."}, {"date": "20240421084944", "headline": "11 Hot Growth Stocks To Buy Right Now", "summary": "In this article, we discuss the 11 hot growth stocks to buy now. If you want to read about some more growth stocks that are active in the market, go directly to the 5 Hot Growth Stocks To Buy Right Now. As 2024 moves forward, the outlook for both the stock and bond markets undergoes […]"}, {"date": "20240421212600", "headline": "Top high growth investment ratio stocks from each sector - GS", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421235200", "headline": "Take A Look: Only These 17 AI Stocks Are Undervalued", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422012700", "headline": "Micron, Uber And A Consumer Products Giant On CNBC's 'Final Trades'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422033500", "headline": "Where Will Uber Stock Be in 1 Year?", "summary": "Uber management has turned the company into a self-sustaining business with solid cash flow."}, {"date": "20240422034800", "headline": "August 16th Options Now Available For Uber Technologies (UBER)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422035010", "headline": "Gig Economy Stocks Q4 Earnings Review: DoorDash (NYSE:DASH) Shines", "summary": "The end of an earnings season can be a great time to discover new stocks and assess how companies are handling the current business environment. Let’s take a look at how DoorDash (NYSE:DASH) and the rest of the gig economy stocks fared in Q4."}, {"date": "20240422073506", "headline": "After Plunging -13.75% in 4 Weeks, Here's Why the Trend Might Reverse for Uber (UBER)", "summary": "Uber (UBER) has become technically an oversold stock now, which implies exhaustion of the heavy selling pressure on it. This, combined with strong agreement among Wall Street analysts in revising earnings estimates higher, indicates a potential trend reversal for the stock in the near term."}, {"date": "20240422131309", "headline": "10 Best Multibagger Stocks to Buy Now", "summary": "In this article, we discuss the 10 best multibagger stocks to buy now. To skip the details about our prior multibagger stocks, go to 5 Best Multibagger Stocks to Buy Now. Multibagger is a term commonly used to describe a stock that has generated returns of over 100%. It was coined by Peter Lynch, former […]"}, {"date": "20240422141500", "headline": "Serve Robotics Inc. Announces Closing of $40 Million Public Offering and Uplisting to the Nasdaq Capital Market Under New Ticker \"SERV\"", "summary": "Serve Robotics Inc. (the \"Company\" or \"Serve\"), a leading autonomous sidewalk delivery company, today announced the closing of its underwritten public offering of 10,000,000 shares of common stock at a price to the public of $4.00 per share, for aggregate gross proceeds of $40 million, prior to deducting underwriting discounts and offering expenses. The offering included the participation of one of Serve's largest stockholders and strategic partners, Postmates, LLC, a wholly-owned subsidiary of"}, {"date": "20240422154519", "headline": "Uber Technologies (UBER) Stock Dips While Market Gains: Key Facts", "summary": "The latest trading day saw Uber Technologies (UBER) settling at $68.98, representing a -0.32% change from its previous close."}, {"date": "20240422225400", "headline": "UBS Group Eyeing West? Plans New Office In Menlo Park, Hires Barclay's Lynch, Silicon Valley Expansion In Sight: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422230700", "headline": "Tesla extends its gain after Elon Musk says robotaxi fleet could make non-autonomous cars obsolete", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423014900", "headline": "Uber Stock (NYSE:UBER) Gets a Lift from Tigress Analyst", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423021300", "headline": "2 Top Artificial Intelligence (AI) Growth Stocks With More Than 20% Upside, According to Wall Street", "summary": "Find out why analysts are fired up about these stocks to see if they could be right for you."}, {"date": "20240423050400", "headline": "Behind the Scenes of Uber Technologies's Latest Options Trends", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423073506", "headline": "Here's Why Uber (UBER) is Poised for a Turnaround After Losing -13.13% in 4 Weeks", "summary": "The heavy selling pressure might have exhausted for Uber (UBER) as it is technically in oversold territory now. In addition to this technical measure, strong agreement among Wall Street analysts in revising earnings estimates higher indicates that the stock is ripe for a trend reversal."}, {"date": "20240423084409", "headline": "Rideshare platform Uber expands to Newfoundland and Labrador", "summary": "ST. JOHN'S, N.L. — Uber Technologies Inc. says it has brought its ridesharing platform to Newfoundland and Labrador.The U.S. tech company says its services will be available throughout the Avalon..."}, {"date": "20240423150832", "headline": "Tesla Planning Ride-Hailing App", "summary": "Tesla has hinted for years that it wants to launch a ride-hailing app, and now it is previewing what that could look like.  The company says it has been investing in the hardware and software needed to achieve fully autonomous technology and to launch a ride-hailing service.  In a slide deck previewing the service, the automaker included an image of a Model Y SUV as a vehicle responding to pick up a passenger—indicating Tesla doesn't want to only have its robotaxi models on the network."}, {"date": "20240423190100", "headline": "The Next Ad Battleground Will Be the Back Seat of Your New York City Uber", "summary": "Taking an Uber or Lyft in New York City has long been one of the few ways that locals and tourists alike could escape the relentless creep of digital video advertising. Not for much longer."}, {"date": "20240423235100", "headline": "Uber and Lyft fall after Elon Musk talks up robotaxi concept", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424004900", "headline": "Uber price target raised by $3 at Jefferies, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424021916", "headline": "Aggressive Investors Should Keep An Eye On Uber: Competitive Advantages, Strong Fundamentals", "summary": "Uber has substantial potential upside from self-driving taxis for investors willing to speculate. See why UBER stock is a Buy."}, {"date": "20240424033500", "headline": "2 No-Brainer Stocks to Buy Now With $200 and Hold Long Term", "summary": "These companies have a strong presence in growing markets and shares trade at reasonable valuations. Those qualities could send both stocks higher in the long term."}, {"date": "20240424041317", "headline": "Klarna to offer payment services on Uber's platform", "summary": "Sweden's Klarna on Wednesdaypartnered with Uber Technologies to offer its paymentservices across the company's ridesharing and food deliveryplatforms in a few markets, including the United States...."}, {"date": "20240424043900", "headline": "Uber-Backed Serve Robotics Expands Production Partnership With Automotive Supplier Magna", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424055300", "headline": "Uber (NASDAQ:UBER) Plunges after New Deal with Klarna", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424063900", "headline": "10 Industrials Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424070015", "headline": "Uber Technologies, Inc. (UBER) Is a Trending Stock: Facts to Know Before Betting on It", "summary": "Uber (UBER) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects."}, {"date": "20240424090937", "headline": "Elon Musk insists Tesla isn’t a car company as sales falter", "summary": "As Tesla's profits sink, Musk reaches for an autonomous future."}, {"date": "20240424092246", "headline": "How the Target and Uber cyberattacks from years ago shaped public perception of cybersecurity today", "summary": "The high-profile hackings of Target in 2013 and Uber in 2016 brought put cybersecurity in the national spotlight. However, cyberthreats since then have only grown more sophisticated."}, {"date": "20240424101638", "headline": "12 Best Growth Stocks to Buy and Hold in 2024", "summary": "In this piece, we will take a look at the 12 best growth stocks to buy and hold in 2024. If you want to skip our overview of growth stocks and how they relate to the current stock market environment, then you can take a look at the 5 Best Growth Stocks to Buy and […]"}, {"date": "20240424103401", "headline": "$122 Thai delivery and $26 to-go coffees: New wage laws meant to help gig workers are backfiring big-time", "summary": "The new wage laws are causing food takeout prices to skyrocket and delivery orders to tank."}, {"date": "20240424123400", "headline": "Uber and Lyft Stock Fall on Robotaxi Worries. That Doesn’t Make Sense.", "summary": "Comments from Tesla CEO Elon Musk seem to be putting pressure on shares of the ride-hailing companies."}, {"date": "20240424183607", "headline": "Uber Technologies : and ITF Launch Global Safety Charter for Couriers", "summary": "Global transport workers' union and Uber launch safety charter for couriers, as social dialogue continues under new agreement The International Transport Workers'..."}, {"date": "20240424214000", "headline": "Uber Technologies Inc. stock outperforms market despite losses on the day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425040000", "headline": "Uber Stock Is Up a Phenomenal 120% in 1 Year: But Is Now the Time to Buy?", "summary": "This industry-leading enterprise is winning over investors in remarkable fashion."}, {"date": "20240425043000", "headline": "3 Tech Stocks That Will Post Sizzling Gains This Summer", "summary": "As summer inches closer, cracks are starting to form in this resilient bull market. No one can say for certain whether we’re headed for another swoon or a fiery comeback akin to 2023’s summer surge. But one thing’s for sure – you can never go wrong loading up on high-quality stocks for the long-haul. These battle-tested titans rarely disappoint, no matter how choppy the near-term waters get. Besides, I’ve got a hunch the Federal Reserve could toss us a bone with at least one rate cut this year."}, {"date": "20240425063800", "headline": "10 Industrials Stocks Whale Activity In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425155634", "headline": "13 Best Growth Stocks To Invest In For the Next 5 Years", "summary": "In this article, we discuss 13 best growth stocks to invest in for the next 5 years. If you want to skip our discussion on the stock market landscape, head over to 5 Best Growth Stocks To Invest In For the Next 5 Years. Despite facing fluctuations and pressures, the U.S. stock market has shown […]"}, {"date": "20240425180207", "headline": "Uber Technologies : invests more than $1 billion in Prop 22 benefits for CA Drivers and Couriers", "summary": "Proposition 22 provides historic and important protections and guarantees to workers in California. Since its passage in 2020, California drivers and couriers have received more than..."}, {"date": "20240425200900", "headline": "Bernstein Reaffirms Their Buy Rating on Uber Technologies (UBER)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425224400", "headline": "3 Best Stocks to Buy Now, 4/26/2024, According to Top Analysts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426020000", "headline": "Bull of the Day: Uber Technologies, Inc. (UBER)", "summary": "Uber shares have cooled off to trade at attractive levels for long-term investors given its impressive outlook in businesses it transformed from niche apps for people in select cities into a $50 billion-a-year behemoth."}, {"date": "20240426045500", "headline": "Uber Technologies and RE/MAX have been highlighted as Zacks Bull and Bear of the Day", "summary": "Uber Technologies and RE/MAX are part of the Zacks Bull and Bear of the Day article."}, {"date": "20240426054400", "headline": "Interesting UBER Put And Call Options For June 7th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426054700", "headline": "SPDR ETF Report For Friday, April 26", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426060100", "headline": "JPMorgan's Dimon hopes for soft landing for US economy but says stagflation is a possible scenario", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426064500", "headline": "Got $1,000? 3 Stocks to Buy Now While They're On Sale", "summary": "They're all great companies -- and they're even better investments after their shares' recent sell-offs."}, {"date": "20240427000751", "headline": "Uber: Your Driver Is Here - Initiating With A Buy", "summary": ""}, {"date": "20240428200000", "headline": "Tesla's Robotaxi Plans: Potential Threat Or Future Partner For Uber?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428210600", "headline": "3 Stocks to Buy to Invest Like Sam Altman", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429000100", "headline": "Tractor-trailers with no one aboard? The future is near for self-driving trucks on US roads", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429002600", "headline": "Analysts Offer Insights on Technology Companies: Uber Technologies (UBER), Udemy Inc (UDMY) and ARM Holdings PLC ADR (ARM)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429003700", "headline": "Instacart price target raised by $12 at Oppenheimer, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429003800", "headline": "DoorDash price target raised by $10 at Oppenheimer, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429011000", "headline": "Tractor-trailers with no one aboard? The future is near for self-driving trucks on US roads.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429021500", "headline": "3 Best Growth Stocks to Buy in April 2024, According to Analysts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429034013", "headline": "Domino’s Q1 US sales driven by loyalty, promotions", "summary": "Domestic comps rose 5.6%, the highest increase since 2021, due to rewards member growth, successful marketing campaigns and improved operations."}, {"date": "20240429040100", "headline": "California is joining with a New Jersey company to make a generic opioid overdose reversal drug", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429040543", "headline": "Domino's Pizza beats sales expectations as orders thrive", "summary": "Domino's Pizza topped Wall Street expectations for first-quarter same-store sales on Monday, as consumers in the United States tapped into the pizza chain's spruced-up loyalty program and other promotional offerings.  Domino's has managed to buck a downbeat trend for eating out in the United States, with better returns on its loyalty program and fresh promotional offers drawing inflation-weary consumers to its pizzas and chicken wings.  Domino's U.S. same-store sales rose 5.6% in the quarter, with CEO Russell Weiner saying that the company saw order growth across all income cohorts in the country."}, {"date": "20240429044300", "headline": "Flying Cars are Coming! 3 Stocks to Buy Before They Hit the Skies", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429063100", "headline": "Domino’s Stock Jumps on Earnings Beat. The Pizza Maker Is Seeing Strong Carryout and Delivery Orders.", "summary": "For the first three months of 2024, the company says it grew earnings by 22% from the year-ago period to $3.58 per share."}, {"date": "20240429082329", "headline": "Domino's Pizza Fiscal First-Quarter Results Top Views Amid Higher Carryout, Delivery Orders", "summary": "Domino's Pizza Fiscal First-Quarter Results Top Views Amid Higher Carryout, Delivery Orders"}, {"date": "20240429115849", "headline": "Uber Poised For First-Quarter Earnings, Bookings Beat, BofA Says", "summary": "Uber Poised For First-Quarter Earnings, Bookings Beat, BofA Says"}, {"date": "20240429171516", "headline": "30 Largest Software Companies in the World by Market Cap", "summary": "In this article, we will look into the 30 largest software companies in the world by market cap. If you want to skip our detailed analysis, you can go directly to the 5 Largest Software Companies in the World by Market Cap. Software Industry Outlook According to a report by Morningstar, the total revenue of […]"}, {"date": "20240429214454", "headline": "Q1 2024 Domino's Pizza Inc Earnings Call", "summary": "Q1 2024 Domino's Pizza Inc Earnings Call"}, {"date": "20240429232700", "headline": "Domino's Pizza price target raised by $50 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430012100", "headline": "Domino's Pizza price target raised by $20 at Argus, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430020400", "headline": "Rite Aid expands delivery partnership with Uber Eats", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430020700", "headline": "Apple quietly builds AI dream team, but final product remains mystery: report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430022500", "headline": "Rite Aid expands partnership with Uber Eats to deliver alcohol", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430030300", "headline": "Uber Eats announces exclusive delivery partnership with Domino's in Canada", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430040300", "headline": "Bear of the Day: Hertz", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430040739", "headline": "UPDATE 1-Deliveroo, Just Eat and Uber Eats agree to tackle illegal working in UK", "summary": "Meal delivery companies Deliveroo, Just Eat and Uber Eats have committed to make extra security checks on their British riders, the government said, as it steps up efforts to make it harder for people to work illegally.  The government said a \"small minority\" of riders, who the companies check can work legally, have taken advantage of the system to avoid ensuring their substitutes had the same right to work in Britain.  In response to a freedom of information request submitted by Reuters last year, the government's interior ministry said 42% of riders stopped by an enforcement team over six days in April 2023 were found to be working illegally."}, {"date": "20240430040910", "headline": "Uber ride comes to an end in Pakistan", "summary": "Islamabad, Apr 30, .- Global ride-hailing service Uber announced on Tuesday the closure of its app in Lahore, Pakistan's only city where it was still operating under its name.The announcement marks..."}, {"date": "20240430043716", "headline": "Halal car finance: driving diversity and choice in the UK vehicle financing sector", "summary": "With Sharia-compliant finance gaining momentum in the UK car market, Halal car finance emerges as a crucial choice for drivers prioritising ethical financing solutions, writes Abdullo Kurbanov, Co-Founder & CEO, Ayan Capital."}, {"date": "20240430053000", "headline": "Domino's Pizza Succeeds In Driving More Traffic: Analysts Revise Forecasts After Q1 Results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430090647", "headline": "Scammers stole more than $3.4 billion from older Americans last year, an FBI report says", "summary": "Scammers stole more than $3.4 billion from older Americans last year, according to an FBI report released Tuesday that shows a rise in losses through increasingly sophisticated criminal tactics to trick the vulnerable into giving up their life savings.  Losses from scams reported by Americans over the age of 60 last year were up 11% over the year before, according to the FBI's report.  Investigators are warning of a rise in brazen schemes to drain bank accounts that involve sending couriers in person to collect cash or gold from victims."}, {"date": "20240430154509", "headline": "Why Uber Technologies (UBER) Dipped More Than Broader Market Today", "summary": "In the closing of the recent trading day, Uber Technologies (UBER) stood at $66.27, denoting a -1.68% change from the preceding trading day."}, {"date": "20240501011500", "headline": "Marqeta expands partnership with Uber Eats", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501024900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501033500", "headline": "Check Out What Whales Are Doing With UBER", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501040400", "headline": "Industry Comparison: Evaluating Uber Technologies Against Competitors In Ground Transportation Industry", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501051759", "headline": "Lyft: Ready To Ride - Initiating A Buy Rating", "summary": ""}, {"date": "20240501053725", "headline": "Marqeta expands Uber Eats partnership", "summary": "Marqeta will expand its Uber Eats partnership to Canada, Australia, Mexico, Brazil, Colombia, Peru, Chile and Costa Rica"}, {"date": "20240501080133", "headline": "Uber Technologies (UBER) Reports Next Week: Wall Street Expects Earnings Growth", "summary": "Uber (UBER) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240501083632", "headline": "Top 20 Tech Companies in Silicon Valley", "summary": "In this piece, we will take a look at the top 20 technology companies in Silicon Valley. If you want to skip our coverage of the world’s technology hub and a region that has changed the world as we know it, then check out 5 Top Tech Companies in Silicon Valley. If there’s one thing […]"}, {"date": "20240501144649", "headline": "Shake Shack history: Beyond the Ticker", "summary": "Roadside burger chain Shake Shack (SHAK) may have just gone public in 2015, but it has been one of the fastest-growing fast-food chains for the past 20 years. In 2023, Shake Shack generated over $286 million in total revenue, up 20% year-over-year. Let's take a look at the company's biggest moments with Beyond the Ticker. 2001 It started as a hot dog cart, operated by restauranteur Danny Meyer in New York's Madison Square Park. 2004 That turned into a permanent location – where it added more menu items like burgers, fries, frozen custard, and those famous milkshakes. 2010 Meant to be a single location, there was an appetite for expansion. By 2010, two more locations were added in New York. One in the Upper West Side, and the second in the home to the New York Mets, Citi Field. 2015 On January 29, 2015, Shake Shack went public via initial public offering (IPO) on the New York Stock Exchange (NYSE) at $21 per share. 2017-2024 From there, the burger chain only continued to grow – expanding its digital platforms, partnering with third-party delivery service providers like Uber Eats (UBER), adding kiosks to stores, and even drive-thru's. 2024 This year at roughly 90 US locations, it’ll now be using Carbon Neutral Whole Milk, after it expanded its partnership with US-based carbon-neutral food company, Neutral Foods. In March, the company announced that CEO Randy Garutti would step down after a 20-year run. Rob Lynch, the current CEO of Papa John's, will be named the next CEO, effective May 20, 2024. And Shake Shack continues to make its mark on the fast-food, fast-casual industry, with 530 locations across the globe and growing. From tech giants to retail titans, Beyond the Ticker is a historical series that takes a deep dive into some of Wall Street's trending companies and how they transformed into the financial icons they are today. Check out more of our Beyond the Ticker series, and be sure to tune in to Yahoo Finance. Editor's note: This video was produced by Zach Faulds."}, {"date": "20240501203231", "headline": "PRESS DIGEST-Financial Times - May 2", "summary": "Uber is facing a 250 million pound ($313.35 million) lawsuit to be filed in London's High Court on Thursday on behalf of more than 10,500 cab drivers, which alleges that Uber improperly obtained a licence from Transport for London in 2012.  - British Prime Minister Rishi Sunak has called for an independent probe into a 200,000 pound donation to Welsh first minister Vaughan Gething's leadership campaign from a recycling company within months of its subsidiary receiving a 400,000 pound loan from a state-owned bank.  - Interest earned by the UK's largest high street banks on their Bank of England reserves surged 135 per cent to more than 9 billion pounds last year, according to data released on Wednesday."}, {"date": "20240501213000", "headline": "What You Missed On Wall Street On Thursday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501230000", "headline": "Black cab drivers claim Uber illegally obtained London licence in lawsuit", "summary": "Thousands of London taxi drivers have launched a £250m lawsuit against Uber, claiming the minicab app illegally obtained a licence to operate in London."}, {"date": "20240501231900", "headline": "London's black-cab drivers files EUR 250M lawsuit against Uber, FT says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502002600", "headline": "10,000 London cabbies sue Uber for millions over taxi-booking rules", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502035300", "headline": "GM and Ford's Earnings Beat Could Be A Double-Edged Sword For Their EV Transformation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502042247", "headline": "Uber Hit With £250 Million Suit From London’s Black Cab Drivers", "summary": "(Bloomberg) -- Uber Technologies Inc. was sued by thousands of London’s black cab drivers in a suit seeking hundreds of million pounds accusing it of unlawfully operating in the capital city.Most Read from BloombergUS and Saudis Near Defense Pact Meant to Reshape Middle EastBiden Calls Ally Japan ‘Xenophobic’ Along With China, RussiaSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineHuawei Secretly Backs US Research, Awarding Millions in PrizesTesla Axes Supercharger Team in Blow to B"}, {"date": "20240502051100", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502070948", "headline": "Uber faces a 9-figure lawsuit that could net London taxi drivers $31,000 each", "summary": "Cabbies say Uber illegally obtained a license in 2012, undercutting a skill that takes four years to learn."}, {"date": "20240502083320", "headline": "Q1 2024 Sprouts Farmers Market Inc Earnings Call", "summary": "Q1 2024 Sprouts Farmers Market Inc Earnings Call"}, {"date": "20240502090300", "headline": "Uber Vs. London's Black Cab: Company Faces $310M Claim from Drivers", "summary": "Uber Technologies, Inc (NYSE:UBER) is being sued for millions by over 10,500 London black-cab drivers, claiming the company unlawfully secured a license in 2012, which led to their business loss. The lawsuit, organized by RGL Management and estimated at roughly $312.90 million (250 million Sterling Pounds) in damages, accuses Uber of siphoning business away from local drivers. Over 10,500 black-cab drivers allege that Uber improperly acquired a license from Transport for London (TfL) in 2012, wh"}, {"date": "20240502190100", "headline": "10 Best Performing S&P 500 Stocks In 2023 - Should You Buy Them Now?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502230000", "headline": "Uber Rival Bolt Raises €220 Million in Credit to Gear Up for IPO", "summary": "(Bloomberg) -- Bolt Technology OU has secured a €220 million ($235 million) credit facility that the Estonian mobility company says will help it prepare for a public offering.Most Read from BloombergSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineApple Rallies on Upbeat Forecast, Record-Setting BuybackTurkey Confirms All Trade Halt With Israel Over War in GazaHuawei Secretly Backs US Research, Awarding Millions in PrizesIn Jamie Dimon's America, the Stock Market Has Already VotedIn"}, {"date": "20240502230300", "headline": "Stock Market Crash Alert: 3 Must-Buy Travel Stocks When Prices Plunge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503021900", "headline": "Uber And Lyft Drivers' Future Hangs In Balance As Massachusetts Supreme Court Deliberates", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503022800", "headline": "Job Market Cools In April: Payrolls Miss Forecasts, Wages Rise Less Than Expected (UPDATED)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503040000", "headline": "3 Strong Stocks to Buy in May and Hold", "summary": "The unknowns around the corner shouldn't deter investors since the last several years show how difficult the market timing game is. Investors who want to stay constantly exposed to stocks might consider buying these strong tech stocks in May."}, {"date": "20240503041949", "headline": "Status of Uber, Lyft gig workers hinges on Massachusetts court fight", "summary": "Massachusetts has become the latest front in a years-long battle in the United States over whether ride-share drivers for Uber and Lyft should be treated as independent contractors or employees entitled to benefits and wage protections.  The state's top court is set to hear arguments on Monday over whether to let dueling ballot measures go before voters in November that would redefine the relationship between app-based drivers and companies like Uber, Lyft, Instacart and DoorDash whose businesses help fuel the gig worker economy.  An industry-backed proposal would treat app-based drivers for these companies as independent contractors entitled to some new benefits but would make clear they are not employees."}, {"date": "20240503071520", "headline": "Curious about Uber (UBER) Q1 Performance? Explore Wall Street Estimates for Key Metrics", "summary": "Get a deeper insight into the potential performance of Uber (UBER) for the quarter ended March 2024 by going beyond Wall Street's top -and-bottom-line estimates and examining the estimates for some of its key metrics."}, {"date": "20240503091129", "headline": "Stocks to watch next week: BP,  Saudi Aramco, Uber, and interest rates", "summary": "Earnings preview of key companies reporting next week and what to look out for."}, {"date": "20240503100800", "headline": "Should You Add UBER to Your Portfolio Ahead of Q1 Earnings?", "summary": "The strong performance of the Mobility and Delivery units is likely to have aided UBER's performance in the first quarter."}, {"date": "20240503153447", "headline": "Disney earnings, Fedspeak: What to Watch Next Week", "summary": "As the trading week draws to a close, it's time to look ahead at the key events that will take center stage for Yahoo Finance in the upcoming week. The earnings season continues to unfold, with notable companies such as Disney (DIS), Uber (UBER), and Toyota (TM) scheduled to report their quarterly financial results on Tuesday. Additionally, another round of Federal Reserve commentary is on the horizon. Richmond Fed President Tom Barkin and Fed Governor Lisa Cook are expected to share their perspectives on the central bank's policy outlook. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Angel Smith"}, {"date": "20240504040000", "headline": "Eyes On Apple, Uber, Disney, Rivian And Coupang", "summary": "Stay informed about upcoming market events and earnings reports with Seeking Alpha's Stocks to Watch."}]}