{"news": [{"date": "20240401102136", "headline": "Stocks Weaken As Treasury Yields Climb; Nasdaq Reverses Lower, Dow Sinks 250 Points", "summary": "The Dow Jones Industrial Average and the S&P 500 pulled back while the Nasdaq reversed lower and joined both in the red.  Indexes have been fading since the open as Treasury yields jump following the strong March Institute for Supply Management report.  The benchmark 10-year yield added 12 basis points to 4.33% — on pace for the largest one-day increase since Feb. 13."}, {"date": "20240401102600", "headline": "United Parcel Service Won Some USPS Business. Why the Stock Is Down.", "summary": "The “significant” award of air-cargo work might have been expected to be seen as good news for the company and the stock price."}, {"date": "20240401104300", "headline": "NEW YORK MARKET CLOSE: US stocks mostly fall on inflation worries", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401143000", "headline": "The 7 Best Dividend Stocks to Buy in April 2024", "summary": "Some investors look for growth stocks that don’t offer dividends. While no dividend payments allow corporations to reinvest cash back into their businesses, this structure presents a problem for shareholders. If a stock does not offer dividends, you can only generate additional cash by selling shares. Not every investor wants to sell shares, but non-dividend paying stocks may force investors to do just that. Luckily, you can choose from many dividend stocks that reward you with cash flow for hol"}, {"date": "20240401151736", "headline": "Dow Jones Drops More Than 200 Points As Yields Pop; Trump Stock Plunges", "summary": "3M was the biggest gainer while Home Depot was the biggest loser on the Dow Jones Industrial Average Monday."}, {"date": "20240401202551", "headline": "4 Factor Dividend Growth Portfolio - A Strong Finish To Quarter 1", "summary": "The 4-factor dividend growth portfolio strategy outperformed the S&P 500 and SCHD, generating significant alpha over time. Read more here."}, {"date": "20240401203700", "headline": "Buy vs. Sell ideas paired within each sector - Oppenheimer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240401203800", "headline": "United Parcel Service Unusual Options Activity For April 02", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402040600", "headline": "Norfolk Southern calls on shareholders to reject activist investor’s takeover bid", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402045600", "headline": "FedEx (FDX) Stock Down in Yesterday's Trading: Here's Why", "summary": "The non-renewal of the contract brings an end to USPS' more than two-decade long relationship with FedEx (FDX)."}, {"date": "20240402194400", "headline": "March preliminary North America Class 8 truck orders down 8.7% YoY, ACT says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402212800", "headline": "What You Missed On Wall Street On Wednesday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240402221000", "headline": "UPS just upgraded at Redburn Atlantic, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403004600", "headline": "Is UPS the Best Transportation Stock for You?", "summary": "Management's guidance on the recent Investor Day presentation raised almost as many questions as it provided answers."}, {"date": "20240403015100", "headline": "United Parcel Service gains after Redburn Atlantic flips to a bull rating", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403025500", "headline": "UPS upgraded, PepsiCo downgraded: Wall Street's top analyst calls", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240403070600", "headline": "UPS Stock Rises on Upgrade. The Bottom Could Be In, Analyst Says.", "summary": "Redburn Atlantic analyst Oliver Holmes raised his call on the logistics stock to Buy from Hold. His price target is $180 a share."}, {"date": "20240403142400", "headline": "UPS upgraded to Buy at Redburn Atlantic", "summary": "Shares of United Parcel Service (UPS) are trading higher Wednesday, following an upgrade by Redburn Atlantic. The firm has lifted its rating on the shipping company to Buy from Hold, arguing that UPS has reached, or is close to reaching, \"trough\" revenue, volume, margins, and share price. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. Editor's note: This article was written by Angel Smith"}, {"date": "20240403143000", "headline": "The 7 Most Undervalued Sleeper Stocks to Buy in April 2024", "summary": "Although the stock market is near an all-time high, there are still plenty of stocks that are underperforming. Lots of great companies have not participated in the bull market over the past 18 months and seen their share price slide deep into the red. This presents an opportunity for astute investors who take a long-term view and have the wherewithal to snap up shares when they are on sale, riding them to future gains. The benchmark S&P 500 might have had its best first quarter to a year since 2"}, {"date": "20240403212854", "headline": "Redburn Atlantic Upgrades United Parcel Service (UPS)", "summary": ""}, {"date": "20240404050000", "headline": "Postal Service’s air cargo shift to UPS makes everyone a winner", "summary": "The U.S. Postal Service picked UPS to replace FedEx as its primary partner for moving parcels by air, but analysts say FedEx actually comes out ahead by losing the business. The post Postal Service’s air cargo shift to UPS makes everyone a winner appeared first on FreightWaves."}, {"date": "20240404160020", "headline": "United Parcel Service (UPS) Declines More Than Market: Some Information for Investors", "summary": "In the most recent trading session, United Parcel Service (UPS) closed at $150, indicating a -1.49% shift from the previous trading day."}, {"date": "20240404214500", "headline": "United Parcel Service Inc. Cl B stock rises Friday, still underperforms market", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240404230000", "headline": "Biden to survey collapsed Baltimore bridge, meet families of workers who died", "summary": "President Joe Biden willvisit Baltimore on Friday to survey the site of a collapsedbridge and meet families of the six construction workers whodied, amid growing tensions in the U.S. Congress over..."}, {"date": "20240405043300", "headline": "Contrarian’s Delight: 3 Stocks to Scoop Up Amid the EV Demand Slump", "summary": "EV demand in the U.S. is being weighed down by high interest rates and consumers’ increased preference for hybrid vehicles. Still, the number of EV sales continues to climb year-over-year and, according to Barron’s, EVs’ share of the overall U.S. auto market even increased slightly in Q1 to 7%. Moreover, the recent increases in oil prices, along with the U.S. Federal Reserve’s upcoming rate cuts, should cause the demand for EVs to increase going forward. So for the U.S. EV market, it’s very much"}, {"date": "20240405045000", "headline": "ClearBridge Large Cap Growth ESG Strategy Q2 2024 Portfolio Manager Commentary", "summary": "The Strategy outperformed due to a combination of active management of our mega cap exposure as well as strong stock selection across industrials and similar early-cycle companies."}, {"date": "20240405061100", "headline": "Buy/Sell: Wall Street's top 10 stock calls this week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240405150045", "headline": "UPS plans to hire 300 pilots to support Postal Service contract", "summary": "Express delivery giant UPS is recruiting pilots again after beating out FedEx for the Postal Service’s air transport contract. The post UPS plans to hire 300 pilots to support Postal Service contract appeared first on FreightWaves."}, {"date": "20240407010700", "headline": "Maintaining Hold: UPS Balances New USPS Contract With Strategic Growth and Cost Management", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407050000", "headline": "What One Employer Found When It Started Providing Child Care", "summary": "A coffee roastery opened a subsidized facility on site as companies look for ways to keep staff in high-turnover jobs."}, {"date": "20240407072400", "headline": "Is UPS Stock a Buy?", "summary": "The transportation giant's stock continues to divide bulls and bears. Here are both sides to the story."}, {"date": "20240407081000", "headline": "Is UPS Stock Going to $180? 1 Wall Street Analyst Thinks So", "summary": "An analyst recently took a glass-half-full look at the transportation giant's prospects."}, {"date": "20240407190300", "headline": "3 Stocks Soaring on Bullish Analyst Calls: Is It Time to Buy?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240407201000", "headline": "UPS NOW OFFERS NEXT-DAY DELIVERY BETWEEN ASIA AND AUSTRALIA", "summary": "UPS (NYSE: UPS) is now offering customers in leading Asia Pacific economies faster delivery to and from Australia after launching a new flight connecting the company's intra-Asia hub in Shenzhen (SZX) to Sydney Kingsford Smith Airport (SYD)."}, {"date": "20240408042800", "headline": "Interesting UPS Put And Call Options For March 2025", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408054800", "headline": "United Parcel Service Unusual Options Activity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240408082000", "headline": "UPS Boosts Shipment Delivery Between Asia-Pacific & Australia", "summary": "Following the introduction of the new service by UPS, shipments picked up from customers in certain Asia-Pacific economies can be delivered to Australia the next business day."}, {"date": "20240409001100", "headline": "UPS price target lowered by $4 at JPMorgan, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240409075106", "headline": "How's AT&T Handling Things?", "summary": "We've also got a look at 3M's spinoff, gold prices, and the beef industry."}, {"date": "20240409101906", "headline": "UPS To Release First-Quarter 2024 Results On Tuesday, April 23, 2024", "summary": "UPS will announce its 2024 first-quarter results on April 23, 2024, at approximately 6:00 a.m. Eastern Time.At 8:30 a.m. ET, UPS Chief Executive Officer Carol Tomé and Chief Financial Officer..."}, {"date": "20240409155021", "headline": "United Parcel Service (UPS) Exceeds Market Returns: Some Facts to Consider", "summary": "In the closing of the recent trading day, United Parcel Service (UPS) stood at $150.57, denoting a +0.31% change from the preceding trading day."}, {"date": "20240410191500", "headline": "10 Attractive buy puts within the Russell 1000 - JPM", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411012600", "headline": "Bernstein Reaffirms Their Buy Rating on United Parcel (UPS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240411044500", "headline": "3 Under-Appreciated Dividend Stocks That Just Raised Their Payouts to Record Highs", "summary": "These companies are directly rewarding shareholders with passive income."}, {"date": "20240411060021", "headline": "United Parcel Service (NYSE:UPS) sheds 3.3% this week, as yearly returns fall more in line with earnings growth", "summary": "If you buy and hold a stock for many years, you'd hope to be making a profit. Better yet, you'd like to see the share..."}, {"date": "20240411101759", "headline": "All-Time High Flyers: 7 Stocks to Buy as the Market Peaks", "summary": "If you’re wondering which stocks to buy in April, here’s a good place to start. The stock market is off to a difficult start in the second quarter. With the timing of interest rates getting pushed out further, the major averages have turned downwards. Since peaking on March 28, the benchmark S&P 500 index has declined nearly 2%. The dip has some on Wall Street wondering aloud if we’re at or close to the market’s peak and now entering what could be a steep selloff. Many analysts say a pullback is"}, {"date": "20240412000000", "headline": "The Handoff To Normal?", "summary": "The U.S. successfully transitioned once again to a services-driven economy after the global disruption caused by the COVID-19 pandemic led to a shift to a goods-driven economy."}, {"date": "20240412020000", "headline": "Ancora’s Proposed Management Team and Director Candidates to Participate in Fireside Chat with Deutsche Bank on the Value Creation Opportunity at Norfolk Southern", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240412031500", "headline": "ClearBridge Large Cap Value Strategy Q1 2024 Portfolio Manager Commentary", "summary": "The ClearBridge Large Cap Value Strategy underperformed its Russell 1000 Value Index benchmark during the first quarter of 2024. Click here to read more."}, {"date": "20240413220300", "headline": "Boeing weighs on large-cap industrials in turbulent week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240414150000", "headline": "3 Dividend Stocks to Buy for Lifelong Cash Flow", "summary": "Dividend stocks allow investors to get paid just by holding onto shares. This investing model can help people cover their living costs without having to sell shares. Some corporations offer high yields with limited upside in their stock prices. Other businesses have low yields but plenty of upside. Investors should consider whether they prioritize growth or income. You can end up with both, but the scale will always lean toward one side more than the other. Dividend growth stocks can get higher"}, {"date": "20240415052700", "headline": "Ranked: The Largest U.S. Corporations By Number Of Employees", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240415070024", "headline": "Is It Time To Consider Buying United Parcel Service, Inc. (NYSE:UPS)?", "summary": "Today we're going to take a look at the well-established United Parcel Service, Inc. ( NYSE:UPS ). The company's stock..."}, {"date": "20240415092200", "headline": "Top Analyst Reports for Microsoft, Novo Nordisk & United Parcel", "summary": "Today's Research Daily features new research reports on 16 major stocks, including Microsoft Corporation (MSFT), Novo Nordisk A/S (NVO) and United Parcel Service, Inc. (UPS)."}, {"date": "20240415152707", "headline": "Compounding Cash Cows: 7 Dividend Growth Stocks to Buy in 2024", "summary": "Dividend growth stocks with high dividend growth rates can reward investors with appreciation and higher payouts each year. Patient investors who can hold onto their investments for more than a decade can generate significant cash flow that can help with living expenses. The telltale signs of a dividend growth stock are rising financials and a favorable dividend payout ratio. These companies have good runways and can deliver long-term returns for their shareholders. Investors looking for solid d"}, {"date": "20240415154616", "headline": "3 Bargain Stocks to Buy Now: Q2 Edition", "summary": "Investing in underrated stocks can offer a higher margin of safety. These stocks can weather economic uncertainty and stock market volatility better than many corporations. While the current valuation is useful for determining if a stock is undervalued, it doesn’t tell the entire story. Also, bargain stocks offer compelling growth opportunities relative to their valuations. A low P/E ratio doesn’t matter if the corporation is losing market share and generating substantial losses. Therefore, inve"}, {"date": "20240415155019", "headline": "United Parcel Service (UPS) Stock Moves -0.04%: What You Should Know", "summary": "United Parcel Service (UPS) reachead $144.85 at the closing of the latest trading day, reflecting a -0.04% change compared to its last close."}, {"date": "20240416030700", "headline": "The Zacks Analyst Blog Highlights Microsoft, Novo Nordisk, United Parcel Service, Booking and Elevance Health", "summary": "Microsoft, Novo Nordisk, United Parcel Service, Booking and Elevance Health are included in this Analyst Blog."}, {"date": "20240416080055", "headline": "Analysts Estimate United Parcel Service (UPS) to Report a Decline in Earnings: What to Look Out for", "summary": "UPS (UPS) doesn't possess the right combination of the two key ingredients for a likely earnings beat in its upcoming report. Get prepared with the key expectations."}, {"date": "20240416202500", "headline": "Noteworthy Wednesday Option Activity: UPS, AMGN, BMEA", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417040600", "headline": "Trucking stocks hit the brakes as earnings worries mount", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417063900", "headline": "10 Industrials Stocks Whale Activity In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240417114614", "headline": "FIDU: Industrials Dashboard For April", "summary": "Industrials are the second most overpriced sector behind technology, but some subsectors are moderately overvalued. Read more on FIDU ETF here."}, {"date": "20240418014000", "headline": "Amazon.com to benefit from expanding of delivery stations, says DA Davidson", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418023800", "headline": "The number of Americans applying for jobless benefits holds steady as labor market remains strong", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418061555", "headline": "14 Best Large Cap Dividend Growth Stocks To Buy Now", "summary": "In this article, we discuss 14 best large-cap dividend growth stocks to buy now. You can skip our detailed analysis of large-cap dividend stocks and their historical performance, and go directly to read 5 Best Large Cap Dividend Growth Stocks To Buy Now. Large-cap stocks have remained ideal for investors as they typically form the […]"}, {"date": "20240418065100", "headline": "A Closer Look at United Parcel Service's Options Market Dynamics", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418071524", "headline": "UPS (UPS) Q1 Earnings on the Horizon: Analysts' Insights on Key Performance Measures", "summary": "Get a deeper insight into the potential performance of UPS (UPS) for the quarter ended March 2024 by going beyond Wall Street's top -and-bottom-line estimates and examining the estimates for some of its key metrics."}, {"date": "20240418091000", "headline": "UPS Gears Up to Release Q1 Earnings: What's in the Offing?", "summary": "High labor costs are likely to have hurt UPS' bottom line in Q1. Weak demand-induced volume woes are also likely to hurt results."}, {"date": "20240418200200", "headline": "Catalyst Watch: Tesla, Boeing and General Motors brace for earnings fireworks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418201700", "headline": "PepsiCo using only 37 of promised 100 Tesla Semis, Reuters reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418202100", "headline": "PepsiCo using only 36 of promised 100 Tesla Semis, Reuters reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418202500", "headline": "At least 70% of the S&P 500 names that reported results this week topped estimates - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240418214600", "headline": "United Parcel Service, Inc. Dividend Stock Analysis", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240419054000", "headline": "Mayar Capital Q1 2024 Letter To Partners", "summary": "For the three months ending March 31, 2024, the Mayar Responsible Global Equity Fund (Class A) was up 4.31% net. Click here to read the full letter. "}, {"date": "20240419060021", "headline": "Estimating The Intrinsic Value Of United Parcel Service, Inc. (NYSE:UPS)", "summary": "Key Insights Using the 2 Stage Free Cash Flow to Equity, United Parcel Service fair value estimate is US$172 United..."}, {"date": "20240419154511", "headline": "Tesla, Boeing, Big Tech earnings, PCE data: What to watch", "summary": "As the week draws to a close at Yahoo Finance, anchors Julie Hyman and Madison Mills preview the key events to watch in the upcoming week. Earnings results will be in focus. Tuesday sees a number of big names reporting, such as Tesla (TSLA), PepsiCo (PEP), and General Electric (GE). On Wednesday, Boeing (BA) will unveil its first quarter earnings, an eagerly anticipated report as the company continues to navigate significant headwinds and operational challenges.  There are also earnings from Big Tech companies Meta (META), Alphabet (GOOGL, GOOG), and Microsoft (MSFT). Friday energy giants Chevron (CVX) and ExxonMobil (XOM) are scheduled to release their earnings reports, providing insights into the health and dynamics of the oil market. Last, the Personal Consumption Expenditures Price Index, the Federal Reserve's preferred inflation gauge, will be released on Friday. It's a crucial metric for the central bank's future monetary policy decisions. For more expert insight and the latest market action, click here to watch this full episode of Market Domination Overtime. This post was written by Angel Smith"}, {"date": "20240420224900", "headline": "Can Magnificent 7 Help Script Market Turnaround? Earnings Pick Up Pace With Microsoft, Meta, Alphabet And Tesla Expected This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421004642", "headline": "Wall Street Breakfast: The Week Ahead", "summary": "Stay updated with the latest financial news and market trends by listening to the Wall Street Breakfast podcast available on Seeking Alpha, iTunes, and..."}, {"date": "20240421010500", "headline": "Earnings week ahead: Tesla, Meta Platforms, Google, Microsoft, Intel, Exxon Mobil, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240421033607", "headline": "High-Quality Dividend Growth Near 52-Week Lows: Apple Is Attractive", "summary": "The current risks facing Apple appear to be well managed, and the fundamental business is well positioned. Read why I'm bullish on AAPL stock."}, {"date": "20240421184139", "headline": "SCHD: If You've Won The Game, Take A Little Off The Top", "summary": "SCHD is a great capital gains storage for positions that may be getting over-concentrated in your portfolio. Read why SCHD ETF is a Buy."}, {"date": "20240421193800", "headline": "UPS Q1 Earnings Preview: Volumes expected to improve in the coming quarter", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422020000", "headline": "Dividend Income Summary: Lanny's March 2024 Summary", "summary": "Retirement accounts brought in a total dividend income amount of $2,367.19 or 40% of the dividend income total. Read what investors need to know."}, {"date": "20240422041400", "headline": "Activist investor Ancora ramps up pressure in Norfolk Southern board battle", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422062700", "headline": "Notable companies reporting before tomorrow's open", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422121600", "headline": "What's in Store for These 5 Transportation Stocks in Q1 Earnings?", "summary": "Let's focus on transportation stocks like UPS, NSC, UNP, LUV and AAL, which are scheduled to release first-quarter 2024 earnings shortly."}, {"date": "20240422141400", "headline": "UPS’s Earnings Are Coming. Investors Want to See Better Demand.", "summary": "Its first-quarter earnings shouldn’t be a surprise so it could take a positive update to management’s financial forecasts to get things back on track.  Wall Street is looking for earnings per share of $1.30 and an operating profit of $1.6 billion from sales of $21.8 billion, according to FactSet."}, {"date": "20240422183500", "headline": "GLOBAL BRIEFING: Japan's business activity growth speeds up in April", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422230100", "headline": "UPS reports Q1 adjusted EPS $1.43, consensus $1.30", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422230200", "headline": "UPS backs FY24 revenue $92B-$94.5B, consensus $93.03B", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422230900", "headline": "UPS reports mixed Q1 results; reaffirms FY24 outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422231400", "headline": "UPS in charts: Revenues slides Y/Y and Q/Q across all segments in Q1", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422232600", "headline": "Nasdaq, S&P, Dow futures show little change as investors await more earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000108", "headline": "UPS Releases 1Q 2024 Earnings", "summary": "Consolidated Revenues of $21.7B, Compared to $22.9B Last YearConsolidated Operating Margin of 7.4%; Adjusted* Consolidated Operating Margin of 8.0%Diluted EPS of $1.30; Adj. Diluted EPS of..."}, {"date": "20240423000200", "headline": "UPS gains after efficiency improvement leads to profit beat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000200", "headline": "Earnings Scheduled For April 23, 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423000200", "headline": "Wall Street Set To Open Higher As Tesla To Kick Off 'Magnificent 7' Earnings: Why This Analyst Thinks Market Weakness Is A 'Healthy Pullback'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423001409", "headline": "UPS: Q1 Earnings Snapshot", "summary": "ATLANTA — ATLANTA — United Parcel Service Inc. on Tuesday reported first-quarter profit of $1.11 billion. On a per-share basis, the Atlanta-based company said it had profit of $1.30...."}, {"date": "20240423002400", "headline": "Wall Street Set To Open Higher As Tesla Kicks Off 'Magnificent 7' Earnings: Why This Analyst Thinks Market Weakness Is A 'Healthy Pullback'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423002500", "headline": "UPS’s Q1 2024 Earnings: $1.41 EPS Beats Expectations, Revenue Miss", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423002600", "headline": "UPS’s stock rises after company reports profit beat despite lower-than-expected revenue", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423003700", "headline": "TOP NEWS: UPS backs outlook as optimistic on volumes looking ahead", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423011000", "headline": "UPS Delivers Mixed Bag Of Q1 Results, Maintains Guidance Despite Lower Volumes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423013700", "headline": "UPS Earnings: UPS Reports Mixed Results in Q1", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423015006", "headline": "UPS: 35% drop in quarterly EPS", "summary": "UPS reports adjusted EPS down 35% to $1.43 for the first quarter of 2024, with an adjusted operating margin of 8% on sales of $21.7 billion, down 5.3% year-on-year.Our financial performance was in..."}, {"date": "20240423015400", "headline": "UPS sees complete transition of USPS air cargo by Q3", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423015600", "headline": "UPS reaffirms targets offered at March investor day", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423015900", "headline": "UPS CEO says 'delighted' to have won air cargo contract from USPS", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423020200", "headline": "UPS says announcing fuel surcharge later today", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423020500", "headline": "United Parcel (UPS) Gets a Hold from J.P. Morgan", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423020700", "headline": "UPS’s stock gives up gains after another revenue miss offset a profit beat", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423021000", "headline": "UPS CEO says 'even more confident' in FY24 guidance, too early to change", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423021500", "headline": "UPS says examining strategic options on pensions", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423021900", "headline": "UPS CEO says 'no intent to cut dividend,' looking to raise dividend every year", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423022400", "headline": "4 stocks to watch on Tuesday: TSLA, UPS and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423023400", "headline": "Nasdaq, S&P, Dow advance as investors await more earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423024100", "headline": "Unusually active option classes on open April 23rd", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423035400", "headline": "UPS Stock Earnings: United Parcel Service Beats EPS, Misses Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423052017", "headline": "Stock Market Today: Stocks higher amid earnings parade; GM, GE, UPS report", "summary": "Stocks are looking at their first back-to-back gains for the month Tuesday with a host of blue-chip earnings reporting first-quarter earnings."}, {"date": "20240423052900", "headline": "UPS’ stock rises after profit extends long streak of beats as deliveries improve", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423053209", "headline": "United Parcel Service Inc (UPS) Q1 2024 Earnings: A Close Alignment with Analyst Projections ...", "summary": "Insight into UPS's Financial Performance and Strategic Outlook"}, {"date": "20240423060909", "headline": "United Parcel Service, Inc. (UPS) Q1 2024 Earnings Call Transcript", "summary": "United Parcel Service, Inc. (NYSE:NYSE:UPS) Q1 2024 Earnings Conference Call April 23, 2024 8:30 AM ETCompany ParticipantsPJ Guido - IRCarol Tome - CEO..."}, {"date": "20240423063800", "headline": "Stocks Rally On Weaker PMI Data, Tech Earnings Optimism, Dollar Falls: What's Driving Markets Tuesday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423064300", "headline": "UPS Stock Rises on Earnings Beat. Demand Is Still a Struggle.", "summary": "Logistics firm UPS topped estimates on the bottom line, but sales came in light. The company sees a “return to volume and revenue growth.”"}, {"date": "20240423065957", "headline": "Stocks to Watch Tuesday: GM, Spotify, UPS, Tesla", "summary": "? **Tesla (TSLA**): Traders' focus is on the EV maker's earnings, due after the market close. Tesla stock edged up in premarket trading, after a rocky stretch that has seen it fall over 40% in 2024. ↗️ **General Motors (GM)**: Shares of GM leapt roughly 5% premarket after the car company raised its annual profit outlook."}, {"date": "20240423071200", "headline": "The Zacks Analyst Blog Highlights United Parcel Service, Norfolk Southern, Union Pacific, Southwest Airlines and American Airlines", "summary": "United Parcel Service, Norfolk Southern, Union Pacific, Southwest Airlines and American Airlines are part of the Zacks top Analyst Blo."}, {"date": "20240423071839", "headline": "GM, Tesla, and UPS earnings in focus: 3 Things", "summary": "General Motors (GM) stock shifts into high gear in Tuesday's pre-market trading after reporting a first-quarter earnings beat, anticipating \"positive variable profit\" in its EV sales in its full-year guidance. Tesla (TSLA) will report earnings after Tuesday's market close. Investors will be heavily scrutinizing the EV giant's results closely after a rocky 2024 start. Lastly, United Parcel Service (UPS) tops first-quarter estimates in its top and bottom lines, reporting rising labor costs. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Luke Carberry Mogan."}, {"date": "20240423073029", "headline": "UPS (UPS) Q1 Earnings: Taking a Look at Key Metrics Versus Estimates", "summary": "While the top- and bottom-line numbers for UPS (UPS) give a sense of how the business performed in the quarter ended March 2024, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values."}, {"date": "20240423073121", "headline": "UPS reports shipping volume declines in Q1 profit beat", "summary": "United Parcel Service (UPS) is reporting declines in its delivery volumes in its first-quarter earnings figures. While results were mixed on the postal carrier's top and bottom lines, UPS saw profits beat estimates. Morning Brief Anchors Seana Smith and Brad Smith dive into UPS's earnings while taking into account its cost-cutting strategies to offset rising labor costs. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Luke Carberry Mogan."}, {"date": "20240423073950", "headline": "UPS Revenue Slumps as Shipping Slowdown Persists", "summary": "United Parcel Service posted another drop in quarterly revenue, after the delivery company shipped fewer packages both domestically and internationally. Overall revenue fell 5.3% in the first quarter, with shipping volume down 3."}, {"date": "20240423075000", "headline": "Wall Street Lunch: California Bill Takes Aim At Clear Secure", "summary": "California State Senator Josh Newman introduces bill to limit Clear's concierge service at airports, citing equity issues. GM reports higher-than-expected Q1 earnings."}, {"date": "20240423082400", "headline": "Pre-Markets Up, Q1 Earnings Beats for GM, UPS, Pepsi", "summary": "Ahead of economic prints like Friday's PCE report, Q1 earnings are starting to come in hot and heavy."}, {"date": "20240423085400", "headline": "Tech Companies Start Reporting Q1 Earnings", "summary": "Tech Companies Start Reporting Q1 Earnings"}, {"date": "20240423090918", "headline": "UPDATE 1-UPS sees profit in U.S. Postal Service work that dragged down FedEx earnings", "summary": "United Parcel Service expects its newly won U.S. Postal Service (USPS) air cargo contract to be profitable in its first year and throughout the more than five-year deal, after rival FedEx struggled with the business, Chief Executive Carol Tome said on Tuesday.  Atlanta-based UPS will become the No. 1 USPS air cargo service provider on Sept. 30.  It replaces FedEx, which was paid $1.75 billion in fiscal 2023 to provide Priority Mail and other speedy services for the quasi-governmental agency."}, {"date": "20240423093754", "headline": "UPS sees profit in U.S. Postal Service work that dragged down FedEx earnings", "summary": "United Parcel Service expects its newly won U.S. Postal Service (USPS) air cargo contract to be profitable in its first year and throughout the more than five-year deal, after rival FedEx struggled with the business, Chief Executive Carol Tome said on Tuesday.  Atlanta-based UPS will become the No. 1 USPS air cargo service provider on Sept. 30.  It replaces FedEx, which was paid $1.75 billion in fiscal 2023 to provide Priority Mail and other speedy services for the quasi-governmental agency."}, {"date": "20240423093855", "headline": "UPS earnings: Where volumes, labor costs fit into its outlook", "summary": "United Parcel Service (UPS) posted its first-quarter earnings to mixed results with adjusted earnings per share at $1.43 against an estimated $1.30, but revenue came under estimations with $21.71 billion against an expected $21.83 billion. The company also reported a 3.2% decline in average daily volumes in its domestic business and a 5.8% drop in its international segment, signaling a softening of demand in deliveries. Could this be a warning sign of things to come with consumer demand? Bank of America Senior Transportation Analyst Ken Hoexter joins Yahoo Finance to give insight into UPS's earnings and what it signals for the bigger picture. Hoexter outlines how UPS could stage a comeback on forward projections and after this quarter's results: \"I think the momentum really will be on the volume side. We know that the earnings were really hit as they signed a new Teamster employment contract this year. You've got really tough comps because of that on the cost side where employment costs are up 13% year-over-year. You have this huge tough comp until we anniversary that over the summer. So then you're going to have almost a flattish labor cost from that point forward. It really becomes you need that operating leverage of getting volumes into this fixed cost network that you can get some of that leverage. I think that's why you're seeing the focus on where volumes are for this stock in particular because that's really what's going to drive future earnings, is if you can see top-line growth.\" For more expert insight and the latest market action, click here to watch this full episode. This post was written by Nicholas Jacobino"}, {"date": "20240423100952", "headline": "Why UPS Stock Is Up Today", "summary": "An earnings beat has investors more relieved than excited."}, {"date": "20240423101300", "headline": "NEW YORK MARKET CLOSE: Stocks motor as upbeat earnings provide spark", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423102449", "headline": "Top Midday Stories: Shares of GE, Novartis, Danaher and Philip Morris Up Post-Earnings; Pepsi Stock Down Post-Earnings; Apple iPhone China Sales Drop 19%; Trump Poised for Windfall From Media Company Stock", "summary": "Top Midday Stories: Shares of GE, Novartis, Danaher and Philip Morris Up Post-Earnings; Pepsi Stock Down Post-Earnings; Apple iPhone China Sales Drop 19%; Trump Poised for Windfall From Media Company Stock"}, {"date": "20240423104504", "headline": "United Parcel Service (UPS) Q1 Earnings Beat Estimates", "summary": "UPS (UPS) delivered earnings and revenue surprises of 7.52% and 1.16%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240423105317", "headline": "UPS earnings results: 3 figures investors are keying in on", "summary": "Shares of United Parcel Service (UPS) are moving higher Tuesday morning as the company posted its first-quarter earnings to mixed results, topping estimates by posting adjusted gains of $1.43 per share while its revenue figures fell short of analyst forecasts. In addition, the report revealed slowing delivery demand for both the US and international markets. Yahoo Finance's Rachelle Akuffo joins Wealth! to break down the top takeaways from UPS's first-quarter earnings and what investors can expect moving forward. For more expert insight and the latest market action, click here to watch this full episode of Wealth! This post was written by Nicholas Jacobino"}, {"date": "20240423115235", "headline": "FedEx: Cost Cuts Paying Off, Big EPS Growth Expected", "summary": "FedEx is focused on reducing its costs and has impressive EPS growth forecasts from the sell-side. Read why I see FDX stock as a buy on valuation."}, {"date": "20240423124511", "headline": "United Parcel Service (UPS) Q1 2024 Earnings Call Transcript", "summary": "UPS earnings call for the period ending March 31, 2024."}, {"date": "20240423133900", "headline": "UPS Surpasses Q1 Earnings Estimates, Reaffirms 2024 Guidance", "summary": "UPS's first-quarter 2024 earnings and revenues decrease year over year."}, {"date": "20240423215200", "headline": "Analysts Have Conflicting Sentiments on These Industrial Goods Companies: United Parcel (UPS) and Pentair (PNR)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423222039", "headline": "Q1 2024 United Parcel Service Inc Earnings Call", "summary": "Q1 2024 United Parcel Service Inc Earnings Call"}, {"date": "20240423223700", "headline": "Maintaining Hold on UPS: A Balanced Outlook Amidst Mixed Segment Performance and Growth Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424002200", "headline": "Analysts Offer Insights on Industrial Goods Companies: IDEX (IEX), Canadian National Railway (CNI) and United Parcel (UPS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424003300", "headline": "UPS price target raised by $4 at Oppenheimer, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424003400", "headline": "UPS price target raised by $3 at Loop Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424003500", "headline": "Jefferies Sticks to Its Buy Rating for United Parcel (UPS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424004300", "headline": "UPS price target raised by $10 at Susquehanna, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424005100", "headline": "Analysts Offer Insights on Industrial Goods Companies: United Parcel (UPS) and Pentair (PNR)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424010222", "headline": "United Parcel Service Inc (UPS) (Q1 2024) Earnings Call Transcript Highlights: Navigating ...", "summary": "Amidst revenue declines and increased costs, UPS focuses on operational efficiency and strategic growth areas like SMBs and USPS partnerships."}, {"date": "20240424010800", "headline": "Where United Parcel Service Stands With Analysts", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424011000", "headline": "GLOBAL BROKER RATINGS: Stifel ups Adidas, Kepler cuts Siemens Energy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424011700", "headline": "UBS Reaffirms Their Buy Rating on United Parcel (UPS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424022700", "headline": "UPS price target raised by $3 at BofA, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424024800", "headline": "Norfolk Southern's earnings offer railroad chance to defend its strategy ahead of control vote", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424025700", "headline": "UPS price target raised by $4 at BMO Capital, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424041500", "headline": "Artisan Value Fund Q1 2024 Commentary", "summary": "Artisan Value Fund's portfolio performed roughly in line with the Russell 1000 Value Index. Click here to read the full fund letter."}, {"date": "20240424050000", "headline": "US Postal Service to migrate air cargo to UPS during summer", "summary": "UPS is working to transition U.S. Postal Service business from incumbent air cargo supplier FedEx and hire more pilots before the current contract officially ends. The post US Postal Service to migrate air cargo to UPS during summer appeared first on FreightWaves."}, {"date": "20240424052842", "headline": "United Parcel Service First Quarter 2024 Earnings: Revenues Disappoint", "summary": "United Parcel Service ( NYSE:UPS ) First Quarter 2024 Results Key Financial Results Revenue: US$21.7b (down 5.3% from..."}, {"date": "20240424063900", "headline": "10 Industrials Stocks With Whale Alerts In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424073600", "headline": "Company News for Apr 24, 2024", "summary": "Companies in The News Are: UPS,PM,NVS,IVZ"}, {"date": "20240424091402", "headline": "United Parcel Service: I See Persisting Profit Pressure Ahead", "summary": "United Parcel Service, Inc. stock is facing a series of profit headwinds.Â Read the article to learn why we have a hold thesis on UPS stock."}, {"date": "20240424091735", "headline": "United Parcel Service, Inc. (NYSE:UPS) Q1 2024 Earnings Call Transcript", "summary": "United Parcel Service, Inc. (NYSE:UPS) Q1 2024 Earnings Call Transcript April 23, 2024 United Parcel Service, Inc. isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning. My name is Stephen Dye, and I will be your conference facilitator today. […]"}, {"date": "20240424110554", "headline": "United Parcel Service Gains Confidence for Q2 Ramp with Improved Volume, Q1 EBIT, UBS Says", "summary": "United Parcel Service Gains Confidence for Q2 Ramp with Improved Volume, Q1 EBIT, UBS Says"}, {"date": "20240424120304", "headline": "UPS Q1 Earnings Confirms Management's Post-Pandemic Strategy Is Not Working (Downgrade)", "summary": "UPS has struggled since inflation began to accelerate in early 2021, with 10.44% decrease in total returns since May 2021. Find out why UPS stock is a Strong Sell."}, {"date": "20240424191800", "headline": "UPS Earnings Show The Weight Of $170,000 Compensation While It Learns To Navigate Shipping Slump (UPDATED)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424213000", "headline": "What You Missed On Wall Street On Thursday", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424214100", "headline": "HSBC gets more bullish on UPS, upgrades shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424222600", "headline": "HSBC upgrades UPS, says volumes and margins likely troughed", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425023000", "headline": "United Parcel Service: Logistics Leader Still In The Bargain Bin", "summary": "UPS's Q1 earnings fell by 35%, but they remain optimistic about their ability to rebound in the second half of the year. Explore more here."}, {"date": "20240425024100", "headline": "US applications for jobless claims fall to lowest level in 9 weeks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425024500", "headline": "Monster downgraded, Five Below upgraded: Wall Street's top analyst calls", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425035000", "headline": "UPS is upgraded at HSBC on the expectation of margin improvement", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425041000", "headline": "SPDR ETF Report For Thursday, April 25", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425045249", "headline": "HSBC Upgrades United Parcel Service (UPS)", "summary": ""}, {"date": "20240425051000", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425073500", "headline": "Bert's March Dividend Income Summary", "summary": "We have two other individual stocks that paid us individual dividends that were over $100 per share. Those two companies were Target and T.Rowe Price. Click to read."}, {"date": "20240425190300", "headline": "30 out of 34 industrial stocks post EPS wins, while half of them beat revenue estimates - Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426022500", "headline": "UPS And FedEx Confront Obstacles In Going Electric: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426042413", "headline": "Increases to United Parcel Service, Inc.'s (NYSE:UPS) CEO Compensation Might Cool off for now", "summary": "Key Insights United Parcel Service to hold its Annual General Meeting on 2nd of May CEO Carol Tome's total compensation..."}, {"date": "20240426060000", "headline": "Another union throws support behind Ancora's proxy fight with Norfolk Southern", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426065700", "headline": "Garrett Holland Recommends Buy on UPS, Citing Strong Q1 Performance and Positive 2024 Outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426102845", "headline": "Is It Time To Buy These Beaten Down Dividend Stocks?", "summary": "Amid the growing volatility in the stock market, as the macroeconomic headwinds and geopolitical tensions pile on, investors are increasingly being drawn towards high-paying dividend stocks. These stocks often emerge as an attractive option for those ..."}, {"date": "20240427013900", "headline": "UPS Stock: Buy, Sell, or Hold?", "summary": "The company's first-quarter earnings helped restore confidence in its full-year guidance."}, {"date": "20240427142000", "headline": "Is UPS Stock Going to $169? 1 Wall Street Analyst Thinks So", "summary": "The company's recent results were mixed, and Wall Street's reaction was underwhelming."}, {"date": "20240428063026", "headline": "Why I have hated this earnings season — and you might too", "summary": "This earnings has started with a whimper."}, {"date": "20240428164953", "headline": "What is an Annuity for Retirement? 15 Dividend Stocks to Buy Instead", "summary": "In this article, we discuss what is an annuity for retirement and 15 dividend stocks to buy instead. You can skip our detailed analysis on the subject, and go directly to read What is an Annuity for Retirement? 5 Dividend Stocks to Buy Instead. For many Americans approaching retirement age, one of the most significant […]"}, {"date": "20240429015000", "headline": "Glass Lewis throws weight behind Ancora nominees", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429035100", "headline": "U.S. and Canadian hotel workers plan May Day rally for higher pay, increased staffing", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429100400", "headline": "Investors trying to take control of Norfolk Southern railroad pick up key support", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430040200", "headline": "Peering Into United Parcel Service's Recent Short Interest", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430224900", "headline": "UPS declares $1.63 dividend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430230400", "headline": "Stocks to Sell: 3 Earnings Disasters to Ditch Before It’s Too Late", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501024900", "headline": "Global company events calendar", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501025500", "headline": "See Which Of The Latest 13F Filers Holds United Parcel Service", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501153600", "headline": "UPS Announces Quarterly Dividend", "summary": "ATLANTA, May 01, 2024--UPS (NYSE: UPS) today announced its regular quarterly dividend of $1.63 per share on all outstanding Class A and Class B shares."}, {"date": "20240501183500", "headline": "GLOBAL BRIEFING: Federal Reserve notes \"lack of progress\" on inflation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501194000", "headline": "Buy Rating for UPS: Anticipated Recovery and Growth Trajectory in 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501235921", "headline": "4 Fortune 500 Industry Leaders Boast Ideal April/May Dividends", "summary": "Discover the top dividend stocks among the 500 biggest US companies, yielding from 0.14% to 8.07%, and their impressive net gains."}, {"date": "20240502192400", "headline": "In Norfolk Southern board battle, proxy adviser Egan-Jones throws weight behind activist Ancora", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502231400", "headline": "3 EV Stocks That Could Make You a Fortune (if You Dare)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503062100", "headline": "Streamers, Big Banks, and Cyberattacks", "summary": "The latest earnings season gives these investors a lot to talk about."}, {"date": "20240503062500", "headline": "My Top 10 High Yield Dividend Stocks For May 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503213935", "headline": "SCHD: A Must-Have In Every Dividend Portfolio", "summary": "Schwab U.S. Dividend Equity ETF (SCHD) offers diversification and resilience with a focus on healthy dividend-paying companies, but lower total returns. Read more here."}, {"date": "20240503234149", "headline": "The 4 Factor Dividend Growth Strategy - Minor Turbulence In April", "summary": "Learn about the performance of the 4-factor dividend growth portfolio and how it compares to the S&P 500 and SCHD ETF, showcasing its alpha generation."}, {"date": "20240504041123", "headline": "Dividend Champion, Contender, And Challenger Highlights: Week Of May 5", "summary": "Stay updated on dividend activity with this weekly summary."}, {"date": "20240504090200", "headline": "This Dividend Stock Yields 4.4% and Has 15 Consecutive Years of Dividend Increases. Here's Why It's a Buy Now", "summary": "This industry-leading company is out of favor and worth buying now."}]}