{"news": [{"date": "20240422054522", "headline": "US STOCKS-Futures bounce back after Friday sell-off, Mideast tensions subside", "summary": "U.S. stock index futures rose on Monday after steep losses in the previous session as easing Middle East tensions buoyed risk appetite, while investors looked ahead to an action-packed week with major tech earnings and a key inflation print.  The Nasdaq and the S&P 500 ended lower on Friday as Netflix shares weighed after a dour quarterly earnings report, with both the indexes suffering six straight sessions of declines last week, their longest losing streak since October 2022.  Nvidia led gains across megacap growth stocks with a 1.7% rise in premarket trading, rebounding from a 10% drop in the last session."}, {"date": "20240422060103", "headline": "Verizon Communications Inc. (VZ) Q1 2024 Earnings Call Transcript", "summary": "Verizon Communications Inc. (NYSE:NYSE:VZ) Q1 2024 Earnings Conference Call April 22, 2024 8:30 AM ETCompany ParticipantsBrady Connor - SVP, IRHans Vestberg..."}, {"date": "20240422061004", "headline": "Verizon Communications (VZ) Q1 Earnings Beat Estimates", "summary": "Verizon (VZ) delivered earnings and revenue surprises of 2.68% and 1.05%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240422062000", "headline": "Noteworthy Monday Option Activity: VZ, GS, NRG", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422062300", "headline": "Vista Outdoor, Salesforce rise; Tesla, Cardinal Health fall, Monday, 4/22/2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422063000", "headline": "Is 7%-Yielding Verizon Stock A Buy On The Post-Q1 Dip?", "summary": "Verizon stock recently dipped sharply lower in the wake of releasing its Q1 results. Click here to find out our view on VZ relative to its peer T."}, {"date": "20240422063629", "headline": "Stocks to Watch Monday: Tesla, Verizon, Salesforce, Albertsons", "summary": "**↘️** **Informatica (INFA)**: The software provider's shares fell roughly 6% in premarket trading after the Journal reported that Salesforce (CRM) has backed away from its attempt to buy the company."}, {"date": "20240422063945", "headline": "Meta and Boeing Earnings, Home Sales: What to Watch This Week", "summary": "Earnings are due this week from several Magnificent Seven companies, including Tesla and Meta Platforms, the parent of Facebook and Instagram. Pending economic data include the preliminary estimate of gross domestic product for the first quarter."}, {"date": "20240422064602", "headline": "US STOCKS-Wall St eyes higher open after Friday sell-off, Mideast tensions subside", "summary": "U.S. stocks were poised to open higher on Monday after steep losses in the previous session as easing Middle East tensions buoyed risk appetite, while investors looked ahead to an action-packed week with major tech earnings and a key inflation print.  The Nasdaq and the S&P 500 ended lower on Friday as Netflix shares weighed after a dour quarterly earnings report, with both the indexes suffering six straight sessions of declines last week, their longest since October 2022.  Some megacap growth stocks edged higher in premarket trading, with Meta Platforms, Amazon.com and Apple up between 0.5% and 1.0%."}, {"date": "20240422065700", "headline": "Dow, S&P, and Nasdaq jump higher as further earnings data arrives", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422065942", "headline": "Stock market today: Wall Street drifts higher ahead of a big week for earnings reports", "summary": "NEW YORK — Wall Street is drifting higher Monday following its three-week losing streak. The S&P 500 was 0.5% higher in afternoon trading. The Dow Jones Industrial Average was up 191 points,..."}, {"date": "20240422071300", "headline": "Verizon (VZ) Beats Q1 Earnings Estimates, Misses on Revenues", "summary": "Driven by marginal improvement in revenues, Verizon (VZ) beats first-quarter 2024 earnings estimates."}, {"date": "20240422071630", "headline": "News Highlights : Top Company News of the Day - Monday at 1 PM ET", "summary": "Tesla, Li Auto Cut Prices in China as EV Competition Heats Up The price cuts came as sales of electric and hybrid vehicles in China surpassed those of traditional cars for the first time. ..."}, {"date": "20240422072500", "headline": "Wall Street Lunch: Big Tech Bearishness?", "summary": "da-kukListen below or on the go on Apple Podcasts and SpotifyThis is an abridged transcript of the podcast.Our top story so farUBS sounded a warning on its..."}, {"date": "20240422073007", "headline": "Verizon (VZ) Reports Q1 Earnings: What Key Metrics Have to Say", "summary": "While the top- and bottom-line numbers for Verizon (VZ) give a sense of how the business performed in the quarter ended March 2024, it could be worth looking at how some of its key metrics compare to Wall Street estimates and year-ago values."}, {"date": "20240422074331", "headline": "Verizon Earnings Top Views, Wireless Service Revenue Beats On Price Hikes", "summary": "Verizon dipped after the Dow giant reported Q1 earnings that fell vs. a year earlier but topped views. Wireless service revenue beat."}, {"date": "20240422075158", "headline": "Verizon Stock Falls After Revenue Misses Expectations", "summary": "Verizon Communications' revenue rose slightly last quarter as the company lost fewer postpaid phone connections than expected and benefited from higher prices for its plans.  The wireless carrier reported a profit of $4.72 billion, or $1.09 a share, for the first quarter, compared with $5.02 billion, or $1.17 a share, a year earlier.  Verizon stock was down 1.5% in morning trading."}, {"date": "20240422075632", "headline": "2 Telecom Stocks To Watch In The Stock Market Today", "summary": "Telecom stocks to put on your watchlist now."}, {"date": "20240422084027", "headline": "Stock market today: Wall Street gains ground ahead of a big week for earnings reports", "summary": "NEW YORK — Wall Street is gaining ground Monday following its three-week losing streak. The S&P 500 was 1.4% higher in afternoon trading. The Dow Jones Industrial Average was up 457 points,..."}, {"date": "20240422084524", "headline": "Verizon reaffirms guidance, loses fewer phone subscriber", "summary": "Telecom giant Verizon (VZ) reports mixed first-quarter earnings results, however, the company posted a lower-than-expected loss in postpaid phone connections. Verizon reported a loss of 68,000 postpaid phone subscribers during the quarter, beating the 100,000 subscriber loss anticipated by analysts. Additionally, Verizon reaffirmed its full-year guidance, boosting investor confidence in the stock. Yahoo Finance's Brad Smith and Seana Smith break down the details, providing insights into the company's overall financials. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Angel Smith"}, {"date": "20240422091500", "headline": "Verizon Stock Drops as Consumer Business Improves. These Challenges Remain", "summary": "The telecom company lost a net 158,000 users in its consumer division in the first quarter, a better result than in years past."}, {"date": "20240422091647", "headline": "News Highlights : Top Company News of the Day - Monday at 3 PM ET", "summary": "Disney Technology Chief Departs Aaron LaBerge will become chief technology officer of Penn Entertainment. Tesla, Li Auto Cut Prices in China as EV Competition Heats Up The price cuts..."}, {"date": "20240422093640", "headline": "Stock market today: Wall Street leaps to kick off a big week for earnings reports", "summary": "NEW YORK — U.S. stocks are charging higher Monday and clawing back a chunk of their big losses from last week, which was the worst for the S&P 500 in more than a year. The S&P 500 was up 1.2%..."}, {"date": "20240422100120", "headline": "Top Midday Stories: Verizon Shares Down, Truist Shares Up Post Earnings; CNH Industrial Names New Chief Executive; Tesla Dissolves Newly Created Marketing Team", "summary": "Top Midday Stories: Verizon Shares Down, Truist Shares Up Post Earnings; CNH Industrial Names New Chief Executive; Tesla Dissolves Newly Created Marketing Team"}, {"date": "20240422101600", "headline": "NEW YORK MARKET CLOSE: Stocks rebound as key week of earnings looms", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422102815", "headline": "Verizon Drops On Customer Losses and Lagging Revenue", "summary": "(Bloomberg) -- Verizon Communications Inc. shares dropped on Monday after the company reported continued customer losses and lagging revenue.Most Read from BloombergTrump Has Only $6.8 Million for Legal Fees With Trial UnderwayRay Dalio’s Famous Trade Is Sputtering and Investors Are BailingStocks Climb as US Earnings Kick Into High Gear: Markets WrapRussians Transform Dubai as They Flee Putin’s War: Photo EssayTikTok to Remove Executive Tasked With Fending Off US ClaimsFree cash flow also fell s"}, {"date": "20240422104943", "headline": "Smartphone upgrade: The two features consumers focus on most", "summary": "If you're in the market for a new smartphone, perhaps due to an unfortunate incident or simply desiring to trade in your personal device for the latest generation, CNET Senior Editor Lisa Eadicicco joins Wealth! to share insights on factors to consider when upgrading your smartphone. Eadicicco highlights two aspects consumers prioritize when selecting a new phone, beyond a comfortable budget: screen size and camera capabilities. She emphasizes that these are the two features consumers tend to utilize the most, stating \"they're two factors you can't really change.\" Additionally, Eadicicco outlines several considerations when choosing a network provider, including exploring better deals, evaluating coverage in your area, and even testing out the carrier's service before fully committing. For more expert insight and the latest market action, click here to watch this full episode of Wealth! This post was written by Angel Smith"}, {"date": "20240422111008", "headline": "Why Verizon Stock Was Sliding Today", "summary": "Shares the telecom operator pulled back on underwhelming revenue growth in its Q1 report."}, {"date": "20240422111500", "headline": "News Highlights : Top Company News of the Day - Monday at 7 PM ET", "summary": "FTC Sues to Block $8.5 Billion Deal to Combine Makers of Coach, Michael Kors The Federal Trade Commission said the merger would give the combined firm too much power in the market for..."}, {"date": "20240422111929", "headline": "News Highlights : Top Company News of the Day - Monday at 5 PM ET", "summary": "Hackers Broke Into Change Healthcare's Systems Days Before Cyberattack The hackers who attacked UnitedHealth Group's Change Healthcare unit were in the company's networks for more than a week..."}, {"date": "20240422132400", "headline": "Verizon’s Consumer Business Shows Improvement. Why the Stock Is Down Sharply.", "summary": "The telecom company lost a net 158,000 users in its consumer division in the first quarter, a better result than in years past."}, {"date": "20240422195000", "headline": "Investor Optimism Improves, But Fear & Greed Index Remains In 'Fear' Zone", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422202100", "headline": "Analysts Offer Insights on Communication Services Companies: Verizon (VZ), Chorus Limited (OtherCHRUF) and NerdWallet, Inc. Class A (NRDS)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422220217", "headline": "Q1 2024 Verizon Communications Inc. Earnings Call", "summary": "Q1 2024 Verizon Communications Inc. Earnings Call"}, {"date": "20240422223400", "headline": "Analysts Offer Insights on Communication Services Companies: Paramount Global Class B (PARA) and Verizon (VZ)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422224600", "headline": "Verizon Hold Rating Maintained Amid Consumer Segment Growth and Competitive Challenges", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422230400", "headline": "3 Telecom Stocks Poised to Thrive in the Face of Rising Costs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422230700", "headline": "Analysts Are Neutral on Top Communication Services Stocks: Snap (SNAP), Verizon (VZ)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240422232300", "headline": "Verizon price target lowered by $4 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423005000", "headline": "Analysts Offer Insights on Communication Services Companies: Verizon (VZ) and Electronic Arts (EA)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423010134", "headline": "Verizon Communications Inc (VZ) Q1 2024 Earnings Call Transcript Highlights: Strong Wireless ...", "summary": "Explore key financial outcomes and strategic insights from Verizon's Q1 2024 earnings, featuring robust subscriber additions and significant wireless service revenue growth."}, {"date": "20240423013700", "headline": "Verizon Frontline to demo public safety solutions at Axon Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423020500", "headline": "Lineage Announces Appointment of New Board Member", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423020600", "headline": "Expert Ratings For Verizon Communications", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423023300", "headline": "Is Verizon a Good Dividend Stock to Buy Now?", "summary": "A 17-year payout-raising streak and a dividend yield above 6% make this a hard stock to ignore right now."}, {"date": "20240423034800", "headline": "Dow's 164-point rally led by gains for Verizon, Microsoft shares", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423042900", "headline": "Treasury Yields Give Rate-Cut Hope, Why Stocks Still Face a Bumpy Ride, And 5 Other Things to Know Before the Market Opens.", "summary": "Tesla faces an EV price war in China, Trump in line for $1.3 billion media group stock award, and other news to start your day."}, {"date": "20240423044300", "headline": "Cyberattacks are on the rise, and that includes small businesses. Here's what to know", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423052900", "headline": "Dow up 263 points on gains in Verizon, Caterpillar stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423053015", "headline": "Is Verizon A Buy Amid Debate Over Consumer Market Rebound?", "summary": "VZ stock provides a solid dividend but revenue growth has stalled despite 5G wireless investments. Analysts expect a rebound in the consumer wireless business in 2024."}, {"date": "20240423061045", "headline": "Verizon Communications Inc. (NYSE:VZ) Q1 2024 Earnings Call Transcript", "summary": "Verizon Communications Inc. (NYSE:VZ) Q1 2024 Earnings Call Transcript April 22, 2024 Verizon Communications Inc. isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning and welcome to the Verizon First Quarter 2024 Earnings Conference Call. At this time, all […]"}, {"date": "20240423061500", "headline": "Verizon Poised For Growth, Strategic Network Upgrades, Strong Momentum To Drive Future Success: Analyst", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423063000", "headline": "Verizon Frontline demos public safety solutions at Axon Week", "summary": "WASHINGTON, April 23, 2024 (GLOBE NEWSWIRE) -- As a featured sponsor, Verizon Frontline will demonstrate its suite of public safety solutions at Axon Week. Hosted by public safety technology leader Axon, Axon Week combines two conferences, Axon Accelerate and TASERCON, to assemble the best from public safety’s premier technology and training conferences. “Axon Week is the ideal environment to showcase Verizon Frontline’s public safety solutions,” said Michael Adams, vice president, public sector"}, {"date": "20240423063800", "headline": "10 Communication Services Stocks Whale Activity In Today's Session", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240423070000", "headline": "Verizon Business Second Annual Latino Small Business Survey Highlights Optimism and Digitalization", "summary": "Verizon Small Business Days Kick Off April 22, Featuring Tech Checks and PromotionsWhat you need to know: Verizon Business announced its second annual Latino Small Business Survey, revealing that: Compared to non-Latino, Latino small business owners express higher levels of optimism regarding their business's financial security and the overall economic outlook.Latino small business owners prioritize technology investments, including eCommerce and network security, reflecting a clear focus on lev"}, {"date": "20240423110000", "headline": "Detroit Lions Choose Verizon as their Official 5G Network", "summary": "New partnership makes Verizon the exclusive wireless telecommunications provider of Ford FieldNEW YORK, April 23, 2024 (GLOBE NEWSWIRE) -- Verizon today announced a new partnership with the Detroit Lions to be the “Official 5G Network of the Detroit Lions” and presenting sponsor of the halftime performance at the team's annually hosted Thanksgiving game. As the Lions’ exclusive 5G and wireless services partner, Verizon will provide reliable connectivity designed to improve venue operations and e"}, {"date": "20240423142838", "headline": "Why Verizon Stock Recovered From Earnings Losses", "summary": "The market is rethinking Verizon's earnings report."}, {"date": "20240424000026", "headline": "Fitch Rates Verizon Master Trust Series 2024-3", "summary": "Fitch Ratings has assigned ratings and Rating Outlooks to the Verizon Master Trust Series 2024-3 notes issued by Verizon Master Trust .The VZMT series 2024-3 notes represent the 19th overall term..."}, {"date": "20240424000700", "headline": "Ribbon announces plans for major network modernization program for Verizon", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424003100", "headline": "The Top 7 Dividend Stocks to Buy in 2024 to Build Lasting Wealth", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424005300", "headline": "AT&T climbs on Q1 profit beat as postpaid phone subscribers rise, affirms FY24 outlook", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424024600", "headline": "RBC Capital Keeps Their Hold Rating on Verizon (VZ)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424034200", "headline": "Is a 6.8% Dividend Yield Enough Reason to Buy Verizon Stock?", "summary": "Verizon's earnings showed a steady company, but the dividend may be the best reason to buy shares."}, {"date": "20240424041000", "headline": "These Are the 10 High-Profile Stocks U.S. Politicians Have Gravitated to Most Over the Last 3 Years", "summary": "These stocks kept members of Congress especially busy."}, {"date": "20240424042628", "headline": "Analysts Have Made A Financial Statement On Verizon Communications Inc.'s (NYSE:VZ) First-Quarter Report", "summary": "The quarterly results for Verizon Communications Inc. ( NYSE:VZ ) were released last week, making it a good time to..."}, {"date": "20240424043413", "headline": "AT&T beats estimates for subscriber additions, free cash flow", "summary": "(Reuters) -AT&T surpassed Wall Street expectations for first-quarter wireless subscriber additions and free cash flow on Wednesday as more people purchased its higher-tier unlimited plans.  The telecom giant has been leaning on its 5G rollouts and plans that are usually cheaper than rivals such as Verizon to appeal to more budget-conscious consumers and drive growth in the competitive U.S. market.  AT&T added 349,000 net monthly bill-paying wireless phone subscribers in the first quarter, flying past expectations of 286,800 additions, according to five analysts polled by FactSet."}, {"date": "20240424050300", "headline": "Verizon, Home Depot share losses contribute to Dow's 100-point fall", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424060400", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424073216", "headline": "Ribbon Communications Inc. (RBBN) Q1 2024 Earnings: Misses Revenue Estimates, Narrows Losses", "summary": "Key Financial Outcomes and Analyst Expectations"}, {"date": "20240424140000", "headline": "Verizon to offer Latin music fans the chance to win a VIP experience at La Onda", "summary": "Verizon connects fans to the music they love at the inaugural edition of Festival La Onda by BottleRock® in Napa Valley, CANEW YORK, April 24, 2024 (GLOBE NEWSWIRE) -- Starting today through May 13, Verizon is inviting Latin music fans to participate in a sweepstakes for a chance to win a trip to Festival La Onda by BottleRock®. Held June 1 & 2 at the Napa Valley Expo, the inaugural edition of this two-day music festival will bring together the hottest Latin musical acts across genres including"}, {"date": "20240424142206", "headline": "Why Ribbon Communications Stock Is Soaring Today", "summary": "Ribbon's earnings were lackluster, but a monumental contract with Verizon is turning heads on Wall Street."}, {"date": "20240424143000", "headline": "Verizon readies for 2024 wildfire season", "summary": "Year-round preparation, hardened network infrastructure and mobile assets support disaster responseDENVER, April 24, 2024 (GLOBE NEWSWIRE) -- As Wildfire Awareness Month approaches in May, Verizon is committed to maintaining the safety and connectivity of communities, businesses, and first responders nationwide. With wildfires increasing in both number and severity - like in Maui last year and more recently in West Texas - the need for year-long, round-the-clock preparedness has never been more"}, {"date": "20240424192400", "headline": "3 Stocks Ready to Rebound if Interest Rates Fall in H2", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424204900", "headline": "Verizon Stock (NYSE:VZ): The Dividend Remains Safe, For Now", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424212359", "headline": "Q1 2024 Ribbon Communications Inc Earnings Call", "summary": "Q1 2024 Ribbon Communications Inc Earnings Call"}, {"date": "20240424214000", "headline": "Verizon Communications Inc. stock underperforms Thursday when compared to competitors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240424233837", "headline": "Verizon: Not A Good Fit For Dividend Growth Investors (Rating Downgrade)", "summary": ""}, {"date": "20240425010654", "headline": "Ribbon Communications Inc (RBBN) Q1 2024 Earnings Call Transcript Highlights: Key Financial ...", "summary": "Explore the detailed financial outcomes and strategic discussions from Ribbon Communications' first quarter of 2024 earnings call."}, {"date": "20240425012302", "headline": "US agency to vote to restore net neutrality rules", "summary": "The U.S. FederalCommunications Commission will vote Thursday to reinstatelandmark net neutrality rules and assume new regulatoryoversight of broadband internet rescinded under former..."}, {"date": "20240425013209", "headline": "AT&T: Despite A Painful Miss, Shares Are Trading At A Deep Discount", "summary": "AT&T is undervalued and has the potential for significant upside. Click here to see why T stock is a Buy."}, {"date": "20240425015300", "headline": "Craig-Hallum bullish on Ribbon Communications, initiates with a Buy", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425021000", "headline": "Verizon announces new benefits to Home Device Protection service", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425021000", "headline": "March's Dividend Portfolio Update Sets New All-Time Record - 100 Holdings, 21 Buys", "summary": "Portfolio changes in March focus on BDCs, aiming to increase dividend income by at least $100 each month. Click here for a detailed analysis."}, {"date": "20240425035617", "headline": "Is AT&T Or Verizon The Better Dividend Stock After Q1 2024 Earnings?", "summary": "The article examines the correlation between AT&T Inc. and Verizon Communications Inc. stocks with long-end Treasury yields. Click for our choice between T and VZ."}, {"date": "20240425070000", "headline": "Verizon gives customers more peace of mind with enhanced Home Device Protection service", "summary": "NEW YORK, April 25, 2024 (GLOBE NEWSWIRE) -- Research has shown that the average U.S. household has over $11,000 worth of home technology products1. As the number of devices we rely on at home continues to increase, so does the need to protect them. For $25/month (plus applicable taxes), customers can repair and replace an unlimited number of eligible home technology products such as TVs, tablets, laptops, wearables and gaming devices with Verizon Home Device Protect.2 Beginning April 25, custom"}, {"date": "20240425073643", "headline": "AT&T Q1 Earnings: No Reason To Get Impatient", "summary": "AT&T stock remains cheaper than Verizon with better EPS and dividend growth potential. Read more to see why I am bullish on T stock."}, {"date": "20240425075837", "headline": "Ribbon Communications Inc. (NASDAQ:RBBN) Q1 2024 Earnings Call Transcript", "summary": "Ribbon Communications Inc. (NASDAQ:RBBN) Q1 2024 Earnings Call Transcript April 24, 2024 Ribbon Communications Inc. isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Hello and welcome to the Ribbon Communications First Quarter 2024 Financial Results Conference Call. [Operator Instructions] As […]"}, {"date": "20240425080000", "headline": "How I Would Invest $100k In Today's Market To Collect A Safe Near 9% Yield", "summary": "I recommend four stocks to invest $100k in today to collect a near 9% yield. Explore more details here."}, {"date": "20240425081400", "headline": "Net neutrality restored as FCC votes to regulate internet providers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425162039", "headline": "15 Best Cheap Stocks To Buy For 2024", "summary": "In this article, we will take a look at the 15 best cheap stocks to buy for 2024. If you’d like to skip our overview of investing and some recent financial news, then please take a look at the 5 Best Cheap Stocks To Buy For 2024. While the Federal Reserve may take its time […]"}, {"date": "20240425202700", "headline": "FCC votes to bring back net neutrality rules", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240425230605", "headline": "Decoding Verizon Communications Inc (VZ): A Strategic SWOT Insight", "summary": "Insightful Analysis of Verizon's Strengths, Weaknesses, Opportunities, and Threats"}, {"date": "20240425233500", "headline": "3 Investing Moves to Make Now While the Fed Is in a Holding Pattern", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426004900", "headline": "Charter continues to shed internet subscribers, reflecting cable’s growth woes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426010000", "headline": "Verizon Q1: Don't Worry, Collect A Near 7% Yield And Be Happy", "summary": "Verizon has continued to strengthen the business by paying off debt and increasing free cash flow. Learn why VZ stock is a Buy."}, {"date": "20240426020000", "headline": "Verizon: Get Paid 6.7% While You Wait For 2024 Catalysts", "summary": "Verizon stock's performance has been affected by higher interest rates. See why I believe rate cuts later this year will be a catalyst for a VZ rebound."}, {"date": "20240426020800", "headline": "Verizon, General Motors And More On CNBC's 'Final Trades'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426034000", "headline": "Yielding 6.6%, Is Verizon a Safe Dividend Stock?", "summary": "Passive income investors are attracted to the robust dividend yield offered by Verizon stock."}, {"date": "20240426040015", "headline": "Column: After a years-long pause, the FCC resurrects 'network neutrality,' a boon for consumers", "summary": "Trump's FCC killed network neutrality, giving internet providers a green light to abuse consumers. Biden's FCC has corrected that error."}, {"date": "20240426055400", "headline": "6 out of 8 S&P500 communications services stocks deliver EPS wins this week: Earnings Scorecard", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426060000", "headline": "Verizon to award $25K crisis-response grant to Maryland Tough Baltimore Strong Key Bridge Fund", "summary": "BALTIMORE, April 26, 2024 (GLOBE NEWSWIRE) -- In response to the recent tragedy at the Francis Scott Key Bridge in Baltimore, Verizon is donating $25,000 to the Maryland Tough Baltimore Strong Key Bridge Fund in collaboration with the Baltimore Community Foundation (BCF). Verizon’s contribution to the Fund will help support children and families of the deceased and survivors; first responders reporting to the scene and its aftermath; and job placement programs for displaced port workers. Funding"}, {"date": "20240426070000", "headline": "I'm Locking Up To 8% Yield For A Better Tomorrow", "summary": "Inflation is like a hidden tax that erodes purchasing power, making it important to consider both nominal taxes and inflationary effects. Click here for my two high-yielding stocks review."}, {"date": "20240426070015", "headline": "Investors Heavily Search Verizon Communications Inc. (VZ): Here is What You Need to Know", "summary": "Verizon (VZ) has received quite a bit of attention from Zacks.com users lately. Therefore, it is wise to be aware of the facts that can impact the stock's prospects."}, {"date": "20240426101532", "headline": "New York affordable internet law revived by federal appeals court", "summary": "A divided federal appealscourt revived a 2021 New York state law intended to provideaffordable high-speed internet service to low-income families,setting aside a permanent injunction and handing a..."}, {"date": "20240427032958", "headline": "Dividend Champion, Contender, And Challenger Highlights: Week Of April 28", "summary": "Stay updated on dividend activity for Dividend Champions, Contenders, and Challengers."}, {"date": "20240427033000", "headline": "It's Time to Buy AT&T Stock Hand Over Fist", "summary": "AT&T continues to win subscribers and churn out cash flow."}, {"date": "20240428030100", "headline": "Why I Continue Buying Shares of This Healthy and Secure 6.7%-Yielding Dividend Stock", "summary": "Verizon's big-time dividend is on an increasingly sustainable foundation."}, {"date": "20240428032500", "headline": "The Top 3 Telecom Stocks to Buy in April 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428080122", "headline": "Verizon Communications Inc. (NYSE:VZ) Delivered A Better ROE Than Its Industry", "summary": "While some investors are already well versed in financial metrics (hat tip), this article is for those who would like..."}, {"date": "20240428165443", "headline": "Dividend Stock Portfolio For Income: Top 15 Stocks", "summary": "In this article, we will discuss dividend stocks for regular income. You can skip our detailed analysis of dividend stocks and their historical performance, and go directly to read Dividend Stock Portfolio For Income: Top 5 Stocks. It is generally believed that dividend stocks are primarily suitable for people approaching retirement. However, this is far from […]"}, {"date": "20240428193700", "headline": "FCC fines U.S. wireless carriers over $200M for illegally sharing location data", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428194800", "headline": "This Is What Whales Are Betting On Verizon Communications", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428215500", "headline": "Verizon management to meet with Oppenheimer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428222509", "headline": "Verizon receives 2024 ENERGY STAR Award for 12th consecutive year", "summary": "NEW YORK - The U.S. Environmental Protection Agency has recognized Verizon Communications Inc. as a recipient of the 2024 ENERGY STAR® Partner of the Year - Sustained Excellence Award in the Energy..."}, {"date": "20240429005240", "headline": "Verizon Is A Good Dividend Hideout Despite Mixed Q1 Numbers - Hold", "summary": "Despite a mixed Q1 report, the turnaround story at Verizon remains intact. Find out why I continue to rate VZ stock a 'Hold' in the high $30s."}, {"date": "20240429021900", "headline": "Arista set to benefit from rise in big tech cloud capex: Citi", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429021900", "headline": "Better Dividend Stock: AT&T vs. Verizon", "summary": "Both telecom giants offer dividend dividend yields above 6% at the moment."}, {"date": "20240429025100", "headline": "Apple, Verizon share gains contribute to Dow's nearly 100-point climb", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429062900", "headline": "3 Steady Stocks Predicted to Double in Value by 2026", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429064200", "headline": "FCC fines largest wireless carriers nearly $200M for location data violations", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429080131", "headline": "'Forget Shark Tank, Forget Bitcoin' Kevin O'Leary Says He Prefers Investments That Produce Cash Flow", "summary": "Are you looking to build a solid investment portfolio that can weather any market condition? Look no further than the wisdom of Kevin O’Leary, the renowned venture capitalist and Shark Tank star. In a recent LinkedIn post, O’Leary shared his ..."}, {"date": "20240429102800", "headline": "AT&T Stock Gets Upgrade After Earnings. There’s a ‘Unique Window of Opportunity.’", "summary": "Barclays analysts lifted their rating on the telecom stock to Overweight from Equal Weight on Monday."}, {"date": "20240429120300", "headline": "FCC levies nearly $200M in fines on top wireless carriers for sharing location info", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429121914", "headline": "UPDATE 1-FCC fines US wireless carriers over illegal location data sharing", "summary": "The Federal Communications Commission on Monday fined the largest U.S. wireless carriers nearly $200 million for illegally sharing access to customers’ location information.  The FCC is finalizing fines first proposed in February 2020, including $80 million for T-Mobile; $12 million for Sprint, which T-Mobile has since acquired; $57 million for AT&T , and nearly $47 million for Verizon Communications.  The carriers sold \"real-time location information to data aggregators, allowing this highly sensitive data to wind up in the hands of bail-bond companies, bounty hunters, and other shady actors,\" FCC Chair Jessica Rosenworcel said in a statement."}, {"date": "20240429133840", "headline": "FCC fines wireless carriers millions for sharing user locations without consent", "summary": "The US government has issued millions of dollars in fines to AT&T, Sprint, T-Mobile and Verizon after an investigation found the nation’s top wireless carriers had illegally shared customers’ personal data without their consent."}, {"date": "20240429135733", "headline": "T-Mobile, AT&T, Verizon Face $200 Million in Fines for Alleged Consumer Location Data Violations, FCC Says", "summary": "T-Mobile, AT&T, Verizon Face $200 Million in Fines for Alleged Consumer Location Data Violations, FCC Says"}, {"date": "20240429135748", "headline": "Wireless Carriers Say They’ll Fight FCC on Fines  Over Customer Location Data", "summary": "(Bloomberg) -- The top three US wireless providers vowed to fight fines totaling almost $200 million by regulators who said the carriers illegally shared customers’ location information.Most Read from BloombergTesla Soars on Tentative China Approval for Driving SystemStocks Trade for 390 Minutes a Day. Increasingly, Only 10 MatterYen Sparks Intervention Suspicion After U-Turn From 1990 LowsWhat 60,000 Headlines Say About the Fed’s Next MoveUS Warns ICC Action on Israel Would Hurt Cease-Fire Chan"}, {"date": "20240429155200", "headline": "Verizon, AT&T, and T-Mobile Will Fight FCC’s $200 Million in Fines", "summary": "Regulators fined the wireless carriers for selling customer location data without consent. They said they would appeal."}, {"date": "20240429155600", "headline": "FCC Fines Wireless Carriers About $200 Million for Sharing Customer Data", "summary": "Federal regulators fined wireless carriers  Verizon AT&T T-Mobile  and Sprint nearly $200 million for sharing customer-location data without consent.  The Federal Communications Commission on Monday said that an investigation found the four carriers sold access to customers’ location data to aggregators, who resold the data to third parties.  The FCC said that Verizon was fined $46.9 million, AT&T was fined $57.3 million, T-Mobile was fined $80.1 million and Sprint was fined $12.2 million."}, {"date": "20240429192700", "headline": "FCC fines wireless carriers nearly $200 million for sharing user locations without consent", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429193800", "headline": "3 Stocks Riding the M&A Wave to Riches", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429211200", "headline": "Market Crash Counterpunch: 3 Stocks to Buy for the Coming Downturn", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430003800", "headline": "Verizon (VZ) Gets a Buy from Oppenheimer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430005038", "headline": "Wall Street Breakfast Podcast: NBC Pitches $2.5B A Year For NBA TV Rights", "summary": "NBC pitches paying $2.5B a year for NBA TV rights to edge out Warner Bros' TNT. FCC fines U.S. wireless carriers nearly $200M for illegally sharing location data."}, {"date": "20240430023700", "headline": "2 Dow Jones Dividend Stocks That Still Look Like Bargains", "summary": "These reliably profitable businesses have underperformed this year."}, {"date": "20240430030200", "headline": "Verizon, Houston Dynamo Football Club extend partnership agreement", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430043500", "headline": "FCC fines wireless carriers for sharing user locations without consent", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430061609", "headline": "Verizon Communications : Business & We Are Incandescent's UKII unveil the future of UK industry", "summary": "04/30/2024|Responsible Business|Societal Responsibility Verizon Business & We Are Incandescent's UKII unveil the future of UK industry ..."}, {"date": "20240430071540", "headline": "Verizon, AT&T, T-Mobile, Sprint all fined by FCC for sharing customer data", "summary": "The FCC has fined the largest U.S. wireless carriers for sharing users' geolocation histories with third parties. T-Mobile was hit the hardest with an $80 million fine."}, {"date": "20240430080000", "headline": "Houston Dynamo Football Club and Verizon extend partnership agreement for 2024 season", "summary": "Verizon will continue as the Official 5G partner of Houston Dynamo FC and the Houston DashNEED TO KNOW: Verizon will serve as presenting partner for Fan Appreciation Weekend, a special weekend of unique fan experiences and activations to thank fans for their support, for both the Dash and Dynamo in 2024.Additional experiences, presented by Verizon, include a pre-game festival as part of Hispanic Heritage Night.Verizon will be featured on both the Dash and Dynamo training tops for the season.The"}, {"date": "20240430091511", "headline": "US FCC resumes oversight over broadband providers, cancelling 2017 memo", "summary": "The FederalCommunications Commission said on Tuesday it hasterminated a 2017 memorandum of understanding with the FederalTrade Commission that had shifted some oversight of broadbandservice..."}, {"date": "20240430100000", "headline": "Verizon partners with Latina-owned small business Hija de tu Madre for exclusive Mother’s Day merch", "summary": "Starting May 7, visit participating stores across the country to get the exclusive mercado bag designed by Hija de tu Madre as a gift with purchase NEW YORK, April 30, 2024 (GLOBE NEWSWIRE) -- May is the month of Mom at Verizon. We have offers that allow you to save big by gifting mom the latest tech, entertainment and accessories to stay connected year-round. And beginning May 7, you can also score a limited-edition Mother’s Day mercado bag designed by Hija de tu Madre founder Patty Delgado whe"}, {"date": "20240430100038", "headline": "US FCC resumes full oversight of broadband service providers", "summary": "The FederalCommunications Commission said on Tuesday it hasterminated a 2017 memorandum of understanding with the FederalTrade Commission that had shifted some oversight of broadbandservice..."}, {"date": "20240430103000", "headline": "Verizon Business kicks off 2024 Innovation Sessions in Chicago’s historic Soldier Field", "summary": "Verizon Business and Nokia to showcase the latest in digital transformation innovations for enterprise and public sector leaders, and small business owners on May 1NEW YORK, April 30, 2024 (GLOBE NEWSWIRE) -- Verizon Business, in collaboration with Nokia, is heading to Chicago to showcase the latest technologies driving business innovation and powering business growth at the first Innovation Session of 2024. This invite-only event will follow a curated program highlighting the transformative imp"}, {"date": "20240430113421", "headline": "Crushed From $60 To $40, Is It Time To Buy 6.6% Yielding Verizon?", "summary": "Telco businesses have fallen out of favor with investors due to rising interest rates and high leverage. Read why is it time to buy 6.6% yielding Verizon here."}, {"date": "20240430120000", "headline": "Why SCHD Should Be A Strategic Core Position Of Your Dividend Income Portfolio", "summary": "Discover why adding SCHD positions to your dividend income portfolio is a smart move, a superior choice in terms of risk and reward. Read here for more details."}, {"date": "20240430123400", "headline": "Forget What You Know About AT&T Stock. This Analyst Says It’s Time to Buy.", "summary": "Barclays analysts lifted their rating on the telecom stock to Overweight from Equal Weight on Monday."}, {"date": "20240430160900", "headline": "Verizon donates $20,000 to the American Red Cross for disaster relief efforts in Oklahoma", "summary": "The donation will support communities hardest hit by this weekend’s stormsOKLAHOMA CITY, April 30, 2024 (GLOBE NEWSWIRE) -- In response to the severe storms and deadly tornadoes that covered Oklahoma this past weekend, Verizon is donating $20,000 to the American Red Cross to aid in relief efforts in Oklahoma. “Our hearts go out to the families impacted by the severe storms and tornadoes this weekend in Southern and Central Oklahoma,” said Michelle R. Miller, SVP and Market President, Verizon. “O"}, {"date": "20240430220100", "headline": "2024 Data Breach Investigations Report: Half of the Breaches in EMEA are Internal", "summary": "What you need to know: More than two-thirds (68%) of breaches globally involve a non-malicious human action.Vulnerability exploitation experienced 180% growth vs 2023.On average it took organisations about 55 days to patch 50% of their critical vulnerabilities. LONDON, May 01, 2024 (GLOBE NEWSWIRE) -- Verizon Business today released the results of its 17th annual Data Breach Investigations Report (DBIR), which analysed 8,302 security incidents in Europe, the Middle East and Africa (EMEA), of whi"}, {"date": "20240430223300", "headline": "2024 Data Breach Investigations Report: Vulnerability exploitation boom threatens cybersecurity", "summary": "What you need to know: Vulnerability exploitation surged by nearly 3X (180%) last year.Ransomware and the meteoric rise of extortion techniques accounted for a third (32%) of all breaches.More than two-thirds (68%) of breaches involve a non-malicious human element.30,458 security incidents and 10,626 confirmed breaches were analyzed in 2023—a two-fold increase over 2022.Verizon security by the numbers: 4,200+ networks managed globally, 34 trillion raw logs processed/year, and 9 security operatio"}, {"date": "20240501033000", "headline": "1 Huge Reason Verizon Should Slash Its Dividend Now", "summary": "3M has shown that cutting the dividend may not be a bad idea."}, {"date": "20240501063900", "headline": "7 Stocks That Will Continue to Climb Even When the Market Crashes", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501073400", "headline": "Cord-Cutting 2.0: Cause for Worry?", "summary": "We also take a look at On Holding's appeal for shoe lovers and stockholders."}, {"date": "20240501083000", "headline": "1 Wall Street Analyst Thinks Verizon Stock Is Going to $48. Is It a Buy Around $40?", "summary": "Size has its advantages in the telecom world."}, {"date": "20240501111600", "headline": "Rates Staying Higher for Longer Could Mean More Big Goodwill Write-Downs Ahead", "summary": "Walgreens, Lumen, Truist and Verizon are among the companies with the largest impairments in the past year."}, {"date": "20240501235921", "headline": "4 Fortune 500 Industry Leaders Boast Ideal April/May Dividends", "summary": "Discover the top dividend stocks among the 500 biggest US companies, yielding from 0.14% to 8.07%, and their impressive net gains."}, {"date": "20240502020419", "headline": "2024 Data Breach Investigations Report: Espionage attacks dominate APAC’s cyber security landscape", "summary": "05/01/2024|Networks & Platforms|Networks Solutions for Business 2024 Data Breach Investigations Report: Espionage attacks dominate APAC's cyber..."}, {"date": "20240502030000", "headline": "Dividend Harvesting Portfolio Week 165: $16,500 Allocated, $1,478.71 In Projected Dividends", "summary": "The markets had a good week, and the Dividend Harvesting Portfolio is meeting all the investment objectives. Learn more about Dividend Harvesting Portfolio here."}, {"date": "20240502035000", "headline": "My Top 5 Favorite High-Yield Dividend Stocks to Buy in May", "summary": "Income investors can buy in May and go away with these stocks."}, {"date": "20240502050039", "headline": "Shareholders in Verizon Communications (NYSE:VZ) are in the red if they invested three years ago", "summary": "For many investors, the main point of stock picking is to generate higher returns than the overall market. But its..."}, {"date": "20240502060000", "headline": "Best Dividend Stock: Verizon Stock vs. AT&T Stock", "summary": "Passive income investors can choose between two dividend stocks yielding more than 6%."}, {"date": "20240502060000", "headline": "Verizon Is Ready To Keep You Connected Throughout The 2024 Hurricane Season", "summary": "Robust planning, network upgrades, and mobile assets: essential elements of response planNEW YORK, May 02, 2024 (GLOBE NEWSWIRE) -- As the 2024 hurricane season approaches, Verizon remains committed to keeping communities and first responders connected during severe weather events. With the combination of anomalously warm sea surface temperatures in the Atlantic basin, and the dissipation of El Niño in the Pacific, this year's Atlantic hurricane season is likely to be well above average. Verizon"}, {"date": "20240502082619", "headline": "Verizon Q1: The More It Drops, The More I'll Buy", "summary": "I believe the risk and income proposition for Verizon is exceptionally attractive. Read more to see an overview and analysis of VZ stock."}, {"date": "20240502102034", "headline": "25 Most Profitable Companies in the US", "summary": "In this piece, we will take a look at the 25 most profitable companies in the US. If you want to skip our overview of the US economy and the current business climate, you can jump ahead to the 5 Most Profitable Companies in the US. With the second quarter of 2024 with us, Wall Street […]"}, {"date": "20240502153754", "headline": "Paramount has spent a decade as the source of buyout rumors. That might finally come to an end.", "summary": "Paramount's exclusivity window with Skydance expires on Friday."}, {"date": "20240502182709", "headline": "15 Best Places to Retire in Montana", "summary": "This article takes a look at the 15 best places to retire in Montana. If you wish to skip our detailed analysis of the impact that climate change has on US retirement, you may go to 5 Best Places to Retire in Montana. Climate Change and the Impact on American Retirement $16,972 – that’s the […]"}, {"date": "20240503013000", "headline": "A Simple, 5-ETF Dividend Portfolio You Could Potentially Retire On", "summary": "Dividend growth investors may want to add some ETFs to their portfolio. Find out the ETF portfolio that can help investors retire at a faster pace."}, {"date": "20240503053059", "headline": "Uniti And Windstream: The Circle Of Capital Markets", "summary": "Uniti Group to merge with Windstream, enabling network expansion and improved customer services in the telecom sector. See why we continue to rate UNIT as Sell."}, {"date": "20240503070231", "headline": "We Think Shareholders May Want To Consider A Review Of Verizon Communications Inc.'s (NYSE:VZ) CEO Compensation Package", "summary": "Key Insights Verizon Communications to hold its Annual General Meeting on 9th of May CEO Hans Vestberg's total..."}, {"date": "20240503103900", "headline": "Verizon Business to spotlight the fast-changing cybersecurity landscape and how to manage it at RSA Conference™", "summary": "Verizon Business has the unique position of being a global leader in cybersecurity with network expertise and visibility.NEW YORK, May 03, 2024 (GLOBE NEWSWIRE) -- Verizon Business will be front and center at RSA 2024 (Booth #5570) at the Moscone Center in San Francisco to demonstrate the latest cybersecurity strategies and solutions and, more importantly, how to put them to work for the business community. “Our presence at this year’s RSA is much more than just having a booth – as a global lead"}, {"date": "20240503201613", "headline": "Q1 2024 Shenandoah Telecommunications Co Earnings Call", "summary": "Q1 2024 Shenandoah Telecommunications Co Earnings Call"}, {"date": "20240503213935", "headline": "SCHD: A Must-Have In Every Dividend Portfolio", "summary": "Schwab U.S. Dividend Equity ETF (SCHD) offers diversification and resilience with a focus on healthy dividend-paying companies, but lower total returns. Read more here."}, {"date": "20240504030000", "headline": "5 Relatively Secure And Cheap Dividend Stocks To Invest In - May 2024", "summary": "There are safe, dividend-paying companies with large discounts to historical norms. Check out our selection process and our top 5 dividend stocks."}]}