{"news": [{"date": "20240425165936", "headline": "Dow Jones Futures Rise As Microsoft, Google Jump; Will New Market Rally Take Final Step?", "summary": "Microsoft and Google jumped on earnings late after the market rally attempt showed resilience Wednesday amid Meta's sell-off."}, {"date": "20240426015100", "headline": "XOM Earnings: Exxon Slips on Q1 Bottom Line Miss", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426015400", "headline": "Fly Intel: Pre-market Movers", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426015500", "headline": "Imperial announces first quarter 2024 financial and operating results", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426015600", "headline": "Imperial declares second quarter 2024 dividend", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426020300", "headline": "TOP NEWS: Exxon Mobil earnings fall on weak margins, lower gas prices", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426020300", "headline": "Imperial Oil: Q1 Earnings Snapshot", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426021000", "headline": "5 stocks to watch on Friday: XOM, CVX, ABBV and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426024000", "headline": "Unusually active option classes on open April 26th", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426030200", "headline": "These Stocks Are Moving the Most Today: Alphabet, Microsoft, Intel, Snap, Meta, Exxon, Chevron, and More", "summary": "Alphabet shares surge after Google’s parent posts better-than-expected earnings and announces its first cash dividend, Microsoft posts 31% quarterly growth in Azure cloud-computing revenue, and Snap soars after issuing a strong forecast for second-quarter sales. Earnings are scheduled Friday from Exxon Mobil and Chevron."}, {"date": "20240426030300", "headline": "Chevron CEO expects to receive HSR approval for Hess within a few weeks  -  CNBC (update)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426032600", "headline": "Biggest stock movers today: ROKU, GOOG, MSFT, SNAP, and more", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426035500", "headline": "XOM Stock Earnings: Exxon Mobil Meets EPS, Beats Revenue for Q1 2024", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426040836", "headline": "Trending : Exxon Mobil 1Q Earnings Drop", "summary": "09:52 ET -- Exxon Mobil is one of the most mentioned companies in the U.S. across all news items in the past 12 hours, according to Factiva data. Exxon reported first-quarter earnings of $8.2..."}, {"date": "20240426042115", "headline": "Exxon Mobil : NTU Singapore, ExxonMobil and A*STAR launch S$60 million corporate lab for low carbon solutions", "summary": "Singapore NewsApril 26, 2024 Share Share Facebook link opens in a..."}, {"date": "20240426042754", "headline": "Chevron Exceeds Estimates on Oil-Output Gains Amid $80 Crude", "summary": "(Bloomberg) -- Chevron Corp. surpassed expectations for a second straight quarter as strong oil-production growth from recent acquisitions helped the company take advantage of crude prices above $80 a barrel. Most Read from BloombergJavier Milei Fuels Wild Rally That Makes Peso No. 1 in WorldPlunging Home Prices, Fleeing Companies: Austin’s Glow Is FadingHuawei’s New Phone Runs Latest Version of Made-in-China ChipUS Economy Slows and Inflation Jumps, Damping Soft-Landing HopesAlphabet Beats Reve"}, {"date": "20240426043000", "headline": "ExxonMobil Announces First-Quarter 2024 Results", "summary": "SPRING, Texas, April 26, 2024--Exxon Mobil Corporation (NYSE:XOM):"}, {"date": "20240426043000", "headline": "Exxon profit drops 28%, falls short of estimates", "summary": "Exxon Mobil Corp on Friday missed analysts' estimates with a 28% year-on-year drop in first quarter profits as weaker refining margins and lower natural gas prices offset volume gains."}, {"date": "20240426043804", "headline": "Exxon misses on Q1 profit despite big gains in Guyana", "summary": "Exxon Mobil Corp on Friday missed analysts' estimates with a 28% year-on-year drop in first quarter profits as weaker refining margins and lower natural gas prices offset volume gains.  The largest U.S. oil company, which is in the process of closing a $60 billion deal for top shale oil producer Pioneer Natural Resources, posted first-quarter earnings of $8.22 billion, or $2.06 per share, compared to an $11.43 billion net profit a year ago.  The results were the second highest for a first quarter in the past decade, behind the year-ago period, said Chief Financial Officer Kathryn Mikells."}, {"date": "20240426045243", "headline": "Stocks to Watch Friday: Exxon Mobil, Alphabet, Microsoft, Snap", "summary": "↗️ **Alphabet (GOOG),** **(GOOGL)**: Google’s parent said quarterly profit jumped by more than half and announced its first cash dividend. Shares soared around 12% ahead of the opening bell. ↗️ **Microsoft (MSFT)**: The software company reported quarterly results that beat Wall Street estimates for sales and revenue."}, {"date": "20240426045407", "headline": "Exxon Mobil profit declines in 1st quarter as natural gas prices fall", "summary": "Exxon Mobil's profit declined in its first quarter as natural gas prices fell and industry refining margins dropped.  The energy company earned $8.22 billion, or $2.06 per share, for the three months ended March 31.  The results didn't meet Wall Street expectations, but Exxon does not adjust its reported results based on one-time events such as assets sales."}, {"date": "20240426050013", "headline": "PCE reading, Microsoft, Alphabet jump on earnings: Yahoo Finance", "summary": "Investors are digesting the Fed's preferred inflation measure after the release of the Personal Consumption Expenditures (PCE) index.Big Tech is coming to the rescue on Wall Street. Microsoft (MSFT) and Alphabet (GOOGL, GOOG) are jumping following their latest earning reports. Both companies topped expectations and were helped by their AI businesses. The news comes after a rough day for stocks, with a weaker-than-expected GDP report and earnings from companies such as Meta (META), sending markets deep in the red. Today, we will hear from big names, including ExxonMobil (XOM), Chevron (CVX), Colgate-Palmolive (CL), and AbbVie (ABBV). Yahoo Finance trending tickers include Intel (INTC), Snap (SNAP), and Roku (ROKU). Key guests include:9 a.m. ET - Brian Rose -UBS Global Wealth Management Senior US Economist10:40 a.m. ET - Chris Peterson, Newell Brands CEO11:20 a.m. ET - Patrick Gelsinger, Intel CEO"}, {"date": "20240426050400", "headline": "What You Missed On Wall Street This Morning", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426050403", "headline": "UPDATE 1-Exxon misses on Q1 profit despite big gains in Guyana", "summary": "Exxon Mobil Corp on Friday missed analysts' estimates with a 28% year-on-year drop in first quarter profits as weaker refining margins and lower natural gas prices offset volume gains.  The largest U.S. oil company, which is in the process of closing a $60 billion deal for top shale oil producer Pioneer Natural Resources, posted first-quarter earnings of $8.22 billion, or $2.06 per share, compared to an $11.43 billion net profit a year ago.  The stock was down 2% in pre-market trading to $118.50 after reporting a profit per share of $2.06, 6% shy of Wall Street analysts' consensus for $2.20 per share, LSEG estimates showed."}, {"date": "20240426050700", "headline": "S&P 500 Gains 1%; Exxon Mobil Posts Downbeat Earnings", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426050751", "headline": "Exxon Mobil : Cautionary statement Q1 2024", "summary": "Cautionary statement FORWARD-LOOKINGSTATEMENTS. Statements of future events, conditions, expectations, plans, ambitions, or results in this presentation or the..."}, {"date": "20240426053200", "headline": "ExxonMobil (XOM) Q1 Earnings Miss Estimates, Revenues Fall Y/Y", "summary": "ExxonMobil's (XOM) Q1 earnings suffer due to decreased total production and lower natural gas price realizations."}, {"date": "20240426054100", "headline": "Exxon and Chevron Post Lower Earnings. Their Stocks Are Falling.", "summary": "Chevron reported earnings in line with expectations while Exxon Mobil came in weaker than expected.  Chevron said earnings per share in the first quarter was $2.93, compared with analyst estimates for $2.92.  Exxon’s first-quarter EPS was $2.06, lower than expectations for $2.19."}, {"date": "20240426054300", "headline": "Exxon and Chevron Earnings Fall Back to Earth", "summary": "The oil companies are still printing big profits, but their postpandemic run of record earnings is slowing down."}, {"date": "20240426055200", "headline": "S&P 500 Futures Rise With PCE Inflation in Focus", "summary": "Futures tied to the tech-heavy Nasdaq-100, S&P 500 and the Dow industrials edged up ahead of the personal-consumption expenditures price index for March."}, {"date": "20240426055214", "headline": "Exxon Mobil Corporation (XOM) Q1 2024 Earnings Call Transcript", "summary": "Exxon Mobil Corporation (NYSE:NYSE:XOM) Q1 2024 Earnings Conference Call April 26, 2024 8:30 AM ETCompany ParticipantsDarren Woods - Chairman, Chief..."}, {"date": "20240426055215", "headline": "Exxon Mobil Corp (XOM) Reports Mixed Q1 2024 Results: Earnings Miss, Revenue Aligns with ...", "summary": "Insight into Exxon Mobil's First Quarter Financials and Strategic Developments"}, {"date": "20240426064737", "headline": "Exxon Mobil First-Quarter Earnings Miss Views Amid Lower Oil Refining Margins, Gas Prices", "summary": "Exxon Mobil First-Quarter Earnings Miss Views Amid Lower Oil Refining Margins, Gas Prices"}, {"date": "20240426065000", "headline": "Tech Stocks Rebound As Magnificent 7 Roar On Strong Earnings, Energy Giants Tumble: What's Driving Markets Friday?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426073301", "headline": "PCE, big tech, and energy earnings: 3 Things", "summary": "The Personal Consumption Expenditure (PCE) index, the Federal Reserve's preferred measure of inflation, came in hotter-than-expected for March at 2.8%, potentially delaying the Fed's next round of rate cuts. Shares of Alphabet (GOOG,GOOGL) and Microsoft (MSFT) are trading higher on Friday morning as both companies affirm their commitment to investing in AI. The companies also reported their latest quarterly earnings, beating expectations. Shares of Exxon Mobil (XOM) and Chevron (CVX) are trading lower as both companies reported mixed earnings results for the first quarter, citing lower refining margins. Yahoo Finance reporters Jennifer Schonberger, Jared Blikre, and Ines Ferre join the Morning Brief to discuss the three things investors need to watch for the trading day. For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Nicholas Jacobino"}, {"date": "20240426073726", "headline": "Exxon, Chevron Fall as First-Quarter Earnings Miss Estimates", "summary": "(Bloomberg) -- Exxon Mobil Corp. and Chevron Corp. declined after disappointing first-quarter performances despite posting strong production gains in marquee oil projects in Guyana and the Permian Basin.Most Read from BloombergJavier Milei Fuels Wild Rally That Makes Peso No. 1 in WorldPlunging Home Prices, Fleeing Companies: Austin’s Glow Is FadingHuawei’s New Phone Runs Latest Version of Made-in-China ChipUS Economy Slows and Inflation Jumps, Damping Soft-Landing HopesAlphabet Beats Revenue Es"}, {"date": "20240426075508", "headline": "Exxon, Chevron Earnings In Q1 Fall As Supermajors Spar Over South America's Oil Jewel.", "summary": "Exxon Mobil and Chevron reported first-quarter earnings and revenue declines early Friday as lower refining margins and natural gas prices took a toll on the energy giants.  Meanwhile, the two U.S. supermajors continue to squabble over Chevron's attempt to move into oil-rich Guyana.  Both XOM stock and Chevron stock initially edged lower."}, {"date": "20240426083300", "headline": "PCE In-Line to Warmer, Pre-Market Calms; ABBV Beats, XOM Misses", "summary": "Pre-market futures are up across the board: +106 points on the Dow, +45 points on the S&P 500 and +195 on the Nasdaq immediately following this important data's release."}, {"date": "20240426083300", "headline": "Exxon Spent Money to Make Money", "summary": "The oil and gas giant’s spending in recent years has opened up a huge gap with Chevron, and it might widen further."}, {"date": "20240426083502", "headline": "Exxon Mobil (XOM) Lags Q1 Earnings and Revenue Estimates", "summary": "Exxon (XOM) delivered earnings and revenue surprises of -5.94% and 4.06%, respectively, for the quarter ended March 2024. Do the numbers hold clues to what lies ahead for the stock?"}, {"date": "20240426090700", "headline": "Exxon and Chevron Stocks Fall After Earnings. The Bar Was High.", "summary": "With shares of  Exxon Mobil  and  Chevron  near their 52-week highs, the companies faced a high bar for their first-quarter earnings reports, both of which were released early on Friday.  Chevron, which beat analysts’ earnings estimates by a penny, was down 0.8%.  Exxon, which missed estimates, was down 3.6%."}, {"date": "20240426090841", "headline": "Exxon's Guyana 'mega-project' to fuel 'big growth': Strategist", "summary": "Shares of Exxon Mobil (XOM) and Chevron (CVX) are trading lower on Friday as both companies revealed a dip in first quarter revenue compared to the same period last year. However, both companies beat Wall Street revenue expectations for the quarter. While some of the forecasts for these companies are mixed, upcoming projects have the potential to turn things around. Truist Managing Director of Energy Research Neal Dingmann joins The Morning Brief to give insight into the energy sector and what investors can expect from Exxon and Chevron moving forward. Dingmann explains that growth will be accelerated by two upcoming projects in particular: \"They're going to have big growth...in Guyana and the Permian [Basin]. That's going to keep the remainder of their overall portfolio flat. Guyana is the one worth pointing out. If you look at the projects coming on through 2027 on a gross basis, which Exxon has 45% of this, that could do almost 1.2 billion barrels a day. You think that: the US alone is doing about 13 billion barrels. This is encroaching on over 10% of what the US alone could do with this project by 2027. That's why it's obviously a big deal on this litigation between Chevron and Exxon on the Hess deal. I cannot say enough about this Ghana project...It's a mega project to say the least. \" For more expert insight and the latest market action, click here to watch this full episode of Morning Brief. This post was written by Nicholas Jacobino"}, {"date": "20240426101600", "headline": "NEW YORK MARKET CLOSE: Bullish Alphabet and Microsoft fuel tech rally", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240426102425", "headline": "What Chevron, Exxon Q1 earnings mean for gas prices", "summary": "Shares of Exxon Mobil (XOM) and Chevron (CVX) traded lower on Friday as both companies revealed a year-over-year decline in first quarter revenue due to refining margins being lower. Will these reports have an effect at the pump? Yahoo Finance Reporter Ines Ferré joins Wealth! to break down the potential impact on gas prices and what consumers and investors should keep in mind moving forward. For more expert insight and the latest market action, click here to watch this full episode of Wealth! This post was written by Nicholas Jacobino"}, {"date": "20240426103016", "headline": "ExxonMobil (XOM) Q1 2024 Earnings Call Transcript", "summary": "XOM earnings call for the period ending March 31, 2024."}, {"date": "20240426103300", "headline": "Stocks on Track for Weekly Gains as PCE Inflation Hits 2.7%", "summary": "Stocks climbed, putting the major U.S. indexes on course for weekly gains despite another round of firm inflation data."}, {"date": "20240426110200", "headline": "Earnings for Big Oil backpedal as natgas prices tumble", "summary": "HOUSTON (Reuters) -U.S. and European oil companies reported weaker first quarter results on Friday due to a sharp drop in natural gas prices  compared with a year ago.  Results at oil and gas firms are still retreating from record levels in 2022 that were boosted by a surge in demand after the COVID-19 pandemic and then when prices spiked after Russia invaded Ukraine.  In the U.S., Exxon Mobil missed Wall Street earnings targets on fuel derivatives and Chevron beat tempered expectations with better-than-expected U.S. oil production."}, {"date": "20240426114014", "headline": "Total Energies: Big Projects Heading Toward Production", "summary": "TotalEnergies could make a final investment decision on the Venus and Suriname discoveries, probably leading to significant growth. Read more on TTE stock here."}, {"date": "20240426114218", "headline": "Energy Drops After Mixed Earnings -- Energy Roundup", "summary": "Shares of energy companies fell after mixed earnings. Exxon Mobil shares slid after the largest U.S. oil-and-gas producer posted a drop in first-quarter earnings, hit by a slide in natural-gas..."}, {"date": "20240426121031", "headline": "US Energy Stocks Fall Following Oil Giants' Subdued Earnings Reports", "summary": "Shares of major U.S. energy companies experienced widespread declines in the first hour of trading on Friday, subsequent to the recently released subdued earnings reports from oil giants Exxon Mobil Corp. (NYSE:XOM) and Chevron Corp. (NYSE:CVX). The Energy Select Sector SPDR Fund (NYSE:XLE), a gauge for energy sector performance, experienced a 1.7% drop, setting it up for its worst session since the end of January. Chart: Energy Stocks Witness Their Sharpest Decline Since Late January As Major O"}, {"date": "20240426125250", "headline": "Why ExxonMobil Stock Dropped on Earnings Friday", "summary": "News flash: ExxonMobil stock is still a sell."}, {"date": "20240426134308", "headline": "Exxon, Chevron Earnings Fall As Supermajors Spar Over South America's Oil Jewel", "summary": "Exxon Mobil and Chevron reported first-quarter earnings and revenue declines early Friday as lower refining margins and natural gas prices took a toll on the energy giants.  Meanwhile, the two U.S. supermajors continue to squabble over Chevron's attempt to move into oil-rich Guyana.  XOM stock fell Friday while Chevron stock shook off early losses and advanced."}, {"date": "20240426140807", "headline": "What Exxon, Chevron Q1 earnings mean for the energy sector", "summary": "Energy giants Exxon Mobil (XOM) and Chevron (CVX) are experiencing divergent stock performance following the release of their respective first quarter earnings reports today. Both companies faced headwinds from lower national gas prices and narrowing refining margins, which put pressure on their first quarter profits. However, Chevron managed to surpass expectations on adjusted earnings per share. Yahoo Finance's Jared Blikre and Julie Hyman discuss each company's first quarter earnings report, providing insights into how their financial performance is impacting share prices. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Angel Smith"}, {"date": "20240426141200", "headline": "These Stocks Moved the Most Today: Alphabet, Microsoft, Intel, Snap, Exxon, Roku, Skechers, ResMed, and More", "summary": "Alphabet shares surge after Google’s parent posts better-than-expected earnings and announces its first cash dividend, Microsoft posts 31% quarterly growth in Azure cloud-computing revenue, and Exxon Mobil’s earnings miss estimates."}, {"date": "20240426142913", "headline": "Exxon’s profits are falling, but CEO Darren Woods’ compensation rose last year—here’s how the oil giant rewards its top exec", "summary": "Exxon’s so-so first quarter came on the heels of record profits in 2022."}, {"date": "20240426205320", "headline": "Q1 2024 Exxon Mobil Corp Earnings Call", "summary": "Q1 2024 Exxon Mobil Corp Earnings Call"}, {"date": "20240426212914", "headline": "Exxon Mobil: We Are Only Looking", "summary": "Exxon Mobil's keen on acquiring Hess Guyana interest, focusing on competitive advantages and cost-cutting goals to bolster their production. Explore more here."}, {"date": "20240427010316", "headline": "Exxon Mobil Corp (XOM) Q1 2024 Earnings Call Transcript Highlights: Strategic Insights and ...", "summary": "Unveiling robust earnings, significant cost savings, and ambitious future plans, Exxon Mobil sets a confident course for 2024 and beyond."}, {"date": "20240427070000", "headline": "Exxon and Chevron Output Booms in World’s Hottest Oil Patches", "summary": "(Bloomberg) -- If you want to understand why the two largest US oil companies are together spending in excess of $100 billion on acquisitions right now, look no further than the amount of crude they’re extracting from the two hottest oil fields on the planet.Most Read from BloombergPlunging Home Prices, Fleeing Companies: Austin’s Glow Is FadingWall Street Humbled as Fast-Reversing Markets Confound the ProsApple Intensifies Talks With OpenAI for iPhone Generative AI FeaturesThe Long, Slow Death"}, {"date": "20240427073840", "headline": "Exxon Mobil First Quarter 2024 Earnings: Revenues Beat Expectations, EPS Lags", "summary": "Exxon Mobil ( NYSE:XOM ) First Quarter 2024 Results Key Financial Results Revenue: US$83.1b (down 1.3% from 1Q 2023..."}, {"date": "20240428001505", "headline": "Exxon Mobil: Positioned For Strong Growth And Current Buying Opportunity", "summary": "Exxon Mobil's Q1 2024 earnings results were mixed, beating revenue expectations but missing earnings expectations. See why I rate XOM stock a strong buy."}, {"date": "20240428003932", "headline": "Exxon Mobil Needs Consistent Perfect Execution", "summary": ""}, {"date": "20240428005047", "headline": "Turkey in talks with ExxonMobil over multibillion-dollar LNG deal, FT reports", "summary": "Turkey is in talks with US energygiant ExxonMobil over a multibillion-dollar deal to buyliquefied natural gas, in an effort to curb its dependence onRussian energy, the Financial Times reported on..."}, {"date": "20240428011200", "headline": "ExxonMobil: Buy, Sell, or Hold?", "summary": "The oil and gas giant has benefited from higher oil prices, and external factors could keep them high for longer."}, {"date": "20240428023400", "headline": "Turkey in talks with Exxon over multibillion dollar LNG supply deal - FT", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428045047", "headline": "UPDATE 1-Turkey in talks with ExxonMobil over multibillion-dollar LNG deal, FT reports", "summary": "Turkey is in talks with US energy giant ExxonMobil over a multibillion-dollar deal to buy liquefied natural gas, in an effort to curb its dependence on Russian energy, the Financial Times reported on Sunday.  The country is seeking to build a \"new supply portfolio\" that will make it less reliant on any single partner, Turkey's Energy Minister Alparslan Bayraktar told the FT in an interview.  Turkey would secure up to 2.5 million tonnes of LNG a year through a long-term deal under discussion with Exxon, Bayraktar told FT."}, {"date": "20240428054600", "headline": "While ExxonMobil's Profit Is Plunging, Its Strategy Could Pay Big Dividends in the Coming Years", "summary": "Exxon has multiple catalysts to drive robust earnings growth through 2027."}, {"date": "20240428085738", "headline": "Republicans are Buying These 10 Oil and Gas Stocks", "summary": "In this article, we will take a detailed look at Republicans are Buying These 10 Oil and Gas Stocks. For a quick overview of such stocks, read our article Republicans are Buying These 5 Oil and Gas Stocks. Energy stocks are in the limelight this year amid geopolitical tensions in the Middle East and recession fears. The […]"}, {"date": "20240428191600", "headline": "Exxon Mobil (XOM) Receives a Hold from RBC Capital", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428222600", "headline": "Do You Have $500? Buy These 3 Stocks Now or Regret It Later", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240428224700", "headline": "Barclays Reaffirms Their Buy Rating on Exxon Mobil (XOM)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429001300", "headline": "Wall Street Breakfast: Self-Driving Push", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429001500", "headline": "ProPetro in three year deal with Exxon in Permian, no terms", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429003000", "headline": "Turkey Reportedly Turns East For Gas, Reportedly Eyes Exxon Deal To Ditch Russia", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429003600", "headline": "Scotiabank Keeps Their Hold Rating on Exxon Mobil (XOM)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429004623", "headline": "Wall Street Breakfast Podcast: Philips Settles Ventilator Recall Lawsuits", "summary": "Philips to pay $1B to settle US litigation over sleep apnea devices. Turkey in talks with Exxon over multibillion dollar LNG supply deal. Skydance makes 'best and final' offer for Paramount."}, {"date": "20240429015500", "headline": "Imperial appoints Senior Vice President, Upstream", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429034200", "headline": "Company News for Apr 29, 2024", "summary": "Companies In The News Are: INTC, WDC, XOM, CL."}, {"date": "20240429034900", "headline": "Here are the most efficient companies within the S&P 500’s bargain-stock sector", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429041600", "headline": "Exxon Mobil (XOM) Receives a Buy from Wells Fargo", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429053817", "headline": "Phillips 66: Turnaround Still Very Much A Work In Progress", "summary": "Phillips 66's Q1 earnings report was another in a long line of disappointing results. Learn why PSX's refining \"turnaround\" is still a work in progress."}, {"date": "20240429061500", "headline": "3 Things You Need to Know About ExxonMobil's Dividend", "summary": "ExxonMobil has a very consistent approach to paying dividends."}, {"date": "20240429062300", "headline": "Looking At Exxon Mobil's Recent Unusual Options Activity", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429065600", "headline": "Will Earnings Cheer Continue To Buoy Markets? Apple, Amazon, Pfizer, Coinbase Lead Flurry Of Q1 Reports This Week", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429072002", "headline": "Exxon Traders Rejecting London Move Face Job Cuts, Unions Say", "summary": "(Bloomberg) -- Some traders working for Exxon Mobil Corp. are set to lose their jobs because they don’t want to move from Brussels to London, according to a statement from its unions.Most Read from BloombergTesla Soars on Tentative Approval for Driving System in ChinaMusk Makes Surprise China Visit in Search of Tesla Revenue BoostElliott Built ‘Large’ Stake in Buffett-Favored Sumitomo, Source SaysYen Sparks Intervention Suspicion After U-Turn From 1990 LowsStocks Trade for 390 Minutes a Day. Inc"}, {"date": "20240429080540", "headline": "Global upstream sector set for deals worth $150 bln over rest of 2024, report says", "summary": "April 29 - The global upstream industry could see dealmaking worthanother $150 billion throughout the remainder of the year, withfocus shifting to shale plays in U.S...."}, {"date": "20240429083408", "headline": "Exxon Mobil, Chevron Strategies Hinge On Latest Oil Hotspot", "summary": "Exxon Mobil and Chevron reported first-quarter earnings and revenue declines Friday as lower refining margins and natural gas prices took a toll on the energy giants.  Meanwhile, the two U.S. supermajors continue to squabble over Chevron's attempt to move into oil-rich Guyana.  Exxon Mobil Q1 EPS came in at $2.06, down 27% compared to Q1 2023, while revenue decreased 4% to $83.08 billion."}, {"date": "20240429091705", "headline": "Market Chatter: Exxon's Brussels-Based Traders Are Set to Lose Jobs for Refusing Relocation to London", "summary": "Market Chatter: Exxon's Brussels-Based Traders Are Set to Lose Jobs for Refusing Relocation to London"}, {"date": "20240429094509", "headline": "Why Exxon Mobil (XOM) is a Top Dividend Stock for Your Portfolio", "summary": "Dividends are one of the best benefits to being a shareholder, but finding a great dividend stock is no easy task. Does Exxon Mobil (XOM) have what it takes? Let's find out."}, {"date": "20240429101105", "headline": "20 Biggest Chemical Companies in Australia, 2024", "summary": "In this article, we will take a look at 20 Biggest Chemical Companies in Australia, 2024. If you want to see more of the Biggest Chemical Companies in Australia, 2024, go directly to 5 Biggest Chemical Companies in Australia, 2024. Chemical compounds, made from organic and inorganic materials, are super important due to their diverse set […]"}, {"date": "20240429102000", "headline": "Energy ETFs in Focus Post Exxon, Chevron's Weak Q1 Earnings", "summary": "Two energy behemoths, Exxon Mobil Corp. (XOM) and Chevron Corp. (CVX), reported disappointing first-quarter 2024 results. Both companies lagged estimates on revenues, while Chevron managed to beat earnings estimates."}, {"date": "20240429110058", "headline": "20 Biggest Oil Producing Countries in Asia", "summary": "In this article, we will look at the 20 Biggest Oil Producing Countries in Asia. If you want to skip our discussion of the energy markets, you can go directly to the 5 Biggest Oil Producing Countries in Asia. Oil demand is surging! The International Energy Agency (IEA) reports a jump of 2.3 million barrels […]"}, {"date": "20240429110106", "headline": "Exxon Mobil Corp (XOM) Q1 2024 Earnings Call Transcript Highlights: Strategic Moves and ...", "summary": "Discover how Exxon Mobil Corp is navigating market challenges and capitalizing on new opportunities in the evolving energy sector."}, {"date": "20240429110500", "headline": "Chevron CEO: Permian, D-J Basin Production Fuels US Output Growth", "summary": "Chevron continued to prioritize Permian Basin investment for new production and is seeing D-J Basin growth after closing its $6.3 billion acquisition of PDC Energy last year, CEO Mike Wirth said."}, {"date": "20240429125040", "headline": "Oil traders refuse to leave Brussels for London because of low pay", "summary": "Oil traders working for US giant ExxonMobil face losing their jobs because they refuse to leave Brussels for London over poor pay."}, {"date": "20240429144438", "headline": "Chevron CEO Sees Exxon Arbitration Resolved in Coming Months", "summary": "(Bloomberg) -- Chevron Corp. expects a resolution to a dispute with Exxon Mobil Corp. over a Guyana oil contract in coming months that would allow for the completion of the $53 billion acquisition of Hess Corp. this year. Most Read from BloombergTesla Soars on Tentative China Approval for Driving SystemStocks Trade for 390 Minutes a Day. Increasingly, Only 10 MatterUS Warns ICC Action on Israel Would Hurt Cease-Fire ChancesYen Sparks Intervention Suspicion After U-Turn From 1990 LowsWhat 60,000"}, {"date": "20240429160000", "headline": "Lower Natural Gas Prices Squeeze Big Oil's Profits in Q1 2024", "summary": "U.S. supermajors ExxonMobil and Chevron, as well as France's TotalEnergies, all cited lower natural gas prices as a key downward pressure on earnings"}, {"date": "20240429160524", "headline": "Diamondback Energy and Endeavor receive second FTC request over $26 bln deal", "summary": "Oil and gas firm Diamondback Energy said on Monday it had received a second request from the U.S. Federal Trade Commission (FTC) in connection with the $26 billion deal to buy privately-held Endeavor.  The U.S. antitrust regulator has asked for additional information and documentary material as part of its review of the proposed merger.  Midland, Texas-based Diamondback had said in February it would buy privately held rival Endeavor Energy Partners in a cash-and-stock deal, which is expected to close in the fourth quarter."}, {"date": "20240429192000", "headline": "Exxon to shut two Guyana platforms for two weeks each to connect pipeline", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429194900", "headline": "Exxon Mobil: Weighing Near-Term Headwinds Against Strategic Growth Prospects", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429230115", "headline": "Decoding Exxon Mobil Corp (XOM): A Strategic SWOT Insight", "summary": "Insightful Analysis of Exxon Mobil Corp's Financial Performance and Strategic Position"}, {"date": "20240429232900", "headline": "Exxon Mobil price target raised by $4 at Wells Fargo, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240429234600", "headline": "Exxon Mobil price target raised by $9 at HSBC, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430001700", "headline": "Exxon Mobil price target raised by $7 at TD Cowen, here's why", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430004800", "headline": "Exxon Mobil’s Strategic Growth and Sustainability Efforts Anchor Buy Recommendation", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430010000", "headline": "Exxon Makes a Long-Shot Bet on Climate Tech. Sizing Up the Costs.", "summary": "Exxon Mobil  whose business has been built on products that emit carbon dioxide, is now pulling that gas out of the air through a contraption that it thinks could help solve climate change.  Exxon CEO Darren Woods spoke about the invention this past Friday during the company’s first quarter earnings call.  It’s known as a direct air capture unit and sits at the company’s Baytown, Texas, refining and chemicals complex."}, {"date": "20240430034911", "headline": "Exxonmobil and National Basketball Association (NBA) Africa Launch Jr. National Basketball Association (NBA) League in MozambiqueFormer WNBA Player Clarisse Machanguana and 2009 NBA Champion Trevor Ariza Attend Launch Event in Maputo", "summary": "ExxonMobil and NBA Africa on Saturday launched a new Jr. NBA league in Maputo, Mozambique that will be operated by the Clarisse Machanguana Foundation , an organization founded by former WNBA player..."}, {"date": "20240430042615", "headline": "Exxonmobil and National Basketball Association (NBA) Africa Launch Jr. National Basketball Association (NBA) League in Mozambique", "summary": "ExxonMobil and NBA Africa on Saturday launched a new Jr. NBA league in Maputo, Mozambique that will be operated by the Clarisse Machanguana Foundation , an organization founded by former WNBA player..."}, {"date": "20240430050545", "headline": "Woodside Energy: Climate Becomes An Issue", "summary": "Woodside is determined to dramatically expand its oil & gas production in Asia at a time when LNG expansion is being questioned. Read more on WDS stock here."}, {"date": "20240430053700", "headline": "Big Oil Battle: Exxon Is Better Than Chevron in This Key Area, and It's Not Even Close", "summary": "Exxon is a financial fortress."}, {"date": "20240430064400", "headline": "Why You Should Buy Pioneer Natural (PXD) Ahead of Q1 Earnings", "summary": "Considering the impending mega-merger with ExxonMobil (XOM), investors may invest in Pioneer Natural (PXD) before its Q1 earnings release on May 2."}, {"date": "20240430065200", "headline": "7 Safe Haven Stocks That Can Withstand the Market’s Worst Meltdowns", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430070014", "headline": "Exxon Mobil Corporation (XOM) is Attracting Investor Attention: Here is What You Should Know", "summary": "Recently, Zacks.com users have been paying close attention to Exxon (XOM). This makes it worthwhile to examine what the stock has in store."}, {"date": "20240430070611", "headline": "Exxon Mobil Corporation 2024 Q1 - Results - Earnings Call Presentation", "summary": "The following slide deck was published by Exxon Mobil Corporation in conjunction with their 2024 Q1 earnings call."}, {"date": "20240430100000", "headline": "WTI Finds Support After Sell Off Suddenly Halts", "summary": "WTI crude found resistance at $81 per barrel this morning, countering a sell-off as traders discount geopolitical risk."}, {"date": "20240430105359", "headline": "UPDATE 2-Exxon to shut 2 platforms in Guyana for 2 weeks each to connect pipeline", "summary": "Exxon Mobil Corp will shut down two offshore oil production projects in Guyana for two weeks each, between July and August, to connect a natural gas pipeline, the company's country head Alistair Routledge told reporters in Georgetown on Tuesday.  The 140-mile (225-km) pipeline will feed Guyana's $1.9 billion gas-to-power project aimed at ending the country's dependence on imported fuels and at lowering energy costs for residents.  Exxon has said it will halt production to fulfill a commitment made with local authorities to have the pipeline connected by year end, despite delays on the government-run onshore part of the project."}, {"date": "20240430114124", "headline": "Exxon, Chevron, Other Oil Majors Blamed for Deceiving Public on Climate Change in New House Committee Report", "summary": "Exxon, Chevron, Other Oil Majors Blamed for Deceiving Public on Climate Change in New House Committee Report"}, {"date": "20240430120000", "headline": "Imperial reports voting results for election of directors", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430142524", "headline": "Analysts Are Boosting Price Targets On These Oil and gas Stocks. Is It Time To Lock In The Dividend At Current Prices?", "summary": "The energy sector has been a standout performer in recent years, with many oil and gas companies delivering strong returns and generous dividends. Now, analysts are raising their price targets on some of the industry’s biggest names, suggesting that ..."}, {"date": "20240430144833", "headline": "Why energy plays are for long-term investors", "summary": "The energy sector (XLK) has continued to outperform throughout 2024. Alpine Saxon Woods Chief Market Strategist Sarah Hunt and CFRA Energy Equity Analyst and Deputy Research Director Stewart Glickman join Market Domination to share insight on navigating this sector. Glickman emphasizes that investors looking to capitalize on the energy sector should first consider their outlook for crude oil prices. He believes that with crude oil prices are expected to average between $80 and $90 per barrel in 2024: \"In that kind of environment, you want to be positioned in upstream,\" the analyst tells Yahoo Finance. He recommends exploring names like Exxon (XOM), citing \"a lot of growth potential.\" With an uptick in mergers and acquisitions (M&A) activity throughout the sector, Glickman notes that the \"common theme\" is exposure to the Permian Basin, a trend he believes is \"likely to persist.\" Hunt acknowledges that supply and demand issues have been a headwind for the sector since the pandemic. However, with an \"energy transition underway\" she remains bullish on energy \"from a longer-term perspective.\" She also highlights the significant consolidation within the sector, with companies combining forces to boost operations and enhance their competitive edge. For more expert insight and the latest market action, click here to watch this full episode of Market Domination. This post was written by Angel Smith"}, {"date": "20240430204300", "headline": "FTC poised to approve Exxon-Pioneer deal after settlement, Bloomberg reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430210028", "headline": "Chevron: The Fast Way To Hot Spots", "summary": "Chevron has a lot of potential from both the acquisitions and the growth and income strategy. Find out why CVX stock is a Buy."}, {"date": "20240430211500", "headline": "Exxon set to win FTC OK for Pioneer deal with settlement - Bloomberg", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240430223200", "headline": "Market Today: Qualcomm Surges on Strong Guidance, Google Announces Layoffs", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501002200", "headline": "Oil prices tumble to seven-week lows on surprise build in U.S. crude stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501002235", "headline": "ExxonMobil Demonstrates 'A New Chapter in Collaboration' Through Value Chain Collaboration at NPE", "summary": "SPRING, Texas - ExxonMobil will demonstrate at its National Plastics Exhibition ballroom booth space W206AB in Orlando, Florida, how it is starting 'A new chapter in collaboration' with the..."}, {"date": "20240501003200", "headline": "Exxon To Shut Down Two Oil Projects For Pipeline Connection: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501013200", "headline": "Morning Brew: Tesla Announces Expansion Plans Amid Market Fluctuations", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501013900", "headline": "XOM, SLB, or CVX: Which Energy Stock is the Most Attractive Pick?", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501015300", "headline": "Exxon Mobil, Kimberly-Clark And 2 Other Stocks Insiders Are Selling", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501021300", "headline": "Exxon-Pioneer deal set to be cleared by FTC, reports say. But there’s an unusual twist.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501022700", "headline": "Chevron Remains Confident It Will Close This Needle-Moving Acquisition", "summary": "Chevron firmly believes Exxon's case against it has no merit."}, {"date": "20240501030500", "headline": "Stock Market Crash Warning: Don’t Get Caught Holding These 3 Oil & Gas Stocks", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501040011", "headline": "3 stocks with the biggest gains took April's biggest losses", "summary": "The stock market's very rough April saw some of the biggest gainers of the first three months take some of the biggest dings to their market caps. And at the same time, some of the sectors that struggled in Q1 saw a similar reversal of fortune in April."}, {"date": "20240501050700", "headline": "Chevron-Hess M&A is a long-short equity strategy opportunity - Steamboat Capital Partners 1Q letter", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501052643", "headline": "Earnings Miss: Exxon Mobil Corporation Missed EPS By 6.5% And Analysts Are Revising Their Forecasts", "summary": "Last week, you might have seen that Exxon Mobil Corporation ( NYSE:XOM ) released its quarterly result to the market..."}, {"date": "20240501054800", "headline": "FTC set to rule on Exxon's $60B purchase of Pioneer Natural in coming days - report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501062900", "headline": "Vallourec (VLOWY) to Supply Pipe for Whiptail Deepwater Project", "summary": "Vallourec's (VLOWY) newest contract represents the fourth significant order that it has received under a long-term agreement (LTA) with ExxonMobil Guyana (XOM)."}, {"date": "20240501062927", "headline": "US FTC set to rule on Exxon's $60 bln deal for Pioneer, Bloomberg reports", "summary": "The U.S. Federal Trade Commission isset to decide whether to sue to block Exxon Mobil's $60billion acquisition of Pioneer Natural Resources in thecoming days, Bloomberg News reported on Wednesday,..."}, {"date": "20240501065624", "headline": "US FTC set to rule on $60 bln Exxon-Pioneer deal, Bloomberg reports", "summary": "The U.S. Federal Trade Commission isset to decide whether to sue to block Exxon Mobil's $60billion acquisition of Pioneer Natural Resources in thecoming days, Bloomberg News reported on Wednesday,..."}, {"date": "20240501095307", "headline": "Exxon Mobil: ~12% Mid-Term EPS Growth Justifies Premium Valuation", "summary": "Exxon reported a soft Q1 with earnings down 29% YoY as refining income declined by 67% on significantly weaker margins. Find out why XOM stock is a Strong Buy."}, {"date": "20240501100800", "headline": "ExxonMobil (XOM) Negotiates Massive LNG Deal With Turkey", "summary": "ExxonMobil's (XOM) deal could significantly diversify and secure Turkey's energy mix, enhancing its status as a top global LNG supplier."}, {"date": "20240501101052", "headline": "FTC Set to Rule on $60 Billion Exxon-Pioneer Deal in Coming Days", "summary": "(Bloomberg) -- The Federal Trade Commission is set to decide whether to sue to block Exxon Mobil Corp.’s $60 billion acquisition of Pioneer Natural Resources Co. in coming days, according to people familiar with the matter.Most Read from BloombergTesla Axes Supercharger Team in Blow to Broader EV MarketUS and Saudis Near Defense Pact Meant to Reshape Middle EastNYPD Arrests Over 300 Protesters in Crackdown on College CampusesThe Ozempic Effect: How a Weight Loss Wonder Drug Gobbled Up an Entire"}, {"date": "20240501101539", "headline": "Pioneer CEO To Be Barred From Exxon Board In Deal With FTC- WSJ", "summary": "Pioneer Natural Resources Co: * PIONEER CEO TO BE BARRED FROM EXXON BOARD IN DEAL WITHFTC- WSJ * US FTC IS SET TO ALLEGE AS SOON AS WEDNESDAY THAT PIONEERCEOSHEFFIELD..."}, {"date": "20240501102756", "headline": "Exxon to bar Pioneer CEO from its board in deal with FTC, WSJ reports", "summary": "Exxon Mobil is set to closeits $60 billion deal for Pioneer Natural Resourcesfollowing an agreement with antitrust enforcers to not addPioneer CEO Scott Sheffield to its board, the Wall..."}, {"date": "20240501104515", "headline": "Exxon Mobil Corporation (NYSE:XOM) Q1 2024 Earnings Call Transcript", "summary": "Exxon Mobil Corporation (NYSE:XOM) Q1 2024 Earnings Call Transcript April 26, 2024 Exxon Mobil Corporation misses on earnings expectations. Reported EPS is $2.06 EPS, expectations were $2.2. Exxon Mobil Corporation isn’t one of the 30 most popular stocks among hedge funds at the end of the third quarter (see the details here). Operator: Good morning […]"}, {"date": "20240501105624", "headline": "UPDATE 3-US FTC to rule soon on $60 billion Exxon-Pioneer deal, analysts say", "summary": "The U.S. Federal Trade Commission (FTC) could release its decision in the coming days on an anti-trust review of Exxon Mobil's $60 billion acquisition of Pioneer Natural Resources, analysts said on Wednesday.  Exxon last week said it responded to the FTC's second request for information and received no indications of anti-trust issues over the deal announced in October.  Exxon CEO Darren Woods said on Friday the company had supplied an enormous \"material of documents, contracts, line items on productions and sales.\""}, {"date": "20240501110342", "headline": "US FTC to rule soon on $60 billion Exxon-Pioneer deal, analysts say", "summary": "HOUSTON (Reuters) -The U.S. Federal Trade Commission (FTC) could release its decision in the coming days on an anti-trust review of Exxon Mobil's $60 billion acquisition of Pioneer Natural Resources , analysts said on Wednesday.  Exxon last week said it responded to the FTC's second request for information and received no indications of anti-trust issues over the deal announced in October.  Exxon CEO Darren Woods said on Friday the company had supplied an enormous \"material of documents, contracts, line items on productions and sales.\""}, {"date": "20240501111647", "headline": "News Highlights : Top Company News of the Day - Wednesday at 5 PM ET", "summary": "Exxon to Close Megadeal, Pioneer CEO to Be Barred from Exxon Board in Deal With FTC Antitrust enforcers are set to allege Pioneer CEO Scott Sheffield discussed coordinating oil-production..."}, {"date": "20240501114244", "headline": "Sector Update: Energy Stocks Retreating in Wednesday Afternoon Trading", "summary": "Sector Update: Energy Stocks Retreating in Wednesday Afternoon Trading"}, {"date": "20240501133750", "headline": "Exxon Set to Win FTC Approval for Pioneer Deal on Settlement", "summary": "(Bloomberg) -- The US Federal Trade Commission is poised to greenlight Exxon Mobil Corp.’s $60 billion purchase of Pioneer Natural Resources Co. after the companies agreed to minor concessions, according to people familiar with the matter.Most Read from BloombergTesla Axes Supercharger Team in Blow to Broader EV MarketNYPD Arrests Over 300 Protesters in Crackdown on College CampusesUS and Saudis Near Defense Pact Aimed at Reshaping Middle EastThe Ozempic Effect: How a Weight Loss Wonder Drug Gob"}, {"date": "20240501134350", "headline": "Update: Market Chatter: FTC Set to Rule on Exxon Mobil-Pioneer Deal in Coming Days", "summary": "Update: Market Chatter: FTC Set to Rule on Exxon Mobil-Pioneer Deal in Coming Days"}, {"date": "20240501183000", "headline": "Ex-Pioneer CEO Barred From Exxon Board for Megadeal to Close", "summary": "Antitrust enforcers are set to allege former Pioneer CEO Scott Sheffield discussed coordinating oil-production levels with other producers and OPEC."}, {"date": "20240501202600", "headline": "Stock Market Crash Warning: Don’t Get Caught Holding These 3 Energy Stocks.", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240501204806", "headline": "Q1 2024 ProPetro Holding Corp Earnings Call", "summary": "Q1 2024 ProPetro Holding Corp Earnings Call"}, {"date": "20240501210000", "headline": "Is ESG Good Or Bad - Part II", "summary": "Part I concludes that the â\u0080\u009cEâ\u0080\u009d in ESG appears to have affected equity returns more than the â\u0080\u009cSâ\u0080\u009d and the â\u0080\u009cGâ\u0080\u009d. Part II looks at a different aspect of ESG investing."}, {"date": "20240501214000", "headline": "Tom Lee Weighs In On Market Implications Of A Potential Trump Victory: 'I Think Energy Stocks...Healthcare Would Come Under Pressure'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502000300", "headline": "Stock Market Crash Alert: 3 Must-Buy Warren Buffett Stocks When Prices Plunge", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502002900", "headline": "M&A News: Exxon Set to Receive FTC’s Nod for Pioneer Deal", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502005301", "headline": "Wall Street Breakfast Podcast: FTC Reportedly Set To Approve Exxon-Pioneer Deal", "summary": "Exxon set to win FTC OK for Pioneer deal, but without Sheffield on board - report. Carvana shorts to be potentially put to the test. Google to lay off hundreds in 'Core teams.'"}, {"date": "20240502011420", "headline": "ProPetro Holding Corp (PUMP) Q1 2024 Earnings Call Transcript Highlights: Strategic Moves and ...", "summary": "Discover how ProPetro's innovative strategies and strong Q1 results are setting the stage for future growth."}, {"date": "20240502020417", "headline": "Exxon Mobil : Shareholder Letter – May 1", "summary": "Society has two important asks of ExxonMobil: Reliably providing affordable energy and products critical to modern life and ..."}, {"date": "20240502022100", "headline": "FTC confirms order banning former Pioneer CEO from Exxon board in merger", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502022148", "headline": "ExxonMobil’s $60bn Pioneer acquisition nears FTC approval", "summary": "The US Federal Trade Commission's (FTC) nod is expected following an agreement that Pioneer's co-founder and ex-CEO, Scott Sheffield, will not join Exxon's board."}, {"date": "20240502023000", "headline": "Jamie Raskin Slams Big Oil For 'Lying' About Climate Change: 'They Acted Like Maleficent...And Cursed Everyone To Try To Go To Sleep For 100 Years'", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502023800", "headline": "Pioneer Natural says 'disagree and are surprised by' FTC's complaint", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502024400", "headline": "Shell Beat Expectations on Earnings, Buys Back Shares. The Stock Is Rising.", "summary": "Chief Executive Officer Wael Sawan is working to close the valuation gap between his company and American rivals Exxon and Chevron."}, {"date": "20240502024600", "headline": "FTC bans former Pioneer CEO from Exxon board seat in Exxon-Pioneer deal", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502033500", "headline": "Pioneer Natural Resources Responds to FTC Settlement Complaint Filed as Part of Approval of Proposed Transaction with ExxonMobil", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502034139", "headline": "Exxon to shut Guyana oil project for two weeks", "summary": "The US oil giant is planning to connect a natural gas pipeline to the oil production projects."}, {"date": "20240502040200", "headline": "Exxon says pushing forward with Mozambique LNG project", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502040600", "headline": "FTC to suggest potential criminal case against former Pioneer CEO, Semafor says", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502041500", "headline": "3 Energy Dividend Stocks That Will Thrive at $100 per Barrel Crude Oil", "summary": "This integrated major, oilfield services leader, and exploration and production company all benefit from higher oil prices."}, {"date": "20240502051400", "headline": "See Which Of The Latest 13F Filers Holds Exxon Mobil", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502051625", "headline": "News Highlights : Top Global Markets News of the Day - Thursday at 11 AM ET", "summary": "S&P 500 Moves Higher as Earnings Roll In U.S. stocks rose as investors await Apple's quarterly results among other earnings. U.S. productivity slumps in first quarter Productivity had..."}, {"date": "20240502054522", "headline": "Transocean Breaks $500k Dayrates, But Several Issues Linger", "summary": "Transocean's Atlas rig reached a $505k/d dayrate, while ultra-deepwater floater dayrates declined. Check out my 2024 financial forecast for RIG stock."}, {"date": "20240502061300", "headline": "FTC says ex-Pioneer chief tried to collude with OPEC on oil prices, WSJ reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502064000", "headline": "Here's Why You Should Bet on BP Stock Ahead of Q1 Earnings", "summary": "Given its substantial buyback programs, a pipeline of upstream projects, significant downstream operations, and attractive valuation, it is wise for investors to buy BP before its Q1 earnings release."}, {"date": "20240502064057", "headline": "Exxon to Close Pioneer Deal as FTC Forces Out Founder Sheffield", "summary": "(Bloomberg) -- The US Federal Trade Commission declined to challenge Exxon Mobil Corp.’s $60 billion purchase of Pioneer Natural Resources Co. but asserted that Scott Sheffield, Pioneer’s co-founder, must not take a seat on the supermajor’s board. Most Read from BloombergUS and Saudis Near Defense Pact Meant to Reshape Middle EastBiden Calls Ally Japan ‘Xenophobic’ Along With China, RussiaSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineTesla Axes Supercharger Team in Blow to Broade"}, {"date": "20240502064747", "headline": "US FTC signals Exxon deal approval, bars executive from board seat", "summary": "The Federal Trade Commission signaled on Thursday it was prepared to green light Exxon Mobil's $60 billion purchase of Pioneer Natural Resources on the condition Pioneer's former CEO will not be allowed to join Exxon's board.  The FTC's consent order prevents former Pioneer Natural Resources CEO Scott Sheffield from taking an offered seat on Exxon Mobil's board of directors to resolve antitrust concerns about Exxon's bid to buy the top shale oil producer."}, {"date": "20240502065956", "headline": "REFILE-UPDATE 1-US FTC signals Exxon deal approval, bars executive from board seat", "summary": "The Federal Trade Commission signaled on Thursday it was prepared to green light Exxon Mobil's $60 billion purchase of Pioneer Natural Resources on the condition Pioneer's former CEO will not be allowed to join Exxon's board.  The FTC's consent order prevents former Pioneer Natural Resources CEO Scott Sheffield from taking an offered seat on Exxon Mobil's board of directors to resolve antitrust concerns about Exxon's bid to buy the top shale oil producer.  “Mr. Sheffield’s past conduct makes it crystal clear that he should be nowhere near Exxon’s boardroom,\" said Kyle Mach, Deputy Director of the FTC’s Bureau of Competition."}, {"date": "20240502070120", "headline": "UPDATE 2-ExxonMobil pushing forward with Mozambique LNG project, official says", "summary": "ExxonMobil is \"optimistic and pushing forward\" with its delayed Rovuma liquefied natural gas (LNG) project in Mozambique and expects a final investment decision at the end of next year, a company official said on Thursday.  ExxonMobil and its partner Eni are developing the Rovuma LNG project in offshore Area 4 in northern Mozambique, with Exxon leading the construction and operation of the onshore liquefaction and related facilities, while Eni concentrates on the Coral floating LNG and upstream operations.  When TotalEnergies declared force majeure in 2021 due to an offensive by Islamic State-linked insurgents that threatened its Area 1 Mozambique LNG plant, ExxonMobil was also affected due to the development of shared and common facilities, such as an LNG jetty and offloading facility."}, {"date": "20240502083919", "headline": "Trending : FTC and Exxon Clear Way for Pioneer Deal", "summary": "14:23 ET -- Exxon Mobil is one of the most mentioned companies in the U.S. across all news items in the past 12 hours, according to Factiva data. A consent decree with the U.S. Federal Trade..."}, {"date": "20240502085648", "headline": "Update: US FTC Declines to Challenge Exxon Mobil-Pioneer Natural Resources Deal But Forces Out Pioneer Founder", "summary": "Update: US FTC Declines to Challenge Exxon Mobil-Pioneer Natural Resources Deal But Forces Out Pioneer Founder"}, {"date": "20240502090000", "headline": "Exxon's $60 Billion Pioneer Deal Set to Create Energy Supergiant", "summary": "The FTC is expected to approve Exxon's $60 billion acquisition of Pioneer after minor concessions, solidifying its position as the largest oil and natural gas producer in the Permian Basin and the U.S. energy market."}, {"date": "20240502094659", "headline": "American oil tycoon accused of trying to conspire with OPEC to inflate prices", "summary": "Scott Sheffield, the founder and longtime CEO of Texas oil producer Pioneer Natural Resources, attempted to collude with OPEC and its allies to inflate oil prices, federal regulators alleged Thursday."}, {"date": "20240502102034", "headline": "25 Most Profitable Companies in the US", "summary": "In this piece, we will take a look at the 25 most profitable companies in the US. If you want to skip our overview of the US economy and the current business climate, you can jump ahead to the 5 Most Profitable Companies in the US. With the second quarter of 2024 with us, Wall Street […]"}, {"date": "20240502111913", "headline": "Chevron: Solid Q1 2024 Earnings And A Good Long-Term Holding", "summary": ""}, {"date": "20240502113550", "headline": "FNDB: Outperforming Most Passively Managed Value ETFs", "summary": ""}, {"date": "20240502115343", "headline": "Oil boss accused of driving up petrol prices by colluding with rivals", "summary": "A leading US energy executive has been barred from the board of ExxonMobil over allegations he colluded with Opec+ to raise oil prices."}, {"date": "20240502121100", "headline": "Former Pioneer CEO Is Accused of Trying to Collude With OPEC", "summary": "The FTC alleges Scott Sheffield tried to coordinate on oil production and prices. The agency referred the case for a potential criminal probe."}, {"date": "20240502123543", "headline": "Exxon Mobil deal with Pioneer gets FTC nod, but former Pioneer CEO Scott Sheffield barred from board", "summary": "Exxon Mobil's $60 billion deal to buy Pioneer Natural Resources on Thursday received clearance from the Federal Trade Commission, but the former CEO of Pioneer was barred from joining the new company's board of directors.  The FTC said Thursday that Scott Sheffield, who founded Pioneer in 1997, colluded with OPEC and OPEC+ to potentially raise crude oil prices."}, {"date": "20240502131405", "headline": "Oil Swings as Traders Weigh Inventory Gain, Potential Cease-Fire", "summary": "(Bloomberg) -- Oil settled little changed after swinging in a narrow range throughout the session, with a buildup in US stockpiles and a potential cease-fire in the Middle East suppressing a rebound from yesterday’s sharp losses.Most Read from BloombergSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineUS and Saudis Near Defense Pact Meant to Reshape Middle EastBiden Calls Ally Japan ‘Xenophobic’ Along With China, RussiaTurkey Halts All Trade With Israel Over War in GazaHuawei Secretl"}, {"date": "20240502155624", "headline": "Pioneer reports lower profit ahead of its takeover by Exxon", "summary": "Earlier in the day, the U.S. Federal Trade Commission gave the go-ahead to Exxon Mobil's $60 billion purchase of the company, but barred Pioneer's former CEO, Scott Sheffield, from joining Exxon's board on allegations he attempted to collude with OPEC to raise oil prices.  Sheffield retired as Pioneer's CEO on Dec. 31, but continues to serve on its board and was due to take a seat on Exxon's board when the acquisition closed."}, {"date": "20240502222000", "headline": "Vistra to replace Pioneer Natural in S&P 500 at open on 5/8", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502223800", "headline": "Vistra to replace Pioneer Natural Resources on the benchmark S&P index", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502230300", "headline": "Worried About a Market Meltdown? 3 Stock Picks Perfect for Portfolio Protection", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502230356", "headline": "Decoding Pioneer Natural Resources Co (PXD): A Strategic SWOT Insight", "summary": "Unveiling the Financial Fortitude and Market Dynamics"}, {"date": "20240502231800", "headline": "Oil companies expand offshore drilling, bet on gas, NY Times reports", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240502234954", "headline": "PRESS DIGEST- New York Times business news - May 3", "summary": "Following are the top stories on the New York Times business pages.  - Sony Pictures Entertainment and the private equity giant Apollo Global Management have formally expressed interest in acquiring Paramount for roughly $26 billion.  - TikTok and Universal Music Group have reached a new licensing deal where the companies said that they had agreed to a \"multi-dimensional\" new deal that included improved remuneration for Universal's roster of artists and songwriters."}, {"date": "20240503013000", "headline": "Seplat's $1.28B Asset Deal with Exxon Gets Regulatory Boost: Report", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503020100", "headline": "Oil Remains on a Slippery Path", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503022300", "headline": "Exxon Mobil Expands Portfolio with Pioneer Acquisition", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503024152", "headline": "ExxonMobil’s $60bn Pioneer acquisition gets nod from US regulator", "summary": "However, Pioneer's co-founder and former CEO Scott Sheffield has been barred from joining Exxon's board due to allegations of attempted collusion with OPEC and OPEC+."}, {"date": "20240503024510", "headline": "Exxon Mobil completes $60 billion deal for Pioneer Natural", "summary": "Exxon Mobil has closed its $60billion purchase of Pioneer Natural Resources, the oiland gas producer said on Friday, a day after receiving a go-headfrom the U.S. Federal Trade Commission for the..."}, {"date": "20240503042253", "headline": "Oil majors offered faster Nigerian exit if they pay for cleanup", "summary": "Majors such as ExxonMobil and Shell that aim to exit Nigeria'sonshore oil can get quicker approval to do so if they takeresponsibility for spills rather than wait for authorities toapportion..."}, {"date": "20240503050100", "headline": "June 14th Options Now Available For Exxon Mobil (XOM)", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503064300", "headline": "ExxonMobil Completes Acquisition of Pioneer Natural Resources", "summary": "SPRING, Texas, May 03, 2024--Exxon Mobil Corporation (NYSE: XOM) today announced it has closed its acquisition of Pioneer Natural Resources Company (NYSE: PXD)."}, {"date": "20240503070100", "headline": "Why You Should Bet on Sunoco (SUN) Ahead of Q1 Earnings", "summary": "Investors may find it advantageous to purchase Sunoco (SUN) before Q1 earnings release, given its strategic acquisition deal and strong and sustainable business model."}, {"date": "20240503073100", "headline": "Exxon Completes $60 Billion Pioneer Natural Resources Acquisition", "summary": "Exxon Mobil has completed its $60 billion acquisition of rival Pioneer Natural Resources after reaching an agreement with antitrust regulators, closing out the largest oil-and-gas deal in decades."}, {"date": "20240503073800", "headline": "IN BRIEF: Exxon Mobil completes USD60 billion acquisition of Pioneer", "summary": "Looking for stock market analysis and research with proves results? Zacks.com offers in-depth financial research with over 30years of proven results."}, {"date": "20240503090000", "headline": "Don’t Let the FTC Drama Distract You. Exxon Mobil Just Got a Huge Win.", "summary": "The Federal Trade Commission made headlines this week when it barred a well-known Texas oil executive from joining  Exxon Mobil  board, as a condition of the oil major’s purchase of Pioneer Natural Resources.  The buzzy news around the deal was the FTC’s allegation that former Pioneer CEO Scott Sheffield had tried to convince other oil producers to slow production and boost prices.  Sheffield declined to comment, but Pioneer disputed the FTC’s claims about collusion, saying the commission has a “fundamental misunderstanding of the U.S. and global oil markets.”"}, {"date": "20240503101434", "headline": "Top Midday Stories: Apple's Dividend, Buybacks Announcements; Amgen Obesity Drug Trial Results; Exxon Completes Pioneer Acquisition", "summary": "Top Midday Stories: Apple's Dividend, Buybacks Announcements; Amgen Obesity Drug Trial Results; Exxon Completes Pioneer Acquisition"}, {"date": "20240503102700", "headline": "Exxon to take up to two years to hit stride with Pioneer purchase", "summary": "Exxon Mobil will take18 to 24 months to achieve its desired production synergies fromits $60 billion purchase of U.S. shale oil producer PioneerNatural Resources, the company's top shale executive..."}, {"date": "20240503115344", "headline": "Sector Update: Energy Stocks Down Friday Afternoon", "summary": "Sector Update: Energy Stocks Down Friday Afternoon"}, {"date": "20240503134435", "headline": "Sector Update: Energy Stocks Decline Late Friday Afternoon", "summary": "Sector Update: Energy Stocks Decline Late Friday Afternoon"}, {"date": "20240503142926", "headline": "Exxon to take 18-24 months to hit full stride with Pioneer purchase", "summary": "HOUSTON (Reuters) -Exxon Mobil will take 18 to 24 months to achieve its full production synergies from its $60 billion purchase of U.S. shale oil producer Pioneer Natural Resources, the company's top shale executive said on Friday.  Exxon this week closed all-stock acquisition after agreeing to an antitrust consent order that barred the former Pioneer CEO from joining its board and is moving in coming weeks to combine operations that will form the largest oil producer in the Permian basin.  \"You will see (oil production) grow pretty rapidly, year over year,\" said Bart Cahir, Exxon's senior vice president of shale, as Exxon applies its current growth strategy to the resources incorporated from Pioneer."}, {"date": "20240503153801", "headline": "Guyana Takes Exxon to Court Over Misstated Value of Equipment", "summary": "(Bloomberg) -- Guyana’s tax agency is taking Exxon Mobil Corp. to court after one of the company’s suppliers said it mistakenly inflated the value of oil-well equipment by 200 times to about $12 billion.Most Read from BloombergEverything Apple Plans to Show at May 7 ‘Let Loose’ iPad EventSaudi Arabia Steps Up Arrests Of Those Attacking Israel OnlineApple Rallies Most in 18 Months on Upbeat Forecast, BuybackG-7 Eyes Plan on US-Led $50 Billion Aid Package for UkraineEven the World’s Most-Envied Re"}, {"date": "20240503170500", "headline": "Vistra Set to Join S&P 500; Aaon to Join S&P MidCap 400; Marathon Digital Holdings to Join S&P SmallCap 600", "summary": "S&P MidCap 400 constituent Vistra Corp. (NYSE: VST) will replace Pioneer Natural Resources Co. (NYSE: PXD) in the S&P 500, S&P SmallCap 600 constituent Aaon Inc. (NASD: AAON) will replace Vistra in the S&P MidCap 400, and Marathon Digital Holdings Inc. (NASD: MARA) will replace Aaon in the S&P SmallCap 600 effective prior to the opening of trading on Wednesday, May 8. S&P 500 and S&P 100 constituent Exxon Mobil Corp. (NYSE: XOM) acquired Pioneer Natural Resources in a deal that closed today, Fri"}, {"date": "20240504074500", "headline": "Is ExxonMobil Stock a Buy?", "summary": "It took a long time, but ExxonMobil is finally trading at all-time highs."}]}